{
    "author": [
        "D J Walter Scott"
    ], 
    "text": "The case of a missing 17-year-old girl turned out to be a ‘cold blooded’ murder. The police have arrested three youth, including the girl’s lover on charges of murder and destroying evidence.\n\nPolice said the girl, studying class XII in a local private school, went missing since the evening of January 11 and the Devakottai Taluk police had launched an investigation after her father lodged a complaint, the next day.\n\nAs a special police team, led by Mr V Ramesh, Inspector of Police, was trying to trace the girl, the Thenneervayal village president informed the police about a girl’s body floating in a pond in the village on the evening of January 12. The girl’s mother identified the body.\n\nStrangulated\n\nA special team stepped up the investigation under instructions from Superintendent of Police Ziaul Haque, and cracked the case on Sunday by arresting the girl’s lover, identified as Arun (19) and two of his friends.\n\nPolice said Arun, after taking the girl to the outskirts of the town, objected to the girl being friendly with others and asked her to be loyal to him. After a wordy duel, he strangulated her to death, police said.\n\nAs he wanted to dispose of the body without leaving any clue, he called his friends, who helped him to tie the body with a boulder in a nylon rope and threw it into the pond to ensure it does not come to the surface. Police cracked the case after tracking down those who were in contact with the girl.\n\nThe accused were produced before the Judicial Magistrate Court and remanded them in judicial custody, Mr Ramesh said, adding while Arun was lodged in the home for children in Thanjavur, two of his friends, Dinesh (22) and Sonaimuthu (26) were lodged in Tiruchi jail.\n\nThe SP said preliminary inquiries revealed the girl was not sexually assaulted. However, if the post mortem revealed any sexual abuse, the sections would be altered accordingly, he told The Hindu .", 
    "section": "national", 
    "title": "Missing girl murdered", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}