{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Karamchari Andolan’s national convener Bezawada Wilson addressing rallyists in Kanyakumari on Sunday. (Right) The team which arrived in Ramanathapuram on Saturday.\n\nA nation-wide rally to eradicate manual scavenging was flagged off in Kanyakumari on Sunday.\n\nThe 125-day rally was organised by the Safai Karamchari Andolan (SKA) and flagged off by its national convener Bezawada Wilson in front of Gandhi Mandapam in Kanyakumari.\n\nAddressing before flagging off the rally, Mr. Wilson said that the nation-wide bus yatra began in Dibrugarh city in Assam on December 10 and would culminate in Delhi on April 13 to mark the 125th birth anniversary of Dr. B.R. Ambedkar.\n\nAfter crossing 15 States, the yatra arrived in Kanyakumari.\n\nAbout 40 members of SKA from Uttar Pradesh, Jarkhand, Andhra Pradesh, Karnataka, Kerala, Odisha and Tamil Nadu are participating in the yatra.\n\nThey demanded rehabilitation of all manual scavengers without any delay.\n\nThe yatra sought modernisation of cleaning sewer system.\n\nThe SKA said the government should pay Rs.10 lakh as compensation as per the directions of the Supreme Court to the next of the family members of those who died in sewer lines since 1993.\n\nThey demanded enhancement of onetime cash payment of immediate relief to liberate manual scavengers from Rs.40,000 to Rs.2 lakh.\n\nThe yatra will pass through Theni, Madurai, Dindigul, Coimbatore, Erode, Salem, Dharmapuri and Krishnagiri before entering Karnataka, said A. Samuel, Tamil Nadu State Convener.\n\nOver 300 conservancy workers from across the State participated in the rally in Kanyakumari, he added.\n\nRamanathapuram\n\nEarlier on Saturday, the yatra arrived here. The 50-member contingent, which left Assam on December 10, arrived here from Chennai after visiting Puducherry and Tiruchi. Mr. Samuel, who received the yatra team, regretted that despite the Supreme Court banning manual scavenging, it still persisted in several parts of the country and no efforts were made to rehabilitate those pushed into that vocation. The yatra team would reach Bengaluru after visiting Theni, Coimbatore, Erode and Salem, he added.\n\nK. Rajamanickam, president of Arul Foundation, which is championing the cause of scavengers, said that they were forced into manual scavenging in some parts of the State.", 
    "section": "national", 
    "title": "Nation-wide rally stresses complete eradication of manual scavenging", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}