{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "The sprawling ground in this remote village, famous for hosting manjuvirattu during Pongal festival, wore a deserted look on Sunday as a pose of policemen stood guard at the periphery of the village and prevented entry of bulls.\n\nIf Alanganallur and Palamedu in Madurai district were famous for hosting jallikattu, Siravayal was famous for hosting manjuvirattu with thousands of people thronging the village to witness the event and meet their friends and relatives every year.\n\nThe event was organised with much fanfare in 2014 when about 90 persons turned up to tame more than 200 bulls. Village committee had organised the event in coordination with the police and district administration following the Supreme Court guidelines.\n\nThe event could not be held last year because of the ban and this year, speculations were rife that the event would be organised violating the ban order. Expecting some action, people made a beeline to the village right from morning, but police sent them back and prevented the villagers from letting loose the bulls in the ground.\n\n“The villagers cooperated well with the police and no bull was brought to the arena,” Superintendent of Police Ziaul Haque said. A posse of about 500 policemen was deployed one km outside the periphery of the village and they ensured that there was no untoward incident, the SP said. “I was there in the village from morning to evening and no bull entered the arena,” he said.\n\nIn a couple of stray incidents, bulls were let loose in the open outside the ground and people chased in a bid to tame them, villagers said. But police acted tough and did not allow even people to visit their relatives in the village, R.S Veluchamy, Siravayal Ambalam said. “We cooperated with the police, but police failed to respect our sentiments,” he lamented.\n\nAs per the tradition, villagers offered worship at the Periyanayagi Amman temple at the ground by taking a bull in a procession.\n\nFormer DMK Minister K R Periyakaruppan and Tamil scholar Kundrakudi Adigalar led the procession, he said.\n\nThousands of people thronged the village to witness the event", 
    "section": "national", 
    "title": "No show at venue of manjuvirattu", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}