{
    "author": [
        "L Srikrishna"
    ], 
    "text": "Road in front of Corporation zonal office itself is in a bad shape\n\nThe battered road around the Race Course in Madurai.— Photo: R. Ashok\n\nThere are 100 wards in Madurai Corporation. And at least in 99 of them, people have expressed their displeasure over bad condition of roads in their areas.\n\nTo highlight this issue, councillors belonging to All India Anna Dravida Munnetra Kazhagam (AIADMK) — the DMK members were absent — raised their voice in unison in support of people’s anguish at the last week’s council meeting.\n\nFor instance, those taking an early morning stroll around the Race Course pointed out that the road in front of the zonal office of Madurai Corporation itself was in a bad shape. R. Balakrishnan, a resident of Iyer Bungalow, said that it had become dangerous to ride a two-wheeler on bad city roads. “Three years have passed and still there is no sign of relief from potholed roads.\n\nThe Kalai Nagar First Main Road leading to CEOA School, which is used by hundreds of students, is in tatters,” he said.\n\nA month ago, Mayor V.V. Rajan Chellappa said that officials were waiting for the monsoon to end so that they could start road re-laying work.\n\nRecently, during an interaction with media persons, he said that 106 roads would be re-laid at an estimate of Rs. 26 crore from Special Road Fund (SRF).\n\nAbout a fortnight ago, road-laying work started from Jaihindpuram Bharathi Street in the presence of Mayor and Corporation Commissioner C. Kathiravan.\n\nThe Corporation authorities have so far covered major stretches such as Panagal Road, KK Nagar 80 Feet Road, Gokhale Road, Kalpalam Road and portions of Tirupparankundram Road near Madura College, Palanganatham and Alagappan Nagar.\n\n1,572-km roads\n\nA Corporation official supervising the road laying work said on Saturday that the 100 wards in the city had roads to a total length of 1,572 km.\n\nIt had almost doubled from 780 km when the city had 72 wards. Prior to the merger of 28 wards, the Corporation had laid 47.86 km of roads at a cost of Rs. 20.62 crore from the Tamil Nadu Urban Development Fund.\n\nLikewise, it had been proposed to lay roads covering 66.02 km in all the 100 wards this year (2015-16) at a cost of Rs 25.11 crore.\n\nWhile metalled roads would be laid on major stretches, paver blocks will be fixed in five wards (49, 58, 59, 60 and 99), he added.\n\nSo far, the contractors, who had won the bids, had been carrying out the work as per schedule. There were officials to check the quality and, in all probability, the road laying work would be over by February-end, he said.\n\nDifferent tale\n\nHowever, AIADMK councillors said that they were unhappy with the road-laying work.\n\nThey said that though the officials claimed that works were going on in all the 100 wards, it was not so.\n\nTo be precise, they said that estimates were not prepared for wards 5 to 22, 27, 33 to 47, 50 to 54, 57, 63 to 93 and 100. In some wards, the road laying work was on in more than one stretch, they pointed out.\n\nCouncillor Shanmugavalli, who is a zonal chairperson, said that the officials had not heeded the requests of a majority of councillors. “In my ward, a particular stretch has not been included. People are upset over this,” she said.\n\nAnother councillor, Kannagi Baskaran, said that in her ward, around West Masi Street, underground drainage work had been partly completed.\n\nHence, the roads should be laid after the work was over. Even the work was not done as per norms at some places, she said. Raja Srinivasan of the AIADMK said that TVS Nagar was one of the important residential areas in his ward where the roads were in a bad shape.\n\nSimilarly, councillors representing extension colonies said that the roads were bad in their wards and it was unfortunate that they had not been included in the 106 roads being laid now.\n\nCouncillors representing extension colonies say roads are bad in their wards and it is unfortunate that they have not been included in the 106 roads being laid now", 
    "section": "national", 
    "title": "No sign of relief from rain-battered roads", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}