{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Though the Supreme Court had earlier this year held that High Courts can’t entertain an appeal against an order passed by the AFTs, the High Courts are not totally out of the picture as some cases have to be dealt by them.\n\n“If a litigant wants to challenge a punishment of dismissal from the defence forces, he/she has to move the High Court and not the AFT. The tribunal deals only with the service matters,” explains an advocate. There are also some peculiar cases wherein the role of both the Tribunal and the High Court is involved.\n\nIn one such case, when an applicant moved the AFT challenging the decision to not extend his service on the ground that he had a “red ink” entry in the service record, the AFT directed him to the High Court since he questioned the rule of the Army to give him the red ink entry. “But, actually the issue concerning this litigant was about extending the service which is a service condition,” explains the advocate.\n\nRetired Madras High Court judge Justice K. Chandru also points out that disputes over transfers cannot be heard by the AFT. “Unlike in the Central Administrative Tribunal, where transfer issues too is one of the service issues, the AFT does not hear transfer disputes and the applicants have to move the High Court,” he says.\n\nHe draws attention to the fact that there are not as many AFTs like the High Courts in the country. “The AFT Benches are filled with retired judges and retired defence officers. We need people who specialise in the field (of relevant law),” he adds.\n\nHowever, a jurist familiar with the AFTs, questions, “What was the point in constituting these tribunals if High Courts are to be involved again?\n\nJustice K. Chandru points out that disputes over transfers cannot be heard by AFT", 
    "section": "national", 
    "title": "Not out of HC jurisdiction", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}