{
    "author": [
        "Siddharth Sridhar"
    ], 
    "text": "Students, who appear for the public exams for Classes X and XII, start preparing for it almost a year before. Most students in the city opt to get trained in private tuition or home tuition centres. Yet, with technology as an enabling tool, there are several education portals that offer assistance to the students online.\n\nThe pan-India portal called ‘Meritnation’ specialises in training students for year-end exams. It offers training and live classroom streaming in seven different education boards including CBSE, the Tamil Nadu and Karnataka boards.\n\n2tion.com, a Chennai-based online platform, helps students find tutors who live in their locality. The website’s database contains the information of tutors, the subjects they handle, the city of their residence and contact information. The service also provides the information of tutors who live abroad, thereby aiding NRIs.\n\nCoimbatore can now boast of its own education portal too. Wowelse Online Solutions has announced the launch of its first venture, an online platform for education called EXAMLEGEND. It is aimed at providing a holistic education experience to students studying in both the State and CBSE boards.\n\nThe Chief Financial Officer of Wowelse, Mamta Nair, said the main target of the website would be the schools of metro cities. The tests and question papers which appear in the website will be framed strictly in accordance with government regulations. Students attempting these tests will also have the option of comparing their results with those of their classmates, thus enabling them to find out where they went wrong. An additional feature of the portal will be the round-the-clock availability of an ‘Exam Mate’. The ‘Exam Mate’ will be an in-house teacher appointed by the website, in charge of answering the queries posted in it.\n\nWowelse Online Solutions also has plans to set up smart classrooms in villages and rural areas.", 
    "section": "national", 
    "title": "Now there are portals to learn online", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}