{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Polio drops were administered to about 3.5 lakh children in Salem district during the first phase of the pulse polio campaign on Sunday.\n\nThe District Collector V. Sampath inaugurated the administering of polio drops at the Kumarasamipatti maternity home in the city, in the presence of Mayor S. Soundappan, V. Panneerselvam, MP, K. R. Selvaraj, Corporation Commissioner and others.\n\nAbout 82,000 children were administered the drops in the Corporation limits. A total of 2,216 centres functioned in the primary health centres, noon meal centres, schools, panchayat offices across the district and administered the drops. Besides, polio drops were administered in nine mobile centres and 77 centres at the railway stations and bus stands. A total of 9,332 officials belonging to various government departments and members of the Rotary Movement, were engaged in the campaign, an official press release said. N. Vijayalakshmi, Joint Director of Health Services and Jagadeesh Kumar, Deputy Director of Health Services, visited various centres.\n\nIn Namakkal, polio drops were administered to 1.50 lakh children in 1,198 centres in the district on Sunday.\n\nThe District Collector V. Dakshinamoorthy inaugurated the campaign by administering polio drops to a few children at the Siluvampatti anganwadi centre. In Krishnagiri, polio drops were administered to 1.70 lakh children. A total of 951 centres – 63 in two municipal limits and 898 in 10 panchayat union centres functioned in the district and administered the drops. Besides, mobile centres too were involved in the work.\n\nThe District Collector T. P. Rajesh inaugurated the campaign at the Krishnagiri bus stand in the presence of K. R. C. Thangamuthu, Municipal Chairman.\n\nIn Dharmapuri, polio drops were administered to 1.63 lakh children in 984 centres. K. Vivekanandan, Collector, inaugurated the campaign.", 
    "section": "national", 
    "title": "Over 3 lakh children immunised in Salem", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}