{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Forest Department officials say it is not easy to locate peahen eggs\n\nFarmers have been demanding that the peacocks must be caught and left in forest area.— file photo\n\nThe Forest Department is struggling to address demand from farmers in Chennimalai-Perundurai-Thingalur belt to contain peacock menace.\n\nThe National bird destroys crops at a nascent stage and cause huge losses to farmers. The peafowl number keeps multiplying as it is at the end of the food cycle. With an average lifespan of 20 years, they start breeding from the age of two years. Forest Department officials say it is not easy to locate peahen eggs.\n\nFarmers are arrested when peacocks are found dead due to suspected poisoning. But the agricultural community wonders how cultivators could be held responsible if the peacock had consumed pesticides sprayed on the crop, or poison kept for eliminating rats. Peacocks that feed on fields where the pesticides have been freshly sprayed are more likely to die instantly, sources said. The farming community had, in the past, staged demonstrations demanding control of peacock menace. Farmers have been demanding that the peacocks must be caught and left in forest area.\n\nLast year, a writ petition was filed in the High Court by wildlife activists seeking a comprehensive census of peacocks in the State and formation of a special sanctuary for the national bird. “But, how can a bird be expected to be confined to the forest area. It is bound to find its way back,” said Murugesan, Forest Range Officer of Erode Range. For a long time, the premises of TB Sanatorium used to be the home for peacocks and hens.\n\nBut, the pace of urbanisation has rendered the location unfit as a natural habitat for the bird, and hence its spill over presence in a vast geographic spread has caused a perennial setback to the farming community, officials said.", 
    "section": "national", 
    "title": "Peacock menace haunts farmers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}