{
    "author": [], 
    "text": "AIADMK MLA Pala. Karuppiah’s candid speech at a public function makes the crowd want more\n\nIt is not often that one hears a ruling party MLA talking about collusion of bureaucrats and politicians in public. But that is exactly what happened recently at a public function when an AIADMK MLA Pala. Karuppiah spoke about how crony capitalism was running politics now and corruption was growing due to it. His frank and candid speech, with a large dose of humour, hit home so hard that when his allotted time was up, the crowd kept shouting “Keep continuing, keep speaking”. At the end of his speech, the moderator, Cho Ramaswamy, quipped, “Till his speech, he was in the AIADMK. After these 15 minutes, we do not know for certain if he is or will be a party member anymore.”\n\nDespite his age, DMK president M. Karunanidhi does not compromise on habits that he has kept alive for decades now. One among them is the tradition of giving money to visitors who meet him at his residence and seek his wishes during Pongal. Like every year, Mr. Karunanidhi handed over Rs 10 notes to all those who visited him on Friday. The stature of the person did not matter. Everyone got Rs. 10 without any difference.\n\nIt was a big disappointment to all those who had gone to great lengths to organise a Syndicate meeting at the Tamil Nadu Open University last week. The aim of the meeting was to bid farewell to outgoing Vice-Chancellor Chandrakantha Jayabalan, whose tenure came to an end on January 17.\n\nSince the last working day for last week was Thursday, some university officials had decided to hold a meeting of the Syndicate on that day, in violation of university norms. The Syndicate members remained in the dark about the agenda of the meeting, but were orally informed that some pending appointments needed their approval.\n\nWhile the confused members discussed it among themselves, it is learnt that the Higher Education Secretary, who is one of the members of the Syndicate, denied them permission and the members were informed on Wednesday night that the meeting had been cancelled.\n\nThere was a period in recent times when there were more than half a dozen IPS officers in the rank of Director-General of Police in Tamil Nadu. When it comes to the rank of DGP, the State has three cadre posts and another three can be accommodated in non-cadre posts.\n\nBesides the DGP (Law and Order), Director, Directorate of Vigilance and Anti-Corruption and Chairman, Uniformed Services Recruitment Board, which are cadre posts, the State police have had DGPs heading the Prisons Department, Police Housing Corporation, Home Guards, Coastal Security Group, TN Fire and Rescue Services, Intelligence and even the Transport Corporation at one point of time.\n\nBut now, there is just one DGP Ashok Kumar who is in a cadre post. R Sekar is heading the Vigilance Wing of the TNEB. It is a mystery why the State government has not promoted ADGPs to the rank of DGP when there are clear vacancies both in cadre and non-cadre posts.\n\nWhile Mr. Ashok Kumar attained superannuation a year ago and is continuing as head of the force as per the Supreme Court guidelines in the Prakash Singh case (which prescribed a fixed two year tenure to any DGP appointed as Head of the Force), Mr. Sekar is due to retire in May, 2016.\n\nSenior police officials say that in the last 10 years, T Radhakrishnan was the only direct IPS officer who retired as ADGP since there was no vacancy to promote him. However, T Rajendran retired as ADGP last month even as there were a few top posts lying vacant.\n\nWhether the State will promote ADGPs to fill at least the cadre posts ahead of the election remains to be seen.\n\n( Reporting by T.K. Rohit, Sruthisagar Yamunan, R. Sujatha and\n\nS. Vijay Kumar )", 
    "section": "national", 
    "title": "Politics and plain talk", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}