{
    "author": [
        "C Jaisankar"
    ], 
    "text": "A park is supposed to rejuvenate the soul andmind of users. Howeverit is not serving thepurpose well here.\n\nhinnasamy Park, which was kept closed for more than a year, has been opened for public use. It has good facilities for the children, elderly citizens and morning walkers. But, the poor maintenance has raised question on sustainable use of it.\n\nThe park located in 38{+t}{+h}ward of the Tiruchi Corporation in K.K. Nagar is supposed to cater to the need of the residents of various colonies in Golden Rock zone. Many feel that the park is a gift for the entertainment starved residents of K.K. Nagar, Sundar Nagar, LIC Colony, Ayyappa Nagar and neighbouring residential colonies. It has to serve the people particularly children. However, residents complain that there is no established system in place to maintain the park.\n\nIt was said that it was in disuse for several months due to an issue with a private company over park maintenance. The Tiruchi Corporation had taken over the maintenance recently since the company failed to keep its promise on maintenance.\n\nThough the situation is slightly improved since then, park users said that it is still a long way to go in improving the quality of services to the people. They say that the park is cleaned once in a while, resulting piling up of dried leaves and garbage being dumped by the public users.\n\nThe children play area, which has a few equipment including slides and swings, looks unclean with garbage and eatable wastes. A major portion of the park is found to be covered with dry leaves. Though a toilet is constructed, it is also not maintained properly, claim residents.\n\nSome say that though lights have been replaced recently, they are insufficient to illuminate entire park area.\n\n“It is unfortunate that the civic body is still unable to solve the maintenance issue. A park is supposed to rejuvenate the soul and mind of users. However it is not serving the purpose well,” said S. Balaji of K.K. Nagar.\n\nFaritha Jalal of J.K. Nagar said that trees and plants had not been trimmed for so long. The poor maintenance had caused large scale breeding of mosquitoes. There was no proper arrangement of play equipment in the park.\n\nAnother user said that the park was opened only in the evenings. It was rarely opened in the morning. Hence, the Tiruchi Corporation should come forward to study the issue in detail so as to transfer the benefit of the park to the targeted people of K.K. Nagar.\n\nWhen contacted, a senior officer of the Corporation said it was being opened morning and evening. Short comings would be rectified immediately. All efforts would be taken to maintain the park well.\n\nA park is supposed to rejuvenate the soul and\n\nmind of users. However\n\nit is not serving the\n\npurpose well here.", 
    "section": "national", 
    "title": "Poor maintenance of park irks residents", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}