{
    "author": [], 
    "text": "A separate counter for platform tickets, general enquiry will be of help\n\nQueuing up to buy a platform ticket at the Puducherry railway station where people ahead are waiting to book tickets to various destinations, is a bit like standing to pay up for just a few items at a mall behind a long line of shoppers stocking up on an entire month’s supplies.\n\nThe lack of a separate counter for platform tickets, or a vending machine at this station, is creating untold hassles for people who come to see off their family or friends.\n\nBe warned that even if you turn up to see someone off a good three quarters of an hour ahead of a scheduled train departure, you might still be cutting it too fine especially if your visit to the station happens to coincide with the day on which many of the city’s holidaying crowds too have firmed up their travel plans.\n\nThe rather crude arrangement in practice here is that you holler out ‘platform ticket’ loud enough to catch the attention of the booking clerk. Then, the clerk, and of course the people in the queue, will quickly determine that you are a genuine platform ticket aspirant and not a sly queue jumper.\n\nOnly after the man behind the counter and the people in front it come to a consensus will you be allowed to sidle up to the booking window bypassing the queue.\n\nThe same frustrating fate awaits those wanting to make a simple enquiry as they too have to stand in a common queue because there is no separate information counter.\n\nWhile there has been an increase in train services and passenger traffic through this station over the years, one wonders why Puducherry railway station lags behind when it comes to setting up simple facilities such as a separate counter for platform tickets or an information/enquiry window.\n\nGovernment itself needs help\n\nChief Minister N. Rangasamy minced no words to bring to the notice of employees of the Puducherry Cooperative Sugar Mills at Lingareddypalayam the poor financial position of his government and the pathetic condition the sugar mill had been facing for the last few years. A large number of employees met Mr. Rangasamy in his chamber seeking expeditious settlement of arrears. The Chief Minister said that it would not be possible for the government to meet the demands as his government had been facing a severe financial crunch.\n\nMincing no words, Mr. Rangasamy said that the government itself was in need of Rs.370 crore to meet its commitment over the next three months. The Central Government is not coming to the rescue and what is the solution he asked?\n\nA Tanglish tangle\n\nThe two-day international conference organised by the International Movement for Tamil Culture (India and Canada chapter) began with a ‘Tanglish’ welcome note.\n\nThe Indian president of the Movement Malathy Rajavelu spoke on how to transcend the language per se and imbibe the Tamil cultural heritage.\n\nHaving grown up in Bangalore, her difficulty in speaking pure Tamil should not be seen as a challenge to head the movement. “We need to preserve the cultural heritage of the classical language and that is more important than speaking,” she said in ‘Tanglish’ as she welcomed the gathering.\n\nOn the contrary, many speakers including Chief Minister N. Rangasamy who inaugurated the programme stressed on the need to encourage children to speak in mother tongue even if the parents had settled abroad. “The parents should encourage their children to talk in Tamil at home. This is the way to preserve the cultural legacy of Tamil language,” he said.\n\nProtected by saints\n\nRecently, while participating in the launch of the 22nd International Yoga Festival, Minister for Welfare and Tourism P. Rajavelu appeared to have been overwhelmed while holding forth on the rich heritage of Puducherry. He paid glowing tributes to the great sages who had made Puducherry their home. He even went to the extent of declaring that this port town did not suffer from natural disasters, including the recent floods, due to the ‘divine’ presence of these ‘Siddhars’.\n\nBy M. Dinesh Varma,\n\nS. Prasad and S. Senthalir", 
    "section": "national", 
    "title": "Puducherry railway station needs more facilities", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}