{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Door-to-door visits to vaccinate the unreached eligible children\n\nA nursing student administers polio drops to a child on motorbike on the highway near Jipmer during the polio immunisation programme in Puducherry on Sunday.— Photo: S.S. Kumar\n\nA total of 88,806 children in the 0-5 age group were administered polio drops in the Union Territory, with 96.7 per cent coverage in Puducherry and 100 per cent coverage in Karaikal in the first phase of the pulse polio immunisation campaign.\n\nThe target in Puducherry was 70,784 and the drops were given to 68,415 children, while in Karaikal 14,706 were administered the vaccine, against a target of 14,702.\n\nIn Mahe and Yanam, the coverage was slightly below target. In Mahe, 2,108 children received the drops against a target of 2,356 and in Yanam, 3,577 children were administered the vaccine against a target of 4,467.\n\nIn order to ensure that all children were immunised, the Health Department will be conducting a door-to-door visits with two teams from every Primary Health Centre visiting the houses in their respective areas.\n\nThe teams will be visiting both government and private schools to identify and immunise unreached eligible children, Director of Health, K.V. Raman said.\n\nIn Cuddalore\n\nA total of 2,23,292 children in the 0-5 age group were administered polio drops in Cuddalore district with 94.7 per cent coverage in the first phase of the pulse polio immunisation drive on Sunday.\n\nThe target in Cuddalore district was 2,35,781 children and the drops were given to 2,23,292 children. According to a release, Cuddalore district had become polio free since 1998.\n\nCollector S. Suresh Kumar said that vaccines were administered through 1,611 camps and with over 6,000 volunteers.\n\nIn order to ensure that all children were immunised, the Health Department will be conducting door-to-door visits with teams from every Primary Health Centre visiting the houses in their respective areas.\n\nIn Villupuram\n\nIn Villupuram, vaccines were administered through 2,989 camps to cover 3,32,685 children in the 0-5 age group across the district.", 
    "section": "national", 
    "title": "Pulse polio coverage 100 per cent in Karaikal", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}