{
    "author": [], 
    "text": "Speed up construction of public toilet\n\nThe municipality toilet on Thanthai Periyar Nagar road near Rajiv Gandhi Government Women and Children Hospital in Puducherry was demolished two months ago. It forced the residents of Ellaipillaichavady to resort to open defecation. Many men who visit the hospital openly urinate in the drainage canal adjacent to the hospital compound wall, since there is no men’s toilet for visitors. It is requested that the construction of the toilet should be speeded up for the benefit of more than one hundred families in the locality.\n\nV. Ramalingam,\n\nThattanchavady Post, Puducherry\n\nMake arrangements for senior citizens at temple\n\nDuring the recent Hanuman Jayanti celebrations at the Jayamangala Panchamukha Sri Anjaneya Swamy Temple Panchavatee, Puducherry, there were no proper arrangements done for senior citizens who visited the temple.\n\nThere were several senior citizens who had come from far for the occasion. But they had to go back without darshan. To avoid this, the temple can issue passes for elders through senior citizens, especially on days like Hanuman Jayanti.\n\nSome temples do have provision for special ‘darshan’.\n\nThis is as per government norms which provide concessions to senior citizens.\n\nS.V. Iyer, president\n\nPondicherry Senior Citizens’ Welfare Association\n\nUpgrade alternative road\n\nConsequent to the closure of the Katpadi Railway gate for traffic at the railway level crossing no.2 at Villupuram town limit, two wheelers, light commercial vehicles and heavy vehicles have been diverted to Ellischaram Road to reach National Highway 45.\n\nThis has created a lot of hardship. The road which begins from North Street and goes via Muthopu area and crosses railway level crossing 1 and reaches the main road may be upgraded and developed as a solution to this traffic issue.\n\nD. Prithvi Raj\n\nVillupuram\n\nReaders can send their mails to pondy.thehindu@\n\ngmail.com and The Hindu, No. 135 Mission Street, I Floor, Puducherry – 605001.", 
    "section": "national", 
    "title": "Readers Mail", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}