{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Delay in removing encroachment in a reserved site in a residential locality in Somayampalayam Panchayat, near Vadavalli, may land the district administration in trouble as the locality’s residents’ welfare association has planned to move the Madras High Court for contempt of court.\n\nThe Harini Arcade Housing Welfare Association has sent a letter to the District Collector on January 2, 2016 asking why it should not initiate contempt of court proceedings against her as there has been a failure to implement the Cort order dated September 18, 2015.\n\nThe Court in its order had directed the Collector to remove encroachments on 70 cents of the 1.85 acre land, earmarked reserved site for public purpose.\n\nThe Court had passed the order based on the Association’s writ petition wherein it had stated that the Collector should remove the encroachment within four weeks of the order. After the expiry of the time period, the Association on October 19, 2015 wrote to the Collector to comply with the court order, said the representatives of the association.\n\nThey also said that after the layout was formed in 1987, 1.85 acre or 10 per cent of the layout was earmarked for public purpose. But a person had encroached upon 70 cents of the1.85 acre and they had reasons to believe that a portion of the 70 cents had also been sold.\n\nAt this stage, the Association made several representations to the district administration and after failing to get a response, it moved the court.\n\nNow it had issued a legal notice to the Collector asking why it could not initiate action and awaited reply.\n\nCollector Archana Patnaik said that she would check if the district administration had received the court order. Or, if the Association in its letter had enclosed a copy of the court order, the administration would immediately take action as it had always been complying with court orders.", 
    "section": "national", 
    "title": "Residents’ association plans to move HC", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}