{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "lass X student at the Coimbatore Corporation High School, P.N. Pudur, S. Bharath had difficulty in solving a mathematics problem. He could not approach his teacher in the classroom. He struggled for a while before giving it up.\n\nHe used the next opportunity available to approach his teacher to solve the problem and it came at the special class the school had been conducting for Class X students, who would be facing the public examination this year.\n\n“What I could not do in the class, I did it in the special class because the atmosphere is far more relaxed and there is no time constraint,” the boy says.\n\nFor B. Bharathi, a Plus Two student at the Corporation Higher Secondary School on Oppanakara Street, special classes had helped her understand English grammar. Her batch mate at the Government Higher Secondary School for Boys, Sulur, R. Sandeep Kumar, is gaining confidence to face the public examination because he has been studying his lessons to answer the quiz conducted at special class.\n\n“To score over my classmates in special classes, where teachers quiz us with oft-asked one-mark questions, I read and re-read lessons that gives me confidence,” he says. The classes also help him easily understand ‘punarchi vidigal’ in Tamil grammar, something that he found difficult otherwise.\n\nFor slow learners too the special classes are a boon, say teachers. The Sulur school’s Headmistress L. Daisy Premalatha says that during the classes, conducted before and after school time, the teachers help slow learners by giving personal attention.\n\nThe teachers group and sit with those students to explain in detail the lessons and also support them by provide studying and memorising tips.\n\nThe schools say they have been conducting such classes since the start of the academic year for Class X and Plus Two students, who will soon take public examination.\n\nThis has helped slow learners clear the examination with ease and top rankers score more.", 
    "section": "national", 
    "title": "Special classes help them prepare for exams", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}