{
    "author": [
        "Special Correspondent"
    ], 
    "text": "At an expenditure of Rs. 1 crore with a major share from donors\n\nenovation of Sri Saptharisheeswarar Temple in Lalgudi has been taken up by the Hindu Religious and Charitable Endowment Department.\n\nThe entire work is planned to be executed at an expenditure of Rs. 1 crore with a major share from donors.\n\nPlans have been drafted for renovating the Rajagopuram and other major vimanams of presiding deities and other sub-shrines. Maintenance of the Rajagopuram has been taken up early this month. “We shall use anti-pollution paints for the Rajagopuram as well as other vimanams,” says a source.\n\nThe temple authorities have been paying special attention to the renovation of the ‘Kanda Sashti yagasalai’ which bore the brunt of a fire accident a couple of years ago. “All the ‘vastarams’ and holy cloths kept at the yagasalai mandapam perished,” recall the temple authorities referring to the massive damage caused to the structure.\n\nIn fact, the mandapam remained closed for about a year till the renovation work was taken up. “We clear the weak stones and replace them with new ones,” explains the official. The work is being executed at an expenditure of Rs.27 lakh. The temple has been sanctioned with a loan of Rs. 15 lakh from the Sri Mathura Kali Amman Temple in Siruvachur in Perambalur district while the balance Rs.12 lakh had been contributed by the Hindu Religious and Charitable Endowment Department.\n\nWith a view to augmenting revenue for the temple, the authorities have sent a proposal to the government to construct a marriage hall on a sprawling piece of land in front of the temple. Measuring about 0.75 acre, it was used as ‘gosalai’ and was declared open in 1959. Since it has been in disuse in the absence of animals for the temple, it has been planned to construct a marriage hall at the site, sources said.", 
    "section": "national", 
    "title": "Temple being renovated", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}