{
    "author": [
        "S Prasad"
    ], 
    "text": "Cattle taking part in manju virattu; residents of Kuyilapalayam near Auroville along with foreigners enjoying a ride on a tractor and a foreigner dressed in a sari watches the sport on Sunday.— Photo: T. Singaravelou\n\nKuilapalayam bustled with activity with the fun sport at the end of Pongal festivities\n\nKuilapalayam, a non-descript village on the way to the International township of Auroville near here was bustling with activity on Sunday with hundreds of people particularly foreign tourists gathered at a local temple to catch a glimpse of the annual manju virattu .\n\nManju virattu is an ancient Tamil tradition and is being held for the last 60 years at the end of three-day Pongal festivities in the village. Unlike jallikattu , the event does not involve taming of the cattle.\n\nThe event is hugely popular among foreign tourists visiting Auroville.\n\n“Normally, hundreds of bulls and cows would take part in the event. But the population of cattle has dwindled over the last few years due to decline in farming activities and now even calves take part in the event,” says Sisubalan, a resident.\n\nThe annual event was not held last year due to several reasons. This year, the local panchayat approached the authorities who gave them the green signal to hold the event.\n\nHe pointed out that unlike jallikattu , which has been banned, manju virattu is a fun sport. The cattle are brought before the deity and then made to race back to their stables.\n\nThe event is held after performing pujas to the presiding deity at the local Mariamman temple.\n\nThe deity is brought in a procession near the temple, where cattle from surrounding villages decked up with balloons, bananas and posters of actors are lined up for the race. The animals would break into a run at the bursting of firecrackers with their owners running along to keep pace. From start to finish, the event is cheered by the crowd.\n\n“At manju virattu , I see the origin of Indian culture and find that the tradition of our wisdom is protected even though it is in a village for the future generations,” says Lalit Varma, president of Alliance Francaise in Puducherry.\n\nFor Sophia and August, tourists from Spain, it was an offbeat cultural event with all the cows beautifully decorated.", 
    "section": "national", 
    "title": "Tourists soak in the joy of manju virattu", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}