{
    "author": [
        "Staff Reporter"
    ], 
    "text": "To protest the Union government’s move to construct a flyover\n\nThe Marthandam Chamber of Commerce and Industry has decided to down shutters of over 1500 shops and business establishments in Marthandam on Tuesday to show their protest against the Union government’s move to construct a flyover from Pammam to Vettumani.\n\nIts president A. Al Ameen, told The Hindu that the traders and the public in Marthandam felt that when the proposed coastal road project was implemented, the traffic congestion at Marthandam town would be eased. Under these circumstances, there was no need for a flyover at Marthandam. However, widening the existing National Highway 47 would solve the traffic congestion.\n\nThe chamber was concerned over the pollution and dust emanating during the project implementation at least for three years and this would make customers switch over to other towns for their needs, thus leaving the livelihood of the Marthandam traders in hardship.\n\nThe chamber would cooperate with the government to widen the existing road and not for the construction of the flyover, he said.\n\nIn a resolution, the chamber appealed to the Union Minister of State for Road Transport, Highways and Shipping Pon Radhakrishnan to use the funds allocated for the flyover for a few other development activities in Marthandam town. Meanwhile, Union Minister for Road Transport, Highways and Shipping Nitin Gadkari will lay foundation stone for four-laning of Kerala/Tamil Nadu border (Karode) to Villukkuri section on NH 47 for a length of 27.250 km at an estimated cost of Rs. 1274.34-crore, four-laning of Villukkuri-Kanyakumari section NH 47 and Nagercoil-Kavalkinaru section NH 47B for a total length of 42.703 km at an estimated cost of Rs.1041.99-crore, construction of flyovers at Parvathipuram and Marthandam on NH 47 at an estimated cost of Rs.286.95-crore and four-laning of Avinashi-Tiruppur-Aninashipalayam section of NH 381 for a length of 31.800 km at an estimated cost of Rs. 162.72-crore at a function in Marthandam on Tuesday.", 
    "section": "national", 
    "title": "Traders to down shutters tomorrow in Marthandam", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}