{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "he hill station of Yercaud, popularly known as Poor Man’s Ooty, has been one of the favourite tourist destinations for the people of Tamil Nadu and also the neighbouring states of Kerala, Andhra Pradesh and Karnataka.\n\nThe hill station has been receiving tourists round-the-year and the season will be at its peak during the summer months and also during the long festival holidays.\n\nGone are the days, when the tourists preferred arriving at Yercaud by the regular bus services. At present, a majority of the visitors arrive by cars and vans. The youths of Salem and neighbouring districts prefer two-wheeler riding to reach the hill.\n\nDespite mammoth increase in the arrival of number of motor vehicles over the years, the failure of the local civic authorities to come up with parking lots in the town and also at the sight-seeing spots situated in its vicinity has left the tourists fuming.\n\nA cross-section of the tourists says that the Salem district administration and the Yercaud Panchayat should focus on creating parking spaces.\n\nIn the absence of proper parking lots, the vehicles of the visiting tourists are parked in a haphazard manner in the main town and also in the other picnic spots leading to traffic congestion.\n\nThe Boat House, Deer Park, Anna Park, Lady’s Seat, Gent’s Seat, Shervaroyan hills, Kiliyur waterfalls, Pagoda point attract a large number of vehicles from dawn-to-dusk every day. The strength of vehicles increases manifold during the weekend holidays.\n\nHowever, there are no proper parking lots in all these spots. The vehicles are parked on both of sides of the road, affecting the free flow of traffic. There are no platforms on the road sides, as such the pedestrians vie with the motorists for reaching these spots. This led to frequent traffic jams. Almost every road in Yercaud town and the surrounding areas witnesses traffic jams.\n\nAt the spots like Pagoda point, the road is very narrow which could not take the heavy flow of vehicles. The traffic congestion at this point is so heavy that the vehicles are parked on each and every vacant site in the defunct housing board colony in its vicinity.\n\nThe parking of vehicles on the roads creates countless problems for everybody, says M. Prabarakan, a cab driver of Salem city. Of late, there is a spurt in the arrival of large sized vans at these spots and they add further confusion.\n\nThe Boat House on the Salem – Yercaud road in the heat of the hill station attracts the maximum number of tourists. The people, in the absence of proper space earmarked, are forced to park their vehicles on roads, due to which pedestrians suffer the most.\n\nAlmost every cab driver complains of getting stuck in traffic jams particularly during the holiday seasons, says Prabakaran.\n\nThe tourists demand posting of adequate police personnel at all the picnic spots for regulating the movement and parking of vehicles. But this seems impossible, with the Yercaud police station, with limited number of police personnel, had to cover a large number of tribal villages situated far away from the main town.\n\nThe police should create a special force for regulating the vehicle movement in tourist spots such as Udhagamandalam, Kodaikanal, Yercaud etc, says K. S. Mahadevan of Krishnagiri, a regular visitor to this hill station.\n\nAn official from the police department also blamed the lack of parking lots for the recurring traffic jams in the hill station. With number of vehicles arriving increasing day by day, the hill station needs adequate parking lots to accommodate more vehicles, he says.\n\nAs peak tourism season during the summer approaching, the people appeal to the district administration and the local panchayat to look into the problem and take steps for creating as many parking lots as possible in Yercaud.", 
    "section": "national", 
    "title": "Traffic congestion in hill station leaves tourists fuming", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}