{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "Despite ban, eruthattam was held at different villages in Omalur block in Salem district on Sunday. —Photo: E. Lakshmi Narayanan\n\nDespite Salem district authorities slapping a ban, eruthattam (bull chase) event was held in various villages in Omalur block on Sunday.\n\n‘Eruthattam’ is a usual affair in the temples in the villages as part of the Pongal celebrations till a few years ago. The farmers organised this traditional festival of chasing the bulls, as a thanks giving gesture for enabling good crop.\n\nThe youth hold the rope tied to the nose of the bulls, on both sides.\n\nLater, they chase the bulls in the areas surrounding the temple.\n\nCiting Supreme Court guidelines for holding such events involving animals, the district authorities refused permission for eruthattam this year.\n\nJ. Megnath Reddy, Sub-Collector, held discussion with the village panchayat presidents and village heads recently and informed them about the ban. The panchayat presidents said that in no way animals were harassed in eruthattam and insisted on holding the event. When the authorities refused to relent, they staged a walk out.\n\nMeanwhile, in connection with Kaanum Pongal, eruthattam was held at villages in M. Settipatti, Amarakunthi, M. Oolaipatti, Danishpet, Malliakuttai, Azhagusamuthiram, Thindamangalam, Kalarapatti, Periyeripatti surrounding Omalur on Sunday.\n\nThe villagers gathered in good strength at the temples in these villages. The bulls were decorated with garlands and were offered special food. A cross section of the farmers said that it was wrong to compare eruthattam with jallikattu. While jallikattu dealt with taming the animal, eruthattam is a game of chasing the bulls. They said that the animals were never harassed in eruthattam and as such slapping a ban on this event was totally unjustified.", 
    "section": "national", 
    "title": "Villagers conduct eruthattam despite ban", 
    "subsection": "tamilnadu", 
    "date": "2016-01-18"
}