{
    "author": [], 
    "text": "The overwhelming support received by Namakku Naame is a clear indication that people are keen on removing the AIADMK regime and bringing back the DMK rule, says Stalin. -File photo\n\neiterating that the multi-cornered contest in the Tamil Nadu Assembly election was a handiwork of the ruling AIADMK, DMK treasurer M.K. Stalin said the actual contest remains between the DMK and the AIADMK. In a free-wheeling interview with B. Kolappan, he took a range of questions head on: various sensitive issues in the upcoming elections, how he fancied his party's chances, the equation with the AIADMK and other parties, the role of caste as a factor in the state and his own whirlwind campaign.\n\nYou launched the Namakku Naame scheme seeking to remove the AIADMK regime. But today in Tamil Nadu, there are many fronts projecting themselves as an alternative. Why do you want people to vote for the DMK in the elections?\n\nThe overwhelming support received by Namakku Naame is a clear indication that the people of Tamil Nadu are keen on removing the AIADMK regime and bringing back the DMK rule. Over 4.5 lakh people submitted various petitions to me as I toured the state as part of the campaign. Farmers, fishermen, traders and the youth from the IT sector have expressed the hope that the DMK regime, when elected to power, would fulfil their requests and demands. The people have realised that even though there are many political fronts, only the DMK would have the strength to oust the AIADMK government. The DMK regime, through its schemes and achievements in the past, had proved it. Today, there is zero governance in Tamil Nadu; there is absolutely no development in any department. The current dispensation has also pushed the state into bankruptcy. But the DMK government had proved it could take care of the interests of all sections of the society. Our leader Kalaignar had an unrivalled record as the Chief Minister of the state. People think a DMK government is the need of the hour. If I were to explain the reasons why people should vote for the DMK, it would occupy entire columns of your news paper. I can say that the DMK will give progressive, inclusive and development-oriented government. The main features and key factors of the governance will be transparency and accountability.\n\nA campaign is on seeking to remove the rule of Dravidian parties on the grounds that they are responsible for all the degradation in Tamil Nadu. Your comments, please!\n\nThe Dravidian movement has upheld social justice and secured for women their rights. If Tamils enjoy self-respect today, it is because of the Dravidian movement. Only a handful of people who actually benefitted from the Dravidian movement — those who could become doctors, engineers and IAS officers — have turned against it, forgetting the movement’s contribution. Political parties that now seek to remove the Dravidian parties had in the past vied with each other to align with us. People are fully aware of this fact. The Dravidian movement is a banyan tree and plants that are yet to take root even in the upper soil cannot crowd it out.\n\nCasteism continues to play a dominant role in Tamil society. Those who marry outside their caste for love are being killed for 'honour'. Can’t we put an end to this? There is also an allegation that both the DMK and the AIADMK maintain a silence over these honour killings.\n\nI reject the allegation levelled against the DMK. I issued a statement condemning the murder of Dalit youth Shankar. Our leader Kalaignar also condemned it. The police have been deprived of their independence in the AIADMK rule. As the police are under compulsion to take orders from the ruling partymen, the department is not able to prevent or take precautionary measures to stop such incidents. Your question has not taken into account that it was the DMK government that gave legal sanctity to self-respect marriages. It created 145 samathuvapurams . You cannot place the DMK on par with the AIADMK. Chief Minister Jayalalithaa, who is holding the home portfolio, has not opened her mouth yet. Why have you not posed the question to her?\n\nPolitical parties field candidates from a particular community depending on the composition of a constituency. Will it not indirectly encourage casteism?\n\nA candidate is not selected just because he belongs to a community. His support base among all the section of the society, his performance and chances of victory are taken into consideration before he is fielded.\n\nWas the Namakku Naame scheme launched to project M.K. Stalin, the DMK's treasurer?\n\nYou cannot separate me from the DMK. I started my political career as an ordinary partyman and reached the position of treasurer. In all these years, I have launched innumerable campaigns. As the Mayor of Chennai and as the Deputy Chief Minister, I have implemented various schemes under the Chief Ministership of Kalaignar. Namakku Naame is one of many such programmes. The objective was to create awareness, not only in the DMK, but in Tamil Nadu that politicians should reach out to the public. On that score, Namakku Naame has achieved its purpose. Politicians like Chief Minister Jayalalithaa can no longer afford to insulate themselves from the people. The programme became a success because the dictum that the “The DMK will fulfil its promises and will always make promises that will ultimately be implemented” is still fresh in the minds of the people.\n\nEven though the DMK was part of the Congress-led UPA government at the Centre, your party quit on the grounds that it had failed to protect the Sri Lankan Tamils. Now the two parties have come together again and your enemies are questioning the rationale behind the alliance. How do you justify the alliance?\n\nOur enemies will question everything. But we have a duty to answer only the people. Now we are going to have elections for the state Assembly. Our only goal is to remove the anti-democratic and autocratic AIADMK government. Political parties that share our ideas align with us.\n\nThe majority of the people who are waiting to remove the AIADMK government will also support political parties that align with the DMK.\n\nWill the Sri Lankan Tamil issue figure during the election campaign?\n\nThe problems of Sri Lankan Tamils cannot be just reduced into an election issue. The DMK has been working for their welfare since the 1950s. In this election, the paramount issue is the removal of the AIADMK government. It is the unanimous wish of the voters. Only these issues will occupy the centre-stage in the election. Even if the Sri Lankan Tamil issue is raised, it will be raised against Ms. Jayalalithaa who gained political mileage in the aftermath of the assassination of Rajiv Gandhi and the civil war in Sri Lanka but let down Sri Lankan Tamils.\n\nThe situation in the DMK has come to a stage in which you are everything after party leader Mr. Karunanidhi. It is not only a great responsibility, but has also created a situation wherein you will be held responsible for the outcome of the elections. How do you see this?\n\nI am among the lakhs of followers of Kalaignar. I follow his advice in all my political activities.\n\nHe built the DMK as a great movement irrespective of electoral outcomes. The victory of the DMK will reach every cadre. Defeat is not in our mind as we are sure of victory. My duty is to coordinate with the workers to hand over the victory to our leader.\n\nWill new faces and youth find a prominent place in the list of DMK candidates, particularly women?\n\nThe list, to be released by Kalaignar, will provide an answer to your question. There has been no dearth of youth, new faces and women in the DMK list. Those who closely follow the list will know it.\n\nThe Congress has already joined the DMK alliance. Will more parties join it?\n\nA few more parties may join us along with Congress and the Indian Union Muslim League (IUML). Above all, the people of Tamil Nadu have joined our alliance.\n\nThe DMK is said to have held parleys with actor Vijayakant’s Desiya Murpokku Dravida Kazhagam (DMDK). This led to DMK leader Kalaignar saying that the “fruit is ripe” and raised great hope about the alliance. Why did it fall through?\n\nMr. Vijayakant declared that he would remove the AIADMK and further said he would not allow Ms. Jayalalithaa to come back to power. He went to the extent of saying that he was ready for any sacrifice to achieve this. There is nothing wrong in forming an alliance with political parties that share common ideas, and only on that basis did our leader invite him. So, you have to pose this question to Mr. Vijayakant. As far as we are concerned, we have fully prepared ourselves for the election.\n\nTamil Nadu is heading for a multi-corned contest. Will it be an advantage or disadvantage to the DMK?\n\nThe AIADMK had meticulously created a multi-cornered contest. But the actual contest is between the DMK and the AIADMK, and the DMK will win the polls.\n\nWho will be the Chief Minister in the event of DMK assuming office after the elections?\n\nThe DMK will win the election and Kalaignar will be the Chief Minister of the state for the sixth time.\n\nWhat is the agenda of the DMK in the elections?\n\nA state with total prohibition, transparent governance and inclusive growth. Our motto is development, development and development.\n\nA few who benefitted from the Dravidian movement have turned against it’", 
    "section": "national", 
    "title": "AIADMK is behind the multi-cornered contest, but DMK is the only challenger to ruling party", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}