{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A sculpture of Chandesvarar, believed to belong to the 10{+t}{+h}century AD, has been found at Sundaikkai village near Umaiyalpuram on Tiruchi-Musiri Highway by research scholars of Dr. M. Rajamanikkanar Centre for Historical Research, Tiruchi.\n\nThe stone sculpture was found partially buried on the outskirts of the village.\n\nR. Akila, Assistant Professor, Department of History, Arignar Anna Government Arts College, Musiri, and M. Nalini, Head, Department of History, Seethalakshmi Ramasami College, stumbled upon the sculpture while undertaking an explorative study in the nearby area, said Dr. Kalaikkovan, Director, Dr. M. Rajamanikkanar Centre for Historical Research, in a press release.\n\nDr. Kalaikkovan, who examined the sculpture, said that it was an early Chola icon measuring 92 cm in height, 58 cm in breadth and 15 cm in thickness. The headgear was arranged as “jatabhara” and the apparel at the hip was short and wavy and kept in place by a well-draped ‘idaikkattu.’\n\nSeated in ‘suhasana’ with one leg folded and kept on the seat, his other leg rested on a pedestal. He was decorated with a sacred thread, a band at the stomach, and scanty ornamentation. Chandesvarar was one of the 63 Nayanmars of the Saivite sect and was the first among them to find a place in temples, Dr. Kalaikkovan said.\n\nHe was housed in a separate shrine on the northern side of all Saivite temples, facing the presiding deity. He was the only devotee to have the credit of getting announced as His son by the Lord Himself and was given the very high rank of Chandesapatham. The most distinguished shrine of Chandesvara was built by Rajaraja I at the Rajarajesvaram in Thanjavur.\n\nThe discovery of the icon suggested the presence of a dilapidated Siva temple in the vicinity and a study would be undertaken by research scholars to identify it, Dr. Kalaikkovan said.", 
    "section": "national", 
    "title": "Chandeswarar sculpture found near Musiri", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}