{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "PROUD MOMENTS: Prize winners (in both junior and senior categories) of The Hindu Young World Painting competition 2016 held in Tiruchi on Sunday.— Photo: M. Srinath\n\nClose to 400 children accompanied by their parents and teachers chose to spend a warm morning showcasing their artistic talent at the highly-anticipated finale of the Young World Painting Competition 2016 at the Cauvery College for Women auditorium on Sunday.\n\nThe event was open to school children from Class 4 to 9, had two categories – Junior (Class 4 to 6) and Senior (Class 7 to 9). R.Nandini of Blossom Public School, Thanjavur, emerged the winner in the juniors category and M.Adinath of Kamala Niketan Montessori School, Tiruchi, in the seniors category.\n\nFrom the preliminary round which drew 1,282 entries (780 Juniors and 502 Seniors), 250 participants from each category were shortlisted for the finale, which was eventually attended by 206 Junior and 185 Senior contestants.\n\nThree topics were provided at the venue for each category.\n\nJunior participants could select a theme from ‘Fun in the Sun’, ‘Outside My Window’ or ‘Food Fair’ while Senior children could choose from ‘A Scene in the Kitchen’, ‘My Hometown Railway Station’ or ‘Emotions’.\n\nIn addition to the usual depiction of landscape subjects, many contestants were seen taking a novel approach in their colour schemes and presentation of ideas.\n\nPudukottai-based professional artists M. Rajappa and M. Ayyappa were the judges for the day.\n\n“Art is an essential part of one’s cultural and personal identity,” Mr. Rajappa told The Hindu .\n\n“What started out as scribbling in the prehistoric era is now considered art. So it is important for us to teach our children how to express themselves through drawing and painting,” he said.\n\nThe contest emphasised the use of brush and paints, and prohibited the use of markers and felt pens. “Children should realise that learning art is not enough, they must find their personal style in any genre that they pick up,” said Mr. Ayyappa, whose chosen painting tool is the kitchen knife.\n\nM. Vasuki, Deputy Director General (Engineering), All India Radio, Tiruchi, who distributed the prizes, said that it was commendable that so many people had attended the painting competition despite constraints of time and distance.\n\n“Children have become distracted by electronic gadgets and the media these days. Learning about victory and defeat becomes easier when they participate in a mass competition like this, because the results are announced soon after the event,” Ms. Vasuki said.\n\nThe popularity of the competition could be seen in the vast numbers of parents and teachers who had gathered outside the auditorium to wait for their young charges. Many of them had travelled from places like Thanjavur, Pattukottai and Karur for the contest, despite a busy school exam schedule.\n\nThyrocare was the presenting sponsor of the Young World Painting Competition 2016. Cauvery College for Women was the venue partner.\n\nResults\n\nJuniors\n\nFirst prize: R. Nandhini (Class 6, Blossom Public School, Thanjavur), Second Prize: B. Sreeni (Class 5, Care International School, Tiruchi), Third prize: R. Rohini (Class 4, Sri Sankara Vidyalaya, Karur).\n\nConsolation prize winners: J. Monica (Class 6, P.A. Vidya Bhavan Higher Secondary School, Karur), P.K. Punithan (Class 6, Blossom Public School, Thanjavur), E.S. Lakshmi (Class 5, Vidya Mandir School, Ariyalur), S. H. Keshav Karthik (Class 5, B.V.M. Global School, Tiruchi), M. Laksha (Class 6, Amrita Vidyalayam School, Tiruchi), T. V. Maneesh (Class 6, Chellamal CBSE School, Tiruchi) and M. Shivaranjanii (Class 6, Laurel Senior Secondary School, Pattukottai, Thanjavur district).\n\nSeniors\n\nFirst prize: M. Adinath (Class 8, Kamala Niketan Montessori School, Tiruchi), Second prize: A. Janua Crispin (Class 8, St. Joseph’s Anglo-Indian Higher Secondary School, Tiruchi), Third prize: N. Arun Prasanth (Class 9, Kongu Vellalar Matriculation Higher Secondary School, Karur)\n\nConsolation prize winners: M. Raghul (Class 8, Pon Vidya Mandir, Karur), R. Shruhan Vinayak (Class 9, P.A. Vidya Bhavan Higher Secondary School, Karur), G. Vijayaraghavan (Class 8, Chinmaya Vidyalaya, Tiruchi), B. Priyadarshini (Class 9, Pon Vidya Mandir, Karur), C. Ramanan (Class 8, Laurel Senior Secondary School, Pattukottai, Thanjavur district), R. D. Samyuktha (Class 8, Blossom Public School, Thanjavur), E. Shree Navaneethaa (Class 7, Pon Vidya Mandir, Karur).", 
    "section": "national", 
    "title": "Children showcase their talent in painting competition", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}