{
    "author": [
        "Special Correspondent"
    ], 
    "text": "At The Hindu Young World painting competition\n\nA large number of children, all studying Standards from 4 to 6 and 7 to 9 assembled and showcased their creativity at The Hindu Young World painting competition 2016 held at the Bell Matric School here on Sunday.\n\nDreaming big like the Pablo Picasso, the young girls and boys brought out their imagination in the form of drawing at the competition, which commenced from as early as 9 a.m.\n\nVying with each other, the kids, who were given different topics on-the-spot to choose from, came out with a brilliant performance and in attractive colours and shades, said noted artist Kathir and Shiva, who donned the role of judges.\n\nAppreciating The Hindu for conducting such a competition in association with sponsors, they said that it helped the children to bring out their talents. “There are enough schools and colleges to impart quality education in every city, but to bring out the talent in arts and culture, such competitions alone encouraged children and gave them the much needed recognition,” they added.\n\nWhile the juniors were given to choose from Fun in Sun, Outside My Window and Food Fair, the senior category students were given topics, including A Scene in the Kitchen, My Hometown Railway Station and Emotions.\n\nSpeaking to The Hindu team at the venue, the winners said that they practised painting regularly at their arts/crafts/CCA classes in school, but expressed concern over the lack of encouragement and time as they were thrust with academics. A few of the parents, who had come to the venue also said that their passion for arts, music and culture, led to the children try their hand in drawing.\n\nPrize winners (Juniors)\n\nFirst prize winner: B.K. Shreya Madhu Bala IV of Sri Jeyendra School; Second prize winner: S. Amalathithan V of Bharath Vidya Mandir; Third prize winner: S. Bhuvan Nainar VI of Sri Jeyendra Silver Jubilee School.\n\nConsolation prizes\n\nShreyas Patrick VI of Alagar Public School; Shwetha IV of Vikaasa School; G. Pravin V of Kanchi Sankara School; S. Kawin Priya V of Kanchi Sankara School; S. Kamalasri IV of Vikaasa School, P. Daphne Marcia IV of Vedic Vidyashram School and G. Ansly Jemi Sharen VI of Kings Matric Higher Secondary School.\n\nSeniors\n\nFirst prize: S. Sahaya Arlin Nathinsha VII of Subbiah Vidyalaya Girls Higher Secondary School; Second prize: G. Ranga Srinivas IX of Jeyandra Silver Jubilee Matric Higher Secondary School; Third prize: T. Shanti Kritika VIII of Vedic Vidyashram School.\n\nConsolation prizes\n\nL. Hema Priya VIII of Kanchi Sri Sankara Academy Matric School; K. Mukilan VII of Shrikarra Vidya Mandir; S. Vidya VIII of Vedic Vidyashram School; V. Varshika VIII of Vikaasa School; M. Franklin Geoffrey IX of Rose Mary Matric Higher Secondary School; L. Lavanya IX of Rose Mary Matric Higher Secondary School; M.K. Ajith Bala VII of Sri Lalitha Vidyashram Matric School.\n\nThe venue sponsor was Bell Matric School. The snacks partner “Me too”, beverage partner Rajah Malco and hospitality partner Mayan Builders.\n\nThe chief guests Chandru, former Principal of Government Fine Arts College Chennai, Devendra Poopathy, Joint Commissioner (Enforcement), Commercial Taxes, and Sanjay Gunasingh of Bell Matric School presented prizes to the winners.\n\nA total of 187 students in the junior category and another 186 from senior category participated in the event presented by Thyrocare.", 
    "section": "national", 
    "title": "Children showcase talents", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}