{
    "author": [
        "Staff Reporter"
    ], 
    "text": "“Can’t get good price due to rising cost of farm inputs”\n\nThe dwindling market price of cotton has raised concerns among farmers growing the cash crop.\n\nTwo years ago cotton fetched a price of Rs. 5,500 to Rs. 6,000 per quintal, but now the price has come down to Rs. 3,300 to Rs. 4,000 for the same quantity, according to K. Navaneethan, a cotton farmer and president of Southern Dryland Farmers’ Association, Kovilpatti.\n\nSince Cotton Corporation of India (CCI) did not give priority to procuring cotton in Tamil Nadu, especially in Kovilpatti, the farmers who raised cotton could not market their produce profitably.\n\nMost of the farmers could not sell the produce at the minimum support price of Rs. 4,100 per quintal declared by the government. Hence, the minimum support price for cotton should be increased to Rs. 5,000 per quintal to support the livelihood of the cotton growers, he told The Hindu on Sunday. Since Kovilpatti block was blessed with black soil, cotton grew well in the region even with less amount of rainwater.\n\nNow, the farmers also faced the problem of shortage of labour, thanks to Mahatma Gandhi National Rural Employment Guarantee Scheme, which provided employment to a large number of rural people.\n\nWith rising cost of farm inputs, production and labour, the cotton farmers could not get the price they needed for their produce.\n\nA daily wage labourer, who plucked an average of 10 kg of cotton, was paid Rs. 200 for six-hour work, he said.\n\nMr. Navaneethan said that since most of the cotton farmers could not withstand the brunt of market slowdown, they switched over to chilli, which yielded a price of Rs. 13,000 per quintal.\n\nNowadays, Kovilpatti, which was known as known as a major producer of cotton in those days, had lost its ground.\n\nEarlier, Kovilpatti cotton had gained international reputation, and cotton bales were exported to other countries from Thoothukudi sea port. Several ginning factories and spinning mills were established by the British in the undivided Tirunelveli and Ramanathapuram districts.\n\nA ginning factory established by the father of Tamil poet C. Subramania Bharathi was still in existence at Ettayapuram, he added.", 
    "section": "national", 
    "title": "Cotton farmers demand hike in MSP", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}