{
    "author": [
        "R Rajaram"
    ], 
    "text": "The Dravida Munnetra Kazhagam has always remained steadfast in fighting for social justice whether in power or out of it, the party treasurer M.K. Stalin said on Sunday.\n\nThe DMK and its parent organisation Dravidar Kazhagam (DK) have been working as a double barrelled gun over the years in fighting societal evils by following the path of Periyar and serving the society, Mr. Stalin said taking part in the social justice conference organised by the DK here.\n\nTracing the roots and history of the Dravidian movement and the DMK, Mr. Stalin said both organisations have been working for the uplift of the Tamil community in all respects.\n\nThe Dravidian movement had risen as a huge tree over the years laying primacy on the core theme of equality, he said adding that it had withstood all challenges in its fight against societal evils.\n\nThe DMK had always followed the path of Periyar and working towards achieving the dreams of the party founder C.N. Annadurai, Mr. Stalin said. Highlighting some of the achievements of the DMK regime, Mr. Stalin said it was the DMK which got women equal share in ancestral property and creating self helf groups for women for their socio-economic uplift besides taking all steps to ensure social justice.\n\nThe DMK would always sacrifice itself and fight for social justice whether in power or out of it, Mr. Stalin said. Claimiung that the DMK would attain a huge victory in the upcoming polls, Mr. Stalin said it would carry on with its task of ensuring social justice in the State.\n\nDK president K. Veeramani said the Tamil community had been enjoying the benefits through reservation which the DK and the DMK had been fighting for long. The DK had now been forcefully fighting for reservation in the private sector, he said.\n\nThe central government in power now was trying to privatise the public sector undertakings with a hidden agenda to quell reservation, he alleged.\n\nTamil Nadu Congress Committee member Gopanna, former MLA Pazha. Karuppaiya and others spoke on the occasion.", 
    "section": "national", 
    "title": "DMK firm in fighting for social justice", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}