{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Launch of Start-Up India initiative by Prime Minister Narendra Modi at the start of the year prompted engineering colleges in the district to motivate their students to transform into job providers through entrepreneurship awareness programmes.\n\nThe Bannari Amman Institute of Technology at Sathyamangalam and Kongu Engineering College, Perundurai, are fostering entrepreneurship through Technology Business Incubators funded by the Central Government.\n\nEarlier this year, Kongu Engineering College conducted an awareness programme under the aegis of Entrepreneurship Management and Development Centre. During a subsequent programme organised by Confederation of Indian Industry, top industrialists interacted with students to motivate them.\n\nA year ago, the Centre received ‘Best E-Cell, Entrepreneurship Eco System Builder Award from the Union Ministry of Skill Development and Entrepreneurship and National Entrepreneurship Network.\n\nLast month, Bannari Amman Institute of Technology launched start-ups conceptualised by students, during E-Week celebrations organised by its Entrepreneurship Development Cell and Technology Business Incubator. The three campus companies constituted Project Dock for Project Components, GoFar – Solutions for Motivational Talks for students, and Treatz for Yummy Snacks.\n\nThe Nandha College of Technology and Erode Sengunthar Engineering College teamed up with Ahmedabad-based Entrepreneurship Development Institute of India to conduct awareness programmes.\n\nThe Institute sensitised students to the conducive measures put in place by the Central Government to encourage the culture of entrepreneurship among student community.\n\nThe Central Government’s proposed Start-up Action Plan, meant to reflect the government’s seriousness towards creating an ideal ecosystem, reflected in the Government earmarking Rs. 10,000 crore exclusively for fostering entrepreneurship among students, the students were told. The proposal provides for exemption from payment of income tax on profit for the first three years, fast-tracking of start-up patent applications, 80 per cent exemption in patent fee for start-up businesses, and a self-certification based compliance system for nine labour and environment laws, speakers said while interacting with students.", 
    "section": "national", 
    "title": "Engineering colleges draw students’ attention to Centre’s start-up initiative", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}