{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "‘A healthy Kangayam cow fetches a minimum price of Rs. 80,000’\n\nFarmers are now apprehensive that the restriction on carrying cash could deter many regulars from visiting the fair. —File Photo\n\nOn the one hand, farmers and breeders of Kangayam cattle are eagerly looking forward to the upcoming cattle mela to be organised on the sidelines of the Kannapuram Mariammam temple festival. On the other, they are quite worried too.\n\nThe popular mela, which has a history of nearly 1,100 years, attracts farmers from all over the country.\n\nCode of conduct\n\nFarmers are now apprehensive that the restriction on carrying cash – currently in force as part of the implementation of the model code of conduct – could deter many regulars from visiting the fair.\n\n‘Breed facing extinction’\n\n“This mela is one of the biggest opportunities for the farming community to trade genetically pure Kangayam cattle species, which is facing extinction, on a single platform. Trades here are not done with a billing system as cattle are sold by small and marginal farmers. “Around 8,000 cattle are traded every year. A healthy Kangayam cow fetches a minimum price of Rs. 80,000. A sturdy bull is sold for more than Rs. 1 lakh. Hence, restrictions like mandatory documentary proof for any amount exceeding Rs. 50,000 will severely affect the traditional festival,” said K.S.M. Karthikeya, Managing Trustee of Senaapathy Kangayam Cattle Research Foundation (SKCRF), which is involved in the in-situ breeding of the species.\n\nThe Pushkar model\n\nCiting precedents, the farmers have now made a representation through SKCRF to the Chief Electoral Officer Rajesh Lakhoni. They have requested him to issue directions to the Collector (who is also the District Election Officer) to depute a revenue official for issuing special certificates to farmers who sell cattle. “This methodology is adopted during the Pushkar mela in Rajasthan if the festivity coincides with any election. This will enable the farmer who sells the animals to carry home cash without the fear of getting the amount seized by election officials,” said Mr. Karthikeya.\n\n‘A healthy Kangayam cow fetches a minimum price of Rs. 80,000’", 
    "section": "national", 
    "title": "Kangayam cattle fair: farmers wary of EC curb on carrying cash", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}