{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse by M. Illango on ‘Siddargalin Aanmegam,’ Railway Colony, 7.30 p.m.\n\nKallazhagar Temple: Sundararaja Perumal Tirukalyanam festival, procession of deities, Alagarkoil, 6 p.m.\n\nDandayuthapaniswamy Temple: Uthiram festival fourth day events, Skanda homam, 5 a.m.; Rudra japam, 6 a.m.; Pookoodaram, 4 p.m.; alankaram, Netaji Road, 5 p.m.\n\nMuneeswarar Temple: Masi festival, pattimandram by Gnanasambandan, Munsif Court Road, Tirumangalam, 8 p.m.\n\nPanniru Tirumurai Mandram: Sivagnanapotham discourse by N.S. Sundararaman, South Adi Street, 7 p.m.\n\nRamakrishna Mutt: Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nSri Swami Tatwananda Ashram: Gita classes by Swami Samanandar, South Avani Moola Street, 6.45 p.m.\n\nChinmaya Mission: Discourse on Bhagavad Gita by Sivayogananda, Kanchi Kamakodi Mutt, Besant Road, Chokkikulam, 6.45 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Thirumandiram’ by S. Thirumavalavan, North Adi Street, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Kandapuranam’ by A. Arumugam, S.S. Colony, 5 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., and 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street; 47 B CMR Road, and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nVelammal College of Engineering and Technology: National-level project competition, ‘Three idiots’, Ganesh Natarajan, vice-chairman, presides, Balasubramanian Irulandi of Cognizant Technology Solutions inaugurates, K. Kamaraj Auditorium, 9.15 a.m.\n\nYadava College: Dept. of English conducts ‘Students’ seminar, R. Balasundar, Director, The Gate Academy, speaks on ‘Compete to win’, Rajendran Yadav Auditorium, 2 p.m.\n\nSaraswathi Narayanan College: NSS camp, Dr. P. Pandi, PHC, Valayankulam, speaks on ‘Health and cleanliness,’ Kombadi village, 5 p.m.\n\nTNEB Retired Senior Engineers’ Forum: Meeting on ‘Ageing and eye’, by Dr. A. Kowsalya, consultant, Neuro Ophthalmology, Aravind Eye Hospital, speaks, Hotel Prem Nivas, 5 p.m.\n\nAlcoholics Anonymous: Meeting, Quality Care Hospital, Ellis Nagar, 7 p.m.", 
    "section": "national", 
    "title": "MADURAI TODAY", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}