{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Vikram, Kajal Agarwal to star in the science fiction thriller\n\nActor Vikram will pair with Kajal Agarwal for the first time, in the upcoming movie Garuda. The versatile actor, who is currently in the sets of Irumugan , a science fiction thriller, will start shooting for Garuda on April 1.\n\nWhile a major portion of the film will be shot in the Middle East, the crew is also set to shoot in places around Chennai, Coimbatore, Pollachi, Ahmedabad and Lucknow.\n\nThe first scene will be shot at a grand set being that is being made in a 100-acre site in Sriperumbudur.\n\nKajal Agarwal will don the role of a girl based in Coimbatore. However, the storyline has been kept under wraps.\n\nGaruda will be the fifth movie to be directed by Thiru, who has earlier done Samar and Naan Sigappu Manithan . He has penned the dialogues and screenplay of the movie.\n\nActor-filmmaker Mahesh Manjrekar, who shared screen space with actor Ajithkumar in Arrambam, will be the antagonist in Garuda .\n\nMr. Manjrekar, who has directed 23 Hindi films, gained acclaim for his roles in Slumdog Millionaire and Dabangg.\n\nThe film will also have actors Nassar and Karunas in supporting roles. While Richard M. Nathan will wield the camera, the crew has roped in debut music composer Girinandh and choreographer Shobi for the movie.\n\nAn innovative\n\nstart\n\nAfter the release of the movie Rajathandhiram to critical acclaim, the makers of the heist film announced their plans for a sequel earlier this week with a unique promotion strategy.\n\nThe first six minutes of the sequel Rajathandhiram II was released on YouTube and has, so far, over 1.5 lakh views.\n\nThe video, which shows the lead characters stuck in a prison cell, has them wondering about their escape route.\n\nVeera Bahu, Ajay Prasath and Darbuka Siva are seen reprising their characters from the first movie as the main protagonists.\n\nSenthil Veerasamy — a former assistant of director and producer Gautham Vasudev Menon — is making his directorial debut with the film.\n\nHe has said that the movie is set a year after the first instalment and that the three characters, who are behind bars for a heist, are approached with a new cast. The film is expected to go on floors in July and will release later this year.\n\nApart from tweeting about the release of the video, social media users took to posting about the fact that the new instalment will have music by maestro Ilaiyaraaja and appreciated the background score in the intro as well. Thaarai Thappattai, which was the music maestro’s last major movie release, was much talked about for being his 1000th film in the industry.\n\n(Reporting by K. Lakshmi and S. Poorvaja)", 
    "section": "national", 
    "title": "Major portion of Garuda to be shot in Middle East", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}