{
    "author": [
        "S Prasad"
    ], 
    "text": "Pattali Makkal Katchi (PMK) founder S. Ramadoss on Sunday expressed confidence that the party would come to power in the forthcoming assembly elections if neutral voters and youth who formed a major chunk of the electorate in the State cast their votes for the party.\n\nNeutral voters\n\nTalking to reporters at his residence in Thailapuram near here, Dr. Ramadoss said that time had come to put an end to the fifty years rule of Dravidian parties in the State. The neutral voters and youth are holding the key to ensure a corrupt free administration in Tamil Nadu.\n\n“Both the Dravidian parties had ruined Tamil Nadu by opening liquor shops during their respective terms of rule. This was the only achievement of the DMK and AIADMK who had done nothing for the development of the State,” said Dr. Ramadoss.\n\nDr. Ramadoss said that it was the duty of everyone to cleanse politics instead of shunning it as gutter. Political parties are the grassroots and pillars of democracy.\n\nThe neutral voters and youth who form a major chunk of the electorate should take a firm stand to eradicate corruption and vote for the PMK.\n\nHe added that the right to vote is most precious and cannot be evaluated in terms of price.\n\nVotes for cash\n\nBut both the DMK and the AIADMK have been resorting to sale of votes for cash in a bid to come to power. Both the parties have been attempting to keep voters as slaves by offering money prior to elections and making available freebies post elections, he charged.\n\nAccording to a recent study by Centre for Media Studies, Tamil Nadu was ranked second in the country next only to Karnataka in cash for votes practice.\n\n“It is deplorable that votes of 40 per cent of the ordinary segment of voters and 78 per cent of the below poverty line families have been purchased. However, such a culture cannot be seen in Kerala, West Bengal and Assam,” said Dr. Ramadoss.\n\nMr. Ramadoss said that Anbumani Ramadoss has been registering an increase in support.\n\nHe further added that students of various colleges had come out with the opinion that the present rule should be replaced.", 
    "section": "national", 
    "title": "Neutral voters and youth hold the key: Ramadoss", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}