{
    "author": [
        "C Jaisankar"
    ], 
    "text": "t is a tough time for commuters as they find it horrible to beat the sweltering heat. If the air conditioned bus shelters are to be of any use to them, it is the right time. However, the much-talked air conditioned bus shelters, set up by the Tiruchi City Corporation with the participation of City Union Bank with the aim of providing cooling comfort to the passengers, are hardly functioning.\n\nSuch shelters have been opened at Amma Mandapam in Srirangam zone, Mahatma Gandhi Memorial Government Hospital in K. Abishekapuram zone, Joseph Eye Hospital in Golden Rock zone, and Gandhi Market in Ariyamanagalam zone. The shelters, which were established with the private participation, were opened for public use in January 2015. The private bank had spent Rs.25 lakh to Rs.30 lakh each for setting up the shelters. Transparent glasses with cushioned seats were provided so as to enable the passengers to notice the arrival of buses to their destination.\n\nThe Corporation authorities had said at the time of inauguration that it would gradually upgrade other bus shelters with air conditioned facility depending upon the success of the four A/C shelters. However, it is found that air condition machines have stopped functioning long ago. Though passengers chose to wait inside the cabin in the first few months of installations, they were hardly entering the cabin nowadays because of non-functioning of AC machines.\n\nCommuters complain that the purpose of the facility has been defeated due to the absence of proper mechanism to maintain the bus shelters. There is no efficient system to clean the cabin on a daily basis.\n\nA passenger, who waited in front of the AC shelter at Gandhi market, said the shelter had been offering no use to the passengers. No one was using the shelter as the AC was not functioning. However, security guards, posted by the private bank to guard the ATMs installed in a portion of shelters, said that the cooperation of passengers was important to keep the shelter neat and clean. Without realising the importance of AC shelters, they littered food waste and spit indiscriminately in the shelters.\n\nWithout realising the importance of the facility, passengers litter the shelters with food waste and spit indiscriminately", 
    "section": "national", 
    "title": "No relief for passengers from air-conditioned bus shelters", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}