{
    "author": [
        "K Raju"
    ], 
    "text": "Coming home after nearly a month, Finance Minister O. Panneerselvam had to be content with a lukewarm reception at his hometown Periyakulam and party office in Bodi from where he was elected to the Assembly.\n\nAfter reports of Mr. Panneerselvam falling out of favour with party leadership and with the elevation of MLA Thanga Thamilselvan as district secretary of the Amma Peravai, the inner party feud in Theni district, a traditional stronghold for the AIADMK, came to the fore on Sunday.\n\nMr. Panneerselvam reached home this morning. He went to the party office in the district after more than a month. Only his loyalists and party functionaries, who lost their posts due to their close proximity to him, met the Minister at his son’s residence in Periyakulam, sources said.\n\nNeither Mr. Thamilselvan nor Theni MP R. Parthiban came to the party office to meet him. A sizable number of town and union level leaders and party functionaries, mostly supporters of Mr. Thamilselvan, too did not turn up.\n\nNo senior leader or district-level leaders met him at his residence. The situation was the same at the party office in Bodi. A majority of party functionaries did not come to party office on Sunday, sources said.\n\nUsually, party functionaries at different levels throng the Minister’s house during his weekend visits. There was a huge turnout at his residence and hectic activity in the area 45 days ago when partymen lined up to seek ticket to contest the Assembly election.\n\nBut this time, many party functionaries attended the meeting convened by Mr. Thamilselvan on Saturday. Even in the absence of Mr. Panneerselvam, he drew a large crowd for his first meeting as district secretary of the Peravai.\n\nEver since Mr. Thamilselvan lost his district secretary post in 2011, there was difference of opinion between them. With the leadership strongly favouring him, Mr. Panneerselvam went on to be the Chief Minister for a second time when the trial court convicted Jayalalithaa.\n\nWith Mr. Panneerselvam and two other Ministers reportedly being sidelined, Mr. Thamilselvan is in limelight now. Announcing that a mega public meeting would be held on March 23, he has appealed to cadres to be present in large numbers.\n\nMeanwhile, the second line of AIADMK leaders are worried that the creation of two power centres in the district could jeopardise the electoral fortunes of the ruling party in the Assembly elections.\n\nLocal leaders conspicuous by absence; crowds throng Thanga Thamilselvan meeting", 
    "section": "national", 
    "title": "OPS gets lukewarm welcome at Periyakulam, Bodi", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}