{
    "author": [
        "Special Correspondent"
    ], 
    "text": "CPI (M) leader T. K. Rangarajan, MP, with the representatives of tribal people in Kolli Hills in Namakkal district on Saturday.\n\nCommunist Party of India (Marxist) MP and trade unionist T. K. Rangarajan visited the tribal villages in the Kolli hills on Saturday and interacted with the farmers on the problems confronting them.\n\nMr. Rangarajan visited the Semmedu, Vazhvanthinadu and the surrounding villages. The farmers of these villages said that the production of various farm products such cardamom, seeragam spice has come down due to various reasons such as failure of monsoon, during the current crop season. This has badly hit the revenue of the local farmers.\n\nThe farmers’ representatives urged the MP to use his good office to draw the attention of the Centre to increase the procurement price of both cardamom and seeragam immediately.\n\nDue to the poor crop, the price of cardamom has skyrocketed. But, in no way it benefited the farming community, they complained.\n\nThey also complained about the non-availability of adequate government assistance in the form of subsidy. Mr. Rangarajan assured to take up their grievances with the governments.\n\nMr. Rangarajan visited Siddha branch on the Primary Health Centre (PHC) campus in Vazhavanthinadu constructed at an outlay of Rs. 31 lakh from the MP Local Area Development Fund sanctioned by him in 2014-15.\n\nHe interacted with the doctors, para-medical staff and also with the patients. The local people drew his attention to the absence of trained technicians for handling the X-ray and scan equipment at the PHC. Due to this, the patients are being directed to go to Namakkal for getting X-ray and scan reports. The residents of Vazhvanthinadu presented a petition in this regard to Mr. Rangarajan.\n\nHe urged the tribal people to be aware of the schemes and programmes being implemented by the government for their benefit and leave no stone unturned to take advantage of the same for uplifting their living standard.\n\nN. Srinivasan, state committee member of the CPI (M) and A. Rangasamy, Namakkal district secretary of the party, accompanied the MP to the tribal villages.", 
    "section": "national", 
    "title": "Rangarajan interacts with farmers of Kolli hills", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}