{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Garment workers and salaried class in Tirupur industrial sector who recently heaved a sigh of relief when the Union Government withdrew the decision to impose tax on provident fund following widespread protests, are now in another dilemma.\n\nThe decision to reduce the interest on small savings including public provident fund, national savings certificates and Kisan Vikas Patra, among others has come as shocker to them.\n\n“Interest rate cut on public provident fund (PPF) from the current 8.7 per cent to 8.1 per cent is worse than the move to impose tax on the 60 per cent of the provident fund withdrawals which itself was carried out against interests of the salaried class population. PPF are our only meagre collective savings at the time of superannuation”, pointed out garment sector workers here.\n\nD. Manoharan, district general secretary of All India Bank Employees Association, was of the opinion that it is a ridiculous justification by the Union Finance Ministry that the new move to cut the interest rates on PPF has been aimed at aligning the same with the existing market rates.\n\n“It is the government’s duty to fix the market rates like in the case of fixation of guideline values for lands not that it should run after the market rates”, he said.\n\nEven technocrats feel that small savings like PPF and others are family supportive national policies and hence, it is the responsibility of the Union Government to give good interests for them.\n\n“India is a saving-oriented country and hence, the cut in interest rates may benefit the exchequer but detrimental to the interest as well as sentiments of the people”, observed T.R. Ramanathan, a senior member of Institute of Chartered Accountants of India.\n\nMr. Ramanathan added that small savings, along with the concept of joint families, remain unique characteristics of the society in the country and hence, higher interests on PPF should be protected at any cost.", 
    "section": "national", 
    "title": "Savings shocker to garment workers, salaried class", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}