{
    "author": [
        "S Senthalir"
    ], 
    "text": "Aiyana Gunjan blends calligraphy with painting to create abstract art\n\nThe rhythmic patterns of myriad calligraphic strokes on water colours take us through the life of artist Aiyana Gunjan. She does not visualise her paintings, instead lets the oblique cut nib to travel with her thoughts and state of mind on the canvas.\n\nFor her, it is the qalam , the calligraphy pen, which takes the form of paint brush. Dipped in ink or water colour, it reveals itself on the canvas creating abstract art. Mending calligraphy with painting, she meditates through this art elevating the traditional form of calligraphy into the universal language of contemporary abstract art.\n\nAiyana Gunjan’s journey in fine arts began in Puducherry in 2003 when she saw the horizon beckon her into the vastness of the sea and its expanse. “The life-changing experience brought me closer to the depth and expanse of life beyond the limits of logical mind,” she says.\n\nA brand and semiotics consultant in advertising industry, she is a self-taught artist based in Delhi.\n\n“When I sit in front of my canvas, I am not making a painting. I simply paint going with the flow, stroke by stroke. I do not visualise the work. I just draw and a stroke leads to another one. Only after I complete painting, the work is revealed,” she says.\n\nThe calligraphic strokes synchronise with water colours blending into an abstract form.\n\n“Water colour is my medium. I love the spontaneous flow and transparency and nothing can be hidden. When we use water colours, you have to just let go of the control. This is what brings it closer to my heart,” she says as she explains her art work.\n\nPainting those strokes is a spiritual experience for this artist.\n\n“Everything else goes out of focus when you are in focus with yourself and art. So sacrosanct it is. I paint not to decorate walls but to break the walls within. It was just a medium to go within. It is a spiritual medium,” she says.\n\nShe adds that in every stroke there is a definite start and end and a life in between. It is the single breath and single moment of time.\n\nThe past, present and future are in that moment. Each moment leads to the next moment. In each stroke there is depth, dimension and movement.\n\nAiyana Gunjan’s art works will be exhibited at the Alliance Francaise till March 31.", 
    "section": "national", 
    "title": "She wields the calligraphic pen to break the walls within", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}