{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Farmers demand cold storage unit\n\nThe price of tamarind has registered an upward trend for the last one week in Omalur region due to the poor arrival from the surrounding villages.\n\nThe Eastern Ghats in Omalur block accounted for a large number of tamarind trees. Tamarind is one of the major crops in the nearby Yercaud hills, Kancheri, Kollimalai hills, Arunoothumalai, Manjavadi and Attur. The hilly areas always remained wet, leading to good tamarind production throughout the year. However, the repeated failure of monsoon led to drought on the hills too, affecting the tamarind production to a big extent.\n\nMoreover, the heavy winds during the flowering season also affected the crop. Due to this, the farmers could manage only 60 per cent of the normal crop this season.\n\nThe residents of Kottamettupatti area near Omalur are involved in harvesting the tamarind. They visit various parts of the district and get the tamarind trees on lease. They collect the tamarind fruits, dry them before removing the shells. Later, they separate the fruits based on the quality and again dry it under moderate sun.\n\nThey later pack it and bring it to the market. The price of tamarind remains between Rs. 60 and Rs. 110 per kg. The same is being sold in the open markets at a price ranging between Rs. 90 and Rs. 140.\n\nDue to drop in the arrival in the open markets, the price has registered an upward trend, say the local traders. This will affect the revenue earned by the farmers to a big extent, they say.\n\nThe local people have no storage facility to keep the fruits after harvesting, due to which they have to market the same without any delay. This is one of the reasons for the farmers suffering loss. The storage facility will enable them to stock the fruits and market the same when there is good demand.\n\nThe farmers and the people of Omalur villages demand the government to come forward to create storage facility and also set up a procurement centre so that the government itself could procure the stock directly from the farmers at reasonable price.", 
    "section": "national", 
    "title": "Tamarind price shoots up due to poor arrival", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}