{
    "author": [
        "S Senthalir"
    ], 
    "text": "Saaz Aggarwal shares experiences of Sindhis during partition and speaks on present situation\n\nWhile the bloody history of partition is still fresh in their memories, there remains an invisible part to it. It is the fading history of Sindhis who have lost their homeland, culture, language and history.\n\nSaaz Aggarwal, author of the book Sindh: Stories from a Vanished Homeland , spoke about the invisible but all-pervasive Diaspora during a talk organised by the People for Pondicherry’s Heritage in Puducherry last week.\n\nIn an interview to The Hindu , the author shared the experience of Sindhis during partition, nostalgia, their concept of homeland and the state of contemporary Sindhi language and literature.\n\nDetailing how different the experience of Sindhis has been from that of Bengalis or Punjabis, Saaz Aggarwal said: “During partition, the entire province of Sindh went to Pakistan. One major difference between Sindhis from that of Bengalis or Punjabis is that they lost their homeland completely. The Hindu Sindhis had lived as a minority for centuries and would have continued to do so but for the trouble and riots. When there was violence, many locked their homes and left believing that they would soon return. Of course, that never happened.”\n\nShe added that they lost their language and their culture. “Sindhis not given to talking about themselves, have lost their history too. In Sindh, their songs are not that of valour and bravery – they of the Divine. Who would remember that?” she said.\n\nShedding light on the lives of Sindhis now, she says: “With no political representation, Sindhis have become a neglected community. There have been cases of people wanting to remove the word ‘Sindh’ from the national anthem. In India, Sindhis are unfairly maligned and there is a lot of prejudice against them, so much so that young Sindhis tend to be diffident about their identity.”\n\nHaving lived in different parts of India, she is attached to the Nilgiris, where she grew up; Mumbai where she was born and lived the formative years of young adulthood and Pune where she has lived for more than twenty years. With regard to her views on homeland, she says: “There is a feeling of being attached to Sindh, and an urge (usually ignored) to kiss the earth on returning. I have visited but I feel emotionally connected to Sindh only as the homeland of my grandparents, and my mother’s childhood home.”\n\nShe adds that she feels very sad when she thinks of what the family went through when they left. The more miserable when she never learnt anything about the past lives of their grandparents and what it meant to lose their homeland though she spent three years with them during her college days.\n\n“For them, their homeland remained a secret place, deep inside them, about which they never spoke,” she says.\n\nConcerned over the dying language, the Sindhi author says: “There are many Sindhi families who speak the language at home – but many have given up and adapted local languages wherever they settled after partition.”\n\nThe ray of hope, she adds, is that there are small groups in different parts of the county which keep the literature alive, and it seems there is resurgence among young people. “However, this is a minor resurgence of interest in roots but by and large the young generation has still not understood the importance of reconnecting. None of them have any nostalgia as far as I know.” Stating that secularism should be a natural course of things, she says that religion should be an individual choice and practiced in privacy. “Giving it a name and preaching it is a defence against the radical polarisation of greedy and vested interests,” she says.\n\nFours years after the launch of her book, she continues to receive letters and emails of appreciation from people across the world especially from members of diaspora. The book is available in university libraries too.", 
    "section": "national", 
    "title": "Their history fades into oblivion", 
    "subsection": "tamilnadu", 
    "date": "2016-03-21"
}