{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Bharatiya Janata Party, Puducherry unit president V.Saminathan and other leaders are camping in New Delhi to decide about forging of alliance, announcement of candidates and preparation for campaign in the Union Territory.\n\nSwaminathan is expected to meet top level leaders including national president Amit Shah and Union Ministers Prakash Javadekar and Piyush Goyal who have been made election-in-charge of the poll-bound Union Territory.\n\nMr. Saminathan told The Hindu , “We will submit the list of candidates who were selected to be fielded in all 30 constituencies after conducting interviews with aspirants. The Central Election Committee of the BJP under the presidentship of Amit Shah will announce the list of candidates in due course of time.”\n\nSenior leader and Union Minister M. Venkaiah Naidu and local leaders had stated during earlier occasions that the party has been ready to work with the ruling AINRC in Union Territory of Puducherry. However, AINRC president and Chief Minister N.Rangasamy has not come out openly about forging an alliance so far. Meanwhile the BJP, Puducherry unit completed the interview process with aspirants who wanted to contest on party tickets in all 30 constituencies.\n\n“We are not only sure that the party will form an alliance in the Union Territory but it will ultimately bring more development to UT. We are the deciding factor in several constituencies of UT,” said Mr. Saminathan.\n\nIn an alliance with BJP, the ruling AINRC fielded its candidate R. Radhakrishnan in Lok Sabha polls and won. Immediately M. Visweswaran was made the nominated member of Legislative Assembly. He is the lone nominated member representing the BJP among 33 members of the Legislative Assembly. AINRC had rejected the plea of BJP to field its candidate for Rajya Sabha Election to the lone seat that arose after the term of P.Kannan expired.", 
    "section": "national", 
    "title": "BJP leaders in New Delhi to decide on alliance, finalise candidates", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}