{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Many of them are out of work as a result of the strike by jewelers\n\nSince mid-February, jewellers in the city have staged intermittent strikes against the levy of excise duty and this has badly hit the goldsmiths. They find themselves out of work due to the protests.\n\nThe current strike, which is ten days old had caused the greatest damage. Several goldsmiths have said that they have not got new orders for over a month\n\nHowever, hoping that things would get better, shops on several streets off NSC Bose Road like Edapalayam Street that serve as a hub for goldsmiths are being opened.\n\nK. Kanthan, a goldsmith from Sowcarpet, said he returned to work after leave for several days. “We had shut shop last week in solidarity with the protesting jewellers.\n\nBusiness has been dull as we hardly get 50 per cent of the normal orders. Goldsmiths who normally get a weekly salary between Rs. 3,000 and Rs.5,000 now earn only Rs. 500 due to the strike.”\n\nSeveral goldsmiths who own small units are forced to borrow or pay from the investment meant for business to pay workers. N. Ramachandran who runs a unit in Edapalayam Street said: “I asked workers to go on leave for two weeks. But, I can’t allow workers without salary for several days. So, I pay from the amount meant for investment. Normally, I get orders for one kg of gold every month. But, we have been able to make gold ornaments weighing only 100 grams.”\n\nGoldsmiths in the city decided to open shops as levy of excise duty may not affect them directly. Of the over 20,000 goldsmiths spread over the city, nearly half of them are based in Park Town and Sowcarpet. D. Jayagopi, president of Park Town Gold and Silver Workers Welfare Association, said several workers who give shape to Tamil and Bengali designs have been out of work as only 25 per cent of the normal orders are received.\n\nA few jewellery stores have already opened even as the associations are yet to arrive at a solution.\n\nMeanwhile, representatives from various jewellers association are on a visit to New Delhi to take part in the nation wide protest.\n\nJayanthilal Challani, president of Madras Jewellers and Diamond Merchants Association said: “We plan to take a decision on withdrawing the strike after our representatives present a memorandum to the Union Finance Minister on Saturday.”", 
    "section": "national", 
    "title": "Business lacklustre for goldsmiths", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}