{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector S. Natarajan (left) at the voter awareness campaign launched by the Department of Information and Public Relations at Ramanathapuram bus stand on Friday.— Photo: L. Balachandar\n\nThe Hi-Tech LED publicity vehicle, introduced by the Department of Information and Public Relations (DIPR) to popularise the welfare schemes of the State government, was pressed into service to create election awareness to achieve 100 per cent polling in the May 16 Assembly elections.\n\nA large number of people gathered as the giant LED screen fitted in the vehicle beamed video clippings of sports and film stars, including versatile actor Kamal Hassan exhorting people to cast their votes in the Assembly elections without fail at the new bus stand here on Friday.\n\nCampaigning against ‘vote for cash,’ the actor urged the people not to sell their future and self-respect for a pittance. Voting is one of the important duties of every citizen, actor Surya said as the people watched in awe.\n\nThis was part of the series of SVEEP (Systematic Voters’ Education and Electoral Participation) activities launched in the district to achieve 100 per cent voting in the Assembly elections, S. Natarajan, District Election Officer and Collector, said.\n\nAfter watching the video clippings along with the public, the Collector appealed to the people to visit the nearest polling stations and cast their votes without fail. The publicity vehicle would be used to play the video clippings of popular film and sports stars, roped in by the Election Commission for the campaign, official sources said.\n\nIn a special drive launched in Paramakudi, the Collector pasted voter awareness stickers in mineral water cans supplied by private parties and cooking gas cylinders.\n\nHe also distributed pamphlets to the public and appealed to them to exercise their franchise.\n\nSivaganga Collector S Malarvizhi, accompanied by the Election officials, launched the sticker campaign near Aranmanai on Friday. The stickers asked people to cast their votes according to their conscience and never sell their votes for money.", 
    "section": "national", 
    "title": "Campaign on wheels", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}