{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A sculpture of Chandesvarar, believed to belong to 10{+t}{+h}century AD, has been found at Sundaikkai village near Umaiyalpuram on Tiruchi-Musiri highway by research scholars of the Dr. M. Rajamanikkanar Centre for Historical Research, Tiruchi.\n\nThe stone sculpture was found partially buried on the outskirts of the village.\n\nR. Akila, Assistant Professor, Department of History, Arignar Anna Government Arts College, Musiri, and M. Nalini, Head, Department of History, Seethalakshmi Ramasami College, stumbled upon the sculpture while undertaking an explorative study in the nearby area, said Dr. Kalaikkovan, Director, Dr. M. Rajamanikkanar Centre for Historical Research, in a press release.\n\nLocal people helped the scholars unearth the sculpture and after cleaning, it was identified as the icon of Chandesvarar.\n\nDr. Kalaikkovan, who examined the sculpture, said it was an early Chola icon measuring 92 cm. in height, 58 cm. in breadth and 15 cm. in thickness. The headgear is arranged as “jatabhara” and the apparel at the hip is short and wavy and is kept in place by a well draped ‘idaikkattu.’\n\nSeated in ‘suhasana’ with one leg folded and kept on the seat, his other leg rests on a pedestal. He is decorated with a sacred thread, a band at the stomach, and scanty ornamentation. His left ear has palm leaf rolled and inserted as a kundala while the right ear is naked. A broad necklace adorns his neck. His right hand holds a broad-bladed axe whereas his left hand rests on his thigh.\n\nChandesvarar is one of the 63 Nayanmars of the Saivite sect and was the first among them to find a place in temples, Dr. Kalaikkovan said. He is housed in a separate shrine on the northern side of all the Saivite temples, facing the presiding deity. He is the only devotee to have the credit of getting announced as His son by the Lord Himself and is given the very high rank of Chandesapatham. The most distinguished shrine of Chandesvara was built by Rajaraja I at the Rajarajesvaram at Thanjavur.\n\nThe discovery of the icon suggests the presence of a dilapidated Siva temple in the vicinity and a study would be undertaken by research scholars to identify the same, Dr. Kalaikkovan said.", 
    "section": "national", 
    "title": "Chandeswarar sculpture found at Umaiyalpuram", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}