{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: Sengalipuram B. Damodara Dikshithar, Sri Sakthi Vinayakar Temple, Metro Nagar, Alapakkam, 6.30 p.m.\n\nUpanishad: Jamadhagni, Sri Vedavyasa Trust, Vyasa Mandali, 3{+r}{+d}St., V.V. Colony, Adambakkam, 7 p.m.\n\nVishnu Sahasranamam: Velukudi Krishnan, Valluvar Gurukulam School Campus, West Tambaram, 7 p.m.\n\nVivekachoodamani: V. Abiramasundaram, Aasthika Samajam, Venkateswara Nagar 3{+r}{+d}St., Pozhichalur, 5 p.m.\n\nTiruvasagam: Apavargananda, Ramakrishna Math, Mylapore, 5.30 p.m.\n\nAtma Bodha: R. Aravindan, Parsn Renascence, Aster 203, Mambakkam Main Rd., Medavakkam, 7.15 a.m.\n\nCULTURE\n\nSri Parthasarathy Swami Sabha: Valedictory of ‘Bharat Nritya Utsav’, Narada Gana Sabha, T.T.K. Rd., Alwarpet, 6.15 p.m.\n\nDakshnachita: Inauguration of art exhibition ‘Veerasanthanam’, ECR, Muttukadu, 4 p.m.\n\nOrganising Committee: Launch of publication ‘Bhajagovindam’, Sri Lakshmi Narasimhar Temple, 24{+t}{+h}St., Thillaiganga Nagar, Nanganallur, 6.45 p.m.\n\nOrganising Committee: Workshop and art exhibition on ‘Redrawing Resistance: Women’s Stories of Survival and art exhibition’, Women’s Christian College, College Rd., Nungambakkam, 3.30 p.m.\n\nGENERAL\n\nThe Foundation for Agrarian Studies: Talk by M.S. Swaminathan on ‘The Recommendations of the National Farmers Commission: A Ten Year Balance Sheet’ and launch of website of the foundation, MSSRF, 3{+r}{+d}Cross St., Institutional Area, Taramani, 9.30 a.m.\n\nConsulate – General of Japan in Chennai and ABK-AOTS Dosokai, Tamil Nadu Centre: Seminar on culture and society of Japan ‘Social Inclusion through Cultural Exchange’, The Raintree Hotel, Anna Salai, 4 p.m.\n\nAnna University: Ramanujan endowment lecture, Srinivasa Ramanujan Hall, Department of Mathematics Guindy, 10 a.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}