{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Congress party cadres forced their way into the building claiming ownership on Friday. -Photo: C. Venkatachalapathy\n\nCadres of the Congress and the Tamil Maanila Congress (TMC) locked horns over the ownership of a building on Anna Salai here on Friday. Two persons sustained injuries in a minor scuffle after Congress cadres forced their entry into the building.\n\nAbout 20 cadres of the Congress entered the office after breaking the lock. Soon, the TMC cadres arrived at the spot and protested against their presence on the premises, leading to a scuffle.\n\nThe police arrived at the spot and brought the situation under control. Revenue officials have locked up the office premises.\n\nBoth parties have been claiming ownership of the office since the split in 2014.\n\nHowever, four-time MLA and State vice president of TMC C. Gnanasekaran said the office was the property of Perunthalaivar Kamarajar Trust since 1972, and the parties – either Congress or TMC – has nothing to do with it. He is also the president of the trust.\n\n“The building was constructed during 1960s. It was converted into trust property in 1972. The property is being managed and maintained by the trust members. No party, including the TMC, can claim ownership,” he said. He added that the trust has been providing scholarships to students and financial assistance to the poor.\n\nMr. Gnanasekaran said locking up the building was illegal. He took up the issue with the District Revenue Office, RDO and Superintendent of Police. “I demanded that the officials should open the building immediately,” he said.\n\nBut, C. Panchatcharam, president of Vellore East Congress, said the Congress owned the building.\n\n“We have already submitted the required documents and evidence for the ownership to the RDO. The official had called us for meeting at least on five occasions but TMC members failed to turn up,” he said.\n\nTwo persons sustain injuries in a scuffle after Congress cadres enter building", 
    "section": "national", 
    "title": "Congress, TMC cadres fight over building ownership in Vellore", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}