{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Move to close gate was to facilitate construction of road overbridge\n\nSouthern Railway and State Highways engineers inspecting the level crossing gate on Ramamoorthy Road in Virudhunagar on Friday.\n\nThe proposal to permanently close the railway level crossing gate from the midnight of Friday to enable Southern Railway and State Highways Department to start construction of the road overbridge was deferred on Friday night.\n\nAfter an inspection by Deputy Chief Engineer (Constructions-Southern Railway) Samson Vijaykumar and Highways Divisional Engineer C. Subramanian, it was said that the level crossing gate in Virudhunagar-Tirunelveli section would be closed at midnight.\n\n“The gate would be closed on Friday midnight on a permanent basis so that there is no hindrance for the construction work,” Mr. Vijaykumar said.\n\nHighways Department commenced the ground work for the ROB construction on March 4.\n\nIt was also said that the vehicles would be diverted through other level crossing gates at Thanthimara Street, Vadiyan Street, ROB at Muthuramanpatti and the sub-way at Allampatti till the new ROB construction is completed.\n\nHowever, a meeting held by Collector V. Rajaraman and Superintendent of Police P. Aravindhan late in the night deferred the closure.\n\nOfficial sources said that the decision would be taken only after verification of whether the decision to close the level crossing and allowing the construction of bridge would violate the model code of conduct.\n\nThe construction of the bridge has been delayed for nearly five years after a section of residents on Ramamoorthy Road objected to the ROB which they claimed would lead to land acquisition. They demanded that a subway be constructed instead.\n\nA legal battle in the Madurai Bench of the Madras High Court ended up with the court imposing costs on the litigants.\n\nThe Highways (Nabard and Rural Roads) had planned to construct the 610-metre-long bridge in 18 months.\n\nThe two-lane road would be of 7.5 metres wide. Service roads of 3.75 metres on either sides of the bridge would also be laid.", 
    "section": "national", 
    "title": "Decision to close level crossing at midnight deferred", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}