{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Three-day United Agri Tech 2016 exhibition inaugurated\n\nThe Government should arrange soft loans for farmers so that they can buy machinery at lower rate of interest, said K. Vishwanathan, president of Tamil Nadu chapter of Agricultural Machinery Manufacturers’ Association.\n\nSpeaking to The Hindu after inaugurating United Agri Tech 2016 here on Friday, he said the level of mechanisation is 40 per cent in crops such as paddy and sugarcane. However, it is just about 20 per cent among the small-scale farmers.\n\nLabour-intensive\n\nFarmers are looking for mechanisation option for more crops because of labour shortage, especially for weeding as it is labour-intensive. But, it is an intermediary action and hence, there should be selection of crops and mechanisation option should be available for all activities.\n\nGroup farming societies have been formed at block-levels in paddy cultivation areas and they have common hiring services of machinery. Banks also extend loans for this. Mechanisation in farming is getting better focus now. There are 800 manufacturers in Tamil Nadu and the segment is growing at 20 per cent annually. Manufacturers are located more in areas where there are a large number of industries (Chennai, Coimbatore, Erode, etc). Currently, subsidy is available for select machinery. Farmers should get soft loan, he said.\n\nUnited Trade Fairs has organised the fifth edition of United Agri Tech 2016 at Suguna Kalyana Mandapam, Coimbatore.\n\nThe three-day exhibition will be open from 10 a.m. and exhibits machinery and technology related to agriculture. It is mainly for the small-scale farmers in the region.\n\nAwards are also given to the best terrace gardens in the city. With about 80 stalls, it has farming equipment, fertilisers, millets, and books on farming.", 
    "section": "national", 
    "title": "‘Farm mechanisation on the rise’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}