{
    "author": [], 
    "text": "Terming a plea moved by the Ministry of Railways as “near absurdity,” the Madras High Court has dismissed the petition seeking to modify a decade-old order passed by the court directing the Ministry to provide ticket fare concession to disabled persons and persons who escort them.\n\nOn September 16, 2006, the High Court passed an order directing the Ministry to install assistance booth in railway stations to help the disabled people who are travelling independently and to extend the concession to persons who escort them.\n\nThe order was passed on a PIL petition moved by Rajiv Rajan, founder of Forum for People with Cerebral Palsy (now called EKTHA) in 2005.\n\nAfter five years, in 2011, the Ministry moved a plea seeking to modify the 2006 order.\n\nThe Ministry submitted that providing concessions is a policy matter of the Ministry and in view of the financial implications, it would not be possible to increase the scope of concession.\n\nTaking serious view of the submission, the First Bench headed by Chief Justice S.K. Kaul said, “We are amazed at the lack of sensitivity and foresight of the Ministry in seeking such modification. In nutshell, what is sought to be suggested is that the concession is applicable only to a certain type of disabled persons who cannot travel alone.”\n\nWhat is sought to be canvassed is that if a physically challenged person is travelling on his own without an escort, the benefit of concession stands withdrawn, even though the person is covered under the provisions of the Act, the Bench added.\n\nNoting that this is bordering on absurdity, the Bench said, “We are unequivocally of the view that the application is misconceived, contrary to the intent and purpose of the said Act and a mindless exercise. We dismiss this application with cost of Rs. 10,000 payable to EKTHA in Kotturpuram, run by the petitioner within 15 days.”\n\nThe Bench then directed the State Commissioner for Persons with Disabilities to verify the position on the compliance of the order and file a report by April 27.", 
    "section": "national", 
    "title": "HC slams railways’ plea for modification of order on concession for the disabled", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}