{
    "author": [
        "Staff Reporter"
    ], 
    "text": "HC initiates suo motu proceedings, orders notice to State government\n\nA view of the Chembarambakkam lake, once known as Puliyur, which is a major water source for Chennai.— Photo: B. Jothi Ramalingam\n\nThe Madras High Court on Friday initiated suo motu proceedings on an allegation that illegal mining in a lake in Nemam village, Thiruvallur district was the primary cause for filling up Chembarambakkam reservoir and the subsequent deluge in Chennai in December 2015.\n\nOriginally, C.M. Durai Ananth, who runs a transport business, moved a Public Interest Litigation (PIL) petition alleging that illegal mining of over one lakh lorry loads of ‘savudu’ earth from the lake was the primary reason for the recent Chennai floods.\n\nAccording to him, the Nemam Lake which extends over 280 acres of land is under the control of the State Public Works Department. The State government through an order dated December 20, 2011 accorded sanction to create additional water storage in four tanks — Nemam, Porur, Cholavaram, Ayanambakkam — and Chembarambakkam at a cost of Rs. 79.50 crores.\n\nThe capacity of Nemam Lake was proposed to be increased from 257 to 577 million cubic feet by desilting 196 million cubic feet of savudu earth and by increasing the height by 124 million cubic feet.\n\nOn March 27, 2015 the government obtained clearance from the Environment Authority to remove 20,286 lorry loads of savudu earth from the lake within five months, without using machinery.\n\n“But even before obtaining clearance, authorities accorded sanction to a private construction company to remove 1.9 lakhs lorry loads of earth from the lake in clear violation of the clearance provided by the environment authority,” the petitioner alleged.\n\nThe contractor was also permitted use of heavy machineries to mine the earth, which had weakened the bunds of the lake, he added.\n\nHe alleged that owing to heavy rain in the area between November 23 and December 1, 2015, the lake breached resulting in heavy water flow to Chembarambakkam, compelling the authorities to open the shutters of the reservoir triggering the flood.\n\nPlea rejected\n\nThe petitioner sought the court to appoint a Commission of Enquiry to probe the issue. When the plea came up for hearing, the First Bench headed by Chief Justice S.K. Kaul said, “On perusal of the affidavit, we are not satisfied that the petitioner is bona fide. If we may say so, the petitioner appears to be only a name lender for the petition. He has collected the representation and responses of third parties, and then made a representation in order to create the grounds to file the petition.”\n\nHowever, noting that the court would like to look into the issue raised, the Bench converted the petition into suo motu proceedings and directed issuance of notice to State government.\n\nThe Bench then posted the PIL along with similar other petitions to be taken up on April 13.", 
    "section": "national", 
    "title": "Illegal mining cause of deluge in Chennai, says PIL petition", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}