{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Although the People’s Welfare Front (PWF) has renewed its invitation to DMDK leader Vijayakant to join the alliance, this should not be interpreted as a sign of desperation, contended MDMK leader Vaiko whose party is a constituent of the alternative front.\n\nAddressing journalists here on Friday, Mr Vaiko said the PWF has not fixed a deadline for Mr Vijayakant to take a decision. Justifying the repeated invitations to the actor-politician, the MDMK leader said there had been instances of parties entering into a coalition even after the beginning of the election nomination process. Therefore, given the election schedule this time, there is enough time on hand to forge an alliance.\n\nBut this did not mean that the Front was desperate for an alliance with the DMDK. It was the DMK that appeared desperate. Even after the DMDK leadership had called the DMK a fraudulent party ( thillu mullu katchi ), the DMK leadership did not react, which was very uncharacteristic.\n\nIt showed how bad the DMK was, Mr. Vaiko said and also criticised the AIADMK saying it had given the most corrupt rule the State had ever seen. The AIADMK had looted the people for five years and now the murmurs that the people were hearing were the fight for the booty.\n\nThe AIADMK leadership faced the disproportionate assets case and the DMK family was in no better shape as the 2G dagger dangled in front of them. Both were corrupt and that was the reason the people were looking for an alternative in the People’s Welfare Front.\n\nWith the passage of every day, the four-party coalition was gaining in strength, he claimed, adding that the support was from the youth, who were critical of the two big Dravidian parties on social media.\n\nThe coalition was confident of winning majority of the 234 seats, he added.\n\nMr. Vaiko cautioned the Central Government not to change the name of Neyveli Lignite Corporation or make any changes to the public sector undertaking. The Government should give up the exercise of asking the 13,500 employees to express their assent or dissent to the proposed change.\n\nMeets Kausalya\n\nAddressing reporters at the Coimbatore Medical College Hospital after talking to Kausalya, whose husband V. Shankar was murdered by casteist forces in Udumalpet, Mr. Vaiko said that he met the girl to console her and not to get political mileage. He had told her the story of Yusufzai Malala and had asked the girl to come back stronger.\n\nMr. Vaiko said the casteist forces that incited the murder should also be booked as this was the third such incident in the recent past in the State.\n\n‘The plight of the AIADMK leadership and the DMK family is similar’", 
    "section": "national", 
    "title": "Invite to DMDK stands, but we are not desperate: Vaiko", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}