{
    "author": [
        "R Sujatha"
    ], 
    "text": "The Syndicate of the University of Madras has replaced one of the three members on the Vice Chancellor convenor committee.\n\nThe committee that was constituted to function in the absence of the VC had three professors. One of them was K. Jothi Sivagnanam, head of the Department of Economics. At Friday’s Syndicate meeting, the members, through a motion, replaced him with S. Sriman Narayanan, head of the Department of Analytical Chemistry.\n\nWhile sources said the decision was taken following complaints against Prof. Jothi, Registrar P. Jawahar said the move was “more rectification of an error.” Mr. Jawahar said it was simply a question of the senior most member of the Syndicate being appointed to the committee.\n\n“Earlier, Prof. Thangam Menon was the senior most member in the Syndicate and after her, Prof. Sriman Narayanan. There was some confusion as he had retired in October 2015. But since the university rules allow a professor to continue till the end of the academic year, he automatically becomes eligible to be on the committee,” he said.\n\nWhen Prof. Jothi chaired the academic council meeting on February 27, it had raised eyebrows. The meeting is generally chaired either by the VC or in his/her absence the Higher Education Secretary.\n\nIf both officials are absent, the council opts for an election to elect a suitable candidate to chair the meeting. At Friday’s meeting, the members also raised the issue of moving a point of order on the position of Surendra Prasad, the full-time Ph D scholar and senate nominee of the VC search committee and a status report on the committee’s performance.\n\nThe registrar confirmed that the question was raised but said Higher Education Secretary Apoorva struck it down saying that since the committee was appointed by the Governor-Chancellor, only he could take up the matter.\n\nJothi Sivagnanam, against him there were complaints, makes way for Sriman Narayanan", 
    "section": "national", 
    "title": "Madras University convenor committee member replaced", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}