{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Dasavatara Tattuvam’ by M. Vijayaraman, Railway Colony, 7.30 p.m.\n\nPrasanna Venkatesa Perumal Temple: Discourse on “Moondru Moondrai Vazhkkai” by Koodal N. Raghavan, Tallakulam, 6.30 p.m.\n\nMuneeswarar Temple: Masi festival; talk by Rajamanickam, Munsif Court Road, Tirumangalam, 8 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Kanchipuranam’ by A. Arumugam, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Sundarar Tiruppattu’ by R. Umarani, Sakthi Velammal Nagar, S. S. Colony, 5 p.m.\n\nRamakrishna Mutt: Discourse on ‘Tirukkural’ by S. Kaliamoorthi, 5.45 p.m.; aarathi, New Natham Road, 6.30 p.m.\n\nSwami Tatwananda Ashram: Swami Samananda conducts Bhagavad Gita class, P and T Nagar, 6.45 p.m.\n\nOur Lady of Lourdes Church: Holy Week meditation, K. Pudur, 10 a.m. and 6 p.m.\n\nYoung Men Christian Association: Lenten special service; P. Leela Manohari Joseph, Headmistress, OCPM Girls Higher Secondary School, delivers message, Main Guard Square, 6 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGandhi Museum: Book review by S. Jayaraj, M. P. Gurusamy, secretary, presides, Library, 5.30 p.m.\n\nRagapriya: Vocal concert by Shruthi Shankar Kumar, Fortune Pandiyan Hotel, 6 p.m.\n\nTHE HINDU Young World: Thyrocare presents The Hindu Young World Painting Competition 2016; finals, 9.30 a.m.; B. T. Bangera, Managing Director, Hi-Tech Arai, distributes prizes, Justice V. R. Krishna Iyer Community Hall, Lake View Road, K. K. Nagar, 12.30 p.m.\n\nArt Karat: Rajputana jewellery expo, Urban Spice, 472 K. K. Nagar, 11 a.m.\n\nGENERAL\n\nMadura College: Graduation Day; K. Hari Thiagarajan, Executive Director, Thiagarajar Mills, addresses, Auditorium, 3.30 p.m.\n\nVivekananda College: Graduation Day; S. Manivannan, Deputy Drugs Controller, addresses; Swami Niyamananda, secretary, presides, Tiruvedakam West, 2.30 p.m.\n\nM. S. S. Wakf Board College: Seminar on “Protection of cultural monuments;” N. Sulaiman, former Regional Assistant Director of Art and Culture, addresses; S. Abdul Rahim, Principal, presides, K. K. Nagar, 11.30 a.m.\n\nNadar Mahajana Sangam Sermathai Vasan College for Women: A. Manickavel declares open new buildings; Tamizharuvi Manian addresses; G. Mariskumar presides, Avaniapuram, 10.31 a.m.\n\nK. L. N. College of Information Technology: 11{+t}{+h}Graduation Day; I. Sundar of Vikram Sarabhai Space Centre addresses, K. N. K. Karthik presides, Pottapalayam, 10.30 a.m.\n\nSACS MAVMM Engineering College: N. Baskaran, chairman, inaugurates research centre; G. Ganesan, correspondent, declares open 18{+t}{+h}annual sports meet, Alagarkoil, 9 a.m.\n\nVaigai College of Engineering: Workshop on “How to express yourself and impress employers;” S. Rajaram of Thiagarajar College of Engineering speaks, P. Sugumaran, Principal (in charge), presides, Therkkutheru, 9.30 a.m.\n\nSBOA Schools: 34{+t}{+h}Kindergarten graduation ceremony; K. Ravichandran, Special Officer, Madurai Kamaraj University, addresses; J. Joseph Stalin, correspondent, presides, Nagamalai West, 9.30 a.m.\n\nMotherland Nursery and Primary School: 8{+t}{+h}Annual Day; Dr. Dheep addresses, Nicholas Francis, Director, presides, Viswanathapuram, 5.30 p.m.\n\nInstitute of Chartered Accountants of India: L. Thirugnanasambandam, General Manager, Indian Overseas Bank, inaugurates bank audit seminar, Heritage Madurai, Kochadai, 9 a.m.\n\nSociety for Community Organisation Trust: G. M. Akbar Ali, former Judge, Madras High Court, releases book “Bonded labour system in Tamil Nadu from Sangam Era to Sumangali Thittam;” inaugurates seminar on “Women’s rights are human rights” and presents Lifetime Service Award to S. Gnanam and D. Janet Vasanthakumari; S. Selva Gomathi presides, Institute of Gandhian Studies Hall, Gandhi Museum, 9 a.m.\n\nVidiyal: Training in leadership qualities, 21 Kennet Nagar, Muthupatti, 10 a.m.\n\nAlcoholics Anonymous: Meeting; Quality Care Hospital, Ellis Nagar,; 14 Vaidyanatha Iyer Street, Shenoy Nagar, and RC School, Palanganatham, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}