{
    "author": [
        "T Madhavan"
    ], 
    "text": "20 acres of temple land may be obtained for the project\n\nA month ago, revenue officials completed the survey of the land near the Nandhivaram-Guduvanchery bus terminus —Photo: D. Gopalakrishnan\n\nUnable to acquire land for the construction of a terminus for South-bound buses, the Chennai Metropolitan Development Authority (CMDA) is now exploring the possibility of using a temple land measuring about 20 acres, along with 31 acres of adjoining government lands, for the purpose.\n\nA month ago, revenue officials completed the survey of the land near the Nandhivaram-Guduvanchery bus terminus. It is said that the CMDA is assessing the feasibility of using the land, which is presently under the control of Sri Nandheeswarar Temple, managed by Hindu Religious and Charitable Endowments, and also of using a few adjacent lands.\n\nSources said the decision follows opposition by agriculturists to the move to have the terminus built on 65.35 acres of land identified at Vandalur village.\n\n“A few surplus lands had been identified under the Tamil Nadu Land Reforms Act at Kilambakkam village abutting GST Road. This could also be utilised for the bus terminus,” said an official source.\n\nSources said this initiative of the CMDA must pass through clearances of a few departments, which is expected to take a few months.\n\nN. R. Narayanaswamy, a longtime resident of Nandhivaram-Guduvanchery, said that already the several acres of land belonging to Sri Nandheeswarar Temple had been usurped by land sharks. He said the temple lacked a ‘Kumbabhishekam’ for the past 15 years, though it had the resources to carry it out.\n\nWith the State Government initiating the bus terminus project, the temple would lose further revenue.\n\nThe lease amount/ sale proceeds should be utilised for the development of the temple, which attracts anything between 2,000 and 3,000 devotees during festival days like ‘Pradosham’,” Mr. Narayanaswamy said.", 
    "section": "national", 
    "title": "Mofussil bus terminus likely in Guduvanchery", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}