{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The district administration had on Friday organised a two-wheeler rally to create voter awareness.\n\nAccording to a release, Collector and District Election Officer Archana Patnaik flagged off in Race Course the rally that the administration had organised in association with Coimbatore Auto Sports Club and PSG College of Technology.\n\nTo ensure 100 per cent voter turn out in the district, the administration was engaged in various voter awareness drives.\n\nThe vehicle rally was one among those, the release said. The participants in the rally started off from Race Course, pass through Hope College, Lakshmi Mills Junction, Women’s Polytechnic College, Gandhipuram bus stand, North Coimbatore and returned to the Collectorate via Brookefileds Mall.\n\nCollector visits sensitive booths\n\nCollector and District Election Officer Archana Patnaik on Friday visited sensitive booths in Mettupalayam Assembly constituency. A release said that she went to Pilloor, Parali, Athikadavu and a few other pockets closer to forest.\n\nThe district administration had identified 31 of the 308 polling booths in the Assembly constituency as sensitive. The release added that in the 10 Assembly constituencies in the district, there were 273 sensitive booths. Superintendent of Police Ramya Bharathi accompanied the Collector.\n\nCash seizure\n\nElection officials in the Nilgiris district, seized Rs. 3.40 lakh from two persons in Chambala and Marappalam in Gudalur and Coonoor Assembly constituencies on Friday.\n\nThe Friday’s seizure takes the total cash seized thus far to Rs. 88.66 lakh in the district, says a release.\n\nLiquor bottles seized\n\nOfficials in Coimbatore on Friday seized 74 liquor bottles of 180 ml each from near a liquor outlet in Raghavendra Nagar in Kavundampalayam Assembly constituency. A release said that the Thudiyalur Police have registered a case in this regard as the sale happened much before the start of the outlet.", 
    "section": "national", 
    "title": "Motorcycle rally taken out to create voter awareness", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}