{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Consignments without validdocuments seized at check-posts\n\nNumerous vehicle checks and routine inspections continued to mark the Assembly elections preparatory work in the delta districts on Friday.\n\nDuring a vehicle check at Papanassam bazaar at around 4 a.m. on Friday, officials found a one-foot tall panchaloha idol of Lord Hanuman in a car bearing Karnataka registration.\n\nWhen the officials questioned the passengers, including Naveen Chander and Vishwanath, they said that they were taking the idol to a sthapathi in Swamimalai for adorning the deity with a Thiruvachi (arch).\n\nThe officials seized the idol as the passengers did not possess valid papers for backing their claims and they took it to the Papanasam Taluk Office.\n\nIn another vehicle check near Papanasam, officials inspecting two container lorries at Ukkadai between Ammapettai and Koilvenni found children's footwear estimated at Rs. 61 lakh.\n\nThe lorries had come from Uttar Pradesh and Haryana.\n\nFrom the truck that came from Uttar Pradesh, 17,852 pairs of slippers estimated to cost Rs. 34.81 lakh and from the one that came from Haryana 15,000 pairs of chappals worth Rs. 26.47 lakh were seized.\n\nThe consignment was meant for the Nagapattinam District Elementary Education Officer and the trucks were then taken to the Papanasam Taluk Office.\n\nIn a poll preparatory meet held at the Thanjavur Collectorate, District Election Officer and Collector N. Subbaiyan said that 92 polling booths across the district had been identified as sensitive and officials must take adequate precautions to ensure smooth polling exercise in all booths including the sensitive ones.\n\nFlying squads must exercise utmost vigil, especially in vehicle checks and inform the details of the interceptions to the headquarters immediately, Dr. Subbaiyan said.\n\nIn Tiruvarur, District Collector M. Mathivanan called upon ex-servicemen to join election-related duties. He said that desirous ex-servicemen could approach the office of the Assistant Director, Ex-Servicemen Welfare, for details.\n\nIn Nagapattinam, District Collector S. Palanisamy launched an election awareness rally at Thirupoondi in Kilvelur Assembly constituency under the aegis of Mahalir Thittam and Pudu Vaaazhvu Thittam.\n\nA cultural troupe performed street plays and folk dance to drive home the point of ensuring 100 per cent polling.", 
    "section": "national", 
    "title": "Officials step up vigil in delta districts", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}