{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Amidst reports that he was maintaining a low profile after having fallen out of favour with Chief Minister and AIADMK leader Jayalalithaa, Finance Minister and party treasurer O. Panneerselvam on Friday visited her Poes Garden residence.\n\nOpposition leaders, including DMK president M. Karunanidhi and MDMK leader Vaiko, had alleged that Mr. Panneerselvam, Electricity Minister Natham R. Viswanathan and Higher Education Minister P. Palaniappan, who were among the “trusted five” of Ms Jayalalithaa’s cabinet, were forced to remain out of public glare in recent times.\n\nWhile the AIADMK did not issue any statement on the issue, party sources confirmed that Mr. Panneerselvam had visited Ms. Jayalalithaa’s residence, but were not sure if he actually met her. Sources also claim that Mr. Panneerselvam continues to be a member of the high-level committee constituted to finalise the AIADMK’s election manifesto.\n\nEarlier in the day, DMK president M. Karunanidhi, citing media reports, said the three Ministers had been sidelined in the AIADMK. Referring to a series of changes in the AIADMK in Theni and Dindigul districts, Mr. Karunanidhi termed it as another drama. “How many times have Ministers been changed in the last five years? Ministers were changed because they did mistakes. But the same Ministers were then inducted again into the Cabinet. If so, what happened to the mistakes they committed,” he asked.\n\nSeat-sharing talks continue\n\nOn Friday evening, the AIADMK invited the Tamizhaga Vazhvurimai Katchi for seat-sharing talks. Sources said that leaders of both parties met for over an hour at the ruling party’s headquarters at Royapettah when Panruti T. Velmurugan handed over a list of constituencies, including in Puducherry, where his party had support.\n\nFrom the AIADMK, Ministers Vaithilingam, Edappadi K. Palaniswami, S.P. Velumani and P. Thangamani took part in the talks and on the other side Mr. Velmurugan was accompanied by former MLAs Y. Cauvery, M.P. Kamaraj and M.S.Shanmugam.\n\nHowever, it is not clear if he was able to meet Jayalalithaa", 
    "section": "national", 
    "title": "Panneerselvam visits Poes Garden", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}