{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Villagers say the station was moved to another village after the last Assembly poll\n\nPeople of Landai panchayat in Thiruvadanai Assembly constituency staged a protest on Friday, demanding shifting of one of the two polling stations in nearby Karungulam to their village and threatening to boycott the May 16 Assembly elections if their demand was not conceded.\n\nThe Dalits, who staged the protest in Landai near here, displayed copies of the electoral roll to claim that they had a polling station in their village in the 2011 Assembly elections. It was shifted to Karungulam when subsequent elections to the local bodies were held.\n\nSince they were forced to travel more than two and a half km to cast their votes in Karungulam in the 2014 Lok Sabha elections, they had been demanding that one of the two polling stations must be shifted to their village, but officials failed to look into their demand, village head M. Thangavel said.\n\nCommunal implications\n\nOfficial sources said that the issue had communal implications as more than 600 voters in Achankudi village, coming under Landai panchayat, preferred the polling station in L. Karungulam (316) and were against shifting it to Landai, though both were Dalit villages.\n\nThe 126 voters in Landai and 843 voters in L. Karungulam were allotted polling station in L. Karungulam (316), while 123 voters of Kannanai, 328 voters of Periya Thamaraikudi and 604 voters of Achankudi were allotted the polling station in Karungulam (317).\n\nAs shifting of the polling station at this stage was not possible, the election authorities have decided to concede to the demand of a section of voters to cast their votes at the polling station of their choice between the two polling stations, the sources said.\n\nAccordingly, the 126 voters in Landai village would be allowed to exercise their franchise in Karungulam polling station (317) and the 604 voters in Achankudi village in L. Karungulam polling station (316), the sources said. Booth-Level Officers had distributed Form 8A to the voters of the two villages asking them to return the filled-in forms by Saturday, the sources added.", 
    "section": "national", 
    "title": "Plea to shift polling station", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}