{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Residents of Peelamedu get water once in 13 days\n\nFour days ago, Peelamedu Chinnasamy Avenue resident P.V.T. Subramanian saw water flowing into the sump in his house. The supply was after 13 days.\n\nThe Pilloor water that flowed in brought relief and also worries.\n\nThe worries were about the quantity of water that the Coimbatore Corporation had released and the next supply, for the residents of the area and other localities in Peelamedu have been having erratic supply for long, he said.\n\nIt had been so for around a year now, added another resident.\n\nThe residents there store water in sump and then take it to the overhead tank. The sumps were built to store four or five days’ water because the Corporation supply was good until the recent past and most houses did not have enough space to build bigger sumps, said N. Rangasamy, a resident of Giri Amman Kovil Street.\n\nGiven the erratic supply and the size of the sumps at houses, the residents were not able to store water for long.\n\nIn neighbouring Ellai Thottam too the water shortage is acute.\n\nThe residents said they were complaining for over a year now but nothing much happened.\n\nThe issue was raised in the Corporation Council meeting, but it was of no use , lamented a few AIADMK councillors, who said that they have also spoken to water supply managers.\n\nThey alleged that the water meant for the residents in East Zone was being diverted to other wards under political influence.\n\nIn South Zone, comprising Kurichi and Kuniamuthur, there had been a notable improvement in water supply. The Chairman, South Zone, M. Perumal Samy, said that with the supply of Pilloor and Siruvani water, the residents in Kuniamuthur got water once in six days and those in Kurichi once in eight days.\n\nLeaky pipeline\n\nCorporation water supply managers said that frequent leaks due to damages to the pipeline at the bridge construction site in Peelamedu and the power fluctuations in the pumping station at Velliangadu were to be blamed for the erratic supply.\n\nAdmitting that there was not enough pressure in the pipeline, the water supply managers also said that the lack of pressure was the reason for not putting the Peelamedu water tank to use.", 
    "section": "national", 
    "title": "Poor water supply troubles residents", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}