{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Ahead of the Assembly elections, the Postal Department is planning to contribute to creating awareness among citizens about the necessity of exercising their franchise. And, the methods planned promise to be unobtrusive, yet effective.\n\nOn an average, post offices in Chennai and its suburbs receive nearly 5.40 lakh letters, including registered posts and money orders to be delivered every day.\n\nThe postal department plans to print messages about the significance of voting right along with franking stamps on mails.\n\nOfficials of the postal department said this campaign, inspired by a similar initiative by the Delhi postal circle, would be started soon.\n\nThe department has also made arrangements for collection and delivery of special mail bags that carry confidential communication between Election Commission of India, New Delhi and chief electoral officers, Tamil Nadu and Puducherry.\n\n“This initiative, which was started on March 11, will continue till May 21 for speedy delivery. We have nominated nodal officers and coordinating officers to monitor the receipt and despatch of the special mail bags,” said an official.\n\nIndia Posts is also gearing up to help voters who will not be able to exercise their rights on polling day.\n\nMervin Alexander, postmaster general (Chennai city region), recalled that post offices delivered 968 ballot papers to returning officers in Chennai city region on May 16, 2014 during the Lok Sabha election.\n\nDuring the previous election, Chennai received 2,000 postal ballots and awareness must be created about this option of voting among special voters, he said.\n\nIn a bid to tap revenue, post offices will also allow candidates and political parties to make use of ordinary mail, direct posts and book posts for their election campaign.\n\nOfficials said direct posts, which is a mail service for unaddressed articles, has been used more to distribute campaign materials.\n\nDirect posts are delivered based on the specifications about the number of mails and areas to be distributed.\n\n“We also plan to allow candidates to mail letters with a personalised My Stamp as part of their campaign to reach out to voters,” Mr. Alexander added.", 
    "section": "national", 
    "title": "Posting messages meant for voters", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}