{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The newly laid AstroTurf hockey stadium at Sethupathy Seethakathi Sports Stadium here would be developed to international standards after creating floodlight facility, A. Chelladurai Abdullah, secretary, Ramanathapuram District Hockey Association, said on Friday evening.\n\nTalking to reporters here, Mr. Abdullah, who is also the president of Hockey Unit of Tamil Nadu, said that the district association was looking for some sponsors to create the facility at an estimated cost of Rs. 1 crore.\n\n“We are planning to install floodlights this year and make the ground fully fit for hosting international matches,” he said, adding the association also proposed to build two more galleries on the eastern side of the court to accommodate 1,000 more spectators.\n\nAs more rooms would come under the new galleries, the stadium would have enough facilities to accommodate players, coaches, umpires and selectors whenever State and national-level tournaments were conducted, he said.\n\nAfter Chief Minister Jayalalithaa inaugurated the stadium through videoconferencing on February 27, Tamil Nadu Senior Men Inter-district Tournament was being held in the stadium from Sunday, and all the about 560 players, along with coaches, umpires and selectors were accommodated in the stadium itself, he said.\n\n“This is one of the most compact stadiums having all necessary facilities for the players,” former Olympian V.J. Phillip, one of the selectors, who was present in the press conference, said.\n\nMr. Chelladurai said that after the end of the ongoing tournament, Tamil Nadu team would be selected to participate in All-India Senior Men Hockey Tournament to be played in Uttar Pradesh next month.\n\nSix-day camp\n\nA total of 50 players would be shortlisted and the final 24 would be selected after a six-day camp here, he added.\n\nThe final 24 would attend a camp in Chennai before leaving for Uttar Pradesh on April 7, he added.\n\nAssociation proposes to build two more galleries on the eastern side", 
    "section": "national", 
    "title": "Ramanathapuram hockey stadium to get floodlights", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}