{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Cite the interest of 25,000 teachers and 5 lakh students\n\nRepresentatives of 746 schools that are in danger of losing recognition on May 31 for failing to meet certain stipulated norms have appealed to the government that schools established before 2004 should be provided recognition in the interest of 25,000 teachers and five lakh students.\n\nThe representatives of the schools which had not complied with the recommendations of the S.V. Chittibabu Commission met the media on Friday and said the schools had to reduce their intake as they could not comply with the norms.\n\nFollowing the commission’s recommendations, the government issued an order that schools should comply with the norms stipulated by the commission within five years. One of the norms is that it is mandatory for schools in corporation limits to have six grounds; those in district headquarters and municipality to have eight and 10 grounds respectively.\n\n“In cities it is impossible to find land to the extent stipulated by the commission. Those who could find or rent space near the existing school have split the institution’s strength into two and are running the schools from these places,” said S.K. Venkattassala Pandian, general secretary of the Association of Matriculation Higher Secondary Schools and their managements in Tamil Nadu and Pondicherry. The association also wants the government to implement a uniform syllabus across the country as the Supreme Court had rejected their plea that the uniform syllabus system, which is now in vogue in the State, was below par.\n\nThe members said students under the CBSE perform better than others and hence a uniform syllabus should be adopted. Mr. Pandian also said the association wanted the students from other States to be given the option of not studying Tamil. “We agree that all students whose native language is Tamil should learn the language. But the same should not be forced on children who come from outside States.” According to school education officials, however, as many as 8,400 students had been exempted from writing the Tamil language exam after they approached the court.\n\nOn whether there would be exemptions for those who join schools after middle school, an official said such decisions would have to be made after a new government is formed.\n\nSay those\n\nestablished\n\nbefore 2004\n\nshould be provided recognition", 
    "section": "national", 
    "title": "Schools at risk of losing recognition seek leniency", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}