{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The State Government can neither impose a blanket ban on appointment of teaching and non-teaching staff in government aided private schools nor refuse grant-in-aid for payment of salaries to those staff since the beneficiaries of those schools happened to be the “downtrodden and underdogs,” the Madras High Court Bench here has held.\n\nIn a judgement reserved here and delivered in the Principal Seat of the High Court in Chennai a day before his retirement on Wednesday, Justice D. Hariparanthaman allowed a batch of 186 writ petitions challenging two Government Orders passed in 2007 and 2010 directing aided schools to fill up vacancies certain posts of non-teaching staff through outsourcing.\n\nQuashing both the Government Orders, the judge held that the direction to outsource the posts of Gardener, Watchman, Sweeper and so on and bear the costs through school funds was in violation of Section 32 of Tamil Nadu Recognised Private Schools (Regulation) Act, 1973 which prohibits aided schools from collecting fees other than that prescribed by the government.\n\nFurther, pointing out that Rule 15(3) of the statutory rules framed under the Act states that “in a regular vacancy, a fully qualified person shall be appointed only on a regular basis,” the judge said that in such circumstances, “it is illegal” on the part of the government to direct aided private schools to appoint non-teaching staff, even in sanctioned posts, through outsourcing. He also said that the State could not cite financial constraints for issuing such a direction to aided schools after having taken a policy decision to desist from granting aid to any private school established after 1991-92 which had resulted in “commercialisation of education and a mushroom growth of self financing institutions at the school level also in Tamil Nadu.”\n\nObserving that a conjoint reading of the Constitutional provisions would make it clear that free and compulsory education was a fundamental right not only up to 14 years of age but until a student completes Plus Two, the judge said the State cannot escape from the liability of granting aid by stating that it was liable to pay the salaries of staff only up to high school or less.", 
    "section": "national", 
    "title": "State cannot deny grant to aided schools: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}