{
    "author": [
        "R Rajaram"
    ], 
    "text": "Kumbakonam ranked no. 5, Tiruchi 12 and Thanjavur 19\n\nTiruchi is one of the top 20 ‘A’ category railway stations in the country adjudged as cleanest station as per a Preliminary Report on Assessment of Cleanliness Standards at Major Railway Stations.\n\nKumbakonam and Thanjavur stations too figure in the list of cleanest stations under the ‘A’ category stations, according to the report that was released by Railway Minister Suresh Prabhu.\n\nThe preliminary report was compiled based on passenger feedback on the cleanliness of stations and carrying out an analysis. The Ministry of Railways commissioned a passenger feedback survey on cleanliness at major railway stations as part of a series of measures to improve cleanliness on stations as announced in the Railway Budget 2015-16.\n\nOne such measure was ranking of ‘A-1’ and ‘A’ category stations based on third party audit and feedback from passengers.\n\nThe Indian Railway Catering and Tourism Corporation (IRCTC) was entrusted the task of carrying out the survey.\n\nThe IRCTC in turn engaged TNS India Private Limited for the work.\n\nA total number of 407 stations —74 under “A1” category and 332 “A” category stations — were taken up for the survey to ascertain the cleanliness of stations by obtaining feedback from passengers.\n\nFeedback from non-railway survey providers at stations and railway officials who were part of the Service Improvement Group at stations were captured in the survey.\n\nThe survey was conducted through interviews by circulating questionnaires on cleanliness indicators. This was done face-to-face by survey teams by visiting each of the 407 stations across 16 zonal railways.\n\nEvery passenger was asked to rate the cleanliness of stations objectively on 40 different cleanliness parameters.\n\nBased on passenger feedback and analysis thereof, the 407 stations were given rankings in the preliminary report submitted by the survey agency through IRCTC to the Ministry of Railways for scrutiny and action, according to a Southern Railway release.\n\nAccording to the report, Kumbakonam comes fifth in the cleanliness ranking order among the top 20 ‘A’ category stations in the country.\n\nTiruchi and Thanjavur are ranked 12{+t}{+h}and 19{+t}{+h}respectively.\n\nKovilpatti, Virudhunagar, Erode, Salem, and Mettupalayam are the other stations in the Southern Railway zone to have been adjudged cleanest among the top 20 stations falling under the ‘A’ category.", 
    "section": "national", 
    "title": "Three stations in Tiruchi division among top 20 clean stations", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}