{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Sri Ranganathaswamy Temple, Srirangam: Panguni car festival, Namperumal purappadu in Sesha vahanam from vahana mandapam, 5.15 a.m.; reaching vahana mandapam, 6.30 a.m.; purappadu, 8.30 p.m.; reaching Sesharayar mandapam, 9 a.m.; purappadu in Karpaga Virutcham, 6.30 p.m.; reaching vahana mandapam, 8 p.m.; purappadu, 8.30 p.m.; reaching kannadi arai, 9 p.m.\n\nArulmigu Thayumanaswamy Temple, Rockfort: Theppam festival, Yanai-Pallakk vahanams, 7 p.m.\n\nSri Srinivasa Perumal Temple, Indiranagar: Sri Alamermelmangai Thayar Brahmotsavam, homam, thirumanjanam, 8 a.m.; serthi sevai in Sesha vaganam, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Parayana goshti procession, 5.30 a.m.; Srinivasa Perumal Sannidhi, Amma Mandapam Road, Srirangam, 6.30 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 9/7, VII Cross, Sundar Nagar, 6 p.m.\n\nCULTURE\n\nRasika Ranjana Sabha: Centenary programmes, vocal concert by Kavitha-R.Srilatha & party, Mahatma Gandhi Centenary Vidyalaya, Thennur, 6.30 p.m.\n\nRasavelar Shenbaga Tamil Arangu: G. Veeramani, head, Department of Tamil, Urumu Dhanalakshmi College, speaks on “Science in folk literature”, 102, Gandhi Salai, Srirangam, 6 p.m.\n\nGENERAL\n\nBharathidasan Institute of Technology: Graduation Day, U. Kamachi Mudali, Associate Director, Indira Gandhi Centre for Atomic Research, Kalpakkam, delivers graduation day address, M. Rajaram, Vice-Chancellor, Anna University, Chennai, presides, 5 p.m.\n\nBharathidasan University Department of Educational Technology: Teacher education meet, N. Seshadri, Director, Distance Education, Sastra University, inaugurates, Khajamalai campus, 10 a.m.; valedictory address by C. Thiruchelvam, Registrar, BARD, 4.30 p.m.; School of Physics: Valediction of national conference on Nanophotonics, S.Moorthy, Director, Centre for Nanoscience and Technology, distributes prizes, university campus, 4.30 p.m.\n\nHeavy Alloy Penetrator Project: Ordnance Factories Day, photo exhibition, HAPP Township, 6 p.m.; cultural programme, 7 p.m.\n\nSaranathan College of Engineering: Graduation Day, Thothathri Visvanathan, Vice president and Head, Chennai Development Centre, Infosys Limited, delivers graduation day address, 5.30 p.m.; Department of Instrumentation and Control Engineering: M.Shanthakumar, engineer, Captronic Systems, speaks on Mapping ladders and lattices, 11 a.m.\n\nBishop Heber College: College Day, Rev. S. Xavier Alphonse, senior advisor to ICRDCE and Province Coordinator for higher education Tamil Nadu Jesuits, chief guest, 5 p.m.\n\nDravidar Kazhagam: State conference, Siruganur, 10.30 a.m.\n\nShri Angalamman College of Engineering and Technology: Graduation Day, G. Bhaskaran, Vice Chancellor, Tamil University, delivers the graduation day address, 10.30 a.m.\n\nNehru Memorial College, Puthanampatti: Faculty development programme on Revisiting examination system in current scenario, R.Thirumurugan, Controller of Exams (in-charge), Bharathidasan University, inaugurates, 10 a.m.\n\nPeriyar E.V.R.College: History Association meet and inauguration of Periyar Tholliyal Maiyam, A.Periyasamy, Curator, Government Museum, Madurai, chief guest, 11 a.m.\n\nRotary International District 3000: Charter installation of International fellowship of cricket loving Rotarians chapter of RID 3000, KR. Parthasarathy, chair, IFCR India, inducts office bearers, Ravi Raman, Chair, IFCR World, chief guest, Hotel Sangam, 7 p.m.\n\nTamil Literary Research Academy: Meeting, T. Nedunchezhian, assistant professor, St. Joseph’s College, speaks, Sruthi Mahal, SRC Road, 6 p.m.\n\nM.A.M. Group of Institutions: Annual day, J. Sujith Kumar, Business Leader, Infosys Ltd., speaks, 5.30 p.m.\n\nKongunadu College of Engineering and Technology: National conference on convergence of computing big data analytics and networking technologies, 9.30 a.m.\n\nOxford Engineering College: Inauguration of Kanitamil Peravai, M. Tamilparithi, Director, Tamil Virtual Academy, chief guest, 9.45 a.m.\n\nHallmark Business School: Lecture on “ERP implementation at BHEL” by M. Shanmugam, former DGM, BHEL, Tiruchi, 2 p.m.\n\nDepressed People’s Welfare Association: Dedication of drinking water wells, hand pumps, motor pumps and mini water tanks, SPG Elementary School, Irungalur, 9 a.m.; Pullampadi, 10 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}