{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Leader of the Opposition V. Vaithilingam. (Right) Vehicles of Ministers, MLAs, Councillors and officials parked inside the Puducherry Legislative Assembly.- Photo: S.S. Kumar\n\n‘’There is a convention allowing parties to occupy premises till formation of new govt.’\n\nLeader of Opposition V. Vaithilingam has registered strong protest over the Election authority’s directive to all political parties to vacate Legislature party offices in the Assembly complex as the model of conduct has come into force.\n\nIn a communication to Assembly Secretary S. Mohandas, S.D. Sundaresan, Nodal Officer in the office of District Election Officer, Puducherry stated that he was directed to inform that with announcement of elections to Puducherry Legislative Assembly by Election Commission of India (ECI), the model code of conduct is in force with effect from March 4 in the entire Union Territory.\n\nHe further added that the ECI has instructed that the government premises should not be used to carry out political activities.\n\n“As there is every possibility of using the MLA offices under purview of Legislative Assembly Secretariat for political activities, suitable instructions shall be issued to vacate the premises immediately,” the officer said. He further asked the Assembly Secretary to furnish a compliance report immediately.\n\nLetters sent\n\nFollowing which, the Assembly Secretary Mr. Mohandass last Wednesday sent letters to Legislature Party leaders including Leader of Opposition and Congress Legislature Party Leader V.Vaithilingam and others asking them to hand over the Legislature Party Offices which have been functioning inside the Assembly complex.\n\nIn an interdepartmental note, the Leader of Opposition said the Legislature Party Offices in the Assembly premises provided to the political parties are allowed to continue till the formation of new Legislative Assembly so far. This convention is being followed since 1964. Further, the present 13{+t}{+h}Legislative Assembly constituted in 2011 has not dissolved and will continue till the formation of new Legislative Assembly in May 2016.”\n\nMr. Vaithilingam said the District Election Officer should allow the Legislature party offices in the Legislative Assembly premises allotted to the political parties to continue till the formation of new Legislative Assembly.\n\nOffice premises surrendered\n\nMeanwhile, AIADMK, DMK, BJP and lone independent MLA surrendered the office premises to the Assembly secretariat.\n\nMLAs except ministers handed over their official vehicles to the department concerned.", 
    "section": "national", 
    "title": "Vaithilingam protests directive to parties to vacate Assembly complex", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}