{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The aim is to ensure 100 per cent voter turnout, says Collector\n\nVoter awareness programmes being conducted across the district to increase the voter turnout to the maximum possible extent on May 16 Assembly elections have gained momentum.\n\nIn the awareness programme organised at St. Antony’s Primary School at Pettai and Corporation Middle School, Rahmanpettai, Collector M. Karunakaran administered voter awareness pledge to teachers and students. He distributed pamphlets carrying the pledge to the students and asked them to get signature of their parents on it. “It is an attempt to encourage their parents to cast their votes without fail,” Dr. Karunakaran said.\n\nAfter participating in an human chain to create voter awareness at Pettai, the Collector inaugurated an exercise to paste stickers on cooking gas cylinders at a gas agency, appealing to the electorate to exercise their franchise without fail on May 16.\n\n“Our aim is to ensure 100 per cent voter turnout by creating awareness among the public,” Dr. Karunakaran said.\n\nDistrict Revenue Officer M.G. Kulandaivel, Revenue Divisional Officer P. Fermi Vidya and others participated.\n\nWhatsApp number\n\nThe public have been asked to send videos and photographs on poll code violations in the district to a designated WhatsApp number.\n\nIn a statement issued here on Friday, the Collector said that the round-the-clock election control room established on the Collectorate premises on March 4 was receiving complaints on poll code violations.\n\nThe public can contact 0462 2501172, 74, 75, 76 and 79 or toll-free number 1800 425 7041 to register complaints pertaining to the forthcoming Assembly elections.\n\nThey can also send photos and videos on election code violations to WhatsApp number 83000 25810, Dr. Karunakaran said.", 
    "section": "national", 
    "title": "Voter awareness programmes held", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}