{
    "author": [
        "S Prasad"
    ], 
    "text": "The Voter Verifiable Paper Audit Trail (VVPAT) system would be introduced on a pilot basis in 68 polling stations in three Assembly constituencies in the Union Territory for the Assembly elections on May 16, Chief Electoral Officer V. Candavelou said on Friday.\n\nTalking to reporters after participating in a training programme for sector officers here, he said that the VVPAT system would be introduced in 68 polling stations which had less than 1,350 voters in Uppalam, Orleanpet assembly constituencies in Puducherry and in Karaikal South.\n\nVVPAT system enables the voter to check whether the vote was cast in favour of the candidate of his or her choice through a screen where it would be displayed for seven seconds.\n\nThe slip can be viewed by the voter and however cannot be taken away. It will be automatically sent to the collection compartment of the machine.\n\nMr. Candavelou said that election related complaints received at the control room and on Whatsapp were forwarded to the respective officials and action taken.\n\nThe first phase of randomisation of Electronic Voting Machines (EVMs) to the respective Assembly constituencies has been completed.\n\nVoters in the union territory have been asked to verify whether their names are in the voters list. If they are unable to locate it till April 29, they have been asked to submit applications to get them added.\n\nEarlier, addressing a meeting of sector officers, Muralidaran, Officer on Special Duty (Training) said that they should tour their areas of jurisdiction before the polls and prepare route maps. The sector officers should ensure availability of drinking water and other basic facilities in the booths. The officer said, “It is the responsibility of sector officer to keep records such as voters list, case history and EVMs properly. The officials should enlighten voters about functioning of the electronic voting machines and location of polling booths,”\n\nThey should also help the central poll observers on duty, Mr. Muralidaran added. District Election Officer-cum- District Collector S. Sundaravadivelu participated.", 
    "section": "national", 
    "title": "VVPAT system to be introduced on a pilot basis", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}