{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "ALMOST OVER:Work on the new building for the upgraded Divisional Railway Hospital in Erode is nearing completion.—PHOTO: M. GOVARTHAN\n\nConstruction of upgraded Divisional Railway Hospital in Erode has almost been completed.\n\nThe building at Railway Colony for which foundation was laid during December 2013 has been constructed at a cost of Rs. 5.5 crore. Finishing touches are being given, and once the work is over, equipment worth Rs. 45 lakh will be installed, official sources said.\n\nThough Salem is the headquarters, the Divisional Hospital was sanctioned for Erode in consideration of the large number of employees. There are about 1,400 railway employees in the district, sources said.\n\nA modernised hospital has been a long-felt need of the railway employees since, in the absence of quality medical care, they were constrained to spend heavily on treatment in private hospitals.\n\nThe upgraded hospital will have multi-speciality wings, hi-tech intensive care unit, labour ward, surgical ward, operation theatre, paediatric ward, and additional laboratories. Advanced equipment including multipara monitor, defibrillator, pulse oscillometer, fetal monitor, and ENT and anaesthetic equipment.\n\nThe hospital will be developed as a 60-bed facility, to cater to the advanced medical requirements of the thousands of railway employees and their family members in Erode, Salem and Coimbatore districts, sources added.\n\nHealth camp\n\nEarlier this week, the Salem Division conducted a health-care camp in Erode for 125 employees who will be retiring between April and September.\n\nThe Salem Division ranks next only to Palakkad Division in Southern Railway in conducting such an event for retiring employees.\n\nPresiding over the function, Divisional Railway Manager of Salem Division Shubhranshu spoke of the importance of physical and mental health of the employees in the second innings of their life post-retirement.\n\nThe heath care camp was conducted by the Railway's Medical Department in association with SPT Hospital, Coimbatore, and Vasan Eye Care Centre, Erode.\n\nBlood sugar (including HbA1C test), kidney functioning test, urine test and hypertension tests were conducted for the retiring employees and suitable medical advice was provided.\n\nFinancial experts from State Bank of India and Indian Postal Department also participated in the programme to provide guidance for handling their retirement benefits safely and prudently.", 
    "section": "national", 
    "title": "Work on upgraded railway hospital almost complete", 
    "subsection": "tamilnadu", 
    "date": "2016-03-19"
}