{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Booths with 1,200 voters in rural areas, 1,400 in urban areas to be bifurcated\n\nThe Election Commission of India has granted permission to establish 17 auxiliary polling stations, shift 20 polling stations and change the names of 97 polling stations in the district, according to Collector T.N. Hariharan.\n\nAddressing an all-party meeting here on Wednesday, he said that proposals had already been sent to the ECI seeking bifurcation of polling stations that had more than 1,200 voters in rural areas and 1,400 voters in urban areas in seven Assembly constituencies in the district for the convenience of voters.\n\nThe ECI had granted permission to effect the necessary modifications, he added.\n\nWith formation of auxiliary polling stations, the total number of polling stations in the district would rise to 2,039. Wheelchairs had been provided to 473 polling stations to enable differently abled persons to cast their votes without problems.\n\nNon-governmental organisations would be roped in to assist differently abled persons to cast their votes in these polling stations. All-woman polling stations were set up in all the Assembly constituencies.\n\nAll officials, including police officials, would be women in these stations, the Collector noted. Mr. Hariharan advised the political parties to depute women booth agents in all-woman polling stations. All efforts were on to achieve cent per cent polling in this election, he added.\n\nPalani\n\nCapitalising on the heavy crowd in Palani in view of Panguni Uthiram on Wednesday, the district election officials undertook an awareness campaign on voting and democratic rights of voters along the Giri veedhis near Sri Padha Vinayagar Temple.\n\nA mega electronic signboard was also commissioned near the temple and video clippings on voting rights and importance of democratic rights of the people were screened in the evening.\n\nInaugurating the awareness campaign and the mega screen, Mr. Hariharan said that video shows would be displayed through the electronic signboard.\n\nPilgrims, not only from Tamil Nadu but also from Kerala, would be enlightened on the importance of voting, he added. Later, he distributed pamphlets to the pilgrims in Sannadhi veedhis and Giri veedhis. Village health nurses were also roped in to intensify the campaign in the temple town.\n\nTheni\n\nAn awareness rally was taken out by students in Periyakulam stressing the importance of voting and the democratic right of voters.", 
    "section": "national", 
    "title": "17 auxiliary polling stations for Dindigul district", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}