{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Seeking action against a representative of a Caste Hindu community association who allegedly spoke ill about Dalits in a discriminatory manner, members of Social Justice Party (SJP) petitioned the city police commissioner, on Wednesday, seeking arrest of the leader.\n\nParty president A. Nagarajan said that the audio was that of Mukkulathor Pathukappu Peravai president M.R. Senguttuvan Vandayar.\n\n“In a five-and-a-half minute audio, he asked Caste Hindus to sideline Dalits socio-economically and politically,” he said and added that the audio is spreading viral in the social media (whatsapp).\n\nParty representatives claimed that he has also asked Caste Hindus not to employ Dalits, not to buy from shops of Dalits, get Dalit government staff and officials transferred and to extend support only to political parties that did not seek votes from Dalits.\n\nUrging the police to register a case against the Caste Hindu leader under Scheduled Caste and Scheduled Tribe Prevention of Atrocities Act and his arrest, they have also asked the police to initiate stringent action against those humiliating and threatening Dalits and spreading messages in support of honour killings in the social media.\n\nIn the absence of the police commissioner and deputy commissioner, the petition was received by the inspector of Race Course Police Station. Along with the petition the party also handed over a softcopy of the audio that is circulated in the social media.\n\nDemonstration\n\nEarlier in the day, the party staged a demonstration near the South Taluk Office here seeking arrest of the Caste Hindu suspects responsible for the suspicious death of a Dalit man Chinnasamy (49) in Erode last Saturday. While the police maintained that he accidentally fell into the well and died, relatives and activists suspected it to be a murder. On Wednesday, members also petitioned the IG, West Zone, in this connection.", 
    "section": "national", 
    "title": "Action sought against Caste Hindu outfit leader", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}