{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Sitting AINRC MLA P. Angalane joined the Congress party in the presence of senior Congress leaders on Wednesday.\n\nThe three-time MLA recently tendered a letter quitting the primary membership of AINRC, alleging that the party president and Chief Minister N.Rangasamy deliberately ignored his constituency. He also had indicated that he would resign the post of MLA soon.\n\nMr. Angalane represents the Thirubuvanai constituency in the Legislative Assembly and was secretary of the AINRC. He was also chairman of Pondicherry Industrial Promotion Development and Investment Corporation Limited (PIPDIC).\n\nMr. Angalane who began his political career in Congress some years ago has returned to it.\n\nSpeaking at the function in Madhagadipet, Mr. Angalane charged, “The AINRC ministers never accorded due attention to the grievances of people of Tirubhuvanai constituency. Those around the Chief Minister are not righteous. But, when I complained of this to the Chief Minister, I was only subjected to ridicule.”\n\nClaiming that he garnered more votes for AINRC during last Assembly and Parliamentary polls, he alleged that the AINRC Government failed to fulfill any of the promises made in the run-up to the polls and people of the constituency and he were disappointed. Hence he asked the voters to teach fitting lesson to the ruling AINRC in the forthcoming elections.\n\nExpressing happiness on Mr. Angalane joining the Congress, senior Congress leader and former Union Minister of State V. Narayanasamy said the AINRC has been rattled as a section of AINRC MLAs have raised the banner of revolt. The Congress- DMK alliance will capture the power in the Union Territory, he claimed. Pradesh Congress Committee president A.Namassivayam, Leader of Opposition V. Vaithilingam and MLA K.Lakhsminarayanan spoke on the occasion.\n\nMeanwhile, AINRC sources said Mr. Angalane’s resignation letter giving up the primary membership was forwarded to appropriate forum for further action. He is yet to resign the post of MLA.\n\nThe AINRC will decide on whether to move an anti-defection plaint against Mr. Angalane in a day or two, they added.", 
    "section": "national", 
    "title": "Angalane joins Congress; AINRC to decide on action in couple of days", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}