{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "DMDK to share seats with TMC, PT that are reportedly in talks\n\nDMDK functionaries celebrating after the party formed an alliance with the PWF, in Chennai on Wednesday. —Photo: M. Prabhu\n\nBehind the happy faces of the People’s Welfare Front (PWF) leaders on Wednesday was hidden the strain of brutal negotiations that took place over the last four weeks, culminating in heavy compromises that paved the way for a pact with the DMDK.\n\nSources in the PWF said the group had to climb down on two important positions it had taken over the last several months: Not declaring a chief ministerial candidate and not compromising on the PWF label.\n\nWhile the first commitment was bulldozed the moment they accepted DMDK president Vijayakant as the CM prospect, the second was partially conceded when the DMDK was allowed to remain outside the PWF.\n\nA top PWF source said in return, two promises were given by the DMDK. “They said the Tamil Maanila Congress and Puthia Tamizhagam were in talks with them. If the two parties decide to join us, the DMDK will try to accommodate them in the 124 seats it has. We thought this was a workable equation,” the leader said.\n\nMr. Vijayakant’s wife Premalatha and brother-in-law L.K. Sudheesh led the talks for the DMDK.\n\nOn the PWF side, it was MDMK general secretary Vaiko’s deft manoeuvring and persuasion that made the pact possible.\n\n“The DMDK demanded much more. As the party with the CM candidate, they wanted to contest enough seats to help notch up a majority. But after several rounds of talks, they agreed to bring the figure down. The numbers were finalised on Monday evening,” a Left leader said. But what took some by surprise was Mr. Vaiko christening the new formation with the DMDK as ‘Captain Vijayakant Front’.\n\nSources said this was discussed later in the day and a change could be on cards.", 
    "section": "national", 
    "title": "Big compromises paved way for the big alliance", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}