{
    "author": [
        "T K Rohit"
    ], 
    "text": "With the business of cable television network and politics intertwined in Tamil Nadu, individual cable TV operators, are keenly watching the trend this Assembly elections. Ever since 1995 when people associated with the AIADMK set up a Multi-system Operator (MSO) and the subsequent entry of the Sumangali Cable Vision established by the Maran brothers linked to the DMK, cable TV operators have experienced the influence of politics on their business. In the last five years, the Government-owned Arasu Cable TV Corporation has become the sole MSO in the State.\n\n“There is a certain amount of discontent among the cable TV operators. It is true that there is political interference at every level in cable operations,” claimed a cable TV operator.\n\nThere are about 31,000 cable TV operators in Tamil Nadu and they collectively employ about 1-1.5 lakh persons. Taking their families into consideration, the electorate in this segment is likely to be between 3 and 4 lakh persons.\n\n“We are weighing our options on whom to vote for as we invariably become victims of politics. During 2005-06, the DMK had opposed a bid by the then AIADMK Government to nationalise MSOs. But after a feud with the Marans, the DMK mooted the concept of Arasu Cable TV Corporation. They dropped the initiative once the family feud was settled. The AIADMK Government revived the Arasu Cable but restricted the subscription amount we can charge from consumers to just Rs 70 per month, which itself is a violation of Telecom Regulatory Authority of India’s recommendations. Our business has become unpredictable and we are the mercy of politicians,” said another cable TV operator.\n\nCable TV operators also feel betrayed by the inability of the State government to get the Digital Addressable System licence for its Arasu Cable. “The Jayalalithaa government promised security and had said the welfare of cable operators would be taken care of. But nothing has happened,” charged another operator.\n\nThe nervousness of cable operators is also palpable. Recently, a news report in a Tamil daily that claimed a political party had plans to announce free set top boxes for cable subscribers in its manifesto, had the Tamil Nadu Cable TV Service Providers Association petitioning the state Chief Electoral Officer Rajesh Lakhoni to ban any such announcement.\n\nAn operator opined that cable operators could play a crucial role at the polls. “They are the ones who are almost on the streets on an everyday basis for maintenance of cable lines, collection of monthly fee and so forth. If they are displeased, it will have an impact in the elections,” one of the operators said.\n\nIncidentally, the PMK has petitioned the Election Commission of India seeking the appointment of election observers to manage Arasu Cable till the polls. The PMK also alleged that neutral news channels were being blocked or pushed to the last slot if they were critical of the government.", 
    "section": "national", 
    "title": "Cable TV operators weighing poll options", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}