{
    "author": [], 
    "text": "While police do file complaints, concerted efforts are needed to ensure that women commute safely\n\nThere is no end to the harassment of women waiting at bus stops in the city at odd hours, after a long, hard day at work. Women waiting at the Simpson’s bus stop on Anna Salai are said to be subjected to cat calls and whistling by young men, including college students.\n\nIn a recent instance, such behaviour by men went unchallenged by others waiting at the bus stop for about 20 minutes until a policeman on a patrol motorcycle reached the spot.\n\nOn noticing the policeman, the men began to disperse, jumping into buses.\n\nWomen complain that this in not an isolated case, but is prevalent throughout the city.\n\nKavitha Kumar, a software professional and a resident of Ashok Nagar, recalled an incident, while walking back home recently. “I was returning home when two men on a motorcycle hit me on my back. I was terrified as they passed comments. They did not stop there. They took a ‘U’ turn and pursued me. I managed to take pictures of them with my phone and showed them to the policemen the next day”.\n\nFollowing her complaint, the police set up a small booth at the end of the street.\n\n“The police do take serious cognisance of harassment of women, but it is not enough,” says V. Geetha, an activist. “We have to push to get our complaints lodged and ensure action is taken. It is disappointing and we hope this changes,” she adds.\n\nWomen who assemble in large numbers at temple festivals fall easy prey to robbers. Despite the elaborate security arrangements made for the annual Kapaleeswarar temple festival in Mylapore, chain snatchers had a field day recently.\n\nAhead of the festival, the police took preventive steps including arresting known offenders and making frequent announcements through the public address system cautioning residents about miscreants in the midst of the swelling crowd. Police also installed watchtowers and stepped up deployment. Despite this, women became easy targets for chain snatchers.\n\nPolicemen say the suspects include first-time offenders and women.\n\n“Usually, the local policemen manage to keep a tab on the habitual offenders, but it is hard to keep track of first-time offenders,” a senior officer says.\n\nPolice say that such crimes are often committed by miscreants who have a complete idea of the area. They easily slip into the crowd, target more than one victim and manage to escape with ease.\n\n(Reporting by Aditi. R\n\nand R. Srikanth)", 
    "section": "national", 
    "title": "Combating harassment of women in public spaces", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}