{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Model code of conduct prevented inauguration of projects, say officials\n\nBusiness goes on as usual at Amma Unavagam in Coimbatore Medical College Hospital after Chief Minister Jayalalithaa’s image was covered in the name board. —Photo: S. Siva Saravanan\n\nPeople from low income group in the city whose toilets the Coimbatore Corporation has built and is building under the Central Government’s Swachh Bharat programme will have to wait to use those.\n\nSources in the Corporation said that as the Election Commission of India has imposed the model code of conduct, the civic body cannot open those toilets to the residents for use. This means that the 156 families whose toilets the Corporation has built and the 170 families whose toilets it is building will continue to defecate in the open or use the community toilet and a neighbourhood toilet.\n\nThe officials reasoned that the code prevented inauguration of projects like bridges and that included the toilets as well. The Election Commission of India imposed the model code of conduct on March 4, 2016.\n\nOn this premise, the Corporation had temporarily suspended the distribution of aid under the Muthulakshmi Reddy Maternal Assistance Scheme. The State Government gives Rs. 8,000 in two instalments to pregnant woman and another Rs. 4,000 if they deliver the infant in a government health facility. And, the Corporation implements the scheme in the city.\n\nThe sources said that the civic body would continue to give the money to the women provided it had disbursed either the first or second instalment prior to the imposition of the Model Code of Conduct. If it had not paid the first instalment, then the women would have to wait till the Election Commission of India lifted the code.\n\nLikewise, the civic body had also temporarily suspended the distribution of the ‘Amma Baby Care Kit’ to newborns at its maternity centres. Again, this was due to the imposition of the model code of conduct, they said and added the Corporation had, however, written to the Chief Electoral Officer, Tamil Nadu, seeking clarification.\n\nThe Corporation maternity centres saw around 100 deliveries a month.\n\nBut the Corporation continued to run the budget canteens, Amma Unavagam, after covering the picture of Chief Minister Jayalalithaa on the name boards.\n\nSenior Corporation officials were unavailable for comment.\n\nConsumer activist K. Kathirmathiyon said that the maternal assistance scheme and baby kit distribution scheme should not be stopped citing the Model Code of Conduct because they were on-going schemes.\n\nLikewise, the Corporation should not refrain from throwing open the toilets to the residents. The officials should clearly make a distinction between on-going and new schemes and not deny people the facilities.", 
    "section": "national", 
    "title": "Corporation discontinues ongoing schemes, but Amma Unavagam remains open", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}