{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "He was charge-sheeted by CBI for defrauding a bank to the tune of Rs. 77 crore\n\nTrouble started brewing for the retail firm from 2008, and in a phased manner, it closed 1,600 stores across the country as it could not pay staff salaries or honour vendor payments.– File PHoto\n\nThe Enforcement Directorate, Chennai, has attached property worth Rs 4.5 crore, belonging to R. Subramanian, promoter and Managing Director of Subhiksha Trading Limited, a retail firm which shut down after it ran into a cash crunch in 2009.\n\nAccording to a statement issued by the office of the Joint Director, Enforcement Directorate, Chennai Zonal Office, Subramanian was charge-sheeted by the Central Bureau of Investigation, Bank Security and Fraud Cell, Bengaluru, for defrauding Bank of Baroda, Chennai, to the tune of Rs. 77 crore.\n\nLater, the case was taken up by the Enforcement Directorate for investigation under the provisions of Prevention of Money Laundering Act 2002. Further investigations revealed that Mr. Subramanian availed himself a term loan and cash credit to the tune of Rs. 77 crore from Bank of Baroda in 2007. This loan was disbursed for the purpose of establishing the chain of stores with the brand name Subhiksha.\n\n“But the funds were diverted fraudulently by him. The entire loan amount was at default,” according to a statement quoting KSVV Prasad, Joint Director of Enforcement Directorate, Chennai Zone.\n\nDuring investigation, it was found that four agricultural lands to the extent of 9.59 acres and two vacant lands were fraudulently transferred in the name of m/s Triad Trading Services Limited, a group company of R. Subramanian. Two other properties in Marakanam and Neelangarai which are in the name of his wife were also identified by the Enforcement Directorate team. Seven immovable properties valued at about Rs 4.5 crore, were provisionally attached under the provisions of Prevention of Money Laundering Act. Further investigation is in process.\n\nSubhiksha founded by Subramaniam in 1997 was a retail chain selling products, including FMCG, pharmaceuticals, groceries, fruits and vegetables.\n\nIn 2000, ICICI Venture made its first investment in the firm which at that time had 50 stores. ICICI picked up a 15 per cent stake for Rs. 15 crore.\n\nAzim Premji’s Zash investment picked up a 10 per cent stake in Subhiksha from ICICI Ventures for Rs. 230 crore in 2008. Trouble started brewing for the retail firm from 2008 and in a phased manner it closed 1,600 stores across the country as it could not pay staff salaries, or honour vendor payments and bank loans.\n\nFollowing this, lot of cases were filed against the company. In 2009, the Madras High Court appointed a provisional liquidator. During the same year the Registrar of Companies Chennai ordered a probe into the affairs of Subhiksha.\n\nSeven immovable properties valued at about Rs 4.5 crore were provisionally attached", 
    "section": "national", 
    "title": "ED attaches property of Subhiksha promoter", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}