{
    "author": [
        "Special Correspondent"
    ], 
    "text": "(Left) Officials taking out a procession along with voters ofS. Aduthurai near Kunnam in Perambalur district. (Above) Nagapattinam Collector S. Palanisamy participating in a human chain programme to step up voting percentage on Wednesday.\n\nIntensive campaign will be taken up in villages which registered less than 70 per cent of polling in the last election, said Collector K. Nandakumar. The campaign aims at sensitising the villagers to the need for exercising their franchise during the forthcoming poll.\n\nRevenue and election officials have been directed to visit these villages and launch intensive campaign on voting under the Systematic Voter Education and Electoral Participation (SVEEP).\n\nAs a first step, officials from the Kunnam taluk office visited S. Aduthurai near Kunnam which registered less than 70 percent polling.\n\nLed by Shah Jehan, Tahsildar of Kunnam, the villagers took out a procession in the village on Wednesday, expressing their determination to discharge their democratic duty. Mr. Shah Jahan administered a pledge to them on the occasion.\n\nNagapattinam\n\nIn Nagapattinam, a human chain programme was organised to sensitise the voters to the need for exercising their franchise. S. Palanisamy, Collector, who led the human chain, said as many as 2,500 students from various colleges participated in the human chain.\n\nD. Kannan, Superintendent of Police, was among those who participated in the human chain.\n\nKaraikal\n\nEfforts for registering cent per cent polling percentage are being made across the district by organising various programmes in coordination with individuals and institutions, said T. Karikalan, Collector.\n\nAddressing officials at a meeting convened under SVEEP here on Wednesday, he said the district administration had initiated special steps for motivating the masses towards exercising their franchise in the coming election. The administration has identified polling stations which needed additional ‘bandobust’ arrangement and steps had been taken to provide the same. Earlier, he flagged off a procession in which officials, government employees and public participated. They all reached the new bus stand where the Collector inaugurated a signature campaign in support of SVEEP.\n\nThe Collector also inspected the office of the Returning Officer at the Municipal Office. He discussed the arrangements for providing basic amenities with the election officials.", 
    "section": "national", 
    "title": "Efforts to maximize polling per centage", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}