{
    "author": [
        "T K"
    ], 
    "text": "16 mobile centres – cars with laptops and 4G dongles — to visit every locality in Chennai\n\nIf having election facilitation centres across the State was not enough for people to access election-related services, the centres will now come to your locality in Chennai — on wheels.\n\nThe Election Commission has now arranged 16 mobile election facilitation centres – cars with laptops and 4G dongles — that will visit every locality in Chennai. Residents can now get the electoral rolls checked for their names, apply for name correction and voter ID card among other electoral services, state Chief Electoral Officer Rajesh Lakhoni told The Hindu.\n\nTraders to print bags with messages\n\nTraders in the city have also now stepped up to the Commission’s request and agreed to print the graphic with “May 16. Be 100% ready to vote” message on shopping bags that are handed out to customers on one side while printing the shop’s details on the other side, he said. These bags will mostly be ready in about 2-3 days and shops will start handing them out, he added.\n\nSpecial camps in old-age homes, orphanages\n\nThe Commission will also be conducting special camps for people living in old age homes and orphanages, Mr. Lakhoni said. “There has been a demand from old age homes and orphanages to conduct camps. There are people living here who were earlier living in another area but have to shift their polling station,” he said.\n\nIn a statement earlier this week, the Commission said, “All private companies, IT companies and government offices should declare a holiday with pay on May 16”. The issue of declaring a full-day holiday on the day of the elections was flagged by IT industry body NASSCOM last week claiming that it will affect their business and that there was precedent in other states to make it a partial holiday. But the Election Commission has said it was against the law.\n\nThe surveillance teams of the Election Commission engaged in enforcing the Model Code of Conduct seized 480 Dirhams reportedly being carried without any proof from a person in Sivanganga during surprise checks. The teams have seized Rs. 5.48 crore in cash till March 21.\n\n16 mobile centres cars with laptops and 4G dongles — will visit every locality in Chennai", 
    "section": "national", 
    "title": "Election facilitation centres on wheels in Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}