{
    "author": [], 
    "text": "SALEM\n\nDistrict Administration: Mini-marathon and walkathon to create awareness on people discharging their democratic rights during the elections, flag off, Mahatma Gandhi stadium, 7 a.m.\n\nConfederation of Indian Industry and Young Indians-Salem chapter: Interaction session with Sana Iqbal, solo bullet rider from Hyderabad, on all India two-wheeler expedition, Sona College of Technology, 11 a.m.\n\nPeriyar University: Department of Journalism and Mass Communication, ‘View Finder 2016’ workshop series on media skills, ‘film appreciation session “construction and destruction of films”, 10 a.m.; Department of Geology: national level seminar on ‘environmental impact on earth resources and future challenges’ sponsored by DST and UGC, 4.30 p.m.; Department of Economics: national level workshop on ‘time series modelling and forecasting’, 4.30 p.m.\n\nThe Kavery Engineering College, Mecheri: Department of Civil Engineering, ‘Genitor 2k6’ national level technical symposium, 9.30 a.m.\n\nDistrict Employment Exchange: Training programme for the Staff Selection Commission aspirants,\n\n10 a.m.\n\nNAMAKKAL\n\nPaavai Engineering College: Department of MCA, seminar on ‘introduction to building mobile apps with Xamarin’, 9.30 a.m.\n\nMahendra Engineering College: Department of Electrical and Electronics Engineering, Lecture on special electrical machines, 10 a.m.\n\nGnanamani College of Technology: Department of Science and Humanities, national level technical symposium on ‘Gnan Cehmp 2k16’,\n\n10 a.m.\n\nTIRUCHENGODE\n\nKSR Institute of Technology: National level conference on ‘recent trends in engineering and technology’, V. N. Mani, Scientist-E, C-MET, Hyderabad, chief guest, 10 a.m.\n\nRASIPURAM\n\nMuthayammal Engineering College: Department of Computer Science and Engineering, and Information Technology, national level technical symposium, 10 a.m.\n\nERODE\n\nShree Venkateshwara Hi-Tech Engineering College: NCIESM 2K16 -National Conference on Innovation in Engineering Sciences and Management, 9 a.m.\n\nEBET Group of Institutions: Mech Conflict 2016 - An Intra-Department Technical Treat, 4.30 p.m.\n\nNandha College of Technology: Talk on ‘Capital Budgeting’ 9.30 a.m.\n\nNandha Engineering College: CIM 2K16 - National-level Technical Symposium by Departments of CSE, IT and MCA, 10 a.m.\n\nErode Sengunthar Engineering College: Lecture on ‘Probability and Queuing Theory’ 10 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}