{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Sympathising with the physically challenged who remain unaware of many beneficial schemes devised for them by the State government, the Madras High Court Bench here said the government cannot expect the hamstrung to make applications on time without having taken continuous steps to make them aware of their entitlements.\n\nA Division Bench of Justices S. Manikumar and C.T. Selvam made the observations while dismissing a writ appeal preferred by the School Education Department against a single judge’s order to grant conveyance allowance of Rs.1,000 a month to a physically challenged teacher of a government school from 2010 and not from 2014 when he made an application.\n\n“Blaming one of the beneficiaries like the petitioner of not applying for grant of conveyance allowance to the Head of the Department immediately after joining service cannot be countenanced. Unless and until it is proved that the scheme was communicated to him, the very object of providing assistance to the differently abled would be defeated,” the Bench said.\n\nIt pointed out that the scheme of providing such allowance to the physically challenged was framed way back in 1989 at the rate of Rs.50 every month. The amount was enhanced step by step in the subsequent years with a substantial jump from Rs. 300 to Rs. 1,000 a month in October 2010. Yet, the litigant, Muthukumar of Sivaganga, remained unaware of the scheme until 2014.\n\nStating that the School Education Department should have taken steps to display relevant government orders on notice boards meant for teachers in government schools, the judges said the officials could not find fault with the beneficiaries of not having approached them seeking the benefit when they themselves had failed in their duty to disseminate the information.\n\n“When assistance in the form of conveyance allowance is sought to be provided to differently abled persons, the government is expected to be proactive in achieving the constitutional objective of reaching out to the needy. Instead, it should not expect the beneficiaries to make a request. The government should be pragmatic in its approach,” the Bench said.", 
    "section": "national", 
    "title": "HC sympathises with physically challenged who remain unaware of govt schemes", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}