{
    "author": [
        "Serena Josephine M Zubeda Hamid"
    ], 
    "text": "Annamalai was declared brain dead at CMC after he met with an accident\n\nThe heart of a 48-year-old man, who was declared brain dead at Christian Medical College (CMC), Vellore, on Tuesday evening, was harvested and taken to Chennai for transplantation.\n\nAnnamalai, a resident of Sathuvachari, was working in a tannery in Arcot. He was returning home after work in his two-wheeler on the night of March 21.\n\nHe was coming on the National Highway 48 near Sathuvachari, when he lost control of the vehicle as he applied brakes, as a person suddenly crossed the road. The vehicle skidded on the road, and he fell down.\n\nHe sustained head injury and was admitted to CMC. Doctors declared him brain dead on Tuesday evening, a CMC official said.\n\nConsent\n\n“His family gave consent to donate his vital organs. The organs were harvested during the early hours of Wednesday,” he said.\n\nHis heart was allocated to Fortis Malar Hospital, Chennai, while liver, a kidney and corneas were allotted to CMC.\n\nThe other kidney was allotted to Apollo Hospitals.\n\nA team from Global Hospitals had gone to harvest the lungs but found them to be in bad condition, a doctor from the hospital said.\n\nThe heart was taken to Fortis Malar Hospital by road from Vellore. Annamalai is survived by his wife, son and daughter. His son was a paramedical student at CMC.\n\nAt Fortis Malar in Chennai, the heart was transplanted to a 35-year-old woman from Mumbai, who had post partum cardiomyopathy, said K.G. Suresh Rao, head of cardiac anesthesiology.\n\n“She developed the condition 10 years ago after her delivery. She was on medication, but in the last two years her condition deteriorated. On Tuesday evening, we got a call from Vellore about the heart. This morning, the patient took a chartered flight from Mumbai at 5.30 a.m. and landed at 8.15 a.m. The heart left Vellore at 9.57 a.m. and arrived at the hospital at 11.58 a.m.,” he said.\n\nSurgery successful\n\nThe surgery was successfully completed, and the patient is doing well, Dr. Rao added.", 
    "section": "national", 
    "title": "Heart harvested in Vellore reaches Chennai hospital", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}