{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "It was one of the ancient gateways that marked the boundary of Madurai\n\nThe Madras High Court Bench here has dismissed a case filed by a lawyer to protect Vitta Vaasal, “one of the four ancient gateways that once marked the boundary of Madurai,” after Archaeological Survey of India, State government’s Archaeology Department and Meenakshi Sundareswarar Temple management said that it was not under the control of any of them.\n\nA Division Bench of Justices S. Manikumar and C.T. Selvam said that a writ of mandamus could not be issued to protect the reported gateway when all the three official authorities concerned had denied having any control over it besides stating that Town Survey Records maintained by Madurai Corporation reflected entries in favour of private individuals with respect to Vitta Vaasal.\n\nIn his submission, Assistant Solicitor General G.R. Swaminathan told the court that Vitta Vaasal was not a protected monument under the Ancient Monuments and Archaeological Sites and Remains Act, 1958.\n\nHe also produced a letter received from the Superintending Archaeologist stating that it could be part of the Meenakshi Sundareswarar Temple but definitely not under the control of the ASI.\n\nOn the other hand, Special Government Pleader VR. Shanmuganathan said that Vitta Vaasal was not under the control of the Department of Archaeology though officials of that department had assured him to inspect the gateway.\n\nHe also claimed that property records of the Meenakshi Sundareswarar Temple too do not contain any entry related to Vitta Vaasal.\n\nIn written instructions given to the SGP, the Joint Commissioner of Hindu Religious and Charitable Endowments Department-cum-Executive Officer of the temple had said that verification of revenue records available in the Town Survey Office of Madurai Corporation revealed certain entries having been made in the names of private individuals with respect to Vitta Vaasal.\n\nStating that those entries were being examined by the temple management, the Executive Officer stated that appropriate steps would be taken to protect the gateway if the records revealed that it belonged to the temple. The judges recorded the submissions made on behalf of all three authorities before holding that no direction could be issued in the absence of concrete materials.\n\nASI, Archaeology Department and Meenakshi temple management say they don’t have control over it", 
    "section": "national", 
    "title": "High Court dismisses case to protect Vitta Vaasal", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}