{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Classrooms of various sizes being contructed\n\nConstruction of a building under way for housing the Indian Institute of Management -Tiruchi at Chinna Suriyur on Tiruchi-Pudukottai highway.— Photo: M. Srinath.\n\n: The Indian Institute of Management-Tiruchi, which is likely to move to the new campus at Chinna Suriyur on Tiruchi-Pudukottai Road in June or July 2016, has designed its amphitheatre classrooms on the model of Harvard Business School.\n\nThe state-of-the-art multi-media classrooms will have all latest information technology tools that supplement the teaching-learning experience of students and faculty members. The classrooms will have seating capacities ranging from 50 to 250.\n\nThe classrooms have been designed based on inputs given by a high level team that visited the classrooms of the Harvard Business School (HBS) campus in Mumbai.\n\n“The classrooms will have all sophisticated facilities that add values to teachers and students. The intention is to set up a benchmark in classroom atmosphere in the country,” said Abhishek Totawar, Chairperson, Placement and External Affairs, Indian Institute of Management, Tiruchi.\n\nHe said each classroom would have two screens with two separate projectors so as to screen various case studies simultaneously for effective panel discussion, comparison, video conferencing, online lectures and trouble free live interaction. Moreover, it would have six or seven boards, which were layered one by one.\n\nThe professor could release the board by pressing remote button for reference whenever he wanted to refer it again. Similarly, each row would have sufficient space and height so as to give a clear visibility to the students and professors on all angles of the classrooms. The students, who would sit on last row or corners, would be able to hear well without any hitch.\n\nK. Selvanathan, Chief Administrative Officer, IIM-T, said it had been planned to construct four 80 seater, four 50 seater, one 120 seater and one 250 seater classrooms. These were being built in the academic block. The construction of academic block, administrative block, library, hostels and mess had reached the advanced stages. They would be completed by June 2016.", 
    "section": "national", 
    "title": "IIM-T to have state-of-art amphitheatre classrooms", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}