{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "A special court for Central Bureau for Investigation (CBI) cases on Wednesday expressed concern over tough action being taken on poor farmers who could not repay loans, while industrialists defaulting payment to the tune of Rs. 500 crore or more remained “not reachable.”\n\nDelivering judgment convicting a private textile firm and its representatives in a Rs. 1.5 crore-loan scam, the XI Additional Special Judge for CBI cases, K. Venkatasamy, made an apparent reference to the incident in Thanjavur district recently where collection agents of a private bank accompanied by police personnel assaulted a farmer who had failed to pay a couple of instalments of his tractor loan.\n\n“It is disheartening to see tough action being taken on poor farmers while people who defaulted on repayment of huge loans were living a luxurious life…such loans are easily brought under the non performing asset (NPA) category,” Mr. Venkatasamy said in his order.\n\nIn the present case, the accused had furnished fake documents and obtained loan to the extent of Rs. 1.54 crore in 2002 from the UCO Bank, T. Nagar Branch, Chennai. “This is a public sector bank and the defrauded money belongs to the people. No mercy should be shown to the accused and the judgment would be complete only if it paves the way for compensating the losses suffered by the bank.”\n\nThe case investigated by the CBI revealed that the accused posing as directors or representatives of Meenakshi Tex had conspired to cheat the UCO Bank and in pursuance of the same submitted forged documents as collateral security for securing a loan. While producing documents in fictitious names, they even produced fake Letter of Credit as if it were issued by another nationalised bank and managed to get the loan sanctioned.\n\nThe judge imposed a penalty of Rs. 35 lakh on the company. He sentenced four accused persons to various terms of rigorous imprisonment and slapped a total fine of Rs. 1,54,20,000 on them. Nine persons accused in the case were given the benefit of doubt and acquitted.", 
    "section": "national", 
    "title": "Judge expresses concern over ‘tough action’ on farm loans", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}