{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "The trio, trained in theft, was brought from Jharkhand, police say\n\nNext time you stand in a queue anywhere, make sure you have kept your belongings safe.\n\nThe Mylapore police have nabbed three juveniles, said to have been brought from Jharkhand and have been trained to rob people of valuables in crowded places.\n\nThe arrest of the juveniles, in their mid-teens, follows an investigation into repeated complaints received by the Mylapore police about mobile phones being stolen from a temple in Mylapore.\n\n“Initially, we had no clue about who was behind this. Then, a team headed by Mylapore crime inspector Tamilazhagan was formed. They studied the CCTV footage in and around the temple for many days,” said a senior police officer.\n\nAfter careful scrutiny, they found that it was a team of juveniles who committed the crime.\n\n“They used to mainly target those who keep their mobile phones in their shirt pockets. The children, carrying a newspaper, would stand in the queue with the adults. Then they would keep fanning the paper from behind and quietly steal the phone,” said a senior police officer.\n\nThe police then posed as devotees and identified the juveniles.\n\n“When we asked them, they pointed at a man who was standing a few hundred meters away. They said he was also from Jharkhand. However, the man has been eluding us,” added the officer.\n\nThe police have sent the boys to a home in Royapuram.\n\n“We have special juvenile police units and apart from this, one policeman has been allotted to each station to handle juvenile cases. We have tied up with NGOs to identify and rescue children who are brought to the city from other States and pushed into crime,” said the police officer.\n\nMeanwhile, child rights activists say that many runaway children from places like West Bengal, Tripura and Mizoram are rescued when they arrive in the city.\n\n“They are brought here for domestic work. However, such children can also be pulled into the world of crime,” said an activist.\n\nSpecial team studied CCTV footage in and around a temple\n\nin Mylapore", 
    "section": "national", 
    "title": "Juveniles held for robbing people in crowded places", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}