{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Bloggers have emerged as the new faces of weather forecasting. They provide quick information using digital platforms. What is interesting is that these weather bloggers represent a cross-section — there are farmers, doctors, students, software and marketing professionals among them.\n\nRecognition of their contribution in the dissemination of weather information, especially during the recent deluge, has drawn more people to weather blogging.\n\nMany of them blog from other countries too, as is evident on Chennaiyil Oru Mazhaikalam, a weather blog site, where people from Japan and United States post updates on Chennai weather too.\n\nKeaweather blog, which is one of the popular sites in the city, has over 200 regular bloggers.\n\nK. Ehsan Ahmed, who started the site for amateur meteorologists, said: “When we started eight years ago, there were only four enthusiasts posting updates on weather trends. Now, the community has grown manifold and hundreds of people follow it on social media. We recently launched a mobile application to provide instant weather alerts. This underlines the growing awareness among people about daily weather forecasts.”\n\nMany of them are self-taught weather experts.\n\nWhile P. Senthil Kumar, an engineer-turned-farmer, sought to learn everything about rains after he took up agriculture, budding musician Gopal Shyamantak started observing skies even as a child and also owns an automatic weather station to monitor every day.\n\nWeather bloggers say they learn the fundamentals of weather monitoring by observing various climate models and data of meteorological department.\n\n“It is a continuous learning process. My weather predictions for a fortnight have improved and are 60 per cent accurate now,” notes Mr. Senthil Kumar.\n\nPadma Jothy, a school administrator, began to observe weather so that she could get first-hand information on weather for the benefit of her school. Now, she blogs regularly on weather patterns.\n\nThe recognition of their work in spreading information, especially during the floods, has drawn people to the field", 
    "section": "national", 
    "title": "Meet the new faces of weather forecasting", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}