{
    "author": [], 
    "text": "When the PWF leaders—Vaiko, Thol. Thirumavalavan, G. Ramakrishnan and R. Mutharasan—came to the DMDK’s office on Wednesday, they displayed a high spirit of camaraderie. Mr. Mutharasan invoked the Mahabharata and likened the team to the Pandavas. “Vijayakant is the Dharman of the five,” he said.\n\nWhen Vaiko spoke, he mentioned a date wrong. Immediately, Mutharasan corrected it. In a lighter spirit, Vaiko said that the PWF had benefitted immensely from the memory of ‘Sahadevan’ (Mutharasan) who always remembers the dates and announcements. Vaiko called himself ‘Arjuna’ and Thirumavalavan as ‘Bheeman’ and anybody approaching Vijayakant has to pass through them first.\n\nKing and his makers\n\nThe PWF leaders also called themselves the kingmakers and Vijayakant as the king. In his short speech, Vijayakant said, “When they approached me for the alliance, they told me that I can be the king. When asked if it would be a coalition government, I immediately gave my nod.”\n\nSpecial mention\n\nAfter signing the deal, the PWF leaders gave a special mention to some of the leaders who stood by them during the talks. For the DMDK, the role played by Vijayakant’s wife Premalatha and brother-in-law Sudheesh was appreciated. Similarly, the names of VCK general secretary D. Ravikumar, MDMK leader S. Duraisamy, CPI(M) leader K. Balakrishnan and CPI leader Subbarayan in forging the tie-up got a special mention.\n\nOn air\n\nMDMK leader Vaiko also recalled the meeting with Vijayakant during a flight from Madurai to Chennai last October. Vaiko said he had told the DMDK leader how the DMK was trying to decimate his party. “It was then Vijayakant reassured me,” he recalled. It was then that the possibility of forming a third front was discussed first.", 
    "section": "national", 
    "title": "People’s Welfare Front leaders call themselves ‘Pandavars’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}