{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "Party cadres dread the hotter days as leaders hit the campaign trail\n\nA mirage on a warm summer day gives the appearance of a flooded highway in Vellore on Wednesday.- PHOTO: VM. MANINATHAN\n\nPolitical parties are gearing up for the May 16 Assembly elections. With preparatory works under way, there is only one thing that is slowing them down – the scorching sun.\n\nWith the mercury hitting 41.1 degree Celsius on Tuesday, party cadres are dreading hotter days as their leaders hit the campaign ground and the polling date closes in.\n\nBut the searing heat has to be managed, as elections are something huge for them, a section of cadres said.\n\n“We do not want cadres to fall ill after working under such hot conditions. We want to protect them from the heat, and hence, have worked out a strategy for the summer. We have asked them to work from 7 a.m. to 11 a.m. and then conduct meetings from 4 p.m. to 9 p.m.,” A. Narayanan, district coordinator of People’s Welfare Front (PWF) said.\n\nHe said Vellore was very hot this year when compared to last year.\n\n“The place is known for its searing heat level. It is difficult with temperature touching 40 degree Celsius in Vellore,” he added. One cannot fail to see mirages on the highway due to the soaring temperatures.\n\nThe mirage formed on the highways make it look as though it is flooded.\n\nAn AIADMK party person said they carried bottles of water in their vehicles to prevent from getting dehydrated. “We also take fruits and fruit juices wherever we go. It helps in managing the heat,” he said.\n\nSome representatives of political parties said they were mostly engaged in indoor works now.\n\n“We are carrying out basic works for the elections now. But the sun will be at its peak when the polling date closes in. In fact, the blistering ‘Kathiri’ is likely to set in by then. This will tend to slow down our works particularly after noon,” A.P. Nandhakumar, secretary of DMK Vellore Central district.\n\nParty representatives also said that managing the heat in Vellore will be tough especially when campaigning begins after candidates are announced.\n\n“Every summer, political parties put up “water pandhals” at key locations but this is not possible now due to the election model code of conduct. Instead, the district administration can make drinking water available for public at identified locations,” Mr. Narayanan added.", 
    "section": "national", 
    "title": "Political parties sweat it out in Vellore", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}