{
    "author": [
        "S Ganesan"
    ], 
    "text": "Volunteers of the PWF and the DMDK distributing sweets in Tiruchi on Wednesday after the announcement of an alliance.\n\nConstituent partners of the People’s Welfare Front (PWF) are upbeat about their prospects in the Assembly elections in the Central region following the clinching of an alliance with the Desiya Murpokku Dravida Kazhagam (DMDK).\n\nDistrict level office-bearers of the constituents of the PWF and the DMDK came together to distribute sweets to the public at the Central Bus Stand here on Wednesday soon after the Captain Vijayakant Front was announced.\n\nFunctionaries of the DMDK who were said to be sulking after Mr.Vijayakant recent statement that the party would go it alone heaved a sigh of relief. “It was true that there was anxiety among some office-bearers in the party over the decision to go it alone. Now that an alliance has been struck by our leader, we are happy about it,” said a party aspirant for the Tiruchi West Assembly constituency who did not want to be identified.\n\nFor the four constituents of the PWF, the alliance has definitely come as morale booster. The parties, especially the Left parties, appear to the confident about their prospects in the Central region, where they hold pockets of influence.\n\nThe two Left parties have substantial presence in Nagapattinam, Tiruvarur and Thanjavur districts. The CPI (M), which contested the 2011 elections as part of the AIADMK combine, won from the Kilvelur (SC) constituency and the CPI from the Thiruthuraipoondi (SC) constituency in the delta region.\n\nIn 2006, the Left parties, which were then part of the DMK alliance, had won from Nagapattinam (CPI-M), Thiruthuraipoondi, Mannargudi, Nannilam and Alangudi (all CPI) in the central districts. The VCK had finished second in Sirkali in the previous two elections. The DMDK which went it alone then, had finished third in most of the constituencies across the Central region. The party candidates had polled over 10,000 votes in the six of the nine Assembly seats in Tiruchi district. The MDMK also has scattered pockets of influence, especially in Karur and Tiruchi districts. Apart from their combined strength, office-bearers of the PWF partners believe, that they would be able to swing the neutral votes in their favour as Captain Vijayakant Front projects a “viable and formidable” alliance this time.\n\n“The parties together have substantial presence in many of the constituencies across the region. Apart from this, we will garner the support of neutral voters, who are a decisive factor,” said S.Sridhar, State committee member, CPI (M). People who were looking for an alternative to the two Dravidian majors did not have a viable alternative all these years. “In fact, the two Dravidian parties have been winning alternatively only with the help of negative votes,” he said.\n\nSome feel that the front could now be projected as a mega alliance and winning combination. “People are definitely looking for an alternative and we will now provide it with a strong front,” observed K.Suresh, Tiruchi City Secretary, CPI.", 
    "section": "national", 
    "title": "PWF elated over DMDK’s arrival", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}