{
    "author": [
        "R Sivaraman"
    ], 
    "text": "AINRC non-committal on BJP’s intent to continue alliance\n\nThe All India NR Congress president and Chief Minister N.Rangasamy is likely to spell out a strategy for the forthcoming Assembly polls by the end of this week, according to sources in the party.\n\nThe ruling party is yet to get off the blocks while the Congress and the DMK hve already firmed up an alliance for the elections and also commenced informal discussion on seat- sharing. On Wednesday, the People Welfare Front’s constituents also commenced the talks on seat-sharing besides launching campaign on streets.\n\nThe ruling AINRC is yet to reveal its alliance strategy and Mr. Rangasamy has evaded direct answers to many related queries.\n\nThough the AINRC is part of the BJP-led NDA alliance, Mr. Rangasamy remains non-committal on the BJP’s declaration of intent to continue the alliance for the Assembly polls. AINRC is also warming up to the idea of reviving the alliance with the AIADMK putting aside its long rivalry, which as a party leader stated, was a better alternative to going it alone.\n\nParty sources said that Mr. Rangasamy will take decision after pilgrimage to Tiruchendur Murugan Temple.\n\nThe party leadership said as there is more than month ahead of polls any announcement of alliance or finalising the list of candidates ran the risk of dissidence among the cadres of each constituency, many of which are already faction-ridden.\n\n“Seats will not be given to those who left the party at the time of crisis,” a party leader said hinting at a group of dissidents proposing the Opposition fielded former Union Minister of State S.Jagathrakshakan as a candidate for the Rajya Sabha a few months ago.\n\n“They became disloyal to the party leader and failed to obey the party line. That ultimately led the party leader to approach the AIADMK to avert the fall of the government. They had brought humiliation to the party leadership,” he said.\n\nRangasamy will take decision after visiting Murugan temple at Tiruchendur", 
    "section": "national", 
    "title": "Rangasamy may unveil poll strategy by end of week", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}