{
    "author": [
        "S Ganesan"
    ], 
    "text": "(Top) Students taking recourse to umbrellas or dupatta to shield themselves from scorching sun. (Above) People turning to tender coconuts to get some relief from sweltering heat.— Photos: M. Srinath and A. Muralitharan\n\n(Top) Students taking recourse to umbrellas or dupatta to shield themselves from scorching sun. (Above) People turning to tender coconuts to get some relief from sweltering heat.— Photos: M. Srinath and A. Muralitharan\n\nMercury touches 40 degree Celsius in Karur; too hot in nearby districts too\n\nTiruchi and neighbouring districts seem to be heading for a long and scorching summer as the mercury has started soaring over the past few days.\n\nThe mercury has been climbing steadily over the past few days with the daytime temperature touching 40 degree Celsius, three degrees above normal, over the past couple of days, making for scorching days and sultry nights.\n\nAs has been the trend in recent years, summer has come early with a blistering start right in the middle of March. Since 2012, the mercury has consistently crossed the 39 degree Celsius mark during March every year. Last year, 39.1 degree Celsius was the maximum temperature recorded in the city on March 24.\n\nIn 2012, the day time maximum temperature touched 39.6 degree Celsius on March 31. But this is the first time since 2006 that the mercury had touched 40 degree Celsius in March, according to statistics available on extreme weather in the website of the Regional Meteorological Centre, Chennai. The all-time high for maximum temperature during the month for the city was 42.2 recorded on March 26, 1892, according to the website.\n\nThe temperature in the neighbouring districts such as Karur, Perambalur and Pudukottai districts has also been high, with the mercury touching the 40 degree Celsius mark in Karur too.\n\nGiven the high day-time temperature, residents are apprehensive of a severe summer this year. With rainfall being scanty during the monsoon, residents are desperately hoping for some summer showers. As the public seek to beat the heat, summer fruits such as watermelon, cucumber and tender coconuts are in great demand. It is some consolation that there has not been any abnormal increase in price of tender coconut, which is the most sought after relief by people. Tender coconuts sell at Rs.30-35 a piece, almost the same as last year.\n\nWith elections round the corner, political parties are wary of the prospect of having to hit the campaign trail in scorching heat. The sweltering heat would definitely be one of the factors to take into account in the campaign schedule of parties, which are faced with a long campaign ahead.\n\n“As of now, we prefer to take up door-to-door and street corner campaigns during the evenings,” says K.Suresh, city secretary of the Communist Party of India.", 
    "section": "national", 
    "title": "Searing start to summer", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}