{
    "author": [
        "T Madhavan"
    ], 
    "text": "The 'Ape' vehicles can accommodate three passengers, but ferry over six\n\nDespite the introduction of small buses by the Metropolitan Transport Corporation, share autos — particularly autorickshaws of ‘Ape’ make — remain popular on some routes in Chennai, much to the frustration of traffic police and RTO officials.\n\nThough these autos are banned from operating as ‘share autos’, they seem to rule the roads on East Coast Road and Rajiv Gandhi Salai.\n\nAccording to an estimate, 1400 autos from Sholinganallur RTO and another 1400 from RTO South have been registered.\n\nBut, in reality, many more such autos, bearing registration numbers from other regions of the city, operate on the road, says a traffic police official.\n\nAs per official estimates, there are 80,000 auto-rickshaws, including Ape autos, in the city.\n\nThe Ape model vehicles have a capacity for just three passengers, but are often found ferrying more than twice the number.\n\nAccording to transport department officials, these vehicles carry more than 8 or 10 passengers, which is dangerous. The State transport department has begun cracking down on overcrowded auto-rickshaws, especially the modified ones that operate as share autos.\n\nThe action against share auto-rickshaws comes after a Madras High Court order directing the transport department to take action against auto-rickshaws flouting safety norms.\n\nRTO officials say they have been conducting regular check-ups on these two roads and impound the vehicles for 10 days, which also results in suspension of permit for the same period.\n\nThe officials state that they first issue a warning. Repeat offenders are issued a show-cause notice and their permits are cancelled,” said the official.\n\n“MTC should introduce more small bus services on the SRP Tools-Siruseri SIPCOT, Injambakkam-Siruseri, Kovalam-Kelambakkam and Medavakkam-Siruseri sections which could reduce the number of people opting for these share autos,” says K. Anbazhagan of Padur.\n\n“As these autos stop near office complexes, many find it convenient to reach office. Moreover, the amount charged is nominal, which is the reason for its popularity among office-goers,” Anbazhagan added.", 
    "section": "national", 
    "title": "Share autos pose a stubborn problem on OMR and ECR", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}