{
    "author": [
        "Special Correspondent"
    ], 
    "text": "While pointing out that successive governments had taken away rights of adivasis, historian Ramachandra Guha on Wednesday said that in the short term, their situation in the country is only set to get worse.\n\nHe was delivering the 36{+t}{+h}J.P. Memorial Lecture organised by the People’s Union for Civil Liberties on the topic, ‘Tragedy of the Adivasis in Independent India.’ “State policies have led to the active dispossession of adivasis,” he said.\n\nEven as he pointed out that the erosion of forest rights began with the UPA regime and got exaggerated under the NDA government, Mr. Guha reserved the most criticism for the Maoists.\n\n“We should not romanticise the Maoists. They are believers in an outdated, reactionary, anti-democratic ideology and are practitioners of violence and bloodshed that are completely antithetical to the Constitution. While understanding the reasons why Maoism flourishes in adivasi districts….we should not make the mistake of treating Maoists as their liberators,” he said.\n\nMr. Guha listed eight tragedies that adivasis of the country have had to go through since Independence. The first, which he called the Triple Resource Curse, was at root of all maladies. “….Adivasis sit on the most valuable resource for industrialisation — forest, water and minerals,” he said.\n\nThough Mr. Guha admitted that it was difficult to accurately identify the number of displaced adivasis, he said – quoting studies – that 40 per cent of those displaced by government projects are adivasis even though they comprise only eight per cent of the general population.\n\nAmong the multiple tragedies Mr. Guha listed were how the national movements bypassed the adivasi question entirely and the demographics of the adivasis themselves – the failure to exert a pan-Indian influence because of being concentrated to a region of the country, that too, as a minority. Their demographics had led to another tragedy: the absence of an Ambedkar-like figure for the adivasis.\n\nHistorian lists eight tragedies adivasis in the country had to go through since Independence", 
    "section": "national", 
    "title": "‘Situation to worsen in short term for adivasis’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}