{
    "author": [
        "S Senthalir"
    ], 
    "text": "A number of social service programmes were organised across the Union Territory\n\nBihari families in Puducherry get together to celebrate Holi Festival at a farm house on the outskirts of Puducherry on Wednesday.Photo:T. Singaravelou\n\nHer face smeared in red and green gulaal , Sudha Kumari held a fistful of colour powder to apply on her friend’s face. For Sudha, hailing from Bihar, it was her first Holi in Puducherry.\n\nThe festival of colours has spread its joy in Puducherry too. It was not only the north Indians who played with colours but even students from south India, who joined in the celebrations with their friends.\n\nAhead of the Holi festival celebrated on Thursday, Pondicherry Round Table 70 organised ‘Range De 2016’ at a farm house in Puducherry last Sunday. This year, they did not follow the traditional way of celebrations. “We had organised rain dance, DJ, Punjabi dhol and Thandai (cold drink prepared during Holi festival) for the 350 to 400 participants,” said Ashvin Porwal, chairman, Pondicherry Round Table 70.\n\nThis celebration was organised with the noble cause of collecting funds to provide an ambulance for homeless people. “We require Rs. 4 lakh to buy an ambulance. So far, we were able to collect Rs. 2 lakh and we are still raising funds for the ambulance,” he said.\n\nThis year, JIPMER students too celebrated with a sense of responsibility towards society. JIPMER students started their annual Holi festivity ‘Rangotsav’16’ with cultural events on Wednesday. The Holi Cultural Night had a display of talent by JIPMER students from all streams and batches. Dances, skits, mimes, musicals and band performances were organised to keep the audience enthralled till the wee hours.\n\nThey had organised g ulaal , the festivity of hues, on Thursday morning, which includes a rain dance, kabbadi, tug of war, and an Eat-a-thon for the participants.\n\nIn a bid to add colour to the lives of the less fortunate, the JIPMER Social Service Committee will distribute clothes collected from the staff, students and faculty to Sharon Society, Don Bosco Boys’ Home and St Xavier’s Girls’ Home.\n\nFor the first time, Pondicherry Bihar Welfare Association had organised a get-together of the Bihari families in Puducherry in view of the Holi celebrations. There are 4,500 families in Puducherry region and 2,500 in Karaikal. Women and children smeared gulaal and played games as men danced to Bhojpuri songs.\n\nJain Samaj has also organised Holi celebrations on Thursday afternoon at 45 feet road extension in Puducherry.", 
    "section": "national", 
    "title": "Spreading joy through Holi", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}