{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Star Vijay’s popular reality television show, Super Singer, which completed nine seasons a few days ago, was trending on social media for all the wrong reasons. The channel has been accused of “hiding information about the participant” to the audience after details emerged post the awards ceremony that the winner, Anand Aravindakshan, was already a ‘playback singer’.\n\nIt emerged that Anand Aravindakshan had already rendered a few songs in Tamil movies. Since the show has a reputation of finding new singing talent and giving them the exposure and platform to shine, social media users were critical of the channel not being upfront about the fact that a professional singer had participated in the show and accused the channel of wrongdoing.\n\nActor and filmmaker Lakshmi Ramakrishnan, whose film ‘Aarohanam’ features a song sung by Anand Aravindakshan, wrote on Facebook saying that ‘this cannot have happened without the channel’s knowledge’.\n\n“Unethical practices have resulted in victimising not just Anand, but other participants and, of course, the audience, who spend time and money by sending SMS to support talented youngster,” she wrote.\n\nWhen asked for his comment, Pradeep Milroy Peter, creative head, Star Vijay, said that there was ‘no rule that playback singers should not compete’ in the show. “We don’t know why everyone is talking about this. In the first few years, we had the rule. But we don’t have such a rule anymore. We get hundreds of applications from those who have religious songs, chorus and tracks for films, released single albums. We cannot eliminate all of them,” he said.\n\n“Even those who have sung for movies have lost. Take for instance, Latha Krishna who has sung songs in Malayalam and for James Vasanthan,” he said.\n\nCritics point out this year’s winner is already a professional singer", 
    "section": "national", 
    "title": "Super Singer programme lands in controversy", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}