{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Devotees witnessing Panguni Uthiram car procession at Palani on Wednesday. (Right) Car festival of Sri Adi Jagannatha Perumal Temple held at Thirupullani near Ramanathapuram for Panguni Brahmotsavam.— PHOTOS: G. Karthikeyan and L. Balachandar.\n\nLord Muthukumaraswamy along with Goddesses Sri Valli and Sri Deivanai ascended the car at 12 noon\n\nThousands of devotees from various places in Dindigul and neighbouring districts witnessed the holy car procession, which was celebrated as part of Panguni Uthiram festival here on Wednesday.\n\nThe car, drawn from Sri Padha Vinayagar Temple around 4.30 p.m., returned to the base passing through the four giri veedhis around the hill temple.\n\nThe utsavamurthy was taken to the Shanmuga river for theerthavari, a holy bathing, early in the morning. Special pujas were performed to Lord Muthukumaraswamy. Later, the Lord and the Goddesses were decorated and taken around Thiru Avinankudi Temple on an ivory palanquin.\n\nLord Muthukumaraswamy along with Goddesses Sri Valli and Sri Deivanai ascended the holy car at 12 noon. Special pujas were performed to the temple car and the deities.\n\nAmidst chanting of hymns by gurukkals and Thevaram songs by Oothuvars, devotees pulled the car.\n\nAfter taking part in a rejuvenation camp, the temple elephant pushed the car from behind for a smooth passage on the giri veedhis. Devotees thronged the giri veedhis since evening.\n\nCollector T.N. Hariharan took part in the festival and monitored the arrangements for pilgrims.\n\nHeavy police force was deployed and Superintendent of Police A. Saravanan and DIG G. Karthikeyan camped in the temple town to monitor security arrangements.\n\nDevotees with different kinds of kavadis had thronged the hill temple for the past five days.\n\nThe 10-day Panguni Uthiram festival would conclude on March 26.\n\nRamanathapuram\n\nA large number of devotees, including women and children, thronged temples in the district, carrying of different types of kavadis and taking out milk pot processions.\n\nAs the people thronged more than 60 Amman, Murugan, Vinayagar and Shiva temples in the district, police made elaborate security arrangements since Wednesday morning.\n\nDevotees thronged the Vazhividu Murugan temple here, carrying kavadis and offered worship, fulfilling their vows. They came in ‘padayatra’ from the Bramhabureeswarar Temple at Nochivayal Oorani, near here, carrying ‘paal kavadi’, ‘panneer kavadi’, ‘pushpa kavadi’, ‘vel kavadi’ and ‘thotti kavadi’, fulfilling their ‘nerthikadan’ and offered worship at the Murugan temple.\n\nAs the devotees walked down to the temple, people, en route, offered buttermilk, ‘annadhanam’ and drinking water to them.\n\nThe festival began with “Kappu Kattudhal’, 10 days ago and culminated with devotees performing fire walk in front of the temples after special pujas. Devotees also offered worship at the ancient Sri Kumarakadavul, alias Subramaniya Swamy Thirukoil at Karupilaimadam near Valanadu in Mudukulathur taluk after taking out milk pot procession and carrying kavadis.\n\nBramotsavam, followed by the car festival, was conducted at the ancient Adi Jagannatha Perumal Temple in Thirupullani.", 
    "section": "national", 
    "title": "Thousands witness holy car procession at Palani", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}