{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Thudiyalur Police arrested three persons involved in a clash for alleged attempt to murder three persons with whom they were fighting in front of a restaurant at Thudiyalur in the late hours of Tuesday.\n\nPolice said that the complainant, S. Thennarasu (41) of Kumaran Nagar in Vadamadurai had gone to Thudiyalur police station with his relative Nagaraj and younger brother Murugan to lodge a complaint against his neighbour G. Balasubramaniam (25) for allegedly teasing his 16-year-old daughter over the last few weeks.\n\nThe police called Balasubramaniam for inquiry. Around 8 p.m., Balasubramaniam and his two associates S. Sakthivel and S. Karthik picked a quarrel with Thennarasu and assaulted him and his two relatives (who were at an eatery) with logs.\n\nNagaraj suffered serious head injury and was admitted in Coimbatore Medical College and Hospital.\n\nThe police booked Balasubramaniam, Sakthivel and Karthik under sections 294(b) (uttering obscenities), 324 (voluntarily causing hurt with deadly weapons or means) and 307 (attempted murder) of the Indian Penal Code, arrested and remanded them.\n\nJewellery stolen\n\nThe city police are on the lookout for four persons who allegedly shoplifted more than 25 sovereigns of gold from a jewellery outlet on the Cross Cut Road on Tuesday.\n\nKattoor Police said that the accused went to the store owned by P. Ramu (61) and pretending to be customers they asked the staff there to show them some jewels. While the staff were occupied, they managed to steal more than 20 pieces of jewellery weighing a total 25.5 sovereigns and escaped.\n\nThe staff noticed the theft a short while later and informed the owner of the store. Based on a complaint from Ramu, Kattoor Police registered a case under sections 406 (criminal breach of trust) and 420 (cheating and dishonestly inducing delivery of property) of the Indian Penal Code.", 
    "section": "national", 
    "title": "Three arrested on attempt to murder charge", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}