{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Sri Ranganathaswamy Temple, Srirangam : Panguni car festival, Namperumal purappadu from Thayar Sannidhi, 5.30 45 a.m.; ther vadam pidithal, 7.15 a.m.; Namperuma purappadu from goratham, 4 p.m.; reaching Sandhanu mandapam, 4.30 p.m.; thirumanjanam, 5 p.m.; purappadu, 8 p.m.; reaching sanctum sanctorum, 10 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Parayana goshti procession, South Gate, Srirangam, 5.30 p.m.; Sahasranama parayanam, Sri Dhanvanthri Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama Nama parayanam, 24, SMESC Colony, North Extension II Street, 6 p.m.\n\nGovindammal Tamil Mandram : Vadivel Iyya speaks on Periya Puranam, Pappammal Anna Chathram, Keezha Chinthamani, 6.30 p.m.\n\nSri Varasidhi Vinayagar Temple: Discourse on Srimad Ramayanam by V.Mani, Ganapathy Nagar, Thiruvanaikovil, 6 p.m.\n\nGENERAL\n\nNational College: College day, S.Gopinath, Executive Director, BHEL, Tiruchi, chief guest, 10 a.m.\n\nSaranathan College of Engineering : College Day, Soalikutty Dhanabal, academic programme manager for IndRAA, National Instruments Inc, chief guest, 5 p.m.\n\nJamal Mohamed College : College day for men, V.Ayothi, principal, Thanthai Hans Roever College, chief guest, 10 a.m.\n\nYouth Red Cross Zone, Bharathidasan University and Shrimati Indira Gandhi College : Seminar for YRC programme officers arts and science colleges of Bharathidasan University, C.Thiruchelvam, Registrar, Bharathidasan University, chief guest, 10.15 a.m.\n\nDistrict Administration: Systematic Voter Education and Electoral Participation programme, RDO Office, Musiri, 10 a.m.\n\nM.A.M.College of Engineering : National conference on Advances in computing and communication, A.Azad, Director, Centre for International Affairs, Anna University, chief guest, 9.30 a.m.; valedictory address by Gopinath Ganapathy, Director, Bharathidasan University Technology Park, 4 p.m.\n\nTrichy Engineering College : College Day, K.Rukmani, Director, Centre for Excellence in Nanobio Translational Research, Anna University-Tiruchi, chief guest, 10 a.m.\n\nJ.J.College of Engineering and Technology : Blaze 2016 – boys hostel day, J.Rajesh Gopalan, actor, chief guest, 9.30 a.m.\n\nUrumu Dhanalakshmi College Citizen Consumer Club and Tamil Nadu Consumer Federation: Lecture on Consumer awareness by M.Sekaran, president, Federation of Consumer and Service Organisations, 11.30 a.m.\n\nREACH: Scientific session for physicians and doctors on ‘Approach TB the right way – updates on TB management in your practice,’ Hotel Sangam, 2 p.m.\n\nHallmark Business School Centre for Entrepreneurship Development and TIDITSSIA: Workshop on Entrepreneurship development, N.Kanagasabapathy, president, TIDITSSIA, inaugurates, 10 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}