{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Jet Airways has prepared the summer schedule; it starts from March 27\n\nDomestic connectivity to Chennai from Tiruchi is set to improve with the Jet Airways deciding to introduce two more flights in this sector.\n\nThe private airline has prepared the schedule for the operation of the additional flights in the Chennai – Tiruchi – Chennai sector. The additional ATR flights would be introduced during the summer schedule starting from March 27, sources here said.\n\nThe timings of the flights are as follows: Flight 2787 will leave Chennai at 6.10 a.m. and arrive at Tiruchi at 7.15 a.m. In the return direction, Flight 2788 will leave Tiruchi at 7.45 a.m. and reach Chennai at 8.50 a.m.\n\nIn the afternoon, Flight 2407 will leave Chennai at 4.20 p.m. and arrive at Tiruchi at 5.25 p.m. In the return direction, Flight 2408 will leave Tiruchi at 5.50 p.m. and reach Chennai at 6.55 p.m.\n\nThe sources said the morning flight to Chennai would enable passengers to have immediate connections to Mumbai, New Delhi, Bengaluru, Pune and Port Blair. The airline is already operating three services every day in the Chennai – Tiruchi – Chennai sector. The services would rise to five every day.\n\nJet Airways is the lone airline providing domestic connectivity from Tiruchi. There is no air connectivity to any other major city from Tiruchi other than Chennai today despite repeated demands from travel and trade industry for augmenting domestic services to newer domestic destinations.\n\nAlthough a private airline Fly Easy evinced interest last year in operating a new service in the Bengaluru – Tiruchi – Bengaluru sector, it is yet to take off.\n\nNotwithstanding the lone domestic connectivity to Chennai, Tiruchi airport witnessed growth in domestic passenger traffic during this fiscal.\n\nThe airport handled over 1.2 lakh domestic passengers from April 2015 to January 2016 as compared to 77,409 during the corresponding period last year, according to Airports Authority of India statistics.\n\nIt is already operating three services daily in the Chennai - Tiruchi– Chennai sector", 
    "section": "national", 
    "title": "Two more flight service to Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}