{
    "author": [
        "Staff Reporter"
    ], 
    "text": "District Collector Archana Patnaik (second left) and District Revenue Officer T. Christuraj (left) overseeing the operations to paste poster on the rear of a bus to create awareness among voters on the importance of voting in Coimbatore on Wednesday. —Photo: S. Siva Saravanan\n\nElection officials in the Valparai Assembly constituency on Wednesday seized unaccounted money totalling Rs. 9.12 lakh. A release from the district administration said that the static surveillance team there intercepted a lorry near Diwanshah Pudur school and during checking seized the cash. The vehicle was on its way to Kerala. The Wednesday’s seizure takes the total cash seized to Rs. 30.10 lakh. The amount the officials have returned is Rs. 6.43 lakh. Likewise, the officials in-charge of implementing the Model Code of Conduct have registered 228 cases for various violations, the release said.\n\nVoter enrolment camp\n\nDistrict Election Officer and Collector Archana Patnaik on Wednesday inaugurated a voter enrolment camp at a home for the aged in Podanur. A release said that just as the district administration was conducing enrolment camps in colleges to enrol people over 18 years as voters, it was also conducting such camps to ensure that the senior citizens also voted. The objective was to conduct the camp in all the 33 home for the aged. It had enrolled 272 senior citizens and was in the process of distributing voter identity cards.\n\nHoliday for polling\n\nAll voters employed in any business, trade, hotel, cinema theatre, industrial undertaking or any other establishment including IT organisations, as daily wagers temporary and consolidated staff are eligible for a holiday on the date of polling – May 16, 2016, as per the provision 135B of the Representation of the People Act, says a release from the district administration.\n\nIt warns of penal action, including filing of FIR, against those companies and establishments that refuse to grant paid holiday to their employees who are bonafide voters, since refusal to grant holiday would contravene the provisions of the Act.", 
    "section": "national", 
    "title": "Unaccounted cash seized", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}