{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Expressing deep concern over school and college girls committing suicide even when they faced minor setbacks and failures in their lives, popular Tamil Poet and Lyricist Vairamuthu appealed to them to take failures in their stride as they were the wealth of the nation.\n\nAddressing the 28th Academic day of the Thassim Beevi Abdul Kader College for women here on Tuesday, he said school and college girls should realise that success could be built only over losses and ending their lives for minor setbacks and failures was a great loss to the society.\n\nHe said he was deeply hurt when he learnt that two school girls, who were appearing for plus two examinations had committed suicide in Chidambaram after they found that the Maths and Chemistry question papers were very tough and they would not pass in the school final examinations.\n\n“To be born a girl, to get educated and grow as a woman is a ‘thavam’ (penance) and women ending their lives for minor failures is a great loss to the society,” Ms. Vairamuthu said. The truth was that women lacked the courage to face troubles and overcome failures but ending their lives would not be a solution, he said.\n\nGone were the days when education was denied to women and they were suppressed.\n\nThe women of this century have emerged as a major force to reckon with, he said.\n\n“Now it has become very clear that India could not emerge as a super power without the power of women”, he asserted.\n\nLater, Mr. Vairamuthu, replying to a question on “honour killing” said caste differences could not be abolished as long as race differences persisted in the society.\n\nWiping out caste tags in street names would not help address the issue as long as race differences remained, he said.\n\nS. Sumaya, Principal of the College conferred the title “Gnana Kavi” on Mr. Vairamuthu on the occasion. Arif A. Rahman Buhari, and Khalid A K Buhari, Chairman and Secretary of the Seethakathi Trust respectively and Fajila Azad, life coach, hypnotist and alumnae of the college graced the occasion.", 
    "section": "national", 
    "title": "Vairamuthu expresses concern over spurt in girls committing suicide", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}