{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Tirunelveli District Collector M. Karunakaran placing wreath on the coffin of Vijayakumar at Vallaramapuram in Tirunelveli district on Wednesday.— Photo: A. Shaikmohideen\n\nAmidst a tearful homage by the officials and villagers, the mortal remains of martyr Sepoy K. Vijayakumar (23) of the Indian Army, who was buried alive in an avalanche at Kargil on March 17, was laid to rest at his native place of Vallaramapuram near Puliyangudi in the district on Wednesday.\n\nHis body was retrieved from 12-foot-deep snow three days after the tremor-triggered avalanche.\n\nThe mortal remains was flown from Thiruvananthapuram in a chopper to the helipad on the Manonmaniam Sundaranar University campus at 10.50 a.m., and was taken to Vallaramapuram in an ambulance.\n\nFlex banners condoling the death of the jawan lined the route to his home.\n\nOn reaching the sleepy hamlet shortly after 1 p.m., the coffin was received by Collector M. Karunakaran and Superintendent of Police V. Vikraman and taken to his small house, where people from nearby villagers also paid their last respects for about 15 minutes.\n\nThe inconsolable Karuthapandi, father of Vijayakumar, said his son, who spoke to him over the phone on March 15, had told him to make preliminary arrangements for starting the construction of their house as he would be applying for a housing loan shortly.\n\nMost of the villagers said the Central and State governments, considering the family’s poor economic condition, should give employment to one of the two sisters of the martyr based on their educational qualification. “Since one of his sisters possesses a diploma in nursing, she should be appointed as staff nurse in a government hospital,” the jawan’s relatives said.\n\nDr. Karunakaran, Mr. Vikraman, Revenue Divisional Officer P. Fermi Vidya, Rajya Sabha MPs S. Thangavelu, S. Muthukaruppan and Vijila Sathyananth, Sankarankovil MLA S. Muthuselvi, MDMK general secretary Vaiko’s brother V. Ravichandran and others paid their last respect to the martyr at the burial ground.\n\nAfter a gun salute by the army jawans, Vijayakumar’s body was buried.", 
    "section": "national", 
    "title": "Young jawan laid to rest at his native place", 
    "subsection": "tamilnadu", 
    "date": "2016-03-24"
}