{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Three teens have been arrested by Kancheepuram police on a charge of raping a schoolgirl. The Dalit minor lodged a complaint with All Woman Police Station in Chengalpet on Wednesday night that the trio took her to an abandoned motor room near Singaperumalkoil and sexually assaulted her.\n\nAccording to police sources, the victim, a resident of Kavanoor, is studying class IX in a Chengalpet school. On Tuesday, her mother scolded her for not going to school. Upset over this, she went to meet one of her friends, Alagesan, at Singaperumalkoil railway station. He called two others – Vimal and Sakthi – to join him.\n\nIn her complaint to the police, the girl said Vimal took her to the abandoned motor room in Thirukachoor on a motorcycle. A little later, Alagesan and Sakthi also came there. While Vimal and Alagesan stood outside, Sakthi tried to misbehave with the girl. When she objected to this, Vimal came in and sexually assaulted her.\n\nEarly on Wednesday, the victim reached Potheri railway station where one of her father’s friends helped her reach home. After explaining what had happened to her parents, the victim lodged a complaint against the accused seeking action. She was referred to the government hospital for medical examination.\n\nA special team formed to investigate the case arrested Vimal, Sakthi and Alagesan. They were booked under the provisions of Sections 4 (committing penetrative sexual assault), 6 (committing aggravated sexual assault) and 17 (abetment) of the Protection of Children from Sexual Offences Act (POCSO), 2012, and Section 366 (A) (Procuration of minor girl) and 354 (B) (assault or criminal force to woman with intent to outrage her modesty) of the IPC. They were produced in a local court and remanded in judicial custody.\n\nAnother assault\n\nIn another case reported at Avaniapuram in Madurai, a gang reportedly assaulted a man and raped the woman who was with him on Wednesday night. Police said the couple were talking in a remote farm in Kuranguthoppu on the city outskirts when the gang came there and attacked Anandkumar. They then reportedly took turns to rape the woman. The police arrested three persons Manikandan, Karthik and Muniasamy on charges of rape. A search is on for two more.\n\nThey were produced in a local court and remanded to judicial custody", 
    "section": "national", 
    "title": "3 teens held for raping minor", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}