{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "The ban on certain fixed dose combination drugs puts pharmacists, patients in a quandary\n\nA few weeks ago, a resident of Kolathur bought a cough syrup from a nearby pharmacy.\n\nNow though, the 42-year-old is not sure whether to use it — the syrup is on the list of 344 fixed dose combination (FDC) drugs banned by the government earlier this month.\n\nW. S. Mohan Kumar, president, The Chemists & Druggists Association, Chennai district, said pharmacists in the city were reeling under the effects of the ban and that customers would be affected.\n\n“We have asked all of the pharmacies in our association to separate and keep aside the drugs on the banned list. This amounts to over 4,000 products. Many pharmacies are run by just one person and this is becoming extremely difficult. We want the government to give us more time — at least two months — to do this,” he said.\n\nThe Association, he said, had provided pharmacies with a booklet with a list of all the banned combinations and also held an awareness meeting on the implications of the ban on Wednesday.\n\nAt Sri Saravana pharmacy in Kilpauk, a box is being filled up with the banned drugs.\n\n‘We will return them to the wholesaler and he will return them to the manufacturer,” said the owner, Ka. Thiagarajan, adding that the banned drugs would amount to nearly 30 per cent of their stock.\n\n“Customers have been coming in and asking us what to do with the drugs they have bought previously that are on the banned list. We have been telling them to ask their doctors. One customer told us his doctor was out of the country for a few months and he didn’t know what to do. Some customers have come to us and returned medications they had bought earlier,” said an employee of the pharmacy, who was ticking off the drugs he had taken off the shelves on the booklet.\n\nMr. Thiagarajan said that while a few of the drugs were over the counter, most were prescription drugs.\n\nThe fixed dose combinations were for the treatment of, among others, diabetes and anxiety/depression.\n\nFDCs based on codeine used in cough syrups are also on the banned list.\n\nAt another pharmacy in Nungambakkam, the pharmacist said customers had been asking why codeine was banned and added that he had been telling them to ask their doctors for another prescription.\n\nR. Sundararaman, head of internal medicine and diabetology at SRM Institutes for Medical Science, said that while this move might lead to increase in costs for patients — as fixed dose combinations are cheaper— it was welcome, as there are many irrational drug combinations currently in the market.\n\n“I use the bare minimum of combinations, and for those patients, I have changed prescriptions. One drug can alter the efficacy of another in combination and so, it is always better to use individual drugs,” he said.\n\nPharmacists are working overtime to separate the banned drugs from the rest\n\nof the stock", 
    "section": "national", 
    "title": "A bitter pill to swallow for some", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}