{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Asserting that knowledge has become the supreme asset, Syed Akheel Ahmed, former Vice-Chancellor of Yenepoya University, Mangalore, has called upon the youths to acquire knowledge and become part of the present knowledge-driven society.\n\nDelivering the silver jubilee convocation address at Thassim Beevi Abdul Kader College for Women here on Wednesday, he said that as knowledge was considered an asset, tool and promoter in the knowledge-based society, one could become a participatory citizen only by acquiring it.\n\nAcquisition of knowledge should be based on refined and processed information as the knowledge-driven economy was shifting to knowledge-based economy, and set to absorb human capital as intellectual capital and knowledge asset as technology asset and economy asset, he noted.\n\nThe youths could get into the knowledge society only if they changed their mindset, attitude and perception.\n\n“If you want to make your country a developed country, youngsters and graduates should acquire quality knowledge,” he said.\n\nPointing out that three-fourths of Indian population was below the age of 40 years and 550 million below the age of 25 years, Prof. Ahmed said that India had tremendous youth power which had to be transformed into a national asset, human capital and intellectual capital.\n\nYouth power\n\nLikening the youth power to nuclear energy, he said that the youth power could be used for development and peaceful purposes only if the youths were made to believe in ‘Satyam, Shivam and Sundaram’ (truth, love and peace).\n\n“The concept of Islam is peace and when Muslims surrendered to the will of God in action and deed, there will be peace all over the world,” he said.\n\nThose who believed in violence and destruction had to be nipped in the bud, he said. Students should believe in non-violence and join the ‘men of action’ who believed in peace and love and take the country to greater heights, he added.\n\nThe convocation ceremony was attended among others by Arif A. Rahman Buhari, Khalid A.K. Buhari, chairman and secretary of Seethakathi Trust respectively, A. Rahmathunsia, correspondent, and S. Sumaya, Principal of the college.\n\nIn all, 567 women were awarded degrees. They included 165 women, who were awarded with Muballiga Sanadh diploma in Islamic studies.\n\n“If you want to make your country a developed country, youngsters and graduates should acquire quality knowledge”", 
    "section": "national", 
    "title": "Be part of knowledge-driven society, students told", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}