{
    "author": [
        "R Sujatha"
    ], 
    "text": "‘Creamy layer OBC candidates included in non-creamy layer category’\n\nSET involves only the conduct of examination and the question of OBC creamy layer and non-creamy layer does not arise, says Bharathiar University Registrar K.G. Senthilvasan. A view of the University in Coimbatore.\n\nThe Bharathiar University in Coimbatore, which conducted the State-level Eligibility Test (SET) in 2012, is facing an inquiry from the University Grants Commission (UGC) for allegedly violating norms including irregularities in implementing reservation for OBC candidates. A pass in the SET (like the National Eligibility Test) is a prerequisite for candidates aspiring to be appointed as assistant professors in colleges and universities.\n\nThe UGC had assigned the university as a nodal agency for conducting the SET. Acting on a complaint that the university had wrongly included “creamy layer” OBC candidates in the non-creamy layer category, the UGC’s Senior Statistical Officer Ravi Patwardhan has written to it seeking a response.\n\nMr. Patwardhan pointed out that the complainant, R. Srikumar, an assistant professor in a Salem-based college, had also stated that he submitted numerous representations with material records regarding the said violations to Bharathiar University but appropriate action was not taken in this matter.\n\nThe complainant alleged that the Mother Teresa Women’s University in Kodaikanal, which was entrusted to conduct the SET this year, had continued the violations.\n\nMr. Srikumar has further alleged that the violation of norms had been carried forward even in the appointments made by the Teachers Recruitment Board (TRB). To substantiate his charge, he said documents obtained under the Right to Information Act showed that a particular candidate, who did not pass the SET, was appointed as assistant professor of mathematics in a government college.\n\nIn the case of TRB appointment, the violation was with regard to qualifications specified by the UGC. According to the norms, a person who has received Ph.D degree as per the 2009 regulations alone is exempt from passing the SET/NET. But at least one candidate, who failed in the SET, has been appointed as an assistant professor.\n\n“The TRB filled 1,093 vacancies in arts and science colleges in the State after the SET results were announced. This is just one case. Even the notification by the TRB was violative of the UGC norms on qualification. We don’t know in how many cases the norms have been violated,” Mr. Srikumar, said.\n\nThe candidate’s appointment has since been withheld.\n\nWhen contacted, Bharathiar University Registrar K.G. Senthilvasan, who was then the member-secretary of SET, said: “We have followed the UGC norms. SET involves only the conduct of examination and the question of OBC creamy layer and non-creamy layer does not arise. The distinction is made only in appointments. Besides, the State does not have a distinction between creamy layer and non-creamy layer.”", 
    "section": "national", 
    "title": "Bharathiar University charged with violating norms in SET", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}