{
    "author": [
        "C Jaisankar"
    ], 
    "text": "It has been planned to complete all pending works before January 2017\n\nhe National Highways Authority of India (NHAI) has resumed the construction of Railway Over Bridge and other pending works on Tiruchi-Karaikudi highway.\n\nThis would come as a relief to motorists and passengers, who have been finding it difficult to negotiate the unfinished stretches. Moreover, it has come as a relief to the NHAI, which had encountered a number of issues on completing the 84 km work.\n\nAs per the original plan, the laying of two-way road with paved shoulders on the new alignment should have been completed in 2013.\n\nThough the NHAI had managed to complete about 75 per cent of the work, it could not complete laying of road for 8 km, four each near Kalamavur and Karaikudi, due to a combination of factors including litigation against the use of land of water spread across a few Public Works Department tanks.\n\nBesides, the financial crunch faced by concessionaire, which was allotted the Tiruchi-Karaikudi road project, was citied as one of the reasons for the delay in completion of the project. They had delayed the completion of the project for more than 18 months.\n\nHowever, NHAI authorities told The Hindu that most of the issues, which had remained stumbling blocks, have been resolved. The company had mobilised men and material to take up the work with new vigour. Levelling of road at two stretches has been started. It would gain momentum in the next few weeks.\n\nAs far the construction of ROB at Kalamavur was concerned, the sources said a part of works including construction of sub-structure had been completed.\n\nThere was a need to form service road so as to ensure free movement of traffic while undertaking ROB work. The service road would be formed very soon. It had been planned to complete all pending works before January 2017.\n\nNHAI had encountered a number of issues on completing the 84 km work", 
    "section": "national", 
    "title": "Construction of ROB resumes", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}