{
    "author": [
        "B Kolappan"
    ], 
    "text": "When it comes to tapping resources, the DMK seems to be way ahead of other parties in generating income through various means including donations from individuals with its district secretaries striving hard to contribute to the party’s kitty.\n\nData compiled by the Association of Democratic Reforms (ADR) based on information available in public domain shows that the DMK netted Rs. 158.52 crore as income and donations during a five-year period beginning 2010-11. In comparison, the AIADMK was able to generate Rs.119.24 crore during the same period.\n\nSignificantly, among the top three donors to the DMK during the five years are: former Ministers E.V. Velu and T.M. Anbarasan, who were then also secretaries of the party’s Tiruvannamalai and Kancheepuram district units.\n\nAnother top contributor is Madhavaram S Sudarsanam, who is in charge of the DMK’s Tiruvallur district unit.\n\nIn the DMK, district secretaries consider it a prestige to vie with each other to collect and contribute the highest funds to the party, largely to meet election expenditure. In fact, party president M. Karunanidhi earned the moniker ‘Mr. Eleven Lakh’ from the DMK founder C.N. Annadurai at the party’s Virugambakkam conference in 1966-67 for collecting Rs.11 lakh.\n\n“I collected and contributed Rs 7.12 crore between 2010-11 and 2014-15 in my capacity as district secretary of the party,” says Mr.Velu, who had a brief stint as a bus conductor and ticket checker. He has since tried his hands at different things including running a printing press, a transport service and producing films and acting. “I introduced film director V. Sekar and acted in a dual role in Thilagam with actress Gowthami in the lead,” says Mr Velu, who is the founder of the Arunai Engineering College in Tiruvannamalai and a former Minister.\n\nMr. Sudarsanam, a former Government Pleader, who is now the secretary of the DMK’s North-Chennai district after it was bifurcated, says his contribution of Rs 7.12 crore, too was made on behalf of the Tiruvallur district unit of which he was then in charge. He had joined the DMK in 1976 as a student wing leader and was the Madhavaram town unit secretary for 11 years before rising to the level of a district secretary.\n\nLikewise, Mr. Anbarasan, who had contributed Rs.6.04 crore on behalf of the party’s Kancheepuram unit, says this time for the forthcoming Assembly election too he has contributed Rs. 4 crore to the party.\n\nHe hails from a family of weavers and was the Labour Minister in the last DMK government.\n\nIncidentally, DMK leader Karunanidhi had honoured the three at the party’s Tiruchi conference two years ago by presenting them gold rings in recognition of their contribution of party funds.", 
    "section": "national", 
    "title": "DMK ahead in receiving donations, ex-Ministers top contributions", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}