{
    "author": [
        "Special Correspondent"
    ], 
    "text": "An analysis of the total income and total donations received by four major political parties in Tamil Nadu between 2010-11 and 2014-15 has revealed that the DMK and AIADMK have disclosed only a fraction of the donations in their Income Tax Returns (ITR) Report.\n\nAccording to a report by the Association of Democratic Reforms (ADR), despite the fact that the four parties – AIADMK, DMK, DMDK and PMK – have collected nearly Rs. 120 crore from donations above Rs. 20,000, they have declared only Rs. 6.42 crore or 5.34 per cent of the total donations in their ITR reports.\n\n“This shows lack of transparency,” says Sudarsan Padmanabhan, Tamil Nadu State co-ordinator of ADR. The DMK has shown the highest income of Rs. 158.52 crore. The biggest source of income, though, was ‘surplus from specific funds’ through which the party received a whopping Rs. 122.60 crore – constituting 77.34 per cent of its total income.\n\n“The DMK would say it has a strong cadre base and the money was collected through hundials . That is why we need more transparency and auditing,” Mr. Padmanabhan says.\n\nDMK has received Rs. 109.34 crore or 98.71 per cent of its total donations above Rs. 20,000 from individuals. PMK has received Rs. 4.14 crore or 98.81 per cent of its donations above Rs. 20,000 from individuals.\n\nHowever, the AIADMK received the lowest number of donations above Rs. 20,000 with eight donations generating Rs. 4.17 crore. Surprisingly, Vijayakant’s DMDK has received 54.64 per cent of its total donations from corporate/business houses.\n\nWhile 86.24 per cent of the donations received by the DMK are through donations without PAN details, the PMK has not declared PAN details for even a single donor donating above Rs. 20,000. The total amount received through donations where PAN not given is Rs. 100.06 crore. About 75 per cent of the total donations have been made through cash and most of it ahead of the 2014 Lok Sabha elections.\n\nThe Election Commission should impose rules that no part of the Form 24A submitted by political parties providing details of donations above Rs. 20,000 should be left blank, the ADR has recommended, emphasising that the full details of all donors should be made available for public scrutiny under the RTI.\n\nAIADMK, DMK, DMDK and PMK have collected nearly Rs. 120 crore through donations", 
    "section": "national", 
    "title": "Donations: major parties stingy on IT disclosure", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}