{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Debate inconsequential as Assembly elections have been announced, feel some\n\nThe last year of AINRC government has seen many questioning its majority status on more than one occasion. A view of the Puducherry Legislative Assembly.— Photo: S.S. Kumar\n\nEven as it girds up for the Assembly elections scheduled for May 16, clouds of doubt have gathered again over the majority status of the ruling All India NR Congress Government led by Chief Minister N. Rangasamy.\n\nFormed as a break-away from the Congress, Mr. Rangasamy with his supporters launched the AINRC in February 2011. Forming an alliance with the AIADMK, the AINRC faced Assembly polls held in the month of May, 2011 and managed to win 15 seats which is one seat short of simple majority. However with support of an independent candidate V.M.C. Sivakumar, Mr. Rangasamy formed the government leaving his ally AIADMK in the lurch.\n\nSince then the AINRC regime has governed on the crutches of a wafer-thin majority for more than three years though it has encountered frequent disruptions led by the Opposition on the one hand, and dissidence within its ranks of legislators who were denied ministerial berths.\n\nA couple of months ago, independent MLA V.M.C. Sivakumar on whose support the government survived, had met Tamil Nadu Chief Minister and AIADMK supremo Jayalalithaa indicating a wish to join the AIADMK. To this day Mr. Sivakumar has not formally withdrawn the support to the ruling AINRC.\n\nAINRC’s MLA P. Angalane quit the primary membership of the party last week. It is learnt that the MLA has not resigned the post before joining the Congress party on Wednesday and there was no follow up action against him by the AINRC. Explaining the legal provisions, Former Law and Education Minister and senior advocate A. Gandhiraj told The Hindu , “There is no automatic disqualification of the membership of legislature just because he has resigned the primary membership of the party. Legislature party leader or any other competent person should complain to the Speaker of the House who will decide on whether he or she is disqualified.” The office of Speaker also confirmed that it has not received any complaint on defection from anyone.\n\nWhile these developments may be inconsequential for the AINRC regime as Assembly elections have been announced, the last year of governance has seen aspersions cast on its majority status on more than one occasion.\n\nRaising a banner of revolt in September last year, the Government Whip G. Nehru alias Kuppusamy tendered his resignation to protest ‘inordinate delay’ in the announcing of the ruling AINRC candidate for Rajya Sabha poll —the resignation has not been accepted till today.\n\nThe Rajya Sabha elections also brought into the open deep divisions among AINRC MLAs with five party men signing nomination papers proposing former Union Minister S. Jagathrakshakan (DMK) as a candidate to Rajya Sabha poll held in October defying the party leader’s direction. To avert the fall of government, the AINRC president Mr. Rangasamy with support of the AIADMK, fielded his nominee N. Gokulakrishnan as AIADMK candidate.\n\nThough the AINRC defused the crisis, several parties, including the AIADMK began to question the majority status of the Rangasamy government —the AIADMK even taunted the principal Opposition Congress for its failure to bring a no-confidence motion against the ruling government.\n\nMeanwhile, the leaders of the People’s Welfare Front (PWF) have urged the Speaker V. Sabapathy to take action against Mr. Angalane who switched loyalty to the Congress.\n\nCPI unit secretary and PWF convener P. Viswanathan said the strength of the AINRC has now come down from 15 to 14 with the defection of Mr. Angalane to the Congress. However, AINRC maintained that Mr. Angalane is still continuing as AINRC MLA.\n\nHowever, the Congress party sources said the party has been avoiding a no-confidence motion against the government as such a move might have prompted the AIADMK to support the ruling AINRC.\n\n“That would be disadvantageous to us. Moreover there were no adequate numbers on our side for long. Now there is no necessity as the government nears the end of its tenure,” a Congress leader said.", 
    "section": "national", 
    "title": "Doubts over AINRC’s majority status refuse to die down", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}