{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Warning that half of Indian population would face water scarcity by 2030, S. Subbiah, Vice-Chancellor of Algappa University, has called for adoption of modern technology and intelligent planning for judicious use of water and improved waste water management.\n\nSpeaking on the theme ‘Better water – better jobs’ at a function organised by the Department of Industrial Chemistry at the university on the occasion of World Water Day on Thursday, he said that adoption of modern technology and intelligent planning would certainly help effect judicious use of water and improve quality of waste water.\n\nBy 2030, the demand for water would outstrip the supply by 40 per cent, he said, adding it was matter of concern that industries accorded priority to maximising their production rather than turning their attention to efficient use of water.\n\nMore water was used to manufacture a car than to fill a swimming pool, he noted. “All of us depend on water for good health, quality food and sustainable development, but the climate change posed a challenge to agricultural production and food security,” he said, and stressed the need for water conservation and enhanced awareness programmes.\n\nScarce commodity\n\nA. Narayanamoorthy, Professor of Economics and Member of the Syndicate, said that water was considered ‘public hood’ and became a scarce commodity.\n\nAbout 70 per cent of areas in the country would face water problem, he said, citing the Water Stress Index (WSI).\n\nB.J. Pandian, Professor, Tamil Nadu Agricultural University, Coimbatore, said that a huge quantity of water was wasted due to leakage and lavish domestic and business use.\n\nThough it had 17 major river basins, Tamil Nadu was being pushed into a water stress situation, he lamented.\n\nWater market and water footprint should be taught at gross-roots level and everybody should take a pledge to conserve water for sustainable growth, he said.\n\nAbout 300 delegates from various institutions across the country attended the function.", 
    "section": "national", 
    "title": "“Half of Indian population will face water scarcity by 2030”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}