{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Smelling a rat in a Judicial Magistrate here refusing to take cognisance of grave charges levelled against illegal granite miners, despite specific directions issued by it, the Madras High Court Bench here on Thursday referred the issue to the Chief Justice for initiating either contempt proceedings or disciplinary action against him.\n\nJustice P.N. Prakash also directed the Judicial Magistrate, K.V. Mahendra Boopathy, posted at Melur near here, a hotbed of illegal granite mining, to take cognisance of all offences disclosed in the charge sheets filed by Madurai district police in 98 different cases pending before him and commit all those cases to the Sessions Court concerned for trial in accordance with law.\n\n“It is common knowledge that within the territorial jurisdiction of the Judicial Magistrate, Melur, scores of granite quarries are located. It also came to light that hillocks, waterbodies, burial grounds and other government properties were disappearing slowly in the area on account of illegal mining by quarry owners in connivance with police and revenue officials, thanks to political patronage.\n\n“The police made half-hearted efforts by registering First Information Reports under Section 379 (theft) of Indian Penal Code and under the Mines and Minerals (Development and Regulation) Act. Things galvanised when the First Bench of this court took serious note of illegal mining in and around Madurai and appointed a Court Commissioner to enquire into all facets of illegal mining,” the judge said.\n\nIn so far as the present issue was concerned, he said that Justice M.M. Sundresh on July 29 last issued a directive to the judicial magistrate to take cognisance of all offences mentioned in final reports in about three cases. Yet, the Magistrate took cognisance of only the lesser offence under Section 379 which could be tried by him without committing the cases to Sessions Court.\n\nThe State Public Prosecutor brought it to the notice of the High Court, which sought an explanation from the Magistrate on January 21. Replying to it on February 1, the Magistrate justified his action, forcing Mr. Justice Prakash to state: “This court smells a rat in the act of the learned Judicial Magistrate, Melur, in as much as persons involved in illegal quarrying are mining barons, who are no ordinary mortals.”\n\nHe had refused to take cognisance of grave charges against granite miners", 
    "section": "national", 
    "title": "HC recommends contempt proceedings against Magistrate", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}