{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Narain Karthikeyan interacting with CISF personnel at the airport in Coimbatore.\n\nIndia’s first Formula One racer Narain Karthikeyan on Wednesday spent 90 minutes with Central Industrial Security Force (CISF) personnel at the Coimbatore International Airport.\n\nHe motivated them by answering their queries.\n\nAccording to him discipline was the most important factor for sportspersons and uniformed services personnel. He said that there were many similarities between sportspersons and those in uniformed services.\n\nMr. Karthikeyan said one should sacrifice something to achieve something better. He recalled how he had to lose weight without affecting his health to make up the increase in the weight of his vehicle, for better performance. He elaborated on the importance of teamwork, comradeship, and focus.\n\nIn an interactive session he told them the efforts he took and sacrifices he made to become an achiever.\n\nCISF personnel are usually denied permission to carry mobile phones inside the airport. But as a rare case they were allowed to do so to take a ‘selfie’ with the ace racer.\n\nCISF Deputy Commandant and Chief Airport Security Officer, Ashish Kumar, said that the event was in line with similar motivational programmes which were being organised in other parts of the country.\n\nRecently, Indian cricket captain Mahendra Singh Dhoni interacted with CISF personnel at the New Delhi and Ranchi airports, while former world chess champion Viswanathan Anand motivated personnel at Chennai.\n\n“Most of the personnel are from other States and are living away from their families. Such programmes will motivate them to discharge their duty better,” Mr. Ashish Kumar added. Apart from organising cultural programmes, the CISF personnel presented him with a memento.", 
    "section": "national", 
    "title": "He shares his formula for success", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}