{
    "author": [
        "Special Correspondent"
    ], 
    "text": "An integrated cancer centre with state-of-the-art technology, supported by experts, is to be launched at Vadamalayan Hospital here.\n\nSpeaking to media persons here on Thursday, Hospital Managing Director Pugalagiri said that the founder of the hospital, P. Vadamalayan, who was an excellent surgeon and enthusiastic teacher, died of cancer.\n\nThe hospital, started as a small clinic with 10 beds, had served people in this region for the last 59 years and emerged as a speciality hospital with 250 beds.\n\nIn a bid to bring down treatment cost and minimise waiting period for patients travelling to metro cities, the hospital had proposed to establish the integrated cancer centre.\n\nAdyar Cancer Institute (Chennai) chairperson V. Shanta would dedicate the facility at a function at Rajah Muthiah Mandram on Saturday, he said.\n\nMany people, irrespective of age and sex, suffered a lot from cancer, mostly due to late diagnosis or, sometimes, wrong diagnosis.\n\nUse of technology and equipment such as linear accelerator with Rapidarc, handled by a team of experts, would not only help in early diagnosis, but also in starting treatment immediately and ensuring quality of life, he added.\n\nThe day-care oncology care centre at Vadamalayan Hospital, first of its kind in south Tamil Nadu, would be yet another step towards cutting treatment cost.\n\nIt was a practice followed in the western countries, wherein the patients would be treated as outpatients without being hospitalised.\n\nThe hospital also had plans to conduct counselling-cum-awareness sessions at colleges to disseminate preventive aspects with regard to cancer, said consultant oncologists D. David Praveen Kumar, S. Alagu Ganesh and S. Sowmya Prithiviraj.\n\nThe day-care oncology care centre to be yet another step towards cutting treatment cost", 
    "section": "national", 
    "title": "Integrated cancer centre at Vadamalayan Hospital", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}