{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Is tuberculosis contributing to more diabetes in Chennai? The early results of an ongoing study seem to indicate this may be the case, said researchers.\n\nOf 209 patients with pulmonary tuberculosis who were studied, 54.1 per cent were diabetic, and 21 per cent were pre-diabetic. Of these, newly-diagnosed patients with diabetes – 32.7 per cent -- had low HbA1C levels, indicating that they may have been pre-diabetic earlier and their tuberculosis infection probably pushed this into full-blown diabetes, said Vijay Viswanathan, head, M.V. Hospital for Diabetes, Royapuram, and one of the co-principal investigators of the study.\n\nThe ‘Effects of Diabetes on Tuberculosis Severity’ (EDOTS) study, was begun in early 2014, and is a collaboration between the University of Massachusetts Medical School and the Prof. M. Viswanathan Diabetes Research Centre. The National Institute of Research in Tuberculosis is involved in the immunology portion of the study.\n\nThe early results of this study have surprised researchers. “Previous reports had indicated a diabetes prevalence of about 25 per cent in TB patients and about 10-22 per cent in the general population in and around Chennai. So, the steep increase in prevalence is both surprising and a major cause for concern,” said S. Subash Babu, scientific director, National Institutes of Health -National Institute of Research in Tuberculosis-International Center for Excellence in Research.\n\nThe data, said Hardy Kornfeld, professor of medicine at the University of Massachusetts Medical School, “suggest that becoming sick with TB can push people from pre-diabetes into a diabetic range of high blood sugar”.\n\nHowever, Prof. Kornfeld, also a co-principal investigator of the study, pointed out that these were only interim results and that the study was ongoing.\n\n“An important question that we hope to answer in the future is whether patients who progress from pre-diabetes to diabetes as a result of TB will revert to pre-diabetes or normal blood sugar after TB treatment or if some of them will be left persistently diabetic,” he said, in an email.\n\n“We know that diabetic patients are vulnerable to tuberculosis. This study was initiated to determine if, when a patient who had TB and was on treatment contracted diabetes, would this be a problem in his cure?” said Dr. Viswanathan. He explained that an earlier study had shown that treatment failure rates of tuberculosis patients were higher if they had poorly-controlled diabetes.\n\nChennai is estimated to have a diabetes prevalence of 18.5 per cent, Dr. Viswanathan said. The city’s prevalence of smear positive TB is 228 per 100,000, said Dr. Babu.\n\nIf patients with pre-diabetes are becoming diabetic due to TB, and, as is known, diabetes increases the severity of TB, more public health efforts may need to be focused in this direction, the researchers say.\n\n“The TB control programme now needs to concern itself with screening for diabetes in all its patients and instituting appropriate diabetic treatment to ensure good TB control. Bidirectional screening for TB and diabetes, especially at TB centres, becomes a priority in this case,” said Dr. Babu.\n\nAnd diabetes too: “I would say that our current findings provide another justification to focus limited public health resources on diabetes prevention,” said Prof. Kornfeld.", 
    "section": "national", 
    "title": "‘Is TB leading to more diabetes’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}