{
    "author": [
        "Staff Reporter"
    ], 
    "text": "“We are not worried about the number of seats going down for the allies as a fall out of the People’s Welfare Front’s (PWF) aligning with Desiya Murpoku Dravida Kazhagam (DMDK),” said senior Communist Party of India (CPI) leader R. Nallakannu here on Thursday.\n\nHe said that their goal was to defeat the common enemy at the centre (Congress and Bharatiya Janata Party) and two Dravidian parties in Tamil Nadu.\n\nState ruined\n\nHe accused them of having ruined the State in the last 50 years.\n\nMr. Nallakannu was addressing reporters here on Thursday after meeting Udumalpet honour killing victim Shankar’s wife Kausalya at the Coimbatore Medical College Hospital.\n\nHe said that the AIADMK was their only competitor and the chance for PWF emerging victorious had strengthened after the poll pact with the DMDK.\n\nMore parties\n\nHe said that their alliance leaders were holding talks with leaders of a few other parties, including the Tamil Maanila Congress, to join the alliance.\n\n“Neither Vijaykant nor PWF leaders called it Vijaykant’s alliance,” he said while responding to a question.\n\nHe added that the leaders were working on a revised manifesto. Introducing a new Bill against honour killings will be a part of it.\n\nOn his interaction with Kausalya who was in the intensive care unit, he told reporters that he did not bother the girl by asking questions about the incident that is haunting her.\n\nCash given\n\nThe CPI leader appreciated her for boldly cooperating with the investigations, and gave her Rs. 30,000 as assistance on behalf of Tamil Nadu Odukapattor Valvurimai Iyakkam.\n\n“The incident has put Tamil Nadu to shame as it is the 81st such killing in three years,” he said.\n\nHe felt that it could have been avoided, if the police had taken action on petitions from the victim’s family on threats from the Caste Hindu family of the girl.\n\n“The hirelings indirectly gained confidence due to inaction of the police,” he added.", 
    "section": "national", 
    "title": "Our goal is to defeat common enemy, says CPI", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}