{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Election Commission has allotted a reserved symbol of the “Mango” to the PMK and the letter of allotment was handed over to party president G.K. Mani on Thursday.\n\nThe PMK has contested on the “mango” symbol since 1998 and was allotted the same this time around as well. The party already has the symbol in Puducherry where it is a recognised party.\n\nThe Janata Dal (United), Lok Jan Shakti Party, National People’s Party (Meghalaya), Shiv Sena and Jharkhand Mukti Morcha were among those allotted other reserved symbols. Besides, 10 other parties were allotted common symbols for the upcoming polls.\n\nIn keeping with its plan to have a paper trail of votes, the Election Commission has identified 17 constituencies in Tamil Nadu and three in Puducherry where the EVM will provide such a facility.\n\nThe 17 constituencies are Anna Nagar, Vellore, Krishnagiri, Salem (North), Erode (West), Tirupur (North), Coimbatore (North), Dindigul, Tiruchi (West), Cuddalore, Thanjavur, Kancheepuram, Villupuram, Madurai (East), Thoothukudi, Tirunelveli and Kanyakumari.\n\nThe three constituencies identified in Puducherry are Oupallam, Orleanpet and Karaikal South, according information available on the Election Commission website. A total of around 4,400 polling booths across Tamil Nadu and Puducherry are likely to have this facility.\n\nSurrender of arms\n\nMeanwhile, people with licensed arms have started surrendering their arms as per Election Commission norms. So far, 18,788 arms have been deposited to the local police stations across the State, Chief Electoral Officer Rajesh Lakhoni said.\n\nThe surveillance teams enforcing the Model Code of Conduct have seized $6,171, over 200 mobile phones, nine washing machines, solar lamps, 700 detonators, 45.50 kg of silver jewellery among other items till March 22, a press release said.\n\nThe party has contested on\n\nthe ‘mango’\n\nsymbol\n\nsince 1998", 
    "section": "national", 
    "title": "PMK allotted ‘mango’ symbol for 2016 polls", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}