{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Examination of 11 witnesses – all police officers – commences\n\nPrincipal District and Sessions Court Judge R. Poornima adjourned the trial in the temple pujari suicide case till March 30 as the Special Public Prosecutor (SPP) sought to remove the names of four police officers from the list of witnesses and include them in the list of accused on Thursday.\n\nExamination of 11 witnesses – all police officers – commenced in the court here in the morning. Two police constables, Palpandi and Selvam, Special Sub-Inspector Pichaimani, Inspectors Ilangovan, Anand, Chellapandi and Muthu Kumar, DSPs Sethu and Uma Maheshwaran and ADSPs Uma (retd) and Selvaraj were present. All the accused, including O. Raja, brother of Finance Minister O. Paneerselvam, were produced before the court.\n\nAfter examining constable Selvam and Inspector Anand, SPP B. Mohan sought to treat them as hostile witnesses. The court accepted it. Later, Mr. Mohan filed a petition seeking removal of the names of four police officers – ADSP (retd) Uma, DSP Sethu, Inspectors Ilangovan and Chellapandian – from the list of witnesses and their inclusion in the list of accused.\n\nHe said that they did not register the case under the PCR Act, and acted in favour of the accused. They should be included in the charge sheet, he stressed.\n\nDefence counsel M. Kannappan, however, argued that the SPP had no locus standi to file a petition to remove the names of the police officers from the list of witnesses and add them in the list of accused.\n\nThe Judge adjourned the case till March 30 to enable the defence counsel to file a counter. With the filing of the petition, the court could not examine other police officers.\n\nOut of the 61 witnesses, 20 have so far been examined and cross-examined. Five witnesses have turned hostile in the case.\n\nThe case pertains to the suicide of S. Nagamuthu (22) of T. Kallupatti village, a Dalit, who worked as pujari in Sri Kailasanathar Hill Temple in Periyakulam, on December 8, 2012, after he was allegedly subjected to harassment.", 
    "section": "national", 
    "title": "Pujari suicide case: SPP wants four police officers treated as accused", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}