{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Ministry of External Affairs issues circular; to come into force from April 1\n\nFrom April 1, the passport authorities would not accept ration cards as a legitimate document for either proof of address or identity purposes.\n\nThe Ministry of External Affairs, in a circular issued to all Passport Seva Kendras, had informed that the passport applicants could, however, submit other documents including water tax receipt, electricity bill consumption receipt, telephone (landline or mobile phone) receipt, Election Photo Identity Card, IT return and LPG refill receipt as proof of address or identity purpose for obtaining passport.\n\nRecently, the Union Ministry of Food, Public Distribution System and Consumer Affairs had in an order stated that the ration cards should not be used as a document.\n\nHence, the Ministry of External Affairs had decided to dispense with the document.\n\nThe authorities had also detected a pattern of some applicants applying for non-ECR (Emigration Check Required) passports by enclosing income tax returns by remitting meagre sums like Rs. 100, Rs. 200 and Rs. 300 as income tax and claiming themselves eligible to get non-ECR passports.\n\nTo ensure that illiterates did not fall prey to the designs of unauthorised “agents” who attempted to engage such gullible labour class population to overseas employment, the Ministry had decided to dispense with such methods.\n\nRegional Passport Officer S. Maniswara Raja said on Thursday that the Ministry had issued the circular and it would come into force with effect from April 1.\n\nAppeal\n\nMeanwhile, he appealed to the applicants to check the website for any clarification with regard to obtaining passports or other related issues. The PSK staff would guide them in the right direction, he added.", 
    "section": "national", 
    "title": "Ration card no more an address proof for passport", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}