{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“Our ultimate objective is to achieve cent per cent polling in the district”\n\nDistrict Collector M. Karunakaran has directed his subordinates, particularly the Returning Officers of all 10 Assembly segments in the district to convene weekly review meetings on the awareness programmes being conducted in their area for achieving 100 per cent polling in the May 16 Assembly polls.\n\nAddressing a meeting held at the Collectorate on Thursday, Dr. Karunakaran said Returning Officers of all 10 constituencies in the district should conduct weekly meetings to review voter awareness programmes conducted in the areas falling under their jurisdiction and also the events to be organised during the next week. The heads of all educational institutions should be instructed to issue the ‘voter awareness pledge’ pamphlets to the students, who in turn should obtain their parents’ signatures in the pamphlets and submit it back to the teachers concerned.\n\n“The temple festivals and other events where people gather in large numbers should be utilised for distributing voter awareness pamphlets and erecting awareness flex boards. Self-Help Group members should be roped in for conducting voter awareness rangoli competitions. School and college students should be involved in awareness events and the Returning Officers should ensure screening of voter awareness messages in all cinema halls in the district,” Dr. Karunakaran said.\n\nElocution and essay competitions should be conducted for school and college students on the need for casting votes without fail. All village panchayats should keep voter awareness flex banners in every village under their jurisdiction, the Collector said.\n\n“Our ultimate objective is to achieve cent per cent polling in our district,” Dr. Karunakaran said.\n\nAssistant Collector (Training) K.P. Karthikeyan, District Revenue Officer M.G. Kulandaivel, Revenue Divisional Officers P. Fermi Vidhya of Tirunelveli, Venkatesh of Tenkasi and senior officials participated in the meeting.", 
    "section": "national", 
    "title": "Returning Officers asked to review voter awareness initiatives", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}