{
    "author": [
        "Deepa H"
    ], 
    "text": "As parties have been finalising candidates and firming up alliances, small parties and organisations have been thronging party offices extended their “unconditional support.” Termed thozhamai katchis (friendly parties), they knock at the doors of the larger parties including AIADMK, DMK and PMK and meet leaders with letters of support.\n\nWhile some seek a ticket to contest the polls, others bring demands from back home and yet others come only to thank the party for the kindness shown in the past. They become suddenly busy as election approaches.\n\nM. Ethirajan, State secretary, Revolutionary Socialist Party (Marxist – Leninist), Tamil Nadu, who met senior leaders at the AIADMK office in Royapettah, wanted a law college in Villupuram district. “Our stronghold is in the Ulundurpet- Tiruvannamalai belt and we have been supporting the AIADMK since 2001,” he said.\n\nNot all have a history though. Some are very new organisations or have just a handful of members. The Karur-based Dr. Ambedkar Makkal Nalasangam, whose leader P. Vali expressed happiness over distribution of loans to cobblers in his area, expressed his wish that AIADMK general secretary Jayalalithaa be made the permanent Chief Minister.\n\nThere are those like Mannai Gunasekaran of Tamil Nadu Muvendar Sena, who came to give a piece of advice to the party – strengthen weak pockets. The DMK too has been receiving support from organisations. DMK leader M. Subramanian said the number had crossed over 500 and it was still growing.\n\n“The parties include Hindu Adhiradi Padai, Christhuva Makkal Iyakkam, Vettuva Gounder Sangam, Dalit Kootamaippu. They offer support only when they believe that our party will win and that we will do some good for them,” he said.\n\nP. Ramajayam, Assistant Professor, Centre for Study of Social Exclusion and Inclusive Policy, Bharathidasan University, says such associations come because they crave political recognition. “When the party they support comes to power, they will benefit from that. For the parties to whom they offer support, their numbers, though small might come handy definitely in the local body elections,” says Mr. Ramajayam\n\nThey knock at the doors of AIADMK, DMK and PMK with letters of support", 
    "section": "national", 
    "title": "Smaller parties eager to lend support", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}