{
    "author": [
        "Special Correspondent"
    ], 
    "text": "NOVEL EFFORT:Students of University College of Engineering at Pullangudi near Ramanathapuram forming a ‘Vote 100 per cent’ model on Thursday.— Photo: L. Balachandar\n\nStudents of University College of Engineering at Pullangudi near here formed a ‘Vote 100 per cent’ model on the college premises, and pledged to discharge their democratic duty by exercising their franchise in the May 16 Assembly elections.\n\nParticipating in the Systematic Voters’ Education and Electoral Participation (SVEEP), launched by election authorities, the students of the college formed the model on Thursday to create awareness of the importance of cent per cent polling in the four Assembly constituencies in the district.\n\nDistrict Election Officer and Collector S. Natarajan, who visited the college, administered the voters’ pledge to the students to take part in the electoral process. The students also pledged to prevail upon the voters in their areas to cast their votes.\n\nAddressing the students, the Collector said that the students played a major role in the country’s development and wanted them to exercise their franchise in the elections. All those who had completed 18 years as on January 1 were eligible to vote, and they should ensure that their names figured in the electoral roll and get the Electors Photo Identity cards, he said.\n\nRevenue Divisional Officer Rampradeepan and College Principal Chithiraivel were present.\n\nLaunching the SVEEP activities in Parthibanur and Kamudhi areas on Wednesday, Mr. Natarajan addressed the general public and stressed the importance of participating in the electoral process. He visited primary health centres in Parthibanur and Kamudhi and distributed election awareness pamphlets to those who visited the centres.", 
    "section": "national", 
    "title": "Students’ bid to ensure cent per cent voting", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}