{
    "author": [
        "R Sujatha"
    ], 
    "text": "He and another man are accused of creating ruckus; parents protest arrest\n\nThe police have arrested two persons, including the students’ union chairman of Dr. Ambedkar Government Arts College, Vyasarpadi, on charges of creating a ruckus in the college after consuming alcohol on Wednesday.\n\nThe two have been booked under various sections of the IPC and Section 4 of Tamil Nadu Prohibition of Harassment of Women Act, 1998.\n\nAccording to M.K.B. Nagar police, College principal Chandra lodged a complaint at the station alleging that Lenin and Hariharan, a former student, barged into the college, created a ruckus and harassed some women.\n\nThe police claim that the complainant had said that the duo was drunk.\n\nBased on the complaint, the police arrested Lenin and Hariharan.\n\nOn Thursday, parents of the students approached the principal requesting her to withdraw the complaint. The police intervened and sent them away.\n\n“The college has declared holidays from Sunday to avoid any problems due to the arrest of the students’ union head,” said a police source.\n\nWhile college authorities refused to respond to queries citing the Election Code of Conduct, the Director of Collegiate Education K. Sekar confirmed that the college had sought police assistance.\n\nOn being informed that on Thursday, parents who protested in front of the college against the arrest were detained, Mr. Sekar told The Hindu that the regional joint director would be deputed to inspect the college.\n\nA senior professor and former principal of the college said the issue could have been resolved had the college initiated a dialogue with the parents and students instead of confronting them.\n\nMost of the students of the college were from poor socioeconomic background and struggle to make it to college, the professor added.\n\n“The college does not have enough faculty and often first year students have more free periods than classes leaving them at a loose end,” the professor said, adding that Tasmac shops were in the vicinity of the college.\n\n“We are lenient when students have insufficient attendance. Most come from single-parent families and work part-time. During the wedding season in Thai , attendance drops significantly as students work at marriage halls to pay their semester fees. When students with low attendance are fined, some of us pool money and pay for them,” he said.\n\n(With inputs from Vivek Narayanan)\n\nDirector of Collegiate Education says college had sought police assistance", 
    "section": "national", 
    "title": "Students’ Union head of Ambedkar Arts College held", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}