{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Patient was put on heart-lung machine and body temperature kept at 15{+0}C for an hour\n\nSenior interventional cardiologist A. B. Gopalamurugan (left) showing the graft used by senior cardiac surgeon V. V. Bashi (centre) on patient Prashant Ganesh Bhoge at SIMS hospitalin Chennai on Thursday.— Photo: R. Ravindran\n\nA rare cardiac surgery was performed at SIMS Hospital, Vadapalani, to treat aneurysm of the aorta, the largest blood vessel that carries blood to the brain and the body.\n\nPrashant Ganesh Bhoge, a 47-year-old clerk at the zilla parishad office in Jalgaon district, had been diagnosed with a torn aorta around four-and-half years ago. Doctors in Jalgaon sent him to Mumbai where he underwent surgery to set right the problem.\n\nA few months ago, he began experiencing severe back pain, and this time his doctor referred him to cardiac surgeon V.V. Bashi of SIMS Hospital, here.\n\nMr. Bhoge was admitted to the hospital on March 6 after which he was evaluated at the Institute for Cardiac and Advanced Aortic Disorder of the hospital by a team headed by its director Dr. Bashi, senior interventional cardiologist A.B. Gopalamurugan and senior cardiac anaesthetist Aju Jacob. A surgery was advised as the aortic aneurysm could rupture leading to death.\n\n“In western countries, a readymade graft called frozen elephant trunk graft is used to do this procedure. It is not yet available in India. We modified the technique using graft available here,” said Dr. Bashi, who led the surgery.\n\nMr. Bhoge had undergone a surgery in Mumbai only to control a small portion of the damage, but the entire aorta had suffered an aneurysm.\n\n“It is a difficult surgery and requires a lot of experience. Tackling the entire aorta requires putting the patient on a heart-lung machine and cooling the body temperature to 15 degree C for an hour but maintaining normal blood supply to the brain,” Dr. Bashi explained. The normal body temperature is 37 degree C.\n\nThe doctors made two incisions in the groin and connected the patient to the heart-lung machine.\n\nAfter replacing the upper arch of the aorta with a Dacron graft, Dr. Gopalamurugan simultaneously placed a graft on the descending arm of aorta. Dr. Bashi said the procedure could cost as much as Rs. 25 lakh abroad. It was performed here at half the price.\n\nWhile the Dacron graft for the upper arch is priced around Rs. 12-16 lakh, the endovascular graft for the descending aorta costs Rs. 5 lakh in India. Mr. Bhoge, who will be discharged in a couple of days said: “I am happy I came here for treatment. The doctor is an angel who has helped me live. I am only in my 40s and have a lot of dreams. Now, I can return to work and realise them.”", 
    "section": "national", 
    "title": "Surgeons replace diseased aorta with twin grafts", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}