{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Doctors call for roping in more stakeholders to root out the disease\n\nThe numbers may be satisfactory, but the challenges in tuberculosis control remain in the form of Multi-Drug Resistant Tuberculosis (MDR-TB) and HIV-TB, say doctors.\n\nAs another World TB Day (March 24) went by, the stress is not only on increasing awareness, early diagnosis, ensuring patient compliance to treatment but also on roping in more stakeholders to put a full stop to TB, according to Raja Sivanandam, deputy director of medical services (TB), Vellore.\n\nThe theme for this year’s World TB Day – Unite to End TB – also focuses on this aspect.\n\n“We need to join hands with more stakeholders – private sector and NGOs. Private hospitals should inform the government on the number of TB cases they have diagnosed and are handling. Such a single point of system will help in quantifying the number of cases in the community and assess the future scenario,” he said.\n\nNGOs, on their part, could help by extending socio-economic, nutritional and psychological support to patients, he added.\n\nOn an average, there are 5,700 TB cases getting detected in the district every year. The district, for the last seven years, has been achieving above the basic parameters in TB control. Its case finding rate is 73 per cent (ideal parameter is 70 per cent), sputum conversion rate at the end of two months of treatment is 91 per cent (90 per cent) and cure rate is 87 per cent (85 per cent).\n\nDoctors said the parameters are satisfactory but the challenges pose a threat to the control programme.\n\n“MDR-TB is more rampant as the bacteria mutates as many patients do not take treatment properly. Patients start on treatment, but compliance is a problem. Though the drugs are less, in MDR-TB, patients need to take 10 to 16 tablets every day, besides injections for duration of two years,” said Priscilla Snahalatha Swamickan, senior medical officer, Drug Resistant TB Centre.\n\nIt becomes more difficult if there are co-related diseases such as diabetes, HIV and hypertension, she added.\n\nAll MDR-TB patients are admitted to a special ward – MDR TB ward - on the campus of Government Vellore Medical College Hospital. There are 117 patients with MDR TB and 298 HIV TB in the district.\n\nStill, early diagnosis continues to be a challenge in TB control. “This is because there is low risk perception among people. People also do not report early due to stigma in the community,” Dr. Sivanandam added.\n\nHe pointed out that people should understand that TB is 100 per cent treatable and curable if patient takes drugs for six to eight months.\n\nCounselling can play a crucial role in enabling patients to understand the disease and the risk factors, observed Devarajulu Reddy, scientist ‘B’, National Institute for Research in Tuberculosis, Chennai.\n\n“Patients should be counselled and told that smoking, alcohol are risk factors. Loss of appetite is a main worry for patients, and we should explain to them the need for a nutritious and healthy diet,” he said.\n\nWhile Kerala has started to provide nutritious food free of cost to patients and their family members, he wondered why other States have not made such a policy decision. “People should be told not to be afraid of the disease,” he added.", 
    "section": "national", 
    "title": "TB in check, but challenges remain", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}