{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Project expected to be over in nine months\n\nWhile the Water Resources Department has started rejuvenating reservoirs that are vital to Chennai’s water supply system, water experts and non-governmental organisations (NGOs) observe there is a need for a comprehensive action plan to protect urban waterbodies.\n\nWork has been initiated to improve the reservoirs in Poondi, Cholavaram, Red Hills and Chembarambakkam at a cost of Rs.13 crore.\n\nSources in the WRD said that the project would include works to strengthen the bund, install flood warning system and repair sluice gates of these reservoirs.\n\nAdditional funds needed\n\nThough additional funds are needed to restore these waterbodies that were damaged in the floods, steps are being taken carry out part of the repairs within the project cost.\n\nThe work is expected to be completed in nine months.\n\nHowever, experts note that the recent deluge that dealt a major blow to the city has taught bitter lessons about the need to rejuvenate waterbodies and waterways.\n\nAccording to records of WRD, the area of 19 major lakes on the city’s periphery has shrunk to about 700 hectares over the past few decades.\n\n‘Storage reduced’\n\nArun Nedunchezian of Public Forum of Water, who organised a water walk along Chennai reservoirs recently, said that the storage in the lakes had already reduced to 66 per cent of their capacity.\n\n“We have lost resources of nearly 30 thousand million cubic feet (tmcft) during the floods. This would have fulfilled three years’ of drinking water demand if we had adequate, well-maintained lakes. Waterbodies fall easy prey to sand mining and encroachments,” he said.\n\nThe Forum is now campaigning on the need to conserve waterbodies and the right to free drinking water. Creation of percolation ponds or farm ponds would also help in storing water that otherwise gets into the sea, note experts.\n\nAccording to P. M. Natarajan, former director-Centre for Climate Change, Periyar Maniammai University, Thanjavur, last year’s torrential rains led to floods to the tune of 75 tmcft in three months and hardly 20-25 tmcft was harnessed in the city water bodies.\n\n“It may be difficult to create new resources now. The government must support creation of percolation ponds or farm ponds to recharge groundwater in urban areas and provide sustainable livelihood to farmers in other districts,” he said.\n\nCreation of percolation ponds or farm ponds would also help in storing water that otherwise gets into the sea, note experts", 
    "section": "national", 
    "title": "Work on sprucing up reservoirs starts", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}