{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector K. Palanisamy giving away prize to a winner in Nagapattinam on Thursday.\n\nWith the availability of advanced treatment, all-out effort should be taken to eradicate tuberculosis in the district, said K. Palanisamy, District Collector.\n\nSpeaking at a function organised by the Health Department to mark observance of World Tuberculosis Day on Thursday, Mr. Palanisamy said that people afflicted with the disease or their relatives should be freed of any apprehension as the disease was curable.\n\nThe Collector referred to the special drive launched by the State government in eradicating the disease.\n\nThe Collector advised officials to do everything to encourage the Health Department personnel.\n\nGurunathan, Deputy Director of Health (Medical Services), and Veerakumar, Deputy Director (Tuberculosis), and Senthilkumar, Hospital Superintendent, were present.\n\nLate, the Collector inaugurated a signature campaign on “eradication of tuberculoses”. He distributed prizes among winners in competitions held as part of the observance of the day.\n\nTHANJAVUR: At a similar function at Thanjavur, N. Subbaiyan, District Collector, said that as many as 2,000 persons have been affected by tuberculosis in the district and prompt treatment was being given to all of them for early cure.\n\nHe appealed to the people to extend their cooperation and support to the patients, imbibing a sense of confidence about the recovery. K. Pitchai Balasubramanian, Dean of the Mirasdar Government College and Hospital, Subramanian Jayasekar, Joint Director of Health and Rural Services were present.\n\nEarlier, the Collector distributed pamphlets on eradication of TB and also gave away prizes to winners in various competitions held as part of the observance of the day.", 
    "section": "national", 
    "title": "World TB Day observed in Nagapattinam, Thanjavur", 
    "subsection": "tamilnadu", 
    "date": "2016-03-25"
}