{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Two months after launching sea turtle conservation project, Gulf of Mannar Marine National Park released the second batch of 135 hatchlings into the sea after shifting more than 2,400 turtle eggs into its hatchery at Muhuntharayar Chathiram near Dhanushkodi on Sunday.\n\nAfter the nesting season began in December, the National park, which had launched the project under Tamil Nadu Biodiversity Conservation and Greening Project, established two artificial hatcheries in Dhanushkodi and Opilan, covering the 90-km-long coastline from Arichalmunai to Mariyur.\n\nThe watchers and special turtle walkers deployed under the project had collected 2,459 eggs after identifying 20 nests and shifted them to the hatchery in Dhanushkodi and another 757 eggs to the hatchery in Opilan, S. Ganesalingam, Forest Range Officer, said.\n\nThey had released hatchlings from two beds, set up on January 11 and 16 in the Danushkodi hatchery, he said, adding 48 hatchlings were released from 52 eggs hatched at the first bed last week, and 135 hatchlings from 140 eggs in the second bed. “The high survival rate was very encouraging,” he told The Hindu .\n\nR. Sivakumar, an anti-poacher who supervised the release of the hatchlings on Sunday, said that 65 eggs kept in the third bed on January 18 were expected to be hatched anytime Sunday night and they would be released into the sea at the early hours of Monday. The eggs take 40 to 50 days for hatching, he added.\n\nThe hatching would go on till the middle of May and “we are expecting high survival rate this year,” Deepak Bilgi, Wildlife Warden, said.\n\nLast year, they collected about 950 eggs and achieved a survival rate of just over 50 per cent,. This time, they collected more eggs after successfully protecting them from predators, he added.", 
    "section": "national", 
    "title": "135 turtle hatchlings released into sea", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}