{
    "author": [
        "Dennis S"
    ], 
    "text": "The assault of a teenager from Kannagi Nagar on Saturday by the police, who mistook him to be a suspect in a mobile phone theft case, has come in for sharp criticism by the civil society, including child and human rights activists and forums.\n\nAccording to National Human Rights Commission member Justice D. Murugesan, only members of the Child Welfare Committee (CWC) can question children in such cases and not the police.\n\nExplaining the procedure to be followed in such cases, he says, “I am not aware of the incident. But in cases like these, the children have to be taken to CWCs, which would help in the investigation through the Juvenile Justice Board. Police should never adopt third degree methods.”\n\nThe police action was in violation of the Protection of Children from Sexual Offences Act (POCSO Act), 2012, contends retired judge of Madras High Court Justice K. Chandru. “The police have also not followed the D.K. Basu case guidelines. Even if the accused is a major, these guidelines have to be followed,” he says.\n\nPeople’s Union of Civil Liberties general secretary V. Suresh feels there was systematic stereotyping by the police of areas like Kannagi Nagar linking them with crime.\n\nAlleging that the State police was notorious for “beating up first and asking the accused later,” Mr. Suresh said all police stations maintained a Known Depredator list and picked up certain youth from them every time a crime happened in that area. “When they are picked up repeatedly for crimes which they have not committed, the youth are pushed to join gangs,” contends Mr. Suresh.\n\nChild rights activist A. Narayanan of CHANGE India urges for the removal of all police personnel involved in the custodial torture. A State-level Nodal Officer of Special Juvenile Police Units should be nominated and details of child welfare officers of all police stations and members of Special Juvenile Police Units must be uploaded in the Police Department’s website.\n\nFormer Child Protection Specialist of UNICEF R. Vidyasagar says the police had no right to take the boy to the station.\n\nThe residents of Kannagi Nagar have been constant targets of suspicion in crimes. “The moment we say we are from Kannagi Nagar, we are looked at with suspicion. It becomes even more difficult for us to find jobs and earn a decent livelihood, as they think we are criminals,” claims Annadurai, a resident.\n\nChild rights activist Deveneyan from Kannagi Nagar says, “On one hand, they don’t provide them with proper basic facilities, because of which most end up as dropouts, jobless and some turn into hooligans. Targeting them is modern day discrimination.”\n\nTwo months ago, Muthumari, a parent from Kannagi Nagar whose juvenile son was arrested, complained that residents were randomly picked whenever a crime was reported.\n\nKancheepuram District Child Protection Officer Ekambaram said they were conducting an inquiry and would soon take action against the guilty.\n\nA senior police officer said a probe had been ordered into the incident and once the report was submitted, action would be taken on merits.\n\n“In cases like these, the children have to be taken to the Child Welfare Committee”", 
    "section": "national", 
    "title": "Activists slam police for assaulting teenager", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}