{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Officials inspect Animal Birth Control Centre after four dogs die post surgery\n\nThe Animal Welfare Board of India on Friday inspected the Animal Birth Control (ABC) Centre of Greater Chennai Corporation following reports that four dogs died at the facility as a result of post-operative complications. The team will submit a report on its findings shortly.\n\nA few animal welfare activists reported the death of four dogs at the facility in Lloyds Colony on Thursday, alleging that the Corporation had been violating rules pertaining to animal welfare.\n\nAnimal welfare activist S. Muralidharan said, “A resident who went in search of dogs that had been picked up from his street found four dog carcasses. Two of them were those of the animals trapped from his street. And he led a protest,” said Mr. Muralidharan.\n\n“The Corporation had also trapped 54 dogs from Marina Beach ahead of Republic Day. All these dogs are missing. When asked about the fate of these dogs, they do not have an answer,” he said.\n\nFollowing a social media campaign, more than 30 animal welfare activists gathered on Friday and lodged a complaint with the police.\n\nThese animal welfare activists alleged that the ABC centres of the Corporation at Basin Bridge, Lloyds Colony and Kannamapet were not being maintained properly.\n\nAfter spotting puppies at the ABC centres, the activists asked officials not to trap pregnant dogs for birth control programmes. Animal Birth Control procedure is performed on over 30 dogs every day at the facilities of the Corporation.\n\nSome activists alleged that the dogs were being starved to death at the facility.\n\n“The veterinary doctors started providing food to the dogs only after the protest,” said Mr. Muralidharan.\n\nGreater Chennai Corporation officials said certain NGOs were trying to take over the ABC centres again by claiming that the facility was not maintained properly.\n\nThe Corporation took over operations of ABC centres following complaints about NGOs that were carrying out animal birth control in the city.", 
    "section": "national", 
    "title": "Animal welfare activists fume", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}