{
    "author": [
        "Aditi R"
    ], 
    "text": "Two men on motorcycle snatch woman’s gold chain\n\nIt was around 7.30 p.m. on Friday when Bhuvaneshwari and her son were heading home on their scooter on 10th Avenue Road in Ashok Nagar. She had gone to a nearby shop to buy a birthday cake for her son. Suddenly, two men on a speeding motorcycle, both wearing helmets, hit her on her back and snatched her gold chain.\n\n“I could not see where they came from, as it was dark. They snatched my gold chain weighing five sovereigns and fled,” said Ms. Bhuvaneshwari, who later lodged a complaint at the nearby police station.\n\n“Poorly lit streets are one of the main reasons for such incidents,” said a police official from R3 Ashok Nagar police station. “We have been constantly receiving complaints of eve teasing and theft from people living in that area,” the official said.\n\nThere are around 2,50,000 streetlights in the entire city. However, as people claim, most of them do not function well.\n\n“I was once walking on 9th Main Road in Anna Nagar in the evening, and felt as if someone was following me; as I turned, he came closer and held onto my shirt tightly and pulled me in front. But then he ran away, probably because I was not wearing a chain. Since that day, I have been scared of stepping out in the dark,” said Apoorva Chandran, a journalism student at MOP Vaishnav College.\n\nOfficials from the Greater Chennai Corporation say they had been taking all the necessary steps to ensure that the streets were illuminated.\n\n“We get over 50 calls every day from residents complaining about this. And we immediately get to work; however, sometimes junior technicians tend to become lethargic. But we do our best,” said a senior official.\n\n“If they ensure that the streets are lit every day, half the problems will come down. We wouldn’t have to badger them with complaints as frequently as we do,” said B. Neelakantan, secretary of Vivekanandapuram Residents Welfare Association.\n\nTwo men on\n\na motorcycle snatch woman’s\n\ngold chain at\n\nAshok Nagar", 
    "section": "national", 
    "title": "Badly lit streets set stage for acts of crime", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}