{
    "author": [], 
    "text": "With elections round the corner, many politicians are seen queuing up outside temples and seeking out astrologers\n\nWith the election season on, many politicians, including those from the Dravidian parties, have started lining up at specific temples on given days heeding to the advice of one astrologer or another. Grapevine has it that some politicians even consulted astrologers with horoscopes to see if the alignment of stars would favour them before sending in applications seeking party tickets to contest the Assembly polls. Some of these politicians could be seen visiting specific temples such as the famous Narasimha Temple and Saneeswarar Temple near Sholavandan in Madurai district and Varahar Temple in Vembathur in the neighbouring Sivaganga district. One politician’s wife has been lighting nine lamps every Saturday and offering sweet Pongal to devotees every Thursday after an astrologer told her that if she performed these rituals, her husband would not only win the election but also become a minister if the party comes to power. A Madurai-based astrologer is also busy flying to different destinations advising his political clientele. But ultimately, it is the voters who would seal their fates.\n\nYou may like it or not, but your food bill gets paid. This happens whenever this leader of a prominent Dalit party in the State enters any restaurant. When this correspondent was in a restaurant near the Madurai airport recently, the leader came in along with a dozen followers. As they were leaving, one person walked to each table and informed that the food bills had been settled for all guests in the restaurant. Much to the surprise of others in the restaurant, the hotel manager confirmed that whenever “Anne” (a reference to the leader) came to the restaurant, he offered to pay the bills for all. This has been his practice for years. Asked how he would know the details of bills on each table, the manager said the leader would pay a lump sum amount that would usually be higher than the individual bills put together. Guests are left to pay only the tips. While party cadres call it a mere goodwill gesture, some wondered whether ‘Anne’ would practice the same in luxury hotels.\n\nThe DMK was in the midst of drafting its manifesto for the coming Assembly elections when the DMDK announced its decision to go it alone. Though it caught the former slightly off-guard, the party has once again got itself busy with the task. And one of the key questions this time around is whether people could expect free refrigerators to go with the other freebies like TV, mixie, grinder and laptop that have been distributed so far. A seasoned politician that he is, Karunanidhi would not commit himself. All that he would say is “wait and watch”. That’s a cool reply!\n\nTamil Nadu Congress Committee president E.V.K.S. Elangovan is known to be indiscreet with words. But at a recent press conference in Erode, he exercised utmost restraint when journalists persistently questioned him about the greater importance given by the DMK to DMDK founder Vijayakant than the Congress. However, he did not get provoked and refused to be drawn into a discussion on the subject apparently because the Congress leader did not want to upset Mr. Vijayakant. But two days later, the DMDK founder decided to chart his own political course.\n\n( Contributions by Srikrishna. L, S. Vijay Kumar, Vasanth Srinivasan and R. Krishnamoorthy )", 
    "section": "national", 
    "title": "Banking on their stars", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}