{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Marina, Elliot's beaches have become centres for hosting and promoting a variety of social causes\n\nOn Sunday morning, Marina Beach was bustling with activity. Groups of children were training in boxing, karate and yoga. A beach clean-up was initiated from the Light House. A small crowd, consisting of children and adults, were walking, holding banners and placards.\n\nThis was by no means an unusual sight. Marina wears a busy look every Sunday. In fact, it is seldom idle. Even on other days, it bustles with activity, thanks to its expansiveness, facilities and location.\n\nA variety of groups converge here to promote their causes.\n\n“We are raising awareness about kidney disease in children and how acting early in the form of a healthy diet and adequate physical activity can help prevent it,” said Sudha Ekambaram, Consultant Paediatric Nephrologist at Dr Mehta’s Children’s Hospital, who had organised a walkathon at the Marina on April 13.\n\nBustling grounds\n\nOn this Sunday alone, the Marina beach hosted a beach clean-up, an awareness campaign about the necessity of wearing helmets, organised by the Japanese Chamber of Commerce and Industry, a rally to mark Women’s Day by the National Women’s Front, in addition to a walkathon.\n\n“Over the last two months, we have seen two major marathons and many awareness rallies about health issues and social causes. Volunteers have approached us with pamphlets and we have even attended a few meetings,” said N. Venkat, a senior citizen who frequents the beach for early morning walks with his neighbours.\n\nWhile major political and public meetings are not held at the Marina beach anymore, smaller voluntary organisations as well as companies have taken to organising various events of social interest both at Marina beach and Elliots beach, spaces that attract most number of people through the week.\n\nShift in space\n\nThe Gandhi Statue in Marina as well as the Schmidt Memorial at Elliot’s beach played host to a number of candlelight vigils and small meetings that were organised following the gang rape in Delhi that shook the nation.\n\nWhen the anti-corruption movement began in Delhi under Anna Hazare, nearly 300 people expressed their solidarity by assembling on the sands of Marina.\n\n“We’ve noticed that in beaches, the public are usually more than willing to hear us out and we were even able to organise fundraisers for our cause successfully,” says Pooja Kumar, coordinator of the Coastal Resource Centre, while recalling her experience working for ‘Reclaim our Beaches’, an initiative to clean up our beaches and make them attractive.", 
    "section": "national", 
    "title": "Beach sands prove fertile for activism", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}