{
    "author": [
        "Special Correspondent"
    ], 
    "text": "FACE TO FACE:Senior BJP leader L. Ganesan (second from left) interviewing a ticket aspirant for the Assembly poll at Palayamkottai on Sunday.— Photo: A. Shaikmohideen\n\nThe Bharatiya Janata Party, which was enjoying the goodwill of young voters, thanks to the governance of Narendra Modi-led Central government, would strive to garner the votes of those who disliked both the All India Anna Dravida Munnetra Kazhagam and the Dravida Munnetra Kazhagam, senior Bharatiya Janata Party leader L. Ganesan said.\n\nSpeaking to reporters here on Sunday, Mr. Ganesan, who interviewed party ticket aspirants for the Assembly election, said that the party’s strength in Tamil Nadu had increased from 10 lakh to 50 lakh members after Narendra Modi-led government came to power at the Centre. Hence, the number of applications received from aspirants for the 234 constituencies had increased in an unprecedented manner.\n\nAs the electoral battle would be a multi-cornered contest this time, votes of those who were opposing both the AIADMK and the DMK would be shared among other political parties in the fray. The BJP, having won the goodwill of the young voters, would strive to get these votes as the national party would be the right alternative for providing an able government in the State too.\n\nAt the same time, the BJP was also working on finding right electoral allies, he added.\n\nMr. Ganesan said that the BJP would never seek the support of caste-based political outfits. He predicted that Vijayakant-led Desiya Murpokku Dravida Kazhagam would also face the polls along with like-minded parties, which accepted his leadership as the Chief Ministerial candidate.\n\nMr. Ganesan interviewed 134 persons, including a good number of women, for the 10 constituencies in Tirunelveli district. He also interviewed the aspirants from Thoothukudi and Kanyakumari districts.", 
    "section": "national", 
    "title": "“BJP will attract voters disliking AIADMK, DMK”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}