{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Erection of bus shelters and grant of advertising rights for the same by the Coimbatore Corporation have led to criticism.— Photo: S. Siva Saravanan\n\nThe Coimbatore Collector has written to the Revenue Secretary, Government of Tamil Nadu, indicating that the Coimbatore Corporation has not been following rules related to erection of new bus shelters and grant of advertisement rights in those shelters.\n\nIn a letter written in October 2015, the Collector, Archana Patnaik, had said that she had received complaints from civil society groups, consumer activists and members of the public regarding certain violation in respect of maintenance of traffic signals, shifting of bus shelters and installation of new bus shelters in the Coimbatore Corporation limit.\n\nInstructions had also been issued to the Coimbatore Corporation to ensure that proper approval was obtained from the District Road Safety Committee for shifting and creation of new bus shelters and regarding advertisement rights, permission should be obtained from the appropriate authority. She had also added that further adherence of decisions taken in the meeting without any omission had been insisted time to time. The Collector sent the letter after the Coimbatore Corporation Council in 2015 passed a resolution to erect 50 bus shelters and grant advertising rights to 25 of those for 15 years.\n\nThe contention with the resolution was that the civic body did not have the right to grant approval for erection of bus shelter. It was the job of the District Road Safety Committee, said K. Kathirmathiyon, Secretary, Coimbatore Consumer Cause. The power to grant advertising rights rested with the Collector, who was also the Regional Transport Authority, he said and added that in short, the Corporation had usurped the rights and powers of the Collector in this issue.\n\nThe Corporation’s resolution had in one stroke committed three illegalities – take the rights to erect bus shelters, grant advertising rights and that too for 15 years or so, because even the Collector had rights to grant advertising rights for only three years, Mr. Kathirmathiyon said. He also wanted to know why the Corporation was keen on usurping the Collector’s power for bus shelters when it had various other pressing works.", 
    "section": "national", 
    "title": "Bus shelters: Collector writes to govt. on violation of rules", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}