{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Remote Sensing, GIS and GPS applications have immense opportunities to address various emerging challenges in the fields of agriculture, oil and gas, defence, public works, water resources, environment , said S.M. Ramasamy, Chairman-DST Geospatial Chair, Centre for Remote Sensing, Bharathidasan University, Tiruchi.\n\nThe Central and State Government sectors like public works department, water and drainage board, Tangedco, land records, forestry, agriculture, water resources department, highways and transportation, oil and gas, ISRO, military and defence, have separate sections/department exclusively for GIS Technologies, Mr. Ramasamy said while speaking after inaugurating the Sakura KIOT Centre for Excellence on Remote Sensing and GIS at the Department of Civil Engineering of Knowledge Institute of Technology (KIOT) here recently. Sakura GSR is a leading forum that provides innovative technologies, handling satellite images and generation of digital elevating modelling using GIS.\n\nB. Babu Madhavan, Director, Sakura GSR Private Limited, Chennai, said that the centre of excellence on remote sensing and GIS located at KIOT will provide mission- essential support to all students and also to government, non-government organisations and private industries in all research and development works.\n\nObjective\n\nThe objectives of the centre are integrating existing and emerging technologies in image processing, computer software, Geo Spatial Technologies to support the several applications such as ground water quality mapping, health impact, hydrological studies, transportation network of city road widening, and solid waste management.\n\nThe centre will provide job oriented intensive training to youth. P. S. S. Srinivasan, Secretary and Principal, KIOT presided over the function.\n\nThe centre will provide job\n\noriented intensive training to\n\nyouth", 
    "section": "national", 
    "title": "Centre for excellence inaugurated", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}