{
    "author": [
        "K Lakshmi"
    ], 
    "text": "During El Nino years, temperatures between January and May are higher than usual\n\nChennai may be heading towards an extremely hot summer this year, going by how it has fared during El Nino years in the past, according to a study.\n\nDuring the 18 years when El Nino was active over this region, Chennai has been experiencing hotter weather between January and May, compared to non-El Nino years. El Nino is a phenomenon of warming of the sea surface temperatures that sparks global extreme weather events.\n\nOn Saturday, the weather stations in Nungambakkam and Meenambakkam recorded a maximum temperature of 33.5 degrees Celsius and 34.3 degrees Celsius, which is nearly 1.3 degrees Celsius more than the average temperature registered during this period.\n\nIn 1988 and 1998, the city experienced high mean temperature during the first half of the year owing to a devolving El Nino that had impacted the weather till May. This year too, Chennai is experiencing a similar El Nino factor, which is continuing from last year, and the peaking temperatures indicate a potentially hot summer, according to the study.\n\nThe study had taken into account the monthly mean temperature of first five months between 1950 and 2015 to correlate El Nino and its impact on Chennai. During the strong El Nino years like 1988 and 2010, the monthly mean temperature in March had been 29.7 degrees Celsius, which was higher by 1.2 degrees Celsius than the average monthly temperature.\n\nK. Srikanth of weather blog, Chennaiyil Oru Mazhaikalam , said that of the eight places, including Thiruvananthapuram, Bengaluru, Mumbai and Pamban in Ramanathapuram district that were studied, Chennai’s rising temperatures had had a strong impact of El Nino.\n\n“There is difference between El Nino years and others as Chennai is warmer by 0.5 degrees Celsius during the first five months,” he said.\n\nThe data of weather stations were sourced from Goddard Institute for Space Studies, NASA, and Indian Meteorological Department.", 
    "section": "national", 
    "title": "Chennai hurtling towards hotter days: study", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}