{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The winners of The Hindu - Young World painting competition with Vinodhini Kirupakaran, clinical child psychologist, in Salem on Sunday. —Photo: E. Lakshmi Narayanan\n\nUnmindful of the scorching sun, about 400 boys and girls from different schools of Salem, Erode, Namakkal, Krishnagiri and Dharmapuri turned up for the regional finals of The Hindu-Young World painting competition held at Thiagarajar Polytechnic College here on Sunday.\n\nThe event, sponsored Thyrocare , is an integral part of the NIE programme of The Hindu . More than 2,200 students had submitted their paintings for the preliminary competition, of which 400– 200 from each category were short-listed and called for the finals.\n\nAs the students stepped into the auditorium with anxiety writ large on their faces, they found to their comfort that the topics were familiar and to their liking. “Day in the park”, “Sunday family outing / picnic” and “cleaning my street” for the juniors (for students of classes IV to VI) and “at the village market”, “wedding hall scene” and “a world without technology” for senior (classes VIII and IX) were the topics. The paintings explained the abundant talent in the young children. The winning paintings were those that had the ideas, presentation and the right choice of colour, matching the natural settings.\n\nArt teachers from three different schools - S. Muralidharan (Gokulanatha Hindu Matriculation Higher Secondary School), B. Vimalkumar (Senthil Public School) and A. Arulmathu (Government Higher Secondary School, Bommidi) were the judges and selected the award winning paintings. Vinodhini Kirupakaran, Clinical Psychologist, Inner Vision Children Clinic, was the chief guest and she gave away prizes to the winners. Speaking on the occasion, Dr. Vinodhini Kirupakaran urged the parents to encourage their wards to take part in extra-curricular activities for building their bright future.\n\nD. Rajkumar, Head-School Vertical (South and East India), The Hindu , Chennai, was also present.\n\nThe following is the list of winners:\n\nSeniors: 1. Y. Poornaa – class IX (St. Joseph Matriculation HSS, Salem), 2. C. R. Rithu – VIII (BVB School, Erode), 3. B. Akilan – VIII (Nandha Central School, Erode).\n\nConsolation prizes: S. Anjana – IX (Kalaimagal Kalvi Nilayam, Erode), P. Santhosh Kumar – IX (Gokulanatha Hindu Mahajan HSS), S. Kanishka – VIII (Mahendra International School, Namakkal), M. Harish Siddartha – VIII (Emerald Valley Pubic School, Salem), G. Mukesh – VIII (Kongu Vellalar Matriculation HSS, Perundurai), E. Nithilan – VIII (Sri Sarada Bala Mandhir Matriculatoin HSS, Salem) and I. Harshitha Shridevi - VIII (Senthil Public School, Salem).\n\nJuniors: 1. E. Kaaviya – VI (Vani Vidhyalaya), 2. G. K. Yamini Sheema – VI (Ashok Leyland School, Hosur) and 3. R. Harish Karthik – IV (Senthil Public School, Salem).\n\nConsolation prizes: K. K. Janaranjan – VI (Senthil Public School, Salem), P. A. Nandhithaa – VI (Bharathi Vidya Bhavan, Erode), G. S. Sanjay – IV (Senthil Public School, Salem), K. S. Nivetha – VI (Ashok Leyland School, Hosur), S. Brijesh Kumar – V (Asian Christian High School, Hosur), K.Nandhakumar – VI (PGP Matriculation HSS) and K. Sharmila – VI (Ashok Leyland School, Hosur).\n\nThe regional sponsors were: Thiagarajar Polytechnic College, Hotel Lakshmi Prakash, Anitha Enterprises and Vardhaman Electricals.", 
    "section": "national", 
    "title": "Children bring out their creative best", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}