{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "We do not want power to amass wealth, says CPI leader Mutharasan\n\nAfter eight months of its existence, the constituents of the People’s Welfare Front (PWF) seem to have finally settled on their Unique Selling Proposition (USP). With questions on how they differ ideologically from the two major Dravidian parties being repeatedly raised, the leaders are now hard selling their “clean image” as a definitive differentiation as seen here on Sunday.\n\nAt around 3.30 pm, the loudspeakers began blaring “revolutionary songs” of the Communist movement at the Choolaimedu election meeting arena. With the ‘sickle and hammer’ symbol pinned to his shirt pocket, 82-year-old Vanamalai slowly made his way to the meeting spot on an old and rickety bicycle.\n\n“I have been attending meetings for over 55 years. Election losses are not the end of life. To work for the people should be the goal. So work relentlessly,” he told a group busy setting flower pots on the podium.\n\nThe defining feature of the meeting was the mingling of cadres of different generations. Those of the Left parties were predominantly mid-aged and older. The real energy came from the workers of the Viduthalai Chiruthaigal Katchi (VCK), dominated by men in their twenties. Each time the name of VCK leader Thol. Thirumavalavan was mentioned by a speaker, the cadres shouted in jubilation.\n\nThe months of collaboration has brought in a sense of camaraderie despite the age gap.\n\n“When we worked with the DMK last time, we were treated like kids. There was a big brother attitude. But now we feel we are equals in this team. This has enthused every one,” said Vadivelu, carrying the MDMK’s and VCK’s flags in his hands as he rode pillion on a motorcycle to the electioneering spot.\n\nWith MDMK general secretary Vaiko leading the charge, the symbolisms of Dravidian movement were very much a part of these meetings too. These include large garlands and white ‘towels’ given to welcome the leaders and the swords presented as a reminder of the war ahead.\n\nThe meeting was punctuated by lighter moments. As Mr. Vaiko delivered his speech peppered with poetry, world history and Tamil pride, an inebriated man in the crowd shouted that he would vote the PWF come what may. Mr. Vaiko quickly turned this into an opportunity. “You see, whatever you do alcohol finds its way in. This is why I say, vote us so that we could get rid of this menace,” he said to a rapturous response.\n\nBut the man with the most unique speaking style was CPI State secretary R. Mutharasan. In stark contrast to Mr. Vaiko, he mostly avoided the ‘ senthamizh ’ (classical Tamil) that platform speakers use for the rhetorical punch. “We do not want power to amass wealth. Look at us. We don’t look like rich fellows. Mr. Vaiko might be a little fairer but there is no smear of corruption in his hands,” he added, reminding the audience that none of the four leaders on stage have ever been accused of corruption.\n\nThere was criticism, too. Women who listened to the leaders from the terrace of their apartment pointed to the complete absence of females on the meeting stage. “Maybe next time, they will let a woman speak,” said Kavitha, an IT professional.\n\nLike students attending a seminar, the leaders, including CPI (M) State Secretary G. Ramakrishnan, devotedly signed the MDMK’s “register”—a record the party maintains to document all public meetings—before moving to their next stop in Velacherry.\n\n“When we worked with the DMK last time, we were treated like kids,” says a cadre", 
    "section": "national", 
    "title": "‘Clean image, PWF’s main election plank’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}