{
    "author": [
        "K Raju"
    ], 
    "text": "Despite bumper harvest, stringent Election Commission of India rules for carrying cash when model code of conduct is in force have slashed paddy procurement price to rock bottom in Cumbum Valley, wiping out farmers’ minimum profit in the second cropping season.\n\nThe EC norms prevent outstation traders, mostly from Delta areas and Kerala, from procuring paddy directly from farmers as they cannot carry huge money with them. At present, harvesting is in full swing in the Valley, especially in Chinnamanur, Uthamapalayam and Palanichettipatti.\n\n“With no cash flow, procurement price of fine quality paddy has dwindled to Rs. 820 a bag (63 kg), which was Rs. 1,050 a bag during the first cropping season,” said S. Azhagumalai of Chinnamanur. “Farmers had got 40 bags an acre last year. Now they harvest 50 to 55 bags per acre,” he added. In the absence of outstation traders, local traders, mostly middlemen, offer very low procurement price by forming a syndicate.\n\n“It was a level playground last season as outstation traders competed with local buyers and procured paddy directly from farmers offering better price. Now, arrival of outstation traders has come down sharply as they could not carry large amounts in hand,” said S. Pandia Raj of Chinnamanur. Moreover, the farmers expect cash immediately after sale – in the field itself. They neither believe outstation traders nor accept cheque or other mode of payment.\n\n“We need hefty sum in hand to procure paddy every day. Earlier, I used to lease a rice mill in Theni to convert procured paddy into rice to transport directly to rice market. That too requires huge cash. Carrying huge amount is not advisable now. With no option, we depend on local traders for procurement”, said N. Sivaraman, a trader from Thanjavur.\n\nA sizable amount seized during the previous election had not been fully refunded. “We cannot take risk again”, said another outstation trader.\n\nCapitalising on the situation, local traders exploit farmers. Ironically, EC norms help middlemen make better profit, leaving both outstation traders and farmers in the lurch.\n\nHarvesting is being done on 14,500 acres in Cumbum Valley spreading between Gudalur and Palanichettipatti, three km away from Theni.", 
    "section": "national", 
    "title": "EC norms slash paddy procurement price", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}