{
    "author": [], 
    "text": "SALEM\n\nPeriyar University: Department of Physics, inter-university quiz competition in Physics, R. S. D. Wahidabanu, Principal, Government College of Engineering, inaugurates, C. Swaminathan, Vice Chancellor, presides, 10 a.m.\n\nGovernment Industrial Training Institute: NSS special camp, D. Shanmugavadivu, Headmaster, Government High School, S. Ravindran, Regional Joint Director of Training and others speak, R. Rajendran, principal in-charge, presides, Settichavadi Mariamman Temple ground, 8 a.m.\n\nDhirajlal Gandhi College of Technology: Department of English and Jubilant English Club, national workshop on ‘current language teaching methodologies for vernacular medium students’, S. Kumaran, Assistant Professor in English, Thiruvalluvar Government Arts College, Rasipuram, resource person, 10 a.m.\n\nCooptex: Annual ‘buy two and get one free’ exhibition, Thangam Pattu Maaligai showroom, 10 a.m. to 8 p.m.\n\nNew Century Book House Limited: Book exhibition, Bose maidan, 9 a.m. to 9 p.m.\n\nDistrict Employment Exchange: Training programme for the Staff Selection Commission aspirants, 10 a.m.\n\nNAMAKKAL\n\nMahendra Engineering College: Department of Computer Science, S. Subashini of PSV College of Engineering and Technology, Krishnagiri, speaks on ‘internet things’, M. G. Bharathkumar, Chairman, presides, 10 a.m.; Department of Electronics and Instrumentation Engineering: K. Srinivasan, Assistant Professor, National Institute of Technology Tiruchi (NIT T), speaks on \"industrial automation by using PLC and DCS\", 1.30 p.m.\n\nDepartment of Aeronautical Engineering of Mahendra Engineering College and Institution of Engineers India: Seminar invitation on \"finite element analysis- techniques and application in aircraft structural design\", K. Suresh, Deputy Manager, Aircraft Research and Design Centre, HAL, Bengaluru, resource person, 10 a.m.\n\nCooptex: Annual ‘buy two and get one free’ exhibition, Cooptex showroom, 10 a.m. to 8 p.m.\n\nTIRUCHENGODE\n\nK. S. Rangasamy College of Arts and Science: Department of Biological Sciences, Science Day, M. Arthanari Eswaran, Assistant Professor, Department of Veterinary Microbiology, Government Veterinary College and Research Institute, chief guest, K. S. Rangasamy, Chairman, presides, 9.30 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}