{
    "author": [
        "Staff Reporter"
    ], 
    "text": "All-women polling stations to be set up in all Assembly segments in Dindigul district\n\nAn exclusive sub-polling station meant for visually impaired persons will be established at a polling station at Thomaiyarpuram in Natham Assembly segment to provide better facilities for them to cast their votes without problems.\n\nInteracting with young voters in a private arts and science college here on Sunday, Collector T.N. Hariharan said that all-women polling stations would be set up in all the seven Assembly segments in the district.\n\nAll the presiding officers, polling officers, micro-observers and police personnel would be women at the all-women polling stations. Election officials had been studying the polling stations that recorded low turnout of women during the last elections. “We will set up all-women polling stations there to improve voting percentage in the areas,” he added.\n\nThe EC had been taking massive efforts to bring all voters to the polling stations to cast their votes. Putting up hoardings on election education, interpersonal communication, conducting mass media programmes and street plays were some of the major activities of Systematic Voters’ Education and Electoral Participation (SVEEP) programme that aimed at creating awareness among the voters, he noted.\n\nLater, the Collector interacted with the students and their parents, and advised them to cast their votes without fail.\n\nHe also launched a signature campaign stressing the importance of voting. Cooperation and coordination of the voters were essential to achieve cent per cent polling, he added.\n\nGPS device in vehicles\n\nGlobal Positioning System device was fitted in 32 vehicles given to special flying squads and static surveillance teams in order to track their movement while at work.\n\nInspecting the vehicles on Saturday, Collector T.N. Hariharan said the GPS tracking would help effective monitoring of the teams. It would help officials locate the team that was very close to an incident spot and move them quickly to the particular place for immediate action.\n\nThe officials at the control room could track easily the position of the vehicle in the map, check the speed of the vehicle and see if the vehicle was moving or idle. Each flying squad has a revenue official, three police personnel and a videographer. Static surveillance team too has same manpower.", 
    "section": "national", 
    "title": "Exclusive sub-polling station for visually impaired planned", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}