{
    "author": [
        "S Prasad"
    ], 
    "text": "Swedish-Norwegian Signe Johannessen is on a mission to save wetlands\n\nExploring the coexistence of humans with nature through art is the forte of Swedish-Norwegian artist Signe Johannessen.\n\nMs. Johannessen has been visiting India for the last couple of years and exploring wetlands through contemporary art.\n\nMs. Johannessen visited the theatre festival in Odisha when the devastating super cyclone struck in 1999 killing over 15,000 people. Having survived the catastrophe, the visit to India and her meeting with nature turned emotional.\n\n“For the last three years, I have been visiting India exploring the ecosystems and networking with experts working in various fields on current environmental issues, while exploring how art can act as knowledge bearer for new research. My organisation, Artlab Gnesta, has been working with art and society, particularly contemporary art in Sweden and has benefited from my long stays in India,” Signe Johannessen told The Hindu .\n\nDuring her travels, Ms. Johannessen looks at tidal wetlands in India while contemplating on the fresh water wetlands in her native Sweden. Wetlands are a big and important area for conservation worldwide.\n\n“We are losing our wetlands because of forestry in Sweden. So there are many common grounds even if these are two different countries. Conservation of wetlands is a global issue and I am very happy that the art community is taking steps to talk about these very important issues,” she said.\n\nAround 99 per cent of wetlands in Sweden have rapidly decreased over the last 200 years. It is considered a wasteland but it is such an important ecosystem. However, what is left is now being managed very well.\n\nThe forest department in Sweden has understood the importance of wetlands and is now taking steps for conservation. It is now a beautifully managed ecosystem and open to students and researchers.\n\nOne of the objectives of this project in the future is to invite artists and experts from different fields to talk about wetlands. This is a global issue and experts and scientists from various fields are coming together looking at a common goal.\n\nThe title Swamp Storytelling alludes to the mangroves in the Andaman Islands. The project aims to combine working the fields for scientific research and artistic production on current environmental issues, while exploring how art can act as knowledge bearer for new research.\n\nSweden and India’s different preconditions are an interesting foundation for this work, Ms. Johannessen added.", 
    "section": "national", 
    "title": "Exploring wetlands through contemporary art", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}