{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Coimbatore District Police arrested five persons on Sunday in connection with the vandalisation of a church at Kalapatty on the outskirts of the city the previous evening.\n\nThe arrested persons were identified as R. Kutty alias Prakash (34) of Kalapatty, S. Sakthivel (29) of Singanallur, N. Vignesh (25) of Sowripalayam, and K. Devaraj of (62) of Kalapatty. These four persons are members of a Hindu outfit. The fifth person, P. Sampath (43) of Kalapatty, is the former zonal secretary of Bharatiya Janata Party.\n\nBased on a complaint from the representatives of the church, the Kovilpalayam police registered a case against the accused under Sections 147 (rioting), 148 (rioting armed with deadly weapons), 452 (trespass after preparation for hurt or assault or wrongful restraint), 295(A) (deliberate and malicious acts intended to outrage religious feelings by insulting its religion or religious beliefs) and 506(ii) (criminal intimidation) of the Indian Penal Code and section 3 of the Tamil Nadu Public Property (Prevention of Damage and Loss) Act.\n\nSuperintendent of Police (SP), of Coimbatore District, R.V. Ramya Bharathi said that the three special teams formed to solve the case were on the look out for more persons who were involved in the incident. It is learnt that the accused were in an inebriated condition when they indulged in the act. The SP said that the police had also started identifying persons involved in activities that posed a threat to religious harmony in the past.\n\n“We will bind them by getting an undertaking from them under 107 (security for keeping peace) of Code of Criminal Procedure. Criminal action would be initiated on persons who break the bond,” the SP warned.\n\nMeanwhile, presbyters and hundreds of members from churches attached to CSI petitioned Collector Archana Patnaik at the Collectorate on Sunday, seeking protection for the church.", 
    "section": "national", 
    "title": "Five arrested for vandalising church", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}