{
    "author": [
        "M K"
    ], 
    "text": "It had mauled to death an estate worker on Saturday\n\nHaving spotted on cameras the tiger that had mauled to death an estate worker from Jharkhand at a private estate in Devarshola on Saturday, forest veterinarians are prepared to tranquillise the animal.\n\nForest officials said they have received a direction in this regard from the Chief Wildlife Warden. The focus will be on capturing the tiger, treating it as it was badly injured on its front left knee, and rehabilitating it. It could have strayed away from the nearby Mudumalai Tiger Reserve.\n\nGudalur Divisional Forest Officer S.N. Tejaswi said that the carnivore was caught in seven of the 18 camera traps that were installed to capture images of the predator on Saturday. “It is a seven to eight-year-old adult male,” he said and added that it came to the place where the labourer was killed the previous night. Ten more cameras had been installed on Sunday to track the movement and spot the animal. A team of more than 180 persons, including 73 tribal anti-poaching watchers from Mudumalai Tiger Reserve, personnel from special task force, police, representatives of NGOs, were involved in surveillance, identifying pug marks, tracking the possible hideouts of the animal and in setting up the camera traps and cages. Two tree houses were also setup close to a suspected hideout of the animal to monitor it at night.\n\nConservator of Forests I. Anwardeen said that the animal could have been injured by a snarl that was placed for keeping off smaller animals from damaging the plantations. “Seven cages have been placed to capture the animal without harming it,” he told The Hindu .\n\nPrecaution\n\nDistrict Collector P. Shankar said that as a precautionary measure they identified 13 habitations in Devarshola town panchayat and Nelakottai panchayat within a distance of five km from the place where the labourer was killed. “Announcements were made in the public address system asking people not to come out alone during the day and to avoid stepping out from 6 p.m. to 6 a.m. till the animal was captured,” he said.", 
    "section": "national", 
    "title": "Forest vets gear up to tranquillise tiger", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}