{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Collector imposes fine on TNSTC on seeing students travelling on footboard\n\nIn a recent incident, Collector K. Veera Raghava Rao imposed a fine of Rs. 7,000 on Tamil Nadu State Transport Corporation (TNSTC) for plying an overcrowded bus in which many school students were travelling on the footboard.\n\nWhile appreciating the stern action by Collector, keeping the safety of students in mind, members of TNSTC staff unions, however, suggest that the frequency of bus service in peak hours must be increased to address this nagging problem.\n\nSources said that Mr. Rao was passing through Mandela Nagar when he spotted the overcrowded bus bound for Transport Nagar from Mattuthavani Integrated Bus Stand via Periyar Bus Stand. He stopped the bus and Regional Transport Office officials were asked to come to the spot. The driver and conductor of the bus were enquired. The officials managed to make the students, who were travelling on the footboard to go inside the bus, before it was allowed to leave the place.\n\nTaking a stringent view, the Collector, who is also the Regional Transport Authority, recommended a fine of Rs. 7,000 on the TNSTC. M. Singaravelu, Regional Transport Officer (Madurai South), said that an explanation was later sought from them. “The explanation provided, however, was not satisfactory. So, we have sent a notice asking TNSTC to pay Rs. 7000 as fine,” he said.\n\nThough the Collector had not recommended action against the driver and conductor, an official from the RTO said that the TNSTC is likely to take action against them as the fine has been imposed.\n\nReacting to the incident, G. Rajendran, president of Madurai division president of the TNSTC wing of Centre of Indian Trade Unions, said, “In Madurai, buses are not operated in high frequency during peak hours. So, what can the drivers and conductors do?”\n\nA functionary from another trade union said that every year circulars are sent during school examinations, asking conductors not to discourage students from boarding the bus. “On one hand, they are asked to allow the students to board. On the other hand, they get punished if the students travel on footboard,” he said.\n\nClaiming that students rarely listen to the conductor when they are asked not to travel on footboard, he suggested deployment of a school staff or a policeman near bus stops during peak hours to manage the student traffic.", 
    "section": "national", 
    "title": "High frequency, the answer to overcrowded city buses", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}