{
    "author": [
        "C Jaisankar"
    ], 
    "text": "hough Tiruchi takes pride in being called as one of the top three clean cities in the country, its suburban places and entry points do not seem to be supporting in its endeavour to improve the cleanliness.\n\nSomarasampettai, which was one of the entry points to the city from the western side, and neighbouring villages along its main roads, are some examples to point out that they are not extending much needed support to the city in improving its image. Garbage is being dumped along the sides of Somarasampettai-Vayalur road and Somarasampettai-Thogamalai road. Plastics, plastic bags, bottles, tea cups and others have been indiscriminately dumped by the residents of Somarasapettai and neighbouring villages. Roadside vendors and owners of commercial establishments play their part in polluting the environment by dumping waste being generated in their establishments.\n\nMargins of the two main roads have become convenient grounds for hotels and other eateries to dump waste. They use the night time to throw their waste. Locals point out that broken bottles are also thrown on open places without realising its danger to passersby.\n\nThey said that Somarasampettai-Vayalur road and Somarasampettai-Thogamalai road had been used as dump yard for about one km on both sides. Since no civic body or authority came forward to stop the menace, the practice of indiscriminate dumping had gained momentum over the period.\n\nThey accused that the Somarasampetttai panchayat, which was supposed to prevent dumping of waste on unspecified locations in its territory, had failed to keep its area neat and clean.\n\nPointing out the close proximity to the Tiruchi city, they said it was important for the district officials to set up a coordination meeting consisting representatives of local bodies situated around the city to impress upon the need for maintaining clean environment in the border areas. They should meet at least once in three months to take stock of the situation so as to improve the overall cleanliness.\n\nBroken bottles are also thrown on open places without realising its\n\ndanger to passersby", 
    "section": "national", 
    "title": "Indiscriminate dumping of waste on roadside goes on", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}