{
    "author": [
        "Deepa H"
    ], 
    "text": "T. Velmurugan and other office-bearers meet AIADMK supremo and Chief Minster Jayalalithaa at her Poes Garden residence on Sunday.— Photo: Special Arrangement\n\nLeaders of seven alliance partners of the AIADMK met party general secretary and Chief Minister Jayalalithaa on Sunday and pledged their support to the party in the ensuing Assembly elections.\n\nThe Poes Garden residence of Ms. Jayalalithaa saw a flurry of activity in the afternoon with leaders arriving one after another. Senior AIADMK leaders and Ministers R. Vaithilingam, Edappadi K. Palanisamy, P. Thangamani and S.P. Velumani were present during the meetings.\n\nEmerging from the meeting, T. Velmurugan, founder of the Tamizhaga Vazhvuirmai Katchi, a splinter group of the PMK, said he had presented a list of constituencies where his party had a strong presence.\n\n“The Chief Minister said she will depute a committee to meet us regarding allocation of seats,” he said. Asked about the number of constituencies the party sought, he said that in the recent Salem conference the party, a desire was expressed that it should contest seats in “double digits”.\n\nTamil Maanila Muslim League leader Sheikh Dawood reportedly made a case for five seats. Another Islamic outfit that was invited for possible seat-sharing talks was the Indiya Thoweed Jamath.\n\nIts leader S.M. Backer presented a memorandum to Ms. Jayalalithaa seeking an increase in reservation for Muslims, retrieval of Wakf Board lands, appointment of Imams through the Wakf Board and the release of prisoners who had served a sentence of over 10 years.\n\nThe AIADMK leader also met the Republican Party of India’s Se. Ku. Tamilarasan, All India Forward Bloc’s (AIFB) P.V. Kathiravan, Tamil Nadu Kongu Ilaignar Peravai’s MLA Thaniyarasu and the Samathuva Makkal Kazhagam (a breakaway of the AISMK) founder Eranavur Narayanan.", 
    "section": "national", 
    "title": "Jayalalithaa meets alliance leaders", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}