{
    "author": [
        "Special Correspondent"
    ], 
    "text": "R. Seshasayee, Chairman, Infosys Limited, delivering graduation day address at Bannari Amman Institute of Technology at Sathyamangalam in Erode on Saturday\n\nAbsorb as much knowledge as possible, making the most of the plenty of online portals for self-learning, and lead the technological world with the audacity to question things, R. Seshasayee, Chairman, Infosys Limited, advised the student community on Saturday.\n\n“The process of learning has to shift from knowing what to why. It is important to ask 'why not?' and attempt to change the way society moves ahead,” Mr. Seshasayee said addressing the 16th graduation day at Bannari Amman Institute of Technology.\n\nCiting instances of innovation in the corporate world, he said Tesla cars came more from younger players who are fearless than from the established ones. Demographic dividend in our country will become meaningful when youth drive the change, Mr. Seshasayee said, adding that the time was apt now for youth-powered Indian knowledge-revolution to impact the universe.\n\nVijay Mohan, Chairman, Pricol Industries Limited, Coimbatore, the guest of honour, stated that it was necessary for graduates to imbibe the technological innovations to excel in the competitive world, with two main ingredients: domain expertise and soft skills.\n\nMr. Vijay Mohan appealed to the youth to develop entrepreneurial values and create more jobs in the manufacturing sector to help the downtrodden, thereby enabling growth-acceleration for transformation of India into a developed nation.\n\nPresiding over, S.V. Balasubramaniam, BIT Chairman, said the knowledge, skills and expertise students acquire ought to be put into practice to gain from tremendous opportunities to facilitate progress.\n\nIn all, 1068 UG graduates, 453 PG graduates and 40 Ph.D. holders received their degrees.\n\nOutstanding UG students Mathess J, a B.E. Mechanical Engineering graduate, and Swetha Srivarna S, a B.E. Electrical and Electronics Engineering graduate, received Bharat Ratna C.Subramaniam gold medal and Smt. Kalavathi Kaarthikeyan gold medal respectively.", 
    "section": "national", 
    "title": "‘Lead technological world with audacity to question’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}