{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple : Discourse on ‘Sithargalin Anmeegam’ by M. Ilango, Railway Colony, 7.30 p.m.\n\nMuneeswarar Temple : Masi festival; discourse on ‘Iraivan Kaatum Paathai’ by Sannasi, Munsif Court Road, Tirumangalam, 8 p.m.\n\nTiruvalluvar Mandram : Discourse on ‘Kantha Puranam’ by A. Arumugam, Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nSri Swami Tatwananda Ashram : Gita class by Swami Samanandar, Ayiram Vaisyar Primary School, South Avani Moola Street, 6.45 a.m.\n\nMadurai Tiruvalluvar Kazhagam : Discourse on ‘Tirumandiram’ by S. Tirumavalavan North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre : Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya : Fre rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nMagic Lantern Theatre : 38th anniversary of Nija Nadaga Iyakkam and 18th death anniversary of Shenbagam Ramasamy, ‘Sooravali,’ a Tamil adaptation of Shakespeare’s The Tempest by Indira Parthasarathy, Kadambavanam, Madurai-Natham Road, 6 p.m.\n\nThe American College : Blood donation camp, M. Davamani Christober, Principal, inaugurates, Main Hall, 8:30 a.m.; Postgraduate and Research Department of English, Inter-collegiate workshop on ‘Communication skills for placement’ by M. Lawrence, Associate Professor, Paul Linder Love Hall, 9 a.m.\n\nThiagarajar College : Department of Physics, State-level inter-collegiate seminar on ‘Path-breaking discoveries of the universe and cyberspace,’ M Eyini, Principal, presides, S. Asath Bahadur, Professor, Kalasalingam University; chief guest, Kabilar Hall, 9 a.m.\n\nYadava College : Special lecture on career guidance by R. Sathish Kannan, Assistant Manager, Central Bank of India, and Naresh Hari Kumar, consultant; S. Dhanasekaran, Principal, presides; Rajendranar Auditorium, 11 a.m.\n\nN.M.S. Sermathai Vasan College for Women : NSS camp, Koodakoil, 10 a.m.\n\nAlcoholics Anonymous : Meeting; Holy Redeemers Church, near Periyar bus stand, 7 a.m.; Quality Care Hospital, Ellis Nagar, 7 p.m.; A.G. Church, Gomathipuram, 7 p.m.", 
    "section": "national", 
    "title": "Madurai Today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}