{
    "author": [
        "S Sundar"
    ], 
    "text": "The booth-level campaigners of the ruling party will seek all details about voters, including their caste identity.\n\nState Minister and party’s Madurai urban district secretary K. Raju asked the campaigners, including members of Ilaignar and Ilampenn pasarai (youngsters wing), to make a note of the name, age, street, education and occupation of the voters along with the caste of the family.\n\nMr. Raju was addressing the first-ever meeting of booth-level campaigners of the Madurai West Assembly constituency here on Sunday.\n\nAt least on two occasions he asked the cadre to fill up the caste details in the printed forms given by the party headquarters while getting details of the voters. “Along with the total number of voters in the house and the number of women, please do mark the caste they belong to,” he said. The party has formed 20-member campaigners, who at the first-level, have been entrusted with the work of getting details of all the voters in the booth – numbering around 1,000 – by the next two days.\n\nList of schemes\n\nThe forms have listed out 15 popular welfare schemes like free rice, free home appliances, old age pension, free dhoti and sari, marriage assistance with gold for thirumangalyam among others.\n\n“You will hear from the voters that they would vote only for Amma, for every household has got benefits from at least one welfare scheme like free rice and free laptops for students. But, you have to make a tick against those scheme under which each family has been benefited,” Mr. Raju said.\n\nBesides, the cadre have to get details about the voters who were out of station. “Make a note whether the voter will come home on the polling day to exercise his/her franchise,” the Minister for Cooperative said.\n\nStating that each of the 20 members of the booth-level committees will have to meet only around 50 voters, he said the headquarters has asked them to keep this detail ready before the names of candidates for the Assembly elections are announced.\n\nName, age, street, education and occupation of the voters along with the caste of the family sought", 
    "section": "national", 
    "title": "Minister asks AIADMK cadre to gather caste details", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}