{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The city police have registered 29 cases for violation of model code of conduct against various political parties on Saturday. The cases were registered on complaints lodged by the flying squads and other officers on election duty. It is learnt that most of the cases were for not cleaning wall paintings and not removing party flags and flag posts.\n\nParties against whom cases were registered include All India Anna Dravida Munnetra Kazhagam, Dravida Munnetra Kazhagam, Desiya Murpoku Dravida Kazhagam, the Communist Party of India, Bharatiya Janata Party, Indian National Congress, Social Democratic Party of India, Tamil Nadu Muslim Munnetra Kazhagam, Manithaneya Makkal Katchi, Welfare Party of India, Marumalarchi Dravida Munnetra Kazhagam and Viduthalai Chiruthaigal Katchi.\n\nSeven cases were registered by the Ukkadam police, six each by Rathinapuri and Kuniyamuthur police, five by Selvapuram, four by Kattoor and one by the Race Course police.\n\nA total of 42 cases have been registered against political parties in the city for poll code violation, till Saturday.\n\n646 guns surrendered\n\nSenior police personnel in the district police said that there were 687 licensed guns in the district and 646 of them had been surrendered at the respective police stations or armouries.\n\nThe police said that 35 guns belonged to bank security personnel and were exempted from surrendering their weapons. The remaining six guns were in the court, as they were wanted in connection with some cases.\n\nThe district police have registered 30 cases against political parties for model code of conduct violations. They also got undertaking from 405 mischief mongers under 107, 109 and 110 of the Code of Criminal Procedure, with an assurance that they would not indulge in any acts to disturb the elections. The police are also identifying more of such suspects at the booth level and bind them under the law.", 
    "section": "national", 
    "title": "More cases registered against political parties", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}