{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It will facilitate academic tie-up with renowned overseas institutions\n\nManonmaniam Sundaranar University, as part of its journey towards elevating itself to global standards, has proposed to create a ‘Centre for International Relations’, which will act as ‘nodal centre’ for activities relating to establishing academic tie-up with renowned overseas institutions and attracting foreign students to pursue their higher studies, including research programmes.\n\nDelivering his maiden address at the university Senate on Saturday, Vice-Chancellor K. Baskar said that he was keen on establishing the centre after ensuring excellence in arts and science subjects through reforms in administration, curriculum and collaboration with international institutions.\n\nBesides attracting a good number of foreign students and subsequent revenue, the MSU would also get international research projects through these measures. It would also introduce ‘Global Internship Programmes’ for students.\n\nIn order to facilitate seamless transfer of students between universities, syllabi, semester structuring and credit transfer methodologies would be restructured. This approach would facilitate the students to study one or two semesters in overseas institutions and subsequent credit transfer for the award of degree within the time duration of the programme.\n\n“All these above efforts will culminate in the formation of the ‘Centre for International Relations’ in the near future to facilitate the admission of foreign students to the MSU where they can pursue their postgraduation or research programmes and vice versa,” Prof. Bhaskar said.\n\nHe also unveiled plans for extracting the expertise of foreign-based Indian origin professors under ‘Overseas Professor Scheme’ for the benefit of the MSU students and the faculty.\n\n“Whenever the Indian-origin professors visit their homeland, their pedagogical skills can be effectively used for teaching, research and other academic interactions, which can ultimately lead to signing of MoUs, exchange programmes, joint publications and research projects,” Prof. Baskar noted.\n\nHe also said that steps would be taken to develop integrated undergraduate and postgraduate programmes leading to Ph.D. and introduce ‘School Exposure Programmes.’", 
    "section": "national", 
    "title": "MSU to open Centre for International Relations", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}