{
    "author": [
        "R Rajaram"
    ], 
    "text": "Made in 1953, the loco was chugging in the NMR till 2011\n\nThe Swiss made steam loco \"X\" of the NMR which has been refurbished and displayed at Tiruchi Rail Museum.— PHOTO: B. VELANKANNI RAJ\n\nA Swiss make steam locomotive which had been chugging for over 50 years in the scenic Nilgiri Mountain Railway (NMR) section and withdrawn from service is now a prized exhibit at the Tiruchi Rail Museum.\n\nThe old locomotive of ‘X’ class type with rack and pinion arrangement was cleaned up and given a fresh coat of painting at the Golden Rock Railway Workshop here to keep it as an added attraction at the Rail Museum.\n\nWeighing nearly 50 tonnes, the loco was brought from the Golden Rock Railway Workshop and installed at the Rail Museum on Thursday.\n\nManufactured by the Swiss Locomotive and Machine Works in 1953, the coal-fired steam locomotive chugged in the picturesque NMR section for 58 years before being withdrawn from service in 2011.\n\nThe non-operational locomotive was subsequently brought to the Golden Rock Railway Workshop.\n\nRailway sources said the Southern Railway headquarters issued a directive to keep the steam loco as an exhibit at the Tiruchi Rail Museum housing several heritage railway equipment used during the colonial era.\n\nAccordingly, the Golden Rock Railway Workshop took up the task of cleaning up the loco, retaining the old components and gave it a fresh coat of painting to make it attractive without disturbing its heritage look, the sources said.\n\nThe swanky steam loco was brought by a trailer lorry and installed on a platform established at the entrance of the museum building as another prized exhibit.\n\nThe Tiruchi Rail Museum, which was opened in February 2015, has so far recorded 31,000 visitors, a senior official said. A children’s play park has been created inside the sprawling museum premises to attract children.\n\nThe museum boasts a rich collection of heritage equipment, including old lamps used in railway stations, different types of clocks and rails, rare photographs, old gazettes, and manuals used during the erstwhile South Indian Railway.", 
    "section": "national", 
    "title": "NMR’s ‘X’ locomotive stands tall at Rail Museum", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}