{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Promising a slew of measures for the agricultural sector to alleviate the problems faced by the farmers, Pattali Makkal Katchi leader Anbumani Ramadoss on Sunday said his party if voted to power would go in for scientific approach for farming and strike to make it a profitable venture.\n\nThe PMK would bring out a separate budget for agriculture if given a chance to govern the State and waive all cooperative loans obtained by the farming community, Mr. Anbumani said during an interactive meeting with farmers organised by the party here.\n\nAccusing the two principal Dravidian parties – the AIADMK and the DMK – for the mosaic of problems faced by the farming community in the State today, Mr. Anbumani claimed that his party would bring in necessary change in the lives of the agriculturists by implementing a slew of schemes and going in for modern techniques to usher in a revolution in the agriculture sector.\n\nDespite the fact that over 60 per cent of the population of the State were engaged in the farming sector, the two Dravidian parties were not bothered of the plight of the farmers resulting in large-scale migration to urban areas due to debt problem, non-availability of water and other factors.\n\nPromising to infuse new technologies in the farm sector to increase productivity and raise the standard of living of the farmers, Mr. Anbumani assured that agricultural universities would be started at Tirunelveli, Thanjavur and Vellore to cover all four regions in the State.\n\nMaking it clear that the PMK would not provide freebies to the people, Mr. Anbumani, however, said his party would provide free education and free health services. Farmers would be provided with free seeds, agricultural inputs and fertilizer, he said adding that competitive prices would be provided for the farm produce to raise the economic lot of the agriculturists.\n\nHe also assured of bringing in several irrigation schemes and construction of check dams at every five kilometres on rivers and rivulets to increase the ground water table. Schemes would drafted at the micro and macro levels with a long term vision in respect of the agriculture sector, he said.\n\nHe also assured of creating special agro economic zones at different places in the State and formation of farm-related cooperative clusters to provide employment opportunity to the rural youth.", 
    "section": "national", 
    "title": "PMK to usher revolution in farm sector", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}