{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Top level meeting held to ensure free and fair elections in Puducherry\n\nSenior Superintendent of Police V.J. Chandran addressing the SPs and Inspectors at an orientation programme on the model code of conduct in Puducherry on Saturday.— PHOTO: M. Samraj\n\nPolice officials in Puducherry were briefed on the various instructions of Election Commission of India for the conduct of free and fair elections which is scheduled to be held in May.\n\nA top level meeting was chaired by Senior Superintendent of Police V.J. Chandran. Superintendents of Police, Inspectors and Sub inspectors of Police participated in the meeting.\n\nDr. Chandran told The Hindu , “We have asked our police personnel to implement the model code of conduct and instructions of Elections Commission of India for the free and fair polls. We are going to intensify the drive against history sheeters and anti-social elements.”\n\nThe police personnel were advised to execute pending bailable and non-bailable warrants.\n\nApart from their responsibility of maintaining proper law and order during the entire period starting with the announcement of elections and till the completion of elections, the necessity of ensuring the strict implementation of the various standing and specific orders, directions and instructions of the Commission aimed at enabling a peaceful, free and fair election were also emphasised.\n\nThe police officers were also sensitised on the strict implementation of the Model Code of Conduct, prevention of defacement of property, restrictions on the use of loudspeakers, unauthorised incurring of election expenditure in violation of Section 171H of the Indian Penal Code, Publication of election pamphlets and posters in violation of section 127A of the Representation of the People Act, 1951. They were also told to ensure that electioneering does not result in trampling on the rights of the citizens to have a peaceful life and public peace and tranquillity is not disturbed.\n\nAn official said the police is going to intensify surveillance in coming days including 24/7 checks on the roads and random checks in some pockets.\n\nIncreased surveillance\n\nThey have also plans to mount surveillance on hotels and lodges in order to prevent abuse of money power in Puducherry.", 
    "section": "national", 
    "title": "Police officials appraised of model code", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}