{
    "author": [], 
    "text": "The southern arm of the Inner Ring Road draws walkers and runners from areas proximate to it\n\nNot only do they ease traffic congestion, but the radial roads in the southern parts of the city also serve as jogging tracks for residents.\n\nThe southern arm of the Inner Ring Road (IRR) — between Velachery railway station and GST Road — is a perfect example of this: every day, hundreds of eager fitness enthusiasts can be seen walking and running on this stretch.\n\nR. Satish, a regular jogger on the road, said that right from the day this section of the IRR was thrown open for motorists, walkers had dominated the space as the condition of the road was good and it did not have heavy traffic. And, this section still remained a walker’s paradise, despite certain stretches of the road having become narrow due to construction work, he added.\n\nHowever, residents have complained that the Pallavaram-Thoraipakkam Radial Road, which runs parallel to the IRR, is not the perfect place for running or walking. Their assessment is based on the fact that garbage is dumped and vehicular congestion is common here. Walkers pointed out that the Pallavaram-Thoraipakkam radial road had better conditions, including ample road space and greenery compared to the IRR, but it had been marred by the dumping of garbage by the sides of road.\n\nFlood has changed people’s perspective\n\nThe December 2015 floods have brought about a radical change in the perspectives of many people, many people especially youngsters. Following the catastrophe, many of them devote considerable time to philanthropic activities.\n\nMubarak Abdul Kader, a city-based businessman, who was also actively involved in relief activities, said, “There was an old couple who were roaming the streets of Adyar in search of someone who could give them some money to survive the night, because their son had sent them away. I took the time to speak to them and helped them with whatever money I had. I have begun to empathise and help the ones in need with whatever I can. The deluge has awaked the social consciousness in me.”\n\nMaya Shiva, a housewife, now makes it a point to not throw away things she doesn’t need. “I instead give it to my maid or to the women who live in the slum near my house. Books, newspapers, clothes or food, we do not waste anything now,” she said.\n\n(Reporting by R. Srikanth and Aditi R.)", 
    "section": "national", 
    "title": "Radial roads emerge as fitness spaces", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}