{
    "author": [
        "S Sundar"
    ], 
    "text": "A grief-stricken family of aged Asha Bai and her son Sahayak Mishra from Gwalior in Madhya Pradesh was literally on the platform when their family head Hari Prasad (65) died in a moving train on the midnight of Saturday.\n\nHowever, through extraordinary efforts, the Southern Railway came to the rescue by helping the family that did not know the local language in completing a series of stringent procedures — conducting the post-mortem, cremation of the body and ensuring that the family members boarded the same train on its return journey the same (Sunday) evening with the urn containing the ash of the deceased. “The death of my father was as per his destiny. But I never expected that the railway officials here would come to our succour at the worst time of our life,” Mr. Mishra, a farmer of Damoh district, told The Hindu over phone, sitting in the same berth of the same train.\n\nAround midnight of Saturday, Hari Prasad collapsed in the S2 coach when the pilgrimage special, run by Indian Railway Catering and Tourism Corporation (IRCTC), was approaching Madurai from Dindigul. Later, a railway doctor declared him dead.\n\nThe body was detrained along with six passengers at Madurai and the train proceeded towards Rameswaram after the coach was disinfected.\n\nWhen the issue went to the notice of Chief Commercial Manager Ajeet Saxena, he wanted the officials here to ensure that the family returned home in the same train with all formalities completed at the earliest.\n\nThe Assistant Commercial Manager here, M. Shahjahan, was assigned the task. After counselling the mourning family, the official first made them have their breakfast. Then, he personally visited Tamil Nadu Railway police station and got all formalities done quickly for starting the post-mortem.\n\nHowever, at Government Rajaji Hospital, he faced a problem — post-mortems are not normally conducted on Sundays. “I pleaded with the Dean to treat it as a special case and he obliged,” Mr. Shahjahan said.\n\nThe family members decided to cremate the body in Madurai itself. The railway official liaised with the local police and Corporation for the cremation. And, by late afternoon, the urn with the ashes was handed over to the family. “The CCM instructed us that the IRCTC special should not return without these passengers. But there was no need for stopping the train as everything was completed before the train could return to Madurai at 6 p.m. as scheduled,” Mr. Shahjahan said.\n\nWith such an effort by the railway official, Mr. Mishra’s only disappointment could have been that his father could not go to Rameswaram as per his (the son’s) plan.", 
    "section": "national", 
    "title": "Railway rushes to the help of grief-stricken family", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}