{
    "author": [], 
    "text": "Trenches poorly covered\n\nAlmost all the roads under the jurisdiction of Chitlapakkam town panchayat had been dug up for various reasons — some for laying power cables, some for construction of stormwater drains and so on. However, all the agencies involved have not covered the trenches properly once the works were completed. These roads have been unevenly covered, as a result of which motorists are subjected to considerable strain. Will the authorities concerned look into this matter?\n\nP. Swaminatha Krishna\n\nSelaiyur\n\nEnsure connectivity to Metro stations\n\nResidents appreciate the introduction of small buses (S82 and S85) as they provide access to the Alandur Metro station. But they encounter some problems in how these buses are operated. Though these buses start from the Alandur Metro station, on the return trip, some conductors ask all the passengers to disembark on the opposite side of the station, stating that the stage ends there. Many of the passengers board these buses so that they can alight at the Alandur station and catch the Metro. Hence, bus conductors of S82 and S85 may be instructed to take such passengers to the side where the station is located, and not drop them on the opposite side.\n\nR. Ganesan\n\nAdambakkam\n\nSignboards on streets needed\n\nSome years ago, signboards were installed on many streets in the city, and they were extremely useful for people. However, now it is found that many streets do not sport signboards anymore.\n\nFurther, the ones that had been installed earlier have been defaced. Will the Greater Chennai Corporation arrange for the installation of street signboards wherever they have not been installed so far, and also replace those that have been defaced.\n\nJ. Manohar Singh\n\nAdambakkam\n\n(Readers can send feedback and pictures about civic issues to reporting.thehindu@ gmail.com)", 
    "section": "national", 
    "title": "READeRS' mail", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}