{
    "author": [], 
    "text": "Dance students sway to the percussion beats at the Kalarigramam.Photo: Special Arrangement\n\nA number of foreign students took part in Tantrotsav 2016 hosted by Hindustan Kalari Sangham\n\nFor many foreigners, the city is an irresistible magnet as much for its spiritual succour as its general quietitude.\n\nApart from regular back-packers who head in from international destinations, primarily Europe, there are also several foreigners who come and stay for longer durations to assimilate traditional art and culture.\n\nThe recently concluded Tantrotsav 2016 hosted annually by the Hindustan Kalari Sangham at the Yogishananda Peetham, near Adi Shakti, had a fair share of foreign students among the participants.\n\nThese students, some of whom are trained in contemporary dance, had signed up to learn more about the Kerala martial art of Kalaripayattu, the ritual arts like Theyyam or classical dances such as Bharatanatyam.\n\nThere was an interesting line-up of events during the nine-day festival ranging from residency workshops in Bharatanatyam to kalari classes and theatre with full-fledged cultural performances capping each day. And the organisers seemed to have reserved the best for the last day.\n\nApart from danseuse-educator Rajashree Warrier’s Bharatanatyam performance, there was Malkhamb, Parkour and an enactment of the Ghandakarnan Theyyam, which some people say is rarely staged these days even in the cradle of the ritual art form in north Kerala.\n\nA chendamelam (percussion) that built up the tempo to a crescendo drew the dance students, including the foreigners, out from their seats. And, for the next half an hour or so it was a celebration of absorbing music and improvised dance.\n\nAfter that other-worldly burst of energy, the Hindustani concert that followed was the like the perfect restorative balm.\n\nAs the election commission announced the poll dates for Assembly elections in Tamil Nadu and Puducherry on May 16, political debates have not just confined to public functions.\n\nPolitical debates have become casual conversations at every spot where people gather from retail shops to institutes or public spaces in Puducherry.\n\nAt a small retail provisional store on SV Patil Road, a customer engaged in an impromptu conversation with the shop keeper to inform how the freebies distribution has been affected due to model code of conduct.\n\nNot just that, people are willing to share their thoughts on how the political parties in Puducherry function and which candidate or party should be chosen.\n\n(Reporting by M. Dinesh Varma and S. Senthalir)", 
    "section": "national", 
    "title": "Soaking up Indian culture", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}