{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Close on the heels of arresting four fishermen from Pudukottai district, the Sri Lankan navy has arrested 28 more fishermen – 23 from Pamban and five from here with their three vallams (country boats) and a trawler on charges of poaching when they were fishing on the high seas.\n\nThe Pamban fishermen, who had set out for fishing in three country boats, including one with Thoothukudi registration, were fishing near Mannar Thaulpadu off Gulf of Mannar region on Saturday night, when the Sri Lankan navy arrested them.\n\nIn another incident, the navy from Kankesanthurai arrested five Rameswaram fishermen with their trawler when they were fishing off Delft island.\n\nU Arulanandham, president of the Alliance for the Release of Innocent Fishermen (ARIF) said the Rameswaram fishermen were produced before the Kayts court and remanded in judicial custody in Jaffna prison till March 24.\n\nThe Pamban fishermen, who were handed over to the Mannar Police, produced before the Mannar court and remanded in judicial custody in Vavuniya jail till March 21, he said.\n\nWith this, the Lankan navy has detained 96 fishermen, 79 trawlers and three vallams.\n\nThe arrest came as a rude shock to the fishing community as it comes a couple of days after Chief Minister Jayalalithaa wrote to Prime Minister Narendra Modi, requesting him to direct the officials concerned to take proactive action through diplomatic channels to secure the immediate release of all the arrested fishermen and fishing boats.\n\nFishermen leaders said that the livelihood of fishermen, who were fishing in the traditional waters in Palk Bay, was continuously infringed upon by the Sri Lankan Navy and it was unfortunate that the Centre remained silent.\n\nThere was no sign of Centre’s intervention even after the recent visit of External Affairs Minister Sushma Swaraj to Colombo, they lamented.\n\n‘The Rameswaram fishermen were produced before the Kayts court and remanded in judicial custody till March 24’", 
    "section": "national", 
    "title": "Sri Lankan Navy arrests 28 more fishermen", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}