{
    "author": [
        "L Srikrishna"
    ], 
    "text": "Drinking water distribution likely to be regulated in Madurai which has started experiencing the ‘heat’ already\n\nMadurai Corporation officials are contemplating regulation of drinking water distribution in the city.\n\nThough there was nothing official, plans were being drawn up to supply water once in three or four days, reliable sources said here on Saturday.\n\nWith dwindling water level in Vaigai dam, which stood at 33.20 ft on Saturday against its maximum level of 71 ft, the authorities are examining various options to mitigate water crisis during summer.\n\nWith 100 wards, the city has already started experiencing the ‘heat’ in remote and extension colonies.\n\nWith the government’s commitment to release water for irrigation to the ayacutdars in the region, there has been a steady fall in the storage Vaigai reservoir in the last 30 days.\n\nAccording to sources, apart from releasing water for irrigation, the Public Works Department has to provide water during Chitirai festival when Lord Kallazhagar enters Vaigai river in mid-April.\n\nThe daily distribution may revolve around 8 to 9 million litres. With the mercury touching 37 degree Celsius, the officials have also identified alternative sources from where water could be drawn and distributed.\n\nThe only solace is that the Corporation of Madurai has inaugurated the Cauvery integrated drinking water scheme, which has started benefitting some localities in areas such as Koodal Nagar, Avaniapuram, Silaiman, Chintamani and Iravathanallur.\n\nWary of any violation of model code of conduct, elected representatives have chosen to stay away from day-to-day administration and left decision making to the officials.\n\nThe officials are yet to take a final call on distribution of water. However, an official said they might be in a position to assess only after the water for irrigation was stopped.\n\nA PWD official said that they would release water till March end following turn-system.\n\nThe only good news is that the PWD officials recorded a rainfall of 14 mm in Periyar dam on Saturday, followed by 19.6 mm on Sunday, while the dry spell continued in other parts of the region.", 
    "section": "national", 
    "title": "Storage level in Vaigai dam dwindling", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}