{
    "author": [], 
    "text": "Around 170 students from various engineering colleges participated in the Computer Society of India (CSI) Tamil Nadu State Student Convention, hosted by the Department of Computer Science and Engineering of A.V.C College of Engineering, Mayiladuthurai, and CSI. Apart from paper presentations, events such as Android Application Development and technical quiz were conducted. K. Govinda, regional vice-president, CSI, India, was the chief guest at the inaugural. K. Karthikeyan, secretary and treasurer (in-charge), presided. S. Manikandan of Target Soft Systems delivered a talk on “Mobile Applications.” G. Mahesh, member, Board of Management, delivered the valedictory address. C. Sundar Raj, Principal, A.V.C College of Engineering, was present.\n\nGlobal meet\n\nMore than 180 delegates from India and abroad presented research articles at the IEEE sponsored international conference on “Emerging trends in engineering, technology and science (ICETETS-2016),” organised by Kings College of Engineering, Punalkulam. Kim Kyung-Tae, Professor Emeritus, Hannam University, South Korea, delivered the inaugural address. T.R.B. Rajaa, former chairman of the college, presided. R.V. Balasubramaniam, vice-president, Reliance Jio Infocomm Limited, Mumbai, delivered a special address. An MoU was exchanged between Reliance Industries and Kings College of Engineering.\n\nMr. Kim Kyung-Tae spoke on “How do we perceive 3D objects,” N. Kumarappan, Vice-Chairman, IEEE- Madras section, on “Smart grid,” S.R. Pandian on “Building a smart mosquito trap - intelligent mechatronics for mosquito control research” and S. Raghavan, Professor, National Institute of Technology, Tiruchi, on “Miracles of Microwaves.”\n\nD. Viswanathan, former Vice-Chancellor, Anna University, Chennai, delivered the valedictory address.\n\nP.S. Kannan, Professor Emeritus, Thiagarajar College of Engineering, distributed the certificates in the presence of S. Durairaj, conference chair and Principal.\n\nAlumni gathering\n\nThe Bon Secours College for Women, Thanjavur, organised the alumni gathering. Principal Sr. Victoriya presided. Former Divisional Engineer, TNEB, Aruna Devaraj, was the chief guest. P. Devaraj the guest of honour. Assistant Professor of Information Technology Jackline Jose welcomed the gathering. Assistant Professor of Mathematics Geethanali proposed a vote of thanks.\n\nBudget analysis\n\nThe Gnanam School of Business arranged a panel discussion on budget. It was inaugurated in the presence of Chairman S.P Selvaraj and Chief Executive Officer S.P.S. Arul Doss.\n\nS. Sampath, Chairman, CII Tiruchi, and CEO of Velmurugan Industries, Tiruchi, Chartered Accountant G. Sekar, and advocate S. Jaikumar participated in it. It was moderated by Raghuvir Srinivasan, Associate Editor, The Hindu Business Line.\n\nMr. Sampath explained how the budget was helpful to industry. He noted some pros and cons of the budget like reducing fiscal deficit from 3.9 per cent to 3.5 per cent, FDI, farm based technology and the focus on rural areas . Mr. Sekar spoke about the various types of taxes being imposed but wondered what happened to the promises made in the last budget. He said the GST should have been implemented though it may take some time for the society to adopt. He said this was the first time that the budget did not give much importance to defence.\n\nMr. Jaikumar said the one per cent excise duty levied on gold jewellery was very difficult to admit. He said it could have been more effective if tax was levied on per gram of purchased gold jewellery. He spoke about the infrastructure cess, Krish Kalyan cess and how it will help people.\n\nThe budget is a “Rahul Dravid game,” said moderator Mr. Raghuvir Srinivasan. The whole session gave lot of input to the students.\n\nContest\n\nThe Department of Economics, A.V.V.M Sri Pushpam College, Poondi, under the aegis of the Debate Club organised an inter-collegiate competition. R. Palanivelu, coordinator, Economics Department, and C. Robert Alexander, Dean of Sciences, spoke. From the Bharatidasan University, 13 colleges participated in the contest. Students participated in the various events such as quiz, would be finance minister, dumb charades, elocution, essay writing and cartooning. R. Swaminathan of Economics Department, G. V. Natarajan of Tamil and Malarvizhi of History Departments acted as judges for the events.\n\nWomen’s Day\n\nThe Women’s Day and the 97th birth anniversary of Thanthai Periyar’s partner Annai Maniammaiyar were celebrated at the Periayar Maniammai University. The NSS unit of the PMU and the Indian Red Cross Society organised a blood donation camp. Veeramani Mohana Centre for Quality of Life Engineering Research and M. R. Hospital, Thanjavur, organised an anaemic screening camp. Over 200 students and staff participated in it.\n\nA video about the life of Annai Maniammaiyar was screened in the next session. P. K. Srividhya, Dean (academics), welcomed the gathering. V. Latha, secretary, Women Leadership Forum, read the annual report. Palani Arangasamy, Director, Centre of Excellence for Periyar Thought, presided. Pro Vice-Chancellor M. Thavamani highlighted the UNO pledge for gender parity. Kanmani, Sree Sevugan Annamalai College, Devakkottai, spoke on the life of Annai Maniammi. Tamilmani, obstetrician and gynaecologist, Vinodhagan Hospital, Thanjavur delivered a lecture and distributed prizes. P. Gayathiri, treasurer, Women’s Forum, proposed a vote of thanks.\n\nContributed by\n\nL. Renganathan\n\nand G. Prasad", 
    "section": "national", 
    "title": "Student convention", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}