{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Engineering students engaged in measuring a covering slab at a Swachh Bharat toilet construction site to ensure compliance with norms, in the city.— Photo: M. Periasamy\n\nS. Bharat Kumar, a fourth year civil engineering student of Kathir College of Engineering, is busy before and after college hours running around Kalapatti looking for labour. His job is to engage them for the construction of individual household toilets under the Central Government’s Swachh Bharat Mission.\n\nMr. Kumar as part of the construct-a-thon event involving engineering college students is in-charge of constructing 25 toilets. His job is to engage unskilled labour to dig the septic tank and masons to construct the toilet. And also supervise the work so that it is as per the Mission guidelines.\n\n“In the process of engaging labour and supervising the work, I’m learning labour and resource management,” says the youth.\n\nFor Navashree V.R., a civil engineering student of the SNS College of Engineering, the supervisory role helps her relate to whatever she has learnt in class. “Though the on-field task is a challenge, it helps me relate what I learnt in textbooks and also understand what more is required to get a work executed.”\n\nCollege professor S.L. David Anandaraj says that the assignment of supervising toilet construction will be an eye opener for the students, who will in any case take up jobs in the months to come.\n\nThere are students from PSG College of Technology, SNS College of Engineering, Kathir College of Engineering, CMS, Sri Guru and Park group of institutions who are involved in the project, say R. Raveendran and Suresh Bhandari, who are part of the construct-a-thon event involving the students.\n\nAt present, the students are supervising the construction of nearly 100 toilets, which are in various stages of development, and will soon manage 400 more, they add.\n\nThe students will report at the site on a daily basis, record everyday development in construction and upload the details using a dedicated app. Once completed, they will upload the picture of the toilet and that will help the Coimbatore Corporation release the Central and State government’s subsidies of Rs. 8,000 a toilet, they add.", 
    "section": "national", 
    "title": "Students learn a thing or two about constructing toilets", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}