{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Ramnad district unit of Bharatiya Janata Party opposes its opening\n\nTension prevailed near the railway gate here as the district unit of the Bharatiya Janata Party (BJP) opposed opening of a beef stall near Sandhana Mariamman Temple.\n\nAfter the stall owner distributed pamphlets on Saturday about the opening of the beef stall near the temple, local BJP volunteers, led by ‘Sangathi’ Kannan, protested against the move and lodged a complaint with police.\n\nMandapam police called the two parties for talks on Saturday, when the BJP leaders said that the stall was being opened without proper permission from the Executive Officer of Mandapam township. They had also not obtained clearance from the local health inspector, Mr. Kannan said.\n\nStating that the BJP was not opposed to beef eating, he said that beef was sold in the area twice in a week – on Wednesdays and Sundays – and they had no problem as the shops were located off the main road, he said.\n\nWhen there were no mutton or broiler chicken shops on the main road facing or adjacent to the temple, they would not allow a beef stall to come up there, he said.\n\nDevotees offered worship at the temple after taking out milk pot and ‘mulai pari’ processions and their religious faith would be hurt if they were to pass through the beef stall.\n\nAs Panguni Uthiram festival was nearing, the police should deny permission to running of the shop, failing which the BJP would stage an agitation after mobilising public support, he said.\n\nAs the shop owner claimed that he had obtained permission to open the shop and requested that he be allowed to formally open the shop as he had made all arrangements, the police allowed him to open the shop on Sunday after ensuring that there was no beef for sale in the shop. Sources said that the owner opened the shop and distributed sweets but there was no sale of beef. The police told the shop owner to refrain from selling beef till the dispute was resolved. He was, however, free to sell eatables, the sources said.", 
    "section": "national", 
    "title": "Tension over beef stall near temple", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}