{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Thayumanaswamy Temple, Rockfort : Theppam festival, dwajarohanam, 9 a.m.; Swamy veedhi ula, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sahasranama parayanam, Sri Lakshmi Narayana Swamy Temple, Melur Road, Srirangam, 5.30 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama Nama parayanam, 75, Vinayagar Street, Amman Nagar, 6 p.m.\n\nCULTURE\n\nBharatiya Vidya Bhavan: Cultural evening, keyboard duet by R.Arjun Sambasivan and R.Narayanan and party, Kalai Kaviri College of Fine Arts, 3 p.m.\n\nU.Ve.Sa.Ilakkiya Mandram : Tamil language enthusiasts meet, R.Aruna Devi, speaks, Subbiah Memorial Middle School, Thennur, 6.30 p.m.\n\nGENERAL\n\nBharathidasan University Career and Counselling Cell and PACE Academy : Seminar on Career enhancement, V.Nandha Kumar, Joint Commissioner of Income Tax, Tiruchi, speaks, Bharathidasan University Constituent Arts and Science College, Navalurkuttapattu, 10.30 a.m.\n\nNational College : Principal Saranathan memorial endowment lecture on ‘The eco-ontological literary imperative,’ by Swarnalatha Rangarajan, professor, Department of Humanities and Social Sciences, Indian Institute of Technology, Madras, 11 a.m.\n\nShrimati Indira Gandhi College : Lecture on Fire safety by A.Thanapal, station officer, Tiruchi Fire and Rescue Station, 2 p.m.\n\nSt. Joseph’s College : Rev. S. John Britto SJ, Rector, releases book titled ‘Pierced My Heart’ authored by M. Amutha, Assistant Professor of English, Angayarkan Vinayaka Selvi, Assistant Professor of English, Bharathidasan University, receives first copy, Rev. S. Sebastian SJ, Secretary, Rev. F. Andrews, Principal, speak, T. Vadivu, former Vice Principal, presides, SAIL Auditorium, 11.45 a.m.\n\nPeriyar E.V.R.College: National seminar on Partition literature and its relevance to contemporary India, S.Armstrong, Head, Department of English, Bahuraoji Gholap College, Pune, inaugurates, 10 a.m.\n\nAIMAN College of Arts and Science for Women : College day, Fajila Azad, distributes prizes, 2 p.m.\n\nJamal Institute of management Industry-Institute Partnership Centre : National Management Day, K.Ravichandran, chair person, School of Business Studies, Madurai Kamaraj University, speaks, 9.30 a.m.\n\nJamal Mohamed College : Dr.C.Nainar Mohamed communal harmony endowment lecture by Amuthan Adigal, 11.30 a.m.\n\nHallmark Business School: Student development programme, T.V.Rajendran of Central Film Certification Board, Chennai, speaks, 10 a.m.\n\nM.A.M.College of Engineering : Lecture on C and C+ programming by A.Arockiam, professor, St.Joseph’s College, 2 p.m.\n\nIndian Welding Society : Programme on Welding of automotive steels, Institution buildings, BHEL Township, 9 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}