{
    "author": [], 
    "text": "(From the top) Students receiving a shield at the intramural sports meet of CARE Group of Institutions in Tiruchi; a national conference at Bharathidasan Institute of Technology in Tiruchi; an international conference at Jamal Mohamed College in Tiruchi; bee-keeping being demonstrated to students of Seethalakshmi Ramaswami College in Tiruchi.— Photo: M. Srinath\n\nStudents of Seethalakshmi Ramaswami College were exposed to the basics of bee-keeping at a hands-on training programme organised by the Research Department of Zoology in collaboration with the Tamil Nadu Agricultural University (TNAU) and All India Co-ordinated Research Project on Honeybees and Pollinators (AICRP), ICAR.\n\nM. R. Srinivasan, Professor, Department of Agricultural Entomology, TNAU, was the resource person. He elaborated on various aspects of bee-keeping such as different species of honey bees, their behaviour, bee species distribution, art of acquiring bee-keeping skills and bee-keeping appliances.\n\nMr. Srinivasan and K. Gunasekaran, a commercial bee-keeper from Natham, Dindigul district, gave a demonstration on bee-keeping with a live bee and hive. M. Jayanthi, Principal, was present. Certificates were given to the participants.\n\nGlobal meet\n\nThe Department of Physics, Jamal Mohamed College, organised an international conference on “Recent trends in materials science and applications.” Manickam Sivakumar, Director, Centre for Nanotechnology and Advanced Materials, University of Nottingham, Malaysia, spoke on “Understanding, prospects and constraints of emerging Nanotechnology.”\n\nA compilation of abstracts was released by K. A. Khaleel Ahamed, treasurer, Jamal Mohamed College, and the first copy was received by Mr. Manickam Sivakumar. The electronic version of the abstracts collection was released by S. Ismail Mohideen, Additional Vice-Principal and Bursar, Jamal Mohamed College, and the first copy was received by N. Vijayan, Senior Scientist, Crystal Growth and X-Ray Analysis Section, CSIR-National Physical Laboratory, New Delhi.\n\nMr. Manickam Sivakumar, Mr. Vijayan, D. Mangalaraj, UGC-BSR faculty fellow Bharathiar University, A. John Peter, Head, Department of Physics, Government Arts and Science College, Madurai, Fr. M.S. Xavier, Dean of Studies and Head of Department of Physics, St. Joseph’s College of Arts and Science, Cuddalore, delivered lectures.\n\nAbout 120 papers, including 80 oral presentations and 40 poster presentations, were presented and deliberated at the conference. The best four papers in oral presentation and the best poster presentation were awarded prizes.\n\nNational conference\n\nMore than 80 research and review articles were presented in a national conference on “Recent trends in chemical and petrochemical technology” organised by Department of Petrochemical Technology, Bharathidasan Institute of Technology in association with Indian Oil Corporation. R. Nandakumar, General Manager, IOC, and M. Arulmozhi, Head, Department of Petrochemical Technology, spoke. A book on “Emerging trends in petrochemical technology” and conference proceedings were released by Mr. Nandakumar.\n\nSports meet\n\nFormer Indian kabaddi player and Arjuna Awardee P. Ganesan was the chief guest for the seventh intramural sports meet of CARE Group of Institutions. Mr. Ganesan urged students to take advantage of IT revolution and infrastructure to enhance their career prospects. B. Prative Chend, CEO, CARE Group of Institutions, and N. Meikandan, Director, spoke. Vasudevan, physical director, presented the annual sports report.\n\n“Sensors”\n\nSudhendu Banerjee, Additional General Manager, Design and Engineering Department, C&I Systems, Instrumentation Limited, spoke about the importance of instrumentation and control engineering in various fields of science and technology in his address at “Sensors,” the annual symposium of the Instrumentation and Control Engineering Department (ICED) of National Institute of Technology, Tiruchi.\n\n“Even with the advent of new software, an engineer is required to know how software controls a plant or an entire system of plants,” he said. He spoke about the advent of the Internet of Things and how it helps create jobs and opportunities for instrumentation and control engineering students.\n\nSrinivasan Sundarrajan, Director, National Institute of Technology, Tiruchi, explained how instrumentation formed an important factor in the proper functioning of missiles.\n\nWith the launch of “Make in India” campaign, product designers are much in demand. Students of ICED were awarded with scholarships.\n\nEntrepreneurship programme\n\nThe Department of Commerce AIMAN College of Arts and Science for Women held an entrepreneurship awareness programme sponsored by Ministry of Science and Technology, NSTEDB, and Entrepreneurship Development Institute of India, Ahmadabad. Ramaswami Desai, Project Director, CR Business Solutions, Rajamaheshwari, a woman entrepreneur, Vijayakumari, Managing Director, Oviya Fine Arts, Asha Sulthana, a woman entrepreneur, and M. Hemalatha, Head, MBA Department, M.A.M. College of Engineering, were the resource persons.\n\nCultural management meet\n\nBishop Heber College bagged the overall trophy at “MAM YUGA 2K16,” an inter-collegiate cultural management meet, organised by M.A.M College of Engineering.\n\nAround 280 students from 12 colleges took part. B.G. Venkatesh, co-founder, Campus Tiger, inaugurated the event. Mohammed Nizam, secretary and correspondent of the college, was present. Events such as ad-zap, group singing, group dance and variety show were conducted.\n\nShasminaz Nizam, CEO of the college, distributed the prizes.", 
    "section": "national", 
    "title": "Training programme", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}