{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Several facts and points led the HC to quash an abetment to suicide-cum-corruption case booked against ex-Minister\n\nThe Madurai Bench of the Madras High Court sent shockwaves across the State last week by quashing an abetment to suicide-cum-corruption case booked against former Agriculture Minister ‘Agri’ S.S. Krishnamoorthy after a senior government official, S. Muthukumarasamy (57), committed suicide by jumping in front of a speeding train in Tirunelveli on February 20 last.\n\nSince government employees, their associations, anti-corruption movement activists and many political leaders were taken aback by the verdict, it becomes necessary to delve deep into the judgement and find out what led the court to hold that “on the face of the records available in the matter, it is seen that the petitioner (former Minister) is not involved in the alleged offence”.\n\nAllowing the quash petition, Justice V.S. Ravi pointed out that immediately after the official’s death, Tirunelveli Railway Police had registered a case only under Section 174 (police to report and enquire on suicide) of Code of Criminal Procedure on the basis of a complaint lodged by his wife M. Saraswathi who did not level allegations against the petitioner at that point of time. However, following demands from various quarters for a Central Bureau of Investigation enquiry into the circumstances that led to the suicide, the Director General of Police transferred the case to Crime Branch-Criminal Investigation Department on March 7, 2015, and the latter booked a fresh First Information Report (FIR) in the case, also under Section 174 Cr.P.C.\n\nA day later, the petitioner was stripped of his party posts by the All India Anna Dravida Munnetra Kazhagam and also dropped from the Cabinet. On April 4, the CBCID altered the case to Section 306 (abetment of suicide) of Indian Penal Code and Section 7 of Prevention of Corruption Act, 1988, on the basis of evidence collected and statements recorded from the victim’s family members, friends and colleagues.\n\nA charge sheet was laid before Judicial Magistrate I, Tirunelveli, on September 4 accusing the former Minister, his Personal Assistant Poovaiah and Agricultural Engineering Department Chief Engineer M. Senthil of having exerted pressure on the victim to pay a bribe of Rs. 12.25 lakh, for having appointed seven drivers on consolidated pay, which he could not mobilise.\n\nPF withdrawal\n\nMr. Justice Ravi pointed out that though the CBCID had claimed that the victim had withdrawn Rs. 6 lakh from his Provident Fund account to meet the demand, the investigating agency had failed to bring those documents on record. Further, stating that the entire case rested on hearsay evidence about the petitioner’s involvement, the judge said: “even that hearsay evidence is not direct hearsay evidence.”\n\nObserving that the materials produced in court do not even establish a remote connection between the petitioner and the suicide, the judge said: “There is no mens rea for the petitioner herein to instigate the deceased to commit suicide. It is also relevant to point out that by the suicide committed by the deceased, the alleged demand of money itself could not be achieved.”\n\nHe also laid stress on the fact that the victim was a “well-matured and well-placed” government engineer. Holding that an accused could not be forced to face trial without even prima facie evidence against him, the judge said: “Continuance of the proceedings against the petitioner would clearly amount to abuse of process of the court and definitely result in miscarriage of justice.”\n\nHe also relied upon a catena of decisions rendered by the Supreme Court in similar cases and said: “In the present case also, it is apparent that the petitioner herein has been called upon to face an unnecessary or meritless criminal proceedings.” The judge stressed the fact that the victim’s wife too had not shown interest in contesting the quash petition despite having been served with court notice.\n\n“Bits not adequate”\n\nLamenting that the investigating agency had failed to place “clear, credible, reliable and trustworthy” evidence, the judge said: “A few bits here and a few bits there on which the prosecution relies cannot be held to be adequate… Most of the offences alleged to have been committed by the petitioner carry stringent punishment. Therefore, the prescribed procedures have to be followed meticulously.”", 
    "section": "national", 
    "title": "Why Ex-Minister’s case was quashed?", 
    "subsection": "tamilnadu", 
    "date": "2016-03-14"
}