{
    "author": [
        "Josy Joseph"
    ], 
    "text": "Return of fidayeen attacks, faulty intelligence reports posing a challenge\n\nThe mother of Captain Tushar Mahajan paying tributes to her son in Udhampur on Monday. Mahajan lost his life in a gun-battle with militants in Pampore.— PHOTO: PTI\n\nThe Army lost three of its finest soldiers, two young officers and a jawan from the Para Special Forces in the deadliest fidayeen attack in the Srinagar area in many years. It was not an isolated incident, but part of a disturbing trend of the Army losing some of its finest soldiers as the Kashmir violence flares up yet again.\n\nWhile statistics may hide much of it, the reality is that the Army has lost many of its most experienced counter-insurgency operatives in recent months because of a host of actors, including the return of fidayeen attacks. Among the possible reasons being discussed in intelligence circles is the role of dubious sources planting wrong information on Army units operating in the Valley.\n\nIn the attack on the Entrepreneurship Development Institute campus, Captain Pawan Kumar, 23, of 10 Para, was killed while leading his men into the building on Saturday. Captain Tushar Mahajan, 26, and Lance Naik Om Prakash, 32, of Special Force battalion 9 Para, were killed on Sunday. All the three were para commandos, and their death was chilling capturing the critical role played by these select battalions in fighting militancy in the Valley. butmany Army sources have been expressing concern over the way the Army has been losing its finest officers and soldiers in recent times in the Valley.\n\nEarlier this month, two jawans were killed in a 22-hour gunfight in the Chowkibal forest in Kupwara. Lance Naik Mohan Nath Goswami, another para commando who was awarded Ashok Chakra this Republic Day, was killed in September last year along with another commando. A month later, four more soldiers were killed in the district.\n\nIn November last, Colonel Santosh Mahadik, commanding officer of 41 Rashtriya Rifles, was grievously injured in Kupwara, not very far from where the earlier casualties occurred, and died later. A police officer of the Special Operations Group was also killed in the operations.\n\nMahadik was the second Commanding Officer of a unit to have been killed in the Valley in 2015. Colonel M.N. Rai was killed in January in Tral. Army sources are worried about the growing casualties, especially of the experienced officers and jawans, in the Valley. “We have had a lull for many years until 2013, but that is all over. The casualties are climbing again,” one senior officer said.", 
    "section": "national", 
    "title": "Army battling rise in number of casualties in Kashmir", 
    "subsection": "general", 
    "date": "2016-02-23"
}