{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "President’s Rule was revoked without the Supreme Court’s knowledge and a government headed by Kalikho Pul was sworn in last week.— PHOTO: PTI\n\nRemarking that the Arunachal Pradesh “experiment” to topple State governments may prove “deadly”, the Supreme Court on Monday refused to intervene in the formation of the new government under dissident Congress leader Kalikho Pul, saying the highest judiciary has the power and strength to put the clock back in the sensitive border State.\n\nThe five-judge Constitution Bench, led by Justice J.S. Khehar, is looking into the constitutionality of State Governor J.P. Rajkhowa’s move to advance the Arunachal Assembly session, which eventually triggered a political crisis that lead to the ouster of the Congress-led Nabam Tuki government and proclamation of emergency in the State on January 26 this year.\n\nEarlier in the day, the State’s Congress leaders moved the apex court against the manner in which the President’s rule was withdrawn without the Supreme Court’s knowledge and the formation of the Pul government in the next three hours on February 19.\n\n“The Supreme Court hearing got over at 4 p.m. The proclamation of emergency is lifted at 6.30 p.m. and at 10 p.m., the new government under Kalikho Pul is sworn in on February 19,” senior advocate Kapil Sibal submitted.\n\n“Arunachal Pradesh is an experiment... this is the way they will topple governments in other States. Everything we feared came true,” Mr. Sibal, accompanied by senior advocate Fali Nariman, submitted.\n\n“If so, then this is a deadly experiment... there may be a thought that this is in distant Arunachal Pradesh. But even so, our judgment will have an impact all over the country,” Justice Khehar responded.\n\nBut the Bench refused to take up the issue of the formation of the Pul government, saying “this is a legislative matter and we will not interfere”.\n\nComprehensive dealing\n\nThe court told the Congress leaders that it should be allowed to comprehensively deal with the issue rather than in a piecemeal, “hotchpotch” fashion.\n\nMr. Nariman pointed out that State Governor J.P. Rajkhowa was party to this litigation, his counsel was present in the courtroom on February 19, yet did not consider to inform the Bench about his plans to recommend to the President for withdrawal of the proclamation of emergency issued on January 26.\n\nThe senior lawyer said the court might continue to hear the case, but “meanwhile, they will buy more MLAs and go on to form a two-third majority”. “You should have more confidence in us. We will consider all the issues. Please read the paragraph in the S.R. Bommai judgment on our powers of judicial review,” Justice Khehar said.\n\nMr. Sibal pointed out that in the interim between 6.30 p.m. to 10 p.m. — from the moment the President’s rule was withdrawn to the formation of the Pul government — no government was in power in Arunachal Pradesh. “Our Constitution does not allow such hiatus,” he submitted. Mr. Sibal contended that the Nabam Tuki government was only in a state of “suspended animation” when President’s rule was proclaimed. On its withdrawal, they should have been re-instated, he said.", 
    "section": "national", 
    "title": "Arunachal: SC refuses to intervene", 
    "subsection": "general", 
    "date": "2016-02-23"
}