{
    "author": [
        "P M"
    ], 
    "text": "The description of a peaceful protest staged on the Kuvempu University campus here, demanding a probe into the death of Rohith Vemula — Hyderabad Central University research scholar who committed suicide — as an “act of sedition” has triggered serious displeasure among students.\n\nA signature campaign is being planned against such “branding.”\n\nResponding to the Statewide protest called by Rohith Vemula Nyayapara Horata Samiti (RVNHS), students of Kuvempu University staged a protest on the campus on February 16. A few professors also attended the meet.\n\n‘Anti-national’\n\nThe next day, the Bharatiya Janata Party Yuva Morcha staged a protest in Shivamogga alleging that some professors of the university were “trying to inculcate anti-national feelings” among students in the name of Rohith Vemula.\n\nThe BJP activists alleged that Kuvempu University was becoming an “abode of anti-national elements.” Instead of discharging their academic responsibilities, the professors were trying to mislead the students, district BJP Youth Morcha president Bhavani Rao More alleged, and demanded the arrest of the professors for “conspiring against the nation.”\n\nNow the RVNHS has launched a signature campaign to condemn the charges of sedition levelled against the teachers and students.\n\n“The students and professors respect the right enjoyed by the BJP to stage a protest. However, levelling baseless allegations and labelling us traitors and anti-nationals is unacceptable,” he said.\n\nRajendra Chenni, Chairman, Department of Post-Graduate Studies in English, who was part of the programme, said the event began by observing a minute’s silence for the soldiers who died in Siachen recently. “The death of Vemula was mourned and the entire programme was held in a dignified manner. None of the students and professors, who addressed the programme, took the name of any political party or organisation. It is unfortunate that charges of sedition are levelled against the participants,” he said.\n\n‘Baseless’\n\nJ. Somashekhar, Registrar of Kuvempu University, said the charges levelled against the students and professors were “totally baseless.”\n\nThe protest was staged by the students in a peaceful manner. “Student activism is a trait of a healthy democracy and the university doesn’t like to impose any restrictions,” he said.\n\nStudent activism is a trait of a healthy democracy, says university Registrar J. Somashekhar", 
    "section": "national", 
    "title": "BJP youth wing terms ‘anti-national’ Vemula protest at Kuvempu varsity", 
    "subsection": "general", 
    "date": "2016-02-23"
}