{
    "author": [
        "Omar Rashid"
    ], 
    "text": "We want BHU to be like Nalanda and Taxila, Prime Minister tells students\n\nPrime Minister Narendra Modi presenting a certificate to a meritorious student at the Centenary Year Convocation of BHU at Varanasi on Monday. Chancellor and Congress leader Karan Singh and HRD Minister Smriti Irani are seen.— Photo: Rajeev Bhatt\n\n“The student within you should not die, should not shrivel,” Prime Minister Narendra Modi said here on Monday urging students to not give up their curiosity.\n\nAddressing students at the centenary convocation of the prestigious Banaras Hindu University, Mr. Modi said: “Curiosity makes the roots of development stronger. If curiosity ends, life becomes stagnant…there should be a zeal to do something new every moment.”\n\nDeclines award\n\nTo honour Mr. Modi, the BHU had offered to confer on him an honorary doctorate in law. However, Mr. Modi declined it “politely” saying the city had already offered him a lot. “I believe, the more I can keep away from these things, the better. That is my endeavour. But I am grateful to the Vice-Chancellor and the University for choosing me,” Mr. Modi said.\n\nThe event was conducted amid tight security and CCTV cameras to avoid a repeat of last month's incident in Lucknow when a few Dalit students shouted anti-Modi slogans during a convocation.\n\nTelevision reports said a student was roughed up during the event by unknown persons after he went on camera demanding that student union elections be restored in BHU.\n\nLavishing praise on Pandit Madan Mohan Malviya, the founder of BHU, for his vision, Mr. Modi said the seed sown by Mahanama, as he was popularly known, had developed into a huge tree of wisdom and knowledge.\n\nMahanama’s steps were followed by Mahatma Gandhi who then set up the vidyapeeth in Gujarat, the Prime Minister said. “If we see the work he [Malviya] did 100 years ago, we know what a visionary he was ,” Mr. Modi said. The purpose of institutes such as BHU was to form a force of nation builders, he added.\n\nMr. Modi maintained silence over the current unrest at the JNU in the national capital.\n\nHe asked the students if they had solutions for the problems and challenges facing the country. “We want BHU to be like Nalanda and Taxila,” Mr. Modi told the students.\n\nMakes no comments on\n\nthe unrest in Jawaharlal\n\nNehru University", 
    "section": "national", 
    "title": "Don’t let the student in you die, says Narendra Modi", 
    "subsection": "general", 
    "date": "2016-02-23"
}