{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The levels in India have increased over the years, North India being the most polluted.\n\nThe average Indian was exposed to more particulate matter than the average Chinese citizen in 2015 — the first time that has happened in the 21{+s}{+t}century — according to a report released here on Monday.\n\nGreenpeace analysed NASA’s satellite data of particulate matter from 2003 to 2015 in India and China, and found that the pollution levels in China peaked in 2011 and then started to gradually reduce. India, however, saw a spike over the past decade, the last year being the worst on record. The study looked at the aerosol optical depth, which is the amount of fine solid particles and liquid droplets in air.\n\nAfter a public outcry, China implemented a national air pollution action plan in 2013 that included stricter emission norms for coal-based power plants and industries and greater enforcement of standards. The results of these measures show in the satellite data: there is a slight reduction in pollution in Central and Eastern China.\n\nThe levels in India have increased over the years, North India being the most polluted part of the country. The biggest jump was seen in West Bengal, Bihar, Uttar Pradesh and the National Capital Region. With a population-weighted analysis, the report found that the average citizen in India was exposed to more pollution in 2015 than his or her Chinese counterpart.\n\nThe report said that the AOD levels in Indian cities — Patna, Kolkata, New Delhi, Gorakhpur, Kanpur and Varanasi — all went up from 2005 to 2015. But not all of the highly-polluted big cities are covered by the air pollution monitoring network. There are 89 cities with a population of more than 5 lakhs, but only 17 have continuous air quality monitoring systems. The National Air Quality Index covers 23 cities with 39 stations, as opposed to 1,500 monitoring stations in China. Among the most polluted cities that lack continuous monitoring data are Durgapur, Gorakhpur, Asansol, Shiliguri, Bareilly and Ludhiana.\n\nMeanwhile, China’s actions led to a 17 per cent reduction in PM2.5 from 2010 to 2015, while India saw a 13 per cent increase over the same period. In comparison, the United States saw a 15 per cent decrease. Comparing the situation in India and China, Greenpeace East Asia air pollution specialist Lauri Myllyvirta said: “China is an example of how determined policies and tougher enforcement can turn the tide on air pollution to people’s benefit.”\n\nMr. Myllyvirta, one of the authors of the report, said India too needed to adopt strict and time-bound measures. Sunil Dahiya, a campaigner with Greenpeace India, said India should set a deadline for meeting air quality standards.", 
    "section": "national", 
    "title": "India’s pollution levels beat China’s: study", 
    "subsection": "general", 
    "date": "2016-02-23"
}