{
    "author": [], 
    "text": "Hussein Adil started on the project after a close friend was killed in a car explosion in Baghdad\n\nA youth in a mock bomb suit, designed by Iraqi artist Hussein Adil, walks during a public performance in the streets of Baghdad.— Photo: AFP\n\nThe man in the bulky bomb disposal suit waved at a gaggle of awed children as he walked down a Baghdad street and sat outside a small cafe to drink tea.\n\nBut there was no bomb to defuse on Rasheed Street that day, and no armour inside the black suit to protect him from explosives.\n\nIraqi artist Hussein Adil designed the mock bomb suit — complete with huge helmet and visor — himself for this performance.\n\n“We had to make this one because there aren’t many bomb suits in Iraq,” he said. “We have to be one of the countries in the world that needs them the most.”\n\nMr. Adil, a wispy 20-year-old with a wild head of tight curly hair, is one of an ever growing number of Iraqi artists looking for new ways of tackling the violence they grew up with.\n\nThe inspiration for his “bomb suit happening” was the death last year in a suicide car bombing of his close friend Ammar al-Shahbander, a much-loved journalist.\n\nMr. Adil, Mr. Shahbander and two other friends were heading to a cafe to drink tea in Baghdad’s Karrada district when an important call came in on his mobile phone.\n\n“I told them to go ahead, that I would follow them in five minutes,” Mr. Adil said.\n\nHe heard an explosion moments later. After searching for them for hours, he found one of his friends with a head injury in hospital and was told that Mr. Shahbander had been killed.\n\nTwo weeks later, he dreamt that a bomb would go off near a square in central Baghdad and, after waking up, immediately called his friends and his father to tell them.\n\nAn explosion rocked the exact spot later that day.\n\n“My friends called me to ask me how I knew, it was a very strange thing,” he said, adding it was then that he started looking for ways to express his angst through art.\n\nBaghdad has been rocked by hundreds of car bombs over the years, sometimes several in a day during periods when violence peaked.\n\nThose blasts and other attacks have killed tens of thousands of civilians and left many residents with deep trauma that remains when violence ebbs, as is the case now in the city.\n\nSimple but powerful\n\nAdil thought of a simple performance, during which one of his friends would go about normal daily activities in Baghdad wearing a bomb suit.\n\n“I thought, why isn’t there some kind of outfit that can protect us? Other approaches produced no results so I looked at individual solutions,” Mr. Adil said.\n\nThe decrepit charm of the once glorious Rasheed Street’s ornate arcades and derelict theatres provides an odd backdrop for the dark figure casually walking in full mock ordnance disposal gear.\n\nAs they saw the figure trudging along, arms asway and head ensconced in a massive ballistic collar, some passers-by seemed alarmed or amused. Others barely turned their heads to look.\n\n“I suppose they have their reasons for doing this kind of art, but personally I don’t see what it’s going to change about what our country is going through,” said Abu Ibrahim, a local shop owner.\n\nThe person in the bomb suit walked into buildings to chat with people, ordered tea at a cafe and inquired about prices at a tailor’s shop.\n\n“I could feel people looking at me. Some were laughing, some were perplexed and others looked like they wanted to try it on,” said the young man in the suit.\n\nMr. Adil will repeat the performance in various locations of the capital and wrap up his experiment with a photo exhibit. “I wanted to show the public what we have come to... and plant this question in their heads: what if we all looked like this?” — AFP", 
    "section": "national", 
    "title": "Iraqi artist imagines everyday life in a bomb suit", 
    "subsection": "general", 
    "date": "2016-02-23"
}