{
    "author": [
        "N J"
    ], 
    "text": "Kerala temple boards and priests oppose changes in customs and rituals\n\nDevaswom Board president Prayar Gopalakrishnan at a meeting of temple priests to discuss various issues, in Thiruvananthapuram on Monday.— Photo: S. Mahinsha\n\nRepresentatives of devaswom boards and temple priests have unanimously opposed changes in temple rituals.\n\nA meeting of representatives of devaswom boards and priests of various temples in Kerala held here on Monday, under the aegis of the Travancore Devaswom Board (TDB), expressed their concern over altering the custom and rituals.\n\nThe meeting condemned the cases registered against board presidents and members for parading elephants, displaying fireworks, and using public address system as part of temple festivals.\n\nBriefing reporters on the deliberations at the meeting, TDB president Prayar Gopalakrishnan said the issue of giving access to women at Sabarimala was not discussed since it was pending at the Supreme Court.\n\nRates for various offerings would be evened out in temples across the State. Mr. Gopalakrishnan said certain quarters, including the government and government agencies such as the Forest Department, were trying to impede the smooth functioning of the boards.\n\nThe meeting resolved to resist such moves. No one should aspire to curb the functioning of the boards, he said.\n\nThe meeting decided to evolve a system for coordinating the functioning of all devaswom boards in the State. A meeting would be held here on February 27 to discuss the significance of custom and rituals in temples. Gouri Lakshmi Bayi, member of the royal family of the erstwhile State of Travancore, would address the meeting. The next meeting of the boards’ representatives for coordinating the functions of the boards would be held at Guruvayur. The meeting asked Mr. Gopalakrishnan to take forward the initiative.\n\nMr. Gopalakrishnan said special prayer sessions had been planned in all temples under the board on March 7 in connection with the Sivarathri celebrations. It had also been proposed to hold a meeting soon of all organisations involved in Ayyappa Seva.\n\nM.P. Bhaskaran Nair, president, Cochin Devaswom Board; Panampilly Raghava Menon, chairman, Koodalmanickam Devaswom Board; Ajay Tharayil and P.K. Kumaran, members TDB; C.P. Ramaraja Prema Prasad, Commissioner, TDB; V.S. Jayakumar, secretary, TDB; V.T. Surendran, member, Malabar Devaswom Board; E.A. Rajan, member, Cochin Devaswom Board; K. Gopinathan, member, Guruvayur Devaswom Board; R. Sangamesh Varma, representative of Zamorin, were among those who attended the meeting.", 
    "section": "national", 
    "title": "‘Issue not discussed as it is pending in SC’", 
    "subsection": "general", 
    "date": "2016-02-23"
}