{
    "author": [
        "R Ramabhadran Pillai"
    ], 
    "text": "The seaplane flown in from the U.S. in October last year by Seabird Seaplane Private Limited, a company based in Kochi, is yet to make its trial run on Indian waters. The trial run is a prerequisite for the 10-seater amphibian aircraft to get a nod from the Directorate General of Civil Aviation for operating flights within the country.\n\nThe aircraft, which landed at the Cochin International Airport four months ago, has been undergoing examinations for obtaining an Indian licence. The company, which plans to operate flights from Kochi to Lakshadweep, is hopeful of getting all the required clearances within two months. “Commercial operations are expected to start by the end of March or early April,” a spokesman of the company told The Hindu .\n\nThe plane, which is currently stationed in Sri Lanka, will be flown in for local trials on water. The air-route trials in the Kochi-Lakshadweep sector have been carried out. A ‘waterdrome’ has to be set up at Agatti for the plane to land. It is now for the authorities to set up the necessary infrastructure for the operation of the seaplane. Seabird plans to operate flights in the Kochi-Lakshadweep sector initially.\n\nMeanwhile, the waterdrome in Kollam is ready. At the same time, plans for setting up a waterdrome in Alappuzha have not been abandoned though there was initial opposition from fishermen. Tour operators in Alappuzha, a place known for houseboat tourism, are supportive of the seaplane project. More than 1,000 houseboats are being operated in the water bodies of Alappuzha.\n\nThough the authorities had zeroed in on Punnamada in Alappuzha to set up the waterdrome, they later decided to go for Vattakayal in line with an expert committee’s recommendation following opposition from fishermen.\n\nThe apparatus required for setting up the waterdrome has been brought to Vattakayal, and the facility could be set up at short notice, sources in the water transport sector said.\n\nThe DGCA will now have to examine the waterdromes before granting permission to seaplanes to use them.", 
    "section": "national", 
    "title": "Kerala seaplane project yet to take off", 
    "subsection": "general", 
    "date": "2016-02-23"
}