{
    "author": [
        "Y Mallikarjun"
    ], 
    "text": "The Microsoft CEO will figure in the lesson titled ‘ Spoorthi Pradaathulu ’ along with writer Sanjeev Dev and mountaineer Malli Mastan Babu .— File Photo\n\nMicrosoft CEO Satya Nadella will serve as an inspiration to high school students in Andhra Pradesh from the coming academic year, beginning June 2016.\n\nApart from Mr. Nadella, the late mountaineer Malli Mastan Babu, who was the fastest to climb seven tallest peaks in the seven continents, and eminent painter and writer Sanjeev Dev (who died in 1999) also figure in the lesson titled ‘ Spoorthi Pradaathulu ’ (Role Models) in the Telugu non-detailed book for eighth standard.\n\nThe Andhra Pradesh Government has revised Telugu non-detailed books from sixth to 10th standards and English textbooks from first to fifth standards.\n\nLessons on eminent radiation oncologist, Nori Dattatreyudu, and oil technologist the late S.D. Tirumala Rao, also have been included in ninth standard Telugu non-detailed textbook, AP State Council of Educational Research and Training (APSCERT) Director M.V. Rajya Lakshmi told The Hindu here on Monday.\n\nOther Telugu lessons in the non-detailed text for sixth grade focus on festivals and great leaders — Uyyalawada Narasimha Reddy and Kaneganti Hanumanthu, both freedom fighters. Apart from seeking to draw inspiration from great personalities, the revised curriculum seeks to highlight the importance of local culture, tradition and festivals.\n\nPopular classical dance, Kuchipudi, and different folk forms ‘Harikatha’, ‘Burra Katha’, ‘Tappeta Gullu’ and ‘Kurra Vanji’ have been included in the seventh standard Telugu non-detailed book.\n\nAnother lesson titled ‘Mana Rajadhani’ in 10th class Telugu textbook encapsulates the hoary past and the historical importance of the ancient town of Amaravati, apart from giving an account of the upcoming world class capital of Andhra Pradesh.\n\nThe importance of education and the need to curb child labour gets highlighted in a newly added lesson in Telugu non-detailed book for seventh standard students. In Social Studies, new lessons on financial literacy and the role of cooperative banks have been included for high school students.", 
    "section": "national", 
    "title": "Nadella to figure in A.P. Class 8 textbook", 
    "subsection": "general", 
    "date": "2016-02-23"
}