{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Asserting Nepal’s sovereignty, visiting Prime Minister K.P. Sharma Oli on Monday said that ties between India and Nepal should be based on the “principle of sovereign equality”.\n\n“Respect for the principles of sovereign equality and mutuality of benefits is essential to promote a healthy and friendly relationship”, Mr.Oli said. “Our cultural connections are deep. Pashupatinath and Bishwanath, Janakpur and Ayodhya, Lumbini and Bodhgaya and many more are icons of our shared civilization and our relationship should not be judged on the basis of agreements and treaties”, Mr. Oli said, while delivering a speech at the Indian Council of World Affairs (ICWA).\n\nMr.Oli’s comments came a day after he defended Nepal’s new Constitution, which he described as a “living dynamic document” that had emerged out of a long process of democratic struggle to end discrimination. His assessment of the constitutional democratic process went against India’s viewpoint.\n\nReflecting the Indian concern for the democratic process in Nepal, External Affairs Minister Sushma Swaraj said that concerned about the developments inside Nepal, India was playing the role of an “elder brother”. “India’s role of an elder brother is not similar to the Western concept of a Big-Brother”, Ms.Swaraj said, highlighting that India had tried to play a constructive role during the five-month-long economic blockade which began after the promulgation of the Constitution on September 20, 2015.\n\nMr. Oli asked India to make most of the opportunities provided by Nepal and partner the new development process. “The political struggle has ended and the economic progress of Nepal has begun. India is one of the major economies in the world today, and Nepal wishes to partner India on this path”, he said.", 
    "section": "national", 
    "title": "Nepal PM Oli pitches for equality in bilateral ties", 
    "subsection": "general", 
    "date": "2016-02-23"
}