{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "Student activist Umar Khalid, centre, at Jawaharlal Nehru University on Monday. Khalid, one of the five students accused of sedition, returned to the campus on Sunday.— Photo: PTI\n\nThe Supreme Court said on Monday that there was “nothing explosive” in the reports filed separately in sealed covers by the Delhi Police, the Registrar General of Delhi High Court and its own team of lawyers who visited the Patiala House courts to take stock of the mob violence of February 17. All they contained were “allegations and counter-allegations.”\n\nThe police and the Delhi High Court seemed to agree in their reports that the JNUSU president Kanhaiya Kumar was not assaulted inside the courtroom as mentioned by the lawyers’ team. According to the lawyers’ team, Kumar was “thumped” by a “gentleman in dark glasses” inside the courtroom in the presence of senior police officers and the Registrar General of the High Court.\n\nSenior advocate Rajeev Dhawan, who was in the six-member lawyers’ team sent by the Supreme Court, told a Bench of Justices J. Chelameswar and A.M. Sapre that the police did not intervene despite the Registrar General asking them to.\n\nPolice disagree\n\nMr. Dhawan, who admitted that the lawyers’ team was not witness to this incident, said it happened despite strict orders from the Supreme Court to restrict entry and exit into the court complex.\n\nHowever, Delhi Police counsel and senior advocate Ajit Sinha did not agree completely with the report of the lawyers’ team and refused to sign it. Instead, he separately filed a one-page report in the Supreme Court.\n\nAll the reports were filed in sealed covers and the Bench ordered that they could be distributed in the next three days from the apex court registry.\n\nDuring the hearing, Solicitor General Ranjit Kumar asked the court for an assurance that the reports, if released to the media, would not “influence” the Delhi High Court’s hearing of Kanhaiya Kumar’s bail application on February 23.\n\nPlea disallowed\n\nThe Bench refused to entertain a petition filed by the Karkardooma Bar Association alleging that “cultural celebration” organised by the JNU students was in actuality an occasion to condemn the Supreme Court judgment to execute Parliament attack convict Afzal Guru as a “judicial killing.”", 
    "section": "national", 
    "title": "Nothing explosive in reports: SC", 
    "subsection": "general", 
    "date": "2016-02-23"
}