{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A BJP MP from Gujarat, Vithal Radadia, has supported the demand of the Patidar community for OBC status and reservation in education and government jobs on the similar lines of the Haryana government’s decision to offer quota benefits to the Jats, who launched a violent agitation forcing the authorities to impose curfew and call in Army in major towns.\n\n“If Jats get reservation, so should Patidars,” said Mr. Radadia, a leading Patidar leader in Saurashtra.\n\nMeanwhile, taking a cue from the Jat agitation in Haryana, which forced the government to offer them reservation, the Patidar community in Gujarat is also set to intensify its agitation demanding OBC status and quotas in the jobs and universities.\n\n“We have been agitating peacefully for seven months but the State government has ignored our demand and instead jailed our leaders slapping them with sedition cases. It seems the Gujarat BJP government is inviting Naxalism in the State,” said Varun Patel, spokesman of the Patidar Anamat Andolan Samiti, an outfit that launched the agitation in last July.\n\nAccording to Mr. Patel, more than 350 members of the Patel community are on fast demanding release of Patel members who have been jailed, and seeking quotas.\n\n“Three members, Mahesh Patel, Ashish Patel and Rakesh Patel are on fast for as many as 18 days, they were admitted to hospital twice, their health deteriorated and yet no representative of the government or the BJP or the Congress has visited them,” Mr. Patel said, indicating that the agitation would be intensified in coming days.\n\nMeanwhile, a day after a State transport corporation bus was torched allegedly by Patidar community members, the police have filed a case of attempt to murder against a mob and closed more than 154 routes in Botad district.\n\nIn last few days, four buses were allegedly set on fire by angry mobs demanding the release of agitation leader Hardik Patel, lodged in a Surat jail facing sedition case.\n\nProtest against the slapping of sedition case against leaders of the community", 
    "section": "national", 
    "title": "Patidars to intensify protest in Gujarat", 
    "subsection": "general", 
    "date": "2016-02-23"
}