{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "While the government may be wanting Central universities to hoist the tricolour in an apparent bid to make these more “nationalist” spaces, the RSS recently recalled how some members of a 1931 committee had seen the idea of representing different religions as colours on the national flag as “communal”.\n\nRSS Akhil Bharatiya Prachar Pramukh Manmohan Vaidya said this at a Sangh seminar on “secularism” in Chennai months ago.\n\nThe RSS is the ruling BJP’s ideological mentor.\n\nThe release of the event sent to the media had quoted Mr.Vaidya as saying, “Quoting the discussions in the Flag Committee (constituted by Congress Working Committee in 1931), he explained how the stalwarts of the committee felt that representing different religions as colours of the national flag was in itself a communal thought and how the committee agreed that a saffron flag with a blue charkha would be the best representation of the Indian ethos”.\n\nThe release added: “He concluded adding that the perversion of the concept of secularism in India has resulted in the terming of nationalists as communal and people with communal thinking being hailed as secular”.\n\nWhen contacted about this statement on Sunday, Mr.Vaidya told The Hindu : “That debate is a part of history, not of the present”.\n\nAs early as 1948, Sardar Patel had doubts about the Sangh’s acceptance of the tricolour.\n\nHe had made explicit acceptance of the national flag one of the conditions for lifting the ban that was imposed on the Sangh after Mahatma Gandhi’s assassination.\n\nPatel said at a Congress meet on December 17, 1949, in Jaipur that any organisation seeking to supplant the national flag by another would be sternly dealt with.\n\n“Sardar Patel, who vehemently condemned the activities of the RSS, was loudly cheered at the conclusion of his speech”, says a newspaper report of the event, reproduced in Vol. XIII of the Collected Works of Sardar Vallabhbhai Patel, edited by P.N. Chopra and Prabha Chopra.\n\n“It was under that flag that the Congress made great sacrifices, and today, under no circumstances would they give up the ideal for which they had lived and worked”.\n\nPatel told Congressmen he had made his view very clear to RSS leader M.S. Golwalkar, “The national flag must be universally accepted, and if anyone thought of having an alternative to the national flag, there must be a fight. But that fight must be open and constitutional”.\n\nHome Secretary H.V.R. Iyengar had written to Golwalkar in May 1949, stating, “An explicit acceptance of the national flag would be necessary for satisfying the country that there are no reservations in regard to allegiance to the State”.", 
    "section": "national", 
    "title": "RSS considered idea of tricolour communal", 
    "subsection": "general", 
    "date": "2016-02-23"
}