{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "Action unwarranted, says brigade chief Trupti Desai\n\nThe Maharashtra police on Monday detained Trupti Desai, leader of the women’s outfit, the Ranragini Bhumata Brigade (RBB), less than a month after they foiled the brigade’s campaign to breach the inner sanctum of the Shani Shingnapur temple in Ahmednagar district.\n\nThe RBB on Sunday proposed fresh parleys with temple trustees and residents of Shani Shingnapur with a view to breaking the impasse over the brigade’s efforts to do away with the 400-year-old tradition barring women from offering worship at the inner sanctum.\n\nHowever, the RBB volunteers, who set out in two cars from Pune, were detained by security personnel as they entered Ahmednagar district on Monday afternoon.\n\nMs. Desai and five other activists were apprehended and taken to police headquarters in Ahmednagar where a case under Section 149 (unlawful assembly) of the Indian Penal Code was slapped on them.\n\n“The police action is highly condemnable and utterly unwarranted. We had already discussed our meeting in advance with the temple trustees and they had readily assented. It seems that rather than the trustees or the villagers, the administration is jittery about letting us open any dialogue to break this deadlock,” said Ms. Desai.\n\nShe said the purpose of a fresh dialogue with the trustees and villagers was to emphasise that the RBB was capable of solving this issue through democratic means.\n\nEarlier this month, Ms. Desai met the trustees in the presence of the Ahmednagar District Collector and the Superintendent of Police to resolve the temple imbroglio. The disputing parties had agreed to abide by Chief Minister Devendra Fadnavis’ decision on the issue.\n\n“We had agreed on this fresh meeting with the hostile parties as the Chief Minister’s ruling is pending,” said Ms. Desai. However, contrary to her view, the temple’s trustees said they were not “too keen” on the meeting with the RBB, a view seconded by the villagers.", 
    "section": "national", 
    "title": "Shani temple row: police detain women activists", 
    "subsection": "general", 
    "date": "2016-02-23"
}