{
    "author": [], 
    "text": "Imagine a window in your living room that could double as a giant thermostat or a big TV screen. A new glass technology may make it possible.\n\nResearchers at the University of British Columbia (UBC) in Canada have found that coating small pieces of glass with extremely thin layers of metal like silver makes it possible to enhance the amount of light coming through the glass.\n\nThis, coupled with the fact that metals naturally conduct electricity, may make it possible to add advanced technologies to windowpanes and other glass objects, researchers said.\n\n“Engineers are constantly trying to expand the scope of materials that they can use for display technologies, and having thin, inexpensive, see-through components that conduct electricity will be huge,” said UBC Associate Professor and lead investigator Kenneth Chau.\n\n“I think one of the most important implications of this research is the potential to integrate electronic capabilities into windows and make them smart,” said Prof. Chau.\n\nThe next phase of this research, added Prof. Chau, will be to incorporate their invention onto windows with an aim to selectively filter light and heat waves depending on the season or time of day.\n\nThe theory underlying the research was developed by Prof. Chau and collaborator Loic Markley, an assistant professor of engineering at UBC.\n\nThe researchers questioned what would happen if they reversed the practice of applying glass over metal — a typical method used in the creation of energy-efficient window coatings.\n\n“It’s been known for quite a while that you could put glass on metal to make metal more transparent, but people have never put metal on top of glass to make glass more transparent,” said Dr. Markley.\n\n“It’s counter—intuitive to think that metal could be used to enhance light transmission, but we saw that this was actually possible, and our experiments are the first to prove it,” he added.\n\nThe research was published in the journal Scientific Reports . — PTI", 
    "section": "national", 
    "title": "‘Smart’ windows that turn into TV screens", 
    "subsection": "general", 
    "date": "2016-02-23"
}