{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "The memorandum on restricting foreign travel issued on January 5, 2016 (No.4(4) /E.Coord/2015) by the Department of Expenditure says that delegation sizes must be “kept to a bare minimum” and recommends “leveraging modern technology” instead.\n\n“In respect of objectives that can be achieved through the exchange of letters, or tele/video conferencing or representation from our Missions abroad, no foreign visit need be undertaken,” says the memo.\n\nA Finance Ministry official stresses that the memo is not targeted at the MEA, and that if there are issues, then “remedies can be discussed”, adding that no formal complaint has been received from the MEA or any other Ministry on the issue.\n\nMEA officials say cost cannot be the only consideration, explaining that they are involved in the planning of every foreign visit, and as the ‘nodal’ or coordinating authority for delegations going abroad, they can’t be left out. They also point out that while video conferences might work for technical conversations, most interlocutors will not discuss classified, political or strategic matters over a telephone or computer.\n\nThe MEA is equally upset by the stipulation that “no officer shall undertake more than 4 visits abroad in a [calendar] year.”\n\nWhile the rule on four visits was introduced in 2006, this year’s memorandum says all visits by Secretaries to the government exceeding four visits must be approved by the Prime Minister himself, through the Screening Committee of Secretaries (SCoS).\n\n“The Foreign Secretary completed four visits abroad within the month of January itself,” one official says, explaining that MEA officials, by definition must travel more than others, “Does that mean he has to submit himself to this process every time he travels in the next 11 months?.”\n\n“Isn’t the Prime Minister already too occupied, to have to clear these as well?” asks another official.\n\nAsked for a response, the Ministry of External Affairs spokesperson refused to comment on “internal Government of India processes.” The Hindu sent a detailed questionnaire to the Ministry of Finance on Friday, but received no official response.\n\nMEA officials say until the issues are resolved, however, their ability to give political clearances will be hampered by the new regulations.\n\nMost interlocutors will not discuss sensitive matters over a telephone or computer", 
    "section": "national", 
    "title": "Tour restrictions irk MEA", 
    "subsection": "general", 
    "date": "2016-02-23"
}