{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "At its meeting, Central government committee considers several options to grant reservation\n\ncommittee headed by Union Parliamentary Affairs Minister M. Venkaiah Naidu to look into the demands of the Jat community for reservation in government jobs in Haryana held its first meeting here on Monday even as violence continued in the State.\n\nTop sources present at the meeting said the committee, which include Union Ministers Mahesh Sharma and Sanjeev Balyan and BJP leaders Satpal Malik and Avinash Rai Khanna, was considering several options after the government agreed, in principle, to extend reservations to Jats.\n\n“The first option is to give the community reservation through the Backward Classes (BC) category, which is for agrarian communities. The Jats are the only agrarian community left out of the Mandal recommendations. It has a provision of 11 per cent reservation within the OBC category,” a source said.\n\nThe second option is to make a special category reservation for them as Haryana has a total of 47 per cent reservation in jobs (20 per cent for scheduled castes, and 27 per cent for Other Backward Classes), and therefore has a 3 per cent headroom before breaching the 50 per cent limit for reservation set by the Supreme Court.\n\n“The Bhupinder Singh Hooda government had tried to push through the first option, but without any consultation with the National Commission for Backward Classes (NCBC). That order had been struck down by the courts, which is why we are in this position. Whatever we consider, we will do so with consultation with NCBC, so that we can avoid the orders being struck down by courts,” said the source. The options will be put before the state committee that is to look into the matter, and the State government will be bringing a Bill in the Assembly session in March to finalise which arrangement is to be followed.", 
    "section": "national", 
    "title": "Venkaiah Naidu panel starts work, but violence continues", 
    "subsection": "general", 
    "date": "2016-02-23"
}