{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "CJI T.S. Thakur was displeased with Delhi’s Water Minister for coming to the court rather than finding a way to solve the water problem.\n\nThe Supreme Court slammed the Arvind Kejriwal government on Monday for rushing to the court even as water taps have begun to run dry in the capital following disruption in supply due to the Jat quota stir.\n\nAs Delhi’s Water Minister Kapil Mishra sat in the courtroom, Chief Justice of India T.S. Thakur asked Rajeev Dhawan, senior counsel of the Delhi government, “What is the Minister doing here?”\n\n“There is no water and the Minister is here. He should be with other Ministers doing governance rather than rushing to this court. He should be talking to the Haryana Ministers. What is he doing here?” CJI Thakur asked repeatedly.\n\nWhen the Delhi government went on to contest a particular point in the arguments, the Bench, displeased with its attitude, simply dismissed the petition by the Delhi Jal Board (DJB), throwing the file away.\n\n“You cannot provoke us. We are also humans ... This is a matter of governance. You want an easy solution, so you come here. The Minister is sitting in court. If you [Minister] are not there, go there [where water supply has been disrupted due to damage done to the canals] ... We refuse to pass any orders. We dismiss this petition,” Chief Justice Thakur, heading the Bench also comprising Justice U.U. Lalit, said.\n\nMr. Dhawan however cajoled the Bench to reconsider its decision to dismiss the petition, which said that 70 per cent of Delhi's water supply has been cut off by protestors by damaging Munak canal. It called for urgent action to protect the canals.\n\n“Seven water treatment plants have already shut down, affecting supply to two-thirds of NCT of Delhi, including the entire NDMC zone, which includes vital installations and areas such as LBZ zone, Parliament House, the Supreme Court, embassies of various countries, etc,” the petition contended. The Bench finally issued notice to the Haryana government and the Centre on the DJB’s petition. It further asked Haryana government to file a status report in two days.\n\nThe Haryana government assured the Bench that it would release water to Delhi by 1 p.m., and this would reach the national capital in four to five hours. The government said it was doing whatever it could under the circumstances.\n\nIn a separate petition filed by a lawyer, Ajay Jain, seeking a direction from the court to the Haryana government to give a “free hand to the Army/Para Military forces to control the agitation”, Chief Justice Thakur said “we generally want tolerance, amity and brotherhood among all communities... the rest is for your leaders to decide.”", 
    "section": "national", 
    "title": "Why rush to court over water issue, SC asks Delhi", 
    "subsection": "general", 
    "date": "2016-02-23"
}