{
    "author": [
        "Special Correspondent"
    ], 
    "text": "J. Mohanasundari, managing director, Sharp Industries, Coimbatore, and S.V. Balasubramaniam, chairman, Bannari Amman Institute of Technology, present 'Best Woman Alumna Award' to Parameswary Pandian, consultant, Microsoft Global Delivery, during the International Women's Day celebrations at Sathyamangalam in Erode on Tuesday. —PHOTO: M. GOVARTHAN\n\n\"Work for a while, gain experience, and make it a point to transform into entrepreneurs.\" This was the message J. Mohanasundari, Managing Director of Sharp Industries, conveyed to a student gathering, at Bannari Amman Institute of Technology, Sathyamangalam, on the occasion of International Women's Day.\n\n\"Think differently. Make the most of the digital era, to determine market for products, and focus constantly on quality,\" she said, explaining that when industry organisations are ready to provide hand-holding support and banks are prepared to fund viable projects, there was no reason why students must not think about pursuing entrepreneurship in right earnest.\n\nRecounting her entrepreneurial journey, Ms. Mohanasundari said taking decisions with confidence and clarity of mind was all about succeeding in life. As chief guest, she conferred Women of Excellence Award to Kalpana Shankar, chairperson and Managing Trustee, Hand-in-Hand India, Chennai; and Sitara Vikram, co-founder and Executive Director, CS Academy, Erode. The recipients of Best Women Alumna Award were Gohila TI, co-founder and Director, Stugo Group of Companies, Chennai; and Parameswary Pandian, Consultant, Microsoft Global Delivery, Bengaluru.\n\nPresiding over, S.V. Balasubramaniam, Chairman, BIT, emphasised on inculcation of human values and patriotism by students on campuses. In his special address, M.P.Vijayakumar, BIT Trustee, said there were still obstacles in the patriarchal society in the way of developing the mindset of equality for gender parity.", 
    "section": "national", 
    "title": "'Take decisions with confidence'", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}