{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Glowing tributes paid to contribution of women at rallies, seminars\n\nLetika Saran (centre), former DGP of Tamil Nadu, receiving Vocational Service Award from All Women's Association in Tiruchi on Tuesday on the occasion of Women's Day.— PHOTO: B. VELANKANNI RAJ\n\nRallies, seminars, and honouring of women achievers marked the International Women’s Day celebrations in the city on Tuesday.\n\nYoung and differently abled chess player K. Jenitha Anto and K. Vidya Rupini, Public Relation Officer, Holy Cross Service Society, were presented with awards in recognition of their excellence in their fields at a function got up by the All Women’s Organisations of Tiruchi and Shrimati Indira Gandhi College.\n\nLetika Saran, former Director-General of Police, the chief guest, said there were several examples of women excelling in various fields in Tamil Nadu. Women could excel in any field if only they got the opportunity, she said and emphasised the need for encouraging women achievers.\n\nK. Meena, former vice-chancellor, Bharathidasan University, presided over the programme.\n\nAt a function held at the St. Joseph’s College, M. Jayanthi, Sr. Jeusin Francis and V. Sujatha, principals of the Seethalakshmi Ramaswami College, Holy Cross College, and Cauvery College for Women, respectively were honoured.\n\nA rally was taken out under the auspices of the People’s Development Initiatives, a voluntary organisation, and best performing self-help group members and gender volunteers were honoured.\n\nCelebrations\n\nThe Forum for Women in Public Sector of Bharat Heavy Electricals Limited celebrated the day with a function at the Community Centre Indoor Auditorium in BHEL’s Kailasapuram Township.\n\nS. Gopinath, Executive Director, BHEL, Tiruchi, highlighted the efforts taken by BHEL in giving equal opportunities to women employees in career growth.\n\nPunitha Ganesan, Founder Secretary and Correspondent, Bharath Institutions, Thanjavur, recollected the struggles across the world for upholding women’s rights. Highlighting the achievements of women in various fields, she said that women must learn to appreciate their own abilities and skills.\n\nMr. Gopinath felicitated S. Siyamala, Deputy General Manager, Valves, and P. Manimekalai, Artisan III, Boiler Production for Securing SCOPE (Standing Conference on Public Enterprises) Awards for best women employee in executive and non-executive categories and honoured the senior most women employees who are retiring this month. He re-launched the WIPS website.", 
    "section": "national", 
    "title": "Achievers take the centre stage", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}