{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Kanimozhi, MP and state secretary of the women's wing of the DMK, addressing a demonstration organised by the party in Salem on Tuesday demanding total prohibition in the state.—Photo: E. Lakshmi Narayanan\n\nThe All India Anna Dravida Munnetra Kazhagam (AIADMK) regime has failed on all fronts and the people should take advantage of the forthcoming Assembly elections to teach a fitting lesson to the ruling party and ensure its defeat, said Kanimozhi, MP, and Secretary of the women’s wing of the Dravida Munnetra Kazhagam (DMK) here on Tuesday.\n\nAddressing a demonstration organised by the women’s wing units of the Salem and Namakkal district units of the party to demand total prohibition in the state in front of the collectorate here , she said the state has never witnessed such a turmoil.\n\nViolence against women was rampant. Despite the repeated pleas from different sections of society, the AIADMK government was adamant in running the Tasmac shops, which ruined a large number of families.\n\nThe ouster of the Jayalalithaa government alone will bring renaissance to the women of the state, she said.\n\nMs. Kanimozhi explained the various programmes implemented during the previous DMK regimes for the welfare and uplift of women.\n\nThe act ensuring equal right for women in the family property, introduction of women SHG concept, more than 30 per cent reservation for women in the local bodies were the achievements of DMK governments of the past.\n\nGreetings\n\nExtending her International Women’s Day greetings, Ms. Kanimozhi urged the women to continue their fight for establishing their rights.\n\nThe women members raised slogans condemning the AIADMK regime for increasing violence against women, its failure to check price hike, close down Tasmac shops etc.\n\nVijaya Thayanban, patron of the women’s wing of the DMK, Helen Davidson, former MP, and other leaders participated in the agitation, in which hundreds of women from Salem and Namakkal district participated.", 
    "section": "national", 
    "title": "AIADMK has failed on all fronts: Kanimozhi", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}