{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Barricades have been put up near Odathurai Road-Chennai Bypass junction in Tiruchi so that drivers slow down and avoid collision.PHOTO: M. SRINATH\n\nWith the Chennai Bypass witnessing heavy traffic, the City Traffic Police have placed barricades at a couple of more spots along this main road in a bid to curb the speed of vehicles zipping past and prevent accidents.\n\nBarricades have been placed at the Odathurai Road-Chennai Bypass junction a few metres ahead of the Cauvery bridge. Barricades have been placed a few distance before that spot.\n\nPlaced in a zig-zag manner, the barricades were placed recently by the City Traffic Police in an effort to prevent accidents on the busy highway.\n\nThe barricades at the Odathurai road – Chennai Bypass road junction was installed following opening of the Odathurai bridge a few days ago and diversion of goods carriers and buses through that bridge, the sources say.\n\nThe spot was identified for installation of a couple of barricades to prevent collision of vehicles entering the Bypass from the bridge and those zipping past straight towards the Chennai side, said a senior police officer.\n\nThe barricade would prompt the drivers to slow down a bit while approaching the spot and thereby prevent collision of vehicles, the officer added.\n\nA couple of barricades in a zigzag manner have been placed towards the Chennai side a few metres ahead of the Odathurai road-Chennai Bypass junction.\n\nThe sources say barricades are proposed to be installed at Senthaneerpuram where there is a big “U” turn to curb the speed of vehicles proceeding on both carriageways.\n\nThe city police had installed barricades at Sanjeevi Nagar, Kondayampettai, and Y-road junctions along the Chennai Bypass, falling within the city police limits, following recurring instances of accidents at those spots.\n\nIn brazen violation of rules, many motorists and other vehicle users tend to violate rule by coming on the wrong side of the carriageway so as to avoid taking a circuitous route on the highway.\n\nThis blatant violation could be noticed during day time and night hours jeopardising not only the life of the violator but that of the rule abiding vehicle users.\n\nAnother aspect that makes light of strict enforcement is the parking of goods carriers along the service roads on different stretches of the Bypass where many vehicles go on a breakneck speed.\n\nThe service roads have become a convenient spot for the truck drivers to halt their vehicles notwithstanding caution boards installed by the police warning drivers not to park vehicles at those spots.", 
    "section": "national", 
    "title": "Barricades placed at more spots along Chennai Bypass", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}