{
    "author": [
        "S Senthalir"
    ], 
    "text": "Will perform along with Indian students\n\nFinal-year students from BRIT School of Performing Arts and Technology, London, being welcomed by pre-nursery students of Acharya Educational Public Trust at Manakula Vinayagar Temple in Puducherry on Tuesday.Photo: T. Singaravelou\n\nThree-year-old children holding jasmine garlands stood in front of Manakula Vinayagar Temple to welcome their guests from London. Performing Arts students from BRIT School in London arrived here on Tuesday.\n\nThey will showcase music and theatre performances at a cultural evening organised at the Achariya Siksha Mandir in Villianur on Saturday under the auspices of the Achariya Educational Public Trust.\n\n“The students from BRIT School for Performing Arts and Technology will perform along with students of Achariya to raise funds for The Baby Sara Home, a home for special children. This is the first visit to India for all of the students,” said Conor Doherty, assistant music director from BRIT School.\n\nSixteen final-year students and four staff members will be here for 12 days. “After their performance on Saturday, they will visit Baby Sara Home to conduct an art workshop for the children,” he said.\n\nHe said that the BRIT students will mix theatre, songs, dance and poetry to perform the ‘Life in London’ while Achariya School students will perform south Indian classical dance and music.\n\nJosie Sovegjarto, head of Community Arts Practice, BRIT School, stated that the theme for the cultural evening on Saturday was about exploring the identity.\n\n“[It will be about] what identity means to the students and what it means to different people. They will explore those ideas and transform them into performance. This is about what it means to be British for them and how they identify themselves. The performance will have iconic British music,” she said. The students of BRIT School will perform for 40 minutes in the two-hour cultural programme on Saturday.\n\nThey will showcase music and theatre performances at a cultural evening\n\nat Achariya\n\nSiksha Mandir", 
    "section": "national", 
    "title": "British students to raise funds for home", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}