{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Tamil Nadu Government Transport Corporation Staff Federation (TTSF) on Monday filed a petition with Chief Electoral Officer alleging violation of model code of conduct (MCC) by TNSTC Employees’ Pension Fund Trust by way of disbursal of pension commutation amount in instalments.\n\nCiting a circular reportedly emailed by the Trust to Managing Directors of the TNSTC in various zones on Monday, the TTSF alleged that first instalment of the commutation amount was credited on Sunday, two days after the announcement of elections, to the bank accounts of 7,959 beneficiaries, who retired from service between November 2013 to June 2015.\n\n“These people were fighting for long to get their pension dues. However, the decision to disburse the dues now is a violation of the MCC,” said S. Sampath, State treasurer of the TTSF.\n\nThe TTSF also criticised the decision to disburse the pension commutation amount in instalments instead of settling it one time. The circular sent by the Trust said that the commutation amount would be disbursed in 24 instalments considering the financial situation of the TNSTC.\n\n“Employees contribute a share of their salary for commutation with the hope that they would get a lump sum amount on retirement. Disbursing that in instalments is unfair,” Mr. Sampath noted.\n\nHe alleged that decision to disburse the amount in instalments was a policy change which should not have been done when the MCC was in place. “We are instructed not even to transfer any drivers or conductors between depots. But how can they disburse the amount?” he asked.\n\nSpeaking to The Hindu, Arumugam, administrator of TNSTC Employees’ Pension Fund Trust, said that the decision to disburse commutation amount in instalments was taken at the meeting of trustees in December 2015. He said that the procedure with the banks, however, took long.\n\n“The procedure took two months as the money was deposited with Reserve Bank of India through our bank. Once the procedure was over, we instructed the bank on March 4 morning (election announcement came in evening) to credit the amount but they did it only two days later,” he said.\n\n“Since the TNSTC is not in a position to make one time settlement, we thought disbursing it in instalments will be better than not paying at all,” he said.", 
    "section": "national", 
    "title": "Complaint against pension fund trust", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}