{
    "author": [
        "S Ganesan"
    ], 
    "text": "G. Jerome Arockiaraj (Congress), and Mahesh Poyyamozhi (DMK) are strong contenders for their party ticket in Tiruchi East Assembly constituency.\n\nDMK has won the seat eight times since 1962\n\nA keen tussle is brewing between strong contenders from the Congress and Dravida Munnetra Kazhagam to bag the ticket for Tiruchi East Assembly constituency in the DMK-led alliance.\n\nThe constituency is considered a happy hunting ground for the DMK-Congress combine with the Dravidian major winning the seat eight times since 1962 and the Congress once in 1952. Although the AIADMK holds the seat currently, DMK and Congress office-bearers believe that they could together throw a strong challenge to the ruling party in the constituency this time around.\n\nThe Tiruchi urban district Congress president G. Jerome Arockiaraj, a staunch and long time loyalist of the TNCC President E.V.K.S. Elangovan, is making a concerted bid to get the seat in the alliance. Since Mr. Arockiaraj is a staunch loyalist of Mr. Elangovan, the latter is believed to be keen on rewarding his protégé. Congress sources here say that Tiruchi East tops the list of seats that is being sought by Mr. Elangovan in the alliance.\n\nMr. Arockiaraj, who unsuccessfully contested from the Srirangam constituency in 2006, fancies his chances, given the substantial population of minorities and Vellalars in Tiruchi East.\n\nHowever, the DMK has an equally strong aspirant in Mahesh Poyyamozhi, grandson of party stalwart of yesteryear Anbil Dharmalingam.\n\nKnown for his proximity to party treasurer M.K. Stalin, Mr. Mahesh Poyyamozhi is considered the youthful face of the party in Tiruchi and in recent times had emerged a power centre in the district which has long been dominated by DMK strongman K.N. Nehru. In fact, Mahesh’s father and grandfather have been close to DMK president M. Karunanidhi and Mr. Stalin respectively.\n\nMr. Mahesh is faced with stiff contest from other aspirants within his party such as his own uncle Anbil Periasamy and M. Anbazhagan, former Deputy Mayor and confidant of Mr. Nehru. Mr. Periasamy lost to AIADMK’s R. Manoharan, Chief Whip, by a margin of over 20,000 votes in 2011 in the constituency.\n\nMr. Periasamy had won from here in 2006 when he was given the party ticket after the untimely demise of his brother Anbil Poyyamozhi.\n\nAlthough talks on seat allocation were yet to begin officially in the alliance, Mr. Arockiaraj believes that there would not be any hitch in getting the ticket.", 
    "section": "national", 
    "title": "Congress, DMK eye Tiruchi East seat", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}