{
    "author": [
        "P Sudhakar"
    ], 
    "text": "TIRUNELVELI : The gruesome murder of two persons, supporters of Subhash Pannaiyar of Moolaikkarai near Tiruchendur, at Pazhaiyakaayal has renewed the enmity between him and the followers of Dalit leader Chidambaram Pasupathi, popularly known as Pasupathi Pandian of Mela Alangaarathattu, who was killed in 2012. The enmity between Subash and supporters of Pasupathi dates back to late 1980s. A few Dalit workers employed in the farms and saltpan of Asupathi Pannaiyar, father of Subhash Pannaiyar, started agitating against the employer in the late 1980s. The protesting workers sought the help of Pasupathi, who had nurtured himself as the ‘saviour of Dalits’ by orchestrating a few attacks.\n\nPasupathi and his supporters murdered Asupathi Pannaiyar, Subash’s brother Venkatesa Pannaiyar of Akhila India Nadar Paathukaappu Peravai and his men unsuccessfully targeted Pasupathi in Tuticorin. After surviving the attack, Pasupathi and his supporters murdered Subash’s grandfather Sivasubramanian Pannaiyar in 1990 and two witnesses of this murder later at Tiruchendur.\n\nMeanwhile, Pasupathi developed enmity with his relative Kasi Pandian, also from Mela Alangaarathattu. Kasi triggered a remote-controlled bomb near Murugan Theatre in Lourdammalpuram under Thoothukudi North Police Station limits when Pasupathi’s convoy was crossing, but the attack came a cropper and none was injured.\n\nAs threat to his life increased, Pasupathi shifted his base to Nandavanaththupatti in Dindigul. After his wife Jacintha, a lawyer, became a victim of the attack by a gang when he was coming to Thoothukudi to appear before a court in a case against him, Pasupathi was murdered in 2012 at Nandavanaththupatti. Ever since Pasupathi was murdered, it was anticipated that his supporters would target Subhash and the attack orchestrated on Tuesday with the motive of exterminating him resulted in the killing of his supporters.", 
    "section": "national", 
    "title": "Decades-old group rivalry revived", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}