{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Efforts of Puducherry police have yielded results, says IGP Praveer Ranjan\n\nCrimes against women have decreased year by year, thanks to consistent efforts of the Police Department in the Union Territory.\n\nAccording to statistics provided by the department, 120 cases of crime, including rape, kidnap and molestation, were reported in 2013. Of them, 117 were detected. Of the 97 cases reported in 2014, 91 were cracked . A total of 111 cases were reported in 2015 out of which 91 have been detected so far.\n\nInspector-General of Police Praveer Ranjan told The Hindu , “We are seeing a slight decline in crimes against women as a combined result of several initiatives such as setting up All Women Police Station, Special Cell and others.”\n\nLast year, the government approved of two special cells to handle crimes against women in Puducherry and Karaikal. The cells have been constituted under a Superintendent of Police. Three Inspectors and Sub-Inspectors were deployed to handle rape, human trafficking and kidnap besides cases under the Prevention of Children from Sexual Offences (POCSO) Act.\n\nThere are over 150 women police personnel in the force and another 92 newly recruited are undergoing training. The officials added one third of new posts would be reserved for women in future recruitments.\n\nThe police personnel also conduct regular awareness campaign and workshop to teach defence techniques to girls in schools and colleges.\n\nThe department has also deployed 10 new patrol vans recently. All distress calls made to “100” will be passed on to the vans on wireless. Besides, the police also plan to increase bike patrolling.\n\nRound-the-clock monitoring\n\nThe police control room vans function round the clock to prevent crime and also immediately attend to any crime which is brought to its attention. In case the situation warrants the presence of local police, the control room vans will wait at the scene of crime till the local police has taken over the investigation. The patrol vans will have specific areas earmarked for them during the 24-hour schedule .\n\n“Special attention will be paid to all crowded areas such as bus stops, cinema halls, places of worship, market areas and the places where crime against women are likely to take place. Therefore, the presence of vans on the road will also deter the people creating nuisance in public places especially the revellers visiting Puducherry for drinking,” police officials said.\n\nPolice also conduct workshop to teach defence techniques to girls in schools and colleges", 
    "section": "national", 
    "title": "‘Drop in crime rate against women’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}