{
    "author": [
        "Special Correspondent"
    ], 
    "text": "District Election Officer and Collector S. Natarajan on Tuesday flagged off an election awareness rally taken out by nursing students while students of Government Women’s Arts College pledged to exercise their franchise in the May 16 Assembly elections.\n\nAs part of the series of awareness programmes to motivate all eligible voters to cast their votes and ensure 100 per cent polling in the Assembly elections, the nursing students of the Government District Headquarters Hospital took out a rally, calling upon the voters to take part in the electoral process. They walked around the busy bazaar and Roman Church roads, holding placards asking those who had completed 18 years and enrolled their names in the electoral roll to check whether their names figured in the list. “You should know what to do at the age of 18 years when election comes,” read a placard.\n\nMr. Natarajan launched the SVEEP (Systematic Voters’ Education and Electoral Participation) activity at Utharavai and Sathankulam villages by administering pledge to the members of women self-help groups. The women pledged to educate their members and villagers about the importance of casting votes in the elections and motivate the voters to exercise their franchise. The Collector chose the two villages, which had registered low per centage of polling in the 2011 Assembly elections.\n\nMembers of SHGs in 205 panchayats undertook the pledge after the Collector launched the SVEEP exercise, M. Jayaraman, Project Officer, Magalir Thittam, said. The Panchayat Level Federations would involve all the SHGs in the SVEEP activity by organising awareness rallies and competitions during the next one week, he said.\n\nMeanwhile, the Government Women’s Arts College celebrated International Women’s Day as election awareness day. Students pledged to exercise their franchise without fail by signing a banner. They also pledged to create awareness against cash for votes.", 
    "section": "national", 
    "title": "Election awareness events held in Ramanathapuram", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}