{
    "author": [], 
    "text": "SALEM\n\nDepartment of Commerce of Periyar University and NABARD: International conference on ‘corporate and business response to climate change: from awareness to adoption’, John Mclaren, senior lecturer, School of Business, James Cook University, Singapore, inaugurates, Karthikeyan, Member Secretary, Tamil Nadu Pollution Control Board, Mohammad Abdul Hannan Mia, Professor, Department of Management Information Systems, University of Dhaka, Bangladesh, Desti Kannaiah, senior lecturer, School of Business, James Cook University, Singapore, speak, 10.15 a.m.\n\nPeriyar University: Department of Education, national seminar on ‘recent trends in educational research’, C. Swaminathan, Vice Chancellor, inaugurates, K. Kumaran, former professor, Department of Education, University of Madras, speaks, 10.30 a.m.; M. Manivannan, Registrar, delivers valedictory address, 4.15 p.m.\n\nKnowledge Institute of Technology: Inauguration of Centre of Excellence on ‘Remote Sensing and GIS’, S. M. Ramasamy, former Vice Chancellor, Gandhigram Rural University, chief guest, P. S. S. Srinivasan, principal, presides,\n\n10 a.m.\n\nSri Ganesh College of Education: Mass sapling planting campaign, M. Thangavel, Correspondent, Sankar, panchayat president, inaugurate, Mannarpalayam, 10 a.m.\n\nThiagarajar Polytechnic College and Sona College of Technology: Sona-Thiag Fiesta, Sports Day, K. S. Mohamed Nizammuddin, former international athlete, Kabeer R. Shetty, business head, IOT-Arsenal Soccer Schools, New Delhi, Lakshya Raghavan, unter -19 national Squash champion 2014, chief guests, 4 p.m.\n\nCommissionerate of Central Excise: Tax Payers Day, Foulk’s Compound, Anal Medu, 9 a.m.\n\nMuslim Youth Federation: Zikr majlis, Mettu street, 9 p.m.\n\nCooptex: Annual ‘buy two and get one free’ exhibition, Thangam Pattu Maaligai showroom, 10 a.m. to\n\n8 p.m.\n\nNew Century Book House Limited: Book exhibition, Bose maidan, 9 a.m. to 9 p.m.\n\nNAMAKKAL\n\nPaavai Polytechnic College: NSS special camp, Panchayat Union Elementary School, Kurukkupuram,\n\n3 p.m.\n\nCooptex: Annual ‘buy two and get one free’ exhibition, Cooptex showroom, 10 a.m. to 8 p.m.\n\nTIRUCHENGODE\n\nSengunthar Engineering College: Women Empowerment Cell, International Women’s Day celebrations, Usha Devi Rajamanickam, principal, Sengunthar Matriculation Higher Secondary School, chief guest,\n\n9.30 a.m.\n\nKOMARAPALAYAM\n\nSSM College of Engineering: Placement Cell, training on wind mill technology, P. R. Manikandan, Head of Department of Mechanical Engineering of the college, resource person, 9.30 a.m.\n\nExcel College of Engineering and Technology: Department of ECE and EEE, national level technical symposium, 10 a.m.\n\nExcel Group of Institutions: Department of Placement and Training, campus interview by Ambal Auto, Erode, for MBA students, 10.30 a.m.; campus interview for BE and MBA students by Hitech Communications, Erode, 12.30 p.m.\n\nERODE\n\nKongu Engineering College and National Human Rights Commission: Training programme on 'Human Rights' by Department of Management Studies, 9.30 a.m.\n\nNandha Engineering College: National-level Technical Symposium, talk by A. Athif Shah, ABE Technologies, Chennai, 10.00 a.m.\n\nErode Sengunthar Engineering College: Knowledge-sharing session on 'India's Economic Position', 'Managerial System of Dabbawala', and 'Indian Financial System',\n\n4.00 p.m.\n\nEBET Group of Institutions: Hindi language training, 4.15 p.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}