{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Divisional Railway Manager Shubhranshu and president, Southern Railway Women's Welfare Organisation, Jyotsna Prasad, presenting an award to a woman employee at the International Women's Day celebrations organised by the Salem Railway Division in Salem on Tuesday. —Photo: E. Lakshmi Narayanan\n\nHonouring a dozen outstanding women employees with special awards marked the International Women’s Day celebrations organised by the Salem Railway Division here on Tuesday.\n\nDivisional Railway Manager, Shubranshu, and President, Southern Railway Women’s Welfare Organisation, Jyotsna Prasad, handed over the awards to the women employees belonging to different branches of Salem division in recognition of their outstanding service.\n\nSpeaking on the occasion, Mr. Shubhranshu, said that the Women’s Day is to recognise the role of women in society but felt that it’s inappropriate to call it Women’s Empowerment Day because it denotes as if women are empowered by men, while the truth is otherwise. He commended the women for excelling in different fields.\n\nHe called upon the women employees of the Salem Division to impart training the women around them to be independent financially.\n\nIt is very important that women are financially free to ensure their total freedom, he added.\n\nMrs. Jyotsna Prasad felt that the only way for the country to develop is to recognise the importance of women in society, as the level of development of women is the real indicator of the development off the nation as a whole. R. S. Sinha, Additional Divisional Railway Manager, G. Janarthanan, Divisional Personnel Officer, Rathi, Executive Engineer, Salem, who is also the Chairperson of the Women’s Empowerment Resource Centre, were present.\n\nA large number of employees participated in the cultural and sports events held in connection with the celebrations. Mrs. Jyotsna Prasad gave away prizes to the winners. The wards of the railway employees presented cultural programmes.", 
    "section": "national", 
    "title": "‘Ensure financial freedom for women’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}