{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "With just three weeks left for deadline, Corporation may fall short of target by nearly Rs. 130 cr.\n\nWith just three weeks left for the deadline of achieving the target of collecting Rs. 650 crore as property tax this year, Greater Chennai Corporation finds itself way behind the target. Tax collection stands at Rs. 465 crore.\n\nAfter disruption of tax collection for 45 days due to the floods, tax collection is affected yet again, this time due to election work.\n\nCorporation officials say they have been unable to focus on property tax collection as a result of election work.\n\nCurrently, the collection of property tax per day is estimated at Rs. 2 crore and at this rate, the Corporation would be able to collect only around Rs. 50 crore by March 31. “Tax collection is usually around Rs. 4 crore per day during March. This time, it is down due to poll preparations,” said a tax collector.\n\nIn a bid to achieve last year’s collection of Rs. 581 crore, the civic body is planning to ensure increased tax payment through other modes such as e-payment and bank counters.\n\nMore than one lakh assessors are using the e-payment gateways, which were introduced a while ago.\n\n“More traders are likely to start using e-payment as it is free-of-cost now. But we have to create awareness among traders, who always pay only after a tax collector visits their premises. Assessees should also use credit card, debit card and net banking to pay property tax during this period,” said an official.\n\nThe decision to introduce multiple payment gateways by banks such as ICICI and HDFC has improved the system. Officials stressed the need for more reforms to increase the number of commercial establishments paying through other modes.\n\nThe civic body is also planning to attract at least two lakh additional people to the e-payment gateway to increase tax collection.\n\nCustomers of 42 banks would be able to make e-payment.\n\nResidents would also be requested to make tax payment through counters in zones and headquarters.", 
    "section": "national", 
    "title": "Floods, polls hit property tax collection", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}