{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Temporary recognition granted to over 746 schools will not extended beyond May 31\n\nAfter the State government on Monday informed the Madras High Court that the temporary conditional recognition granted to over 746 unrecognised schools in the State will not be extended beyond May 31, parents in the city are now a worried lot.\n\nM. Kumaresan, who had enrolled his son in class 8 in a new private school closer to his home in Perambur said that he wasn’t sure if the school was one of the 746 schools with a temporary recognition.\n\n“I have already paid the fees of over Rs. one lakh to the school but am now wondering if I should apply for a transfer certificate or just let him continue in his old school,” he said.\n\nParents like him, who have enrolled their wards in new, private schools in the city for a host of factors including proximity to their homes are now in a fix about the status of the school.\n\n“We tried approaching the school management and asking them today, but they aren’t speaking to us about the same,” said another worried parent whose daughter has been studying for the last three years in a matriculation school.\n\n“The school offers both Matriculation and CBSE syllabus for its students, so we are concerned. We don’t know what to do if the recognition is abruptly cancelled as most private schools have already finished admissions for the year,” he added.\n\nThe petition has also wanted the court to ensure that all the unrecognised schools are closed by the end of the academic year 2015-16.\n\nApart from this, the petition had also asked to ensure and facilitate the process of placing students of such schools in other government or aided schools in the neighbourhood.\n\nNon-compliance of rules\n\nNarayanan A, founder of Change India said that the government should immediately publish the list of the 746 schools at the earliest so as to not put parents and students in difficult situation at the last minute.\n\n“It is only then that the parents will be made aware of the quality of institutions and the schools to avoid. After the Kumbakonam fire tragedy in 2004, we had moved the court seeking the state to publish a list of these schools so that parents can be cautioned,” he said.\n\nHe further alleged that among the 6 landmark directions given by the Supreme court in the wake of the fire tragedy, most were not implemented in the state which included inspections of schools at the start of every academic year and recognition committees functioning in every district involving retired judges and NGOs.\n\nNeed for transparency\n\nStating that there was a definite need in making every process starting from the recognition of schools to the admission process more transparent across private matriculation schools in the state, Prince Gajendra Babu, General Secretary, State Platform for Common School System said that there was a collective need on the part of the government and the managements of private schools to provide quality education to Children.\n\nState asks HC to ensure that the schools are closed at end of academic year 2015-16", 
    "section": "national", 
    "title": "Future tense for parents and students", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}