{
    "author": [
        "K Raju"
    ], 
    "text": "The issue was raised at the first all-party meet held in Dindigul\n\nThe inordinate delay in erasing graffiti on the walls of public buildings, including the bridges on National Highway 7, was due to the wrangle among highways department, village panchayat and Chinnalapatti town panchayat authorities as all of them claim that it is not their responsibility to get them erased.\n\nAlready, Election Commission has advised the District Election Office to ban graffiti and advertisements on public buildings and advised it to remove all graffiti from the walls of public buildings immediately. All India Anna Dravida Munnetra Kazhagam party men had mainly wrote the graffiti on the walls of the NH bridges to mark the birth day of Chief Minister Jayalalithaa recently.\n\nRepresentatives of various political parties raised the issue in the first all-party meeting held here on Friday, and officials assured them that all graffiti would be removed. Removal of graffiti commenced at many places. However, no action has been initiated in Chinnalapatti.\n\nChinnalapatti town panchayat administration told other two authorities that the areas came under the jurisdiction of Chinnalapatti town.\n\nThe highways authorities, however, claimed that the bridges were falling within Gandhigram panchayat limits. So it was the responsibility of the panchayat administration to erase the graffiti on the walls, they said.\n\nGandhigram panchyat administration, on its part, stated that it did not grant permission to political parties to make graffiti on the walls of overbridges coming under the control of highways department.\n\nGandigram panchayat president T. Jayaram said that the highways officials, who granted permission to write graffiti on the walls of the bridges, should take steps to get them erased. “We alerted the highways officials and the village panchayat secretary,” he added.", 
    "section": "national", 
    "title": "Graffiti still shine in Dindigul", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}