{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘The case has been booked only on the basis of hearsay witnesses’\n\nThe Madras High Court Bench here on Tuesday quashed a corruption-cum-abetment-to-suicide case registered against former Agriculture Minister ‘Agri’ S.S. Krishnamoorthy of the ruling AIADMK following the death of Agricultural Engineering Department Assistant Executive Engineer S. Muthukumarasamy. Mr. Muthukumarasamy had jumped before a speeding train in Tirunelveli on February 20 last year.\n\nJustice V.S. Ravi quashed the case on many grounds including non-availability of reliable evidence to prove the charge that the former Minister demanded Rs. 12.25 lakh as bribe from the deceased for having appointed seven drivers in his department. Stating that the case had been booked only on the basis of hearsay witnesses, the judge said no purpose would be served by forcing the accused to face trial.\n\nThe CB-CID, which filed a case against the accused, had said that the then agriculture minister had entered into a criminal conspiracy with some officials to collect a bribe of Rs. 1.75 lakh each for the appointment of temporary drivers in his Department. In pursuance of this conspiracy, he had allegedly exerted pressure on Mr. Muthukumarasamy, through the latter’s superiors, to pay Rs. 12.25 lakh. Unable to withstand the pressure, the official is believed to have committed suicide.\n\n‘Built on surmises’\n\nAssailing the charge, Mr. Krishnamoorthy contended that the case was filed based on surmises and conjectures and there was no direct evidence against him. He said there were no materials to show that he had spoken to Mr. Muthukumarasamy in person or over phone. The deceased had also not left behind any suicide note implicating the then Minister.\n\nRow over suicide\n\nEarlier last year, the death of Mr. Muthukumarasamy had triggered a political controversy with the Opposition demanding the arrest of Mr. Krishnamoorthy. Subsequently, he was dropped from the Cabinet and arrested by the Crime Branch CID, to which the investigation was transferred from the Railway Police. He was booked under Section 7 of Prevention of Corruption Act too apart from Section 306 (abetment of suicide) of Indian Penal Code. He had challenged the proceedings on the ground of innocence besides questioning the correctness of trying the offence in a regular criminal court instead of a Special Court for corruption cases.\n\nNo purpose would be served by forcing the accused to face trial,\n\nsays judge", 
    "section": "national", 
    "title": "HC quashes case against ‘Agri’ Krishnamoorthy", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}