{
    "author": [
        "Special Correspondent"
    ], 
    "text": "P. Nedumaran of Tamil Nationalist Movement releasing a book on People’s Watch Executive Director Henry Tiphagne in Madurai on Tuesday.— Photo: S. James\n\nHuman rights activists were working in post-independent India towards achieving Mahatma Gandhi’s objective of freedom from economic and social slavery, said P.V. Rajagopal, founder, Ekta Parishad, here on Tuesday.\n\nAddressing a meeting organised to felicitate Henri Tiphagne, Executive Director, People’s Watch, who has been chosen for the eighth Human Rights Award by Amnesty International, Germany, Mr. Rajagopal recalled that Gandhi was not content with getting political freedom and was keen that the people should have economic and social freedom.\n\nPeople like Mr. Henri, he said, were advancing the struggle towards achieving that freedom. In a modern society, conflicts could be resolved only by engaging people in a dialogue.\n\nRuth Manorama, president, National Alliance of Women, hailed Mr. Henri for always taking an uncompromising stand in the protection of human rights. She insisted that people affected by human rights violations should also understand why such violations happened.\n\nP. Nedumaran of Tamil Nationalist Movement said that human rights activism was fraught with sorrow, service and sacrifice. Mr. Nedumaran felt that the award was a recognition for Madurai. He also released a book on Mr. Henri on the occasion.\n\nN. Sethuraman, chairman, Meenakshi Mission Hospital, said that true valour was sticking to principles in times of adversity.\n\nLucy Xavier, human rights activist, said that his honesty was responsible for Mr. Henri’s growth.\n\nS. Rethinavelu, senior president, Tamil Nadu Chamber of Commerce and Industry, presided over the meeting.\n\nIn his acceptance speech, Mr. Henri said that the award was meant for all those who had sacrificed their lives in defence of human rights.\n\nHe opined that the award was a reminder to the government of the power of civil society, which was now under threat. Human rights defenders, he said, should always stand for the truth and were answerable and accountable to people.", 
    "section": "national", 
    "title": "“Human rights activists working to achieve Gandhi’s objective”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}