{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Rajalakshmi Nirmal, chief research analyst, Business Line; D. Sampath Kumar, former editor, Business Line, along with other dignitaries at a panel discussion on Budget 2016 at Pondicherry Central University in Puducherry on Tuesday. (Right) A student poses a question during the programme.Photos: T. Singaravelou\n\n‘Budget Talk 2016’ hosted by The Hindu Business Line at Pondicherry University\n\nS. Kannan, Commissioner of Customs (Appeals), Chennai, has said that the proposals in the Union budget for 2016-17 offered ways to reduce litigations and bring harmony in tax transactions.\n\nParticipating in a panel discussion on ‘Budget Talk 2016’ hosted by The Hindu BusinessLine at Pondicherry University, Mr. Kannan said the budget also provided provisions to create 11 new benches of indirect tax tribunals to liquidate old arrears of cases.\n\nProviding a positive note on the way budget had dealt with tax transactions, the Commissioner stated that the indirect tax proposals are subtle but will garner higher revenue. He also detailed the new cesses that have been imposed and the amendments introduced to the Act and Rules to enhance the service tax collection. He noted that this budget seemed to facilitate the genuine and honest tax payer and the rich are expected to pay more tax.\n\nModerating the panel discussion, D. Sampath Kumar, former editor and consultant, Business Line , introduced the students to changes that had occurred in the roles of government and market in budget and its analysis over time.\n\nHe added that there was no other socio-cultural event in modern society in India which was as popular as post-budget analysis apart from movie screening. Leaving such popular occasions, the budget had structured the popular imagination of the thinking population of the country.\n\nAmaresh Samantaraya, Associate Professor, Department of Economics, Pondicherry Central University, said the budget provided several incentives for rural sector and agriculture, for start-ups and infrastructure. He said that emphasis was given to start-ups which will help in generating jobs in the long term.\n\nRajalakshmi Nirmal, Chief Business Analyst, Business Line , stated that the budget 2016 had a complete rural push to it. She spoke on the allocation for farmers, agriculture and the gold monetisation and sovereign gold bonds.\n\nR.Anand, Partner, Global Tax Advisory Services, Ernst & Young, detailed what was in store for the common man. He said that this budget sent a message that the small and medium class, and salaried class would be spared from tax and the rich would have to pay more tax. He said that the present budget provided provision to involve panchayat. The action will happen in the 2.5 lakh panchayats in our country as each panchayat will receive Rs 1 crore.", 
    "section": "national", 
    "title": "Indirect tax proposals will garner higher revenue: Customs official", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}