{
    "author": [
        "Pankaja Srinivasan"
    ], 
    "text": "A section of audience at a panel discussion on ‘gender parity’ organised as part of the International Women’s Day celebration held at PSG Institute of Management in Coimbatore on Tuesday. The event was presented by The Hindu in association with VLB Janakiammal College of Arts and Science. (right) The panelists was moderated by Shanthini Rajkumar (centre).— Photos: M. Periasamy\n\nhere is no escaping Women’s Day celebrations. Special programmes and roses everywhere and there is a scramble everywhere to find women to honour. In the midst of all the brouhaha, there are also some insightful discussions. conversation on Gender Parity was one such organised by The Hindu at PSGIM. Shanthini Rajkumar moderated the discussion with Sangeetha Velkrishna, Swarnalatha J, Grace Pachuau and Jitha Karthikeyan.\n\nSangeetha, who runs a textile manufacturing and exporting company along with her sister, said that often people do not take her seriously only because she is a woman “Even my own family members say, we are ‘assisting’ our father in the family business.”\n\nThe other panellists agreed that it was a mindset that needed to be changed. Grace, an IAS officer, comes from a family of bureaucrats.\n\nHer determination to be in the Administrative Service was triggered early in life when she “overheard my mom telling someone that, being girls, it was unlikely any of her daughters would join the bureaucracy. And since then I was determined to do so.”\n\nJitha, a well-known artist, is working on a project to create awareness on female infanticide in Tamil Nadu. “I found it was usually women who were behind female infanticide. Mothers-in-law, sisters-in-law, grandmothers…We can’t blame men for everything.”\n\nShe added that discrimination is universal. In rural areas, they say it out loud; in urban India, discrimination is more subtle.\n\n“We may tick all the boxes, but if we cannot exercise our will or make our own decisions, everything is meaningless,” said Grace.\n\nShe added that just a few right practices could create a huge impact on empowerment. “Most schools in the interiors have no toilets for girls. That is one big reason why they drop out of school once they come of age. If transport could be arranged to take the children to school in remote areas, that could also have a positive impact.\n\nThere are enough laws and special privileges for women in our country. But law alone cannot uplift women; only change in attitudes will.”\n\nSwarnalatha, managing trustee of a foundation that supports people affected with neurological disorders, said, “We have to respect ourselves before we expect others to respect us. I may be physically challenged, but I am not mentally challenged,” she said and urged people to be inclusive in their attitude, not just to people with special needs, but also to women.\n\nShanthini, a food blogger and columnist, raised questions about attitudes towards women in our own homes.", 
    "section": "national", 
    "title": "‘Law alone cannot uplift women; change in attitudes needed’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}