{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "In a communication to the Director, Rural Panchayat Raj, the Tirunelveli Collector M. Karunakaran said that there was no possibility of the Project Director of the District Rural Development Agency signing the files before the model code of conduct came into operation. “Hence, it is confirmed that he violated the model code of conduct purposely and signed antedated.”\n\nMr. Karunakaran said it was learnt that the officer might direct the lower level officers to start work in violation of the model code of conduct which would bring discredit to the State Government.\n\n“Therefore, there is no other possibility than relieving him from the present post…I have relieved him from the post of the Project Director, DRDA, in the afternoon of 07/03/2016.”\n\n50 officials not transferred\n\nPointing out that Mr. Vijayakumar had served in various capacities since 2013 and completed four years and six months of service in Tirunelveli district, the Collector said at least 50 officials in the Development Department who had completed three years (in the district) have not been transferred so far. Normally, the Election Commission will transfer officials who have put in more than three years in a particular place.\n\nHe said it was not possible to conduct the Assembly election with the Revenue officials alone.\n\nIt required deployment of officials from other departments too.\n\n“So far no transfer of officials who completed more than three years in the Development Department in this district has been ordered. This is to inform you to avoid an embarrassing situation to the State Government and the election machinery during the visit of the Observers from the Election Commission of India. The Observers might object to deploying officials who had completed three years of service in the district for election related duties,” the Collector said.\n\n‘Officials who have completed more\n\nthree years\n\nhave not been\n\ntransferred’", 
    "section": "national", 
    "title": "‘Long-tenured staff not transferred’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}