{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The 18-Plus:Representatives of political parties participating in a mock polling in Madurai on Tuesday; (right) Collector K. Veera Raghava Rao, along with officials, taking part in a human chain formed to create voter awareness. — Photos: S. James\n\nA mock poll with participation from representatives of recognised political parties was conducted at Madurai Corporation to check proper functioning of Electronic Voting Machines (EVMs).\n\nSpeaking to media after inspecting the exercise, Collector and District Election Officer K. Veera Raghava Rao said that 3,324 ballot units and 3,348 control units, which are functional, are presently available in the district.\n\n“First Level Check (FLC) is over for these units. As per the Election Commission of India (ECI) norms, mock poll should be conducted for five per cent of the units.”\n\nAccordingly, officials said that the mock poll was conducted with 180 ballot and control units which were randomly picked by representatives of recognised political parties. The votes cast by the representatives in these units were tallied and cross-checked to ensure that they were functioning properly.\n\nThe exercise went on till evening as the units were later subjected to volume testing by casting more than 1,000 votes in each ballot unit. Mr. Rao said that the Voter-Verified Paper Audit Trial (VVPAT) machines, which would be used in Madurai East Constituency alone, and another batch of EVMs to be received by the district would also be subjected to similar testing.\n\nMadurai district, with 10 Assembly constituencies, has 2,685 polling booths. Some of the polling booths may need more than one EVM, depending on the number of candidates. Officials said that in addition to the total number of EVMs required for all booths, 20 per more would be kept ready as buffer.\n\nHuman chain\n\nEarlier Mr. Rao and Additional Collector B. Rohini Ramdas participated in a human chain formation at Y. Othakadai in Madurai East constituency to create awareness of the importance of voting.\n\nRevenue officials, who took part in the initiative, formed “18 +” formation to drive home the point that everyone above 18 years should vote.", 
    "section": "national", 
    "title": "Mock poll conducted to check EVMs", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}