{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: Navalpakkam Narasimhan Visranthi Mudhiyor Illam, MGR Rd., Palavakkam, 3.30 p.m.\n\nMahabharatham: Rama Dikshithar, Sri Krishna Gana Sabha, T. Nagar, 6.30 p.m.\n\nBhagavatham: Paramasukhananda, Ramakrishna Math, Mylapore, 5.30 p.m.\n\nGita: Satyavratananda Saraswati, Mylapore Club, Luz Church Rd., Mylapore, 11 a.m.\n\nRamanuja Nooruanthady: Venu Raza Narayanan, Sri Santhana Venugopalan Sannidhi, Pedariyar Koil St., Mint, Broadway, 6 p.m.\n\nGuru Arul: Komugam, Valleeswarar Temple, South Mada St., Mylapore, 7 p.m.\n\nVedanta Treatise: R. Aravindan, C Flat, Harmony, 20/39, Venkatrathinam Nagar, Adyar, 6.45 p.m.\n\nGENERAL\n\nSRM University – Ramapuram Campus: Inauguration of conference on ‘Communication and Computing, Ramapuram, 9.15 a.m.\n\nValliammal Engineering College: Lecture on ‘Random process and its applications’, Kattankulathur, 8.45 a.m.\n\nMeasi Institute of Management: Workshop on ‘Incubation of Business Ideas’, Peters Rd., Royapettah, 10 a.m.\n\nSapines Health Foundation: World Kidney Day 2016 celebration, Raintree Hotel, Anna Salai, 5 p.m.\n\nNarcotics Anonymous: Meeting, Staying Clean Group, St. Lourdes Church, Don Bosco School, Perambur, 7 p.m.\n\nAl-Anon: Meetings, Police Community Hall, Kondithope, Walltax Rd.; Shrine of Divine Mercy Church, Anna Nagar East, Near Chinthamani; St. Andrews Church, Gandhi Rd., Guduvancherry; Ambedkar Manram, Ashok Nagar; The Lady of the Light Church, Luz, Mylapore; Jacob MHSS., Judges Colony, Periakuppam, Thiruvallur, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Loyola MHSS., United India Colony, Kodambakkam; St. Lukes Church, Anna Nagar; Anglo Indian Association, Ponniyamman Koil St., Egmore; Annai Velankanni Church, Besant Nagar; C.S.I. Good Shepherd Church, Taramani Link Rd., Velachery; Kondithope Community Centre, Police Quarters, Waltax Rd.; St. Mathias Church, Kamarajar Salai, K.K. Nagar; C.S.I. Church, Moolakadai; and The Lady of the Light Church, Luz Church Rd. 7 p.m.", 
    "section": "national", 
    "title": "MRR/CHENNAI TODAY FOR MARCH 09 (WEDNESDAY) FOR CHENNAI CITY FOR PAGE 4", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}