{
    "author": [
        "S Senthalir"
    ], 
    "text": "Union Territory seems to have failed in effective implementation of the Protection of Women from Domestic Violence Act\n\nS.Jayanthi, project director, Pondicherry AIDS Control Society, with Senior Superintendent of Police (Traffic) Rachna Singh at a candle light rally to create awareness of HIV/AIDS in Puducherry on Tuesday.—Photo:T. Singaravelou\n\nHow safe is Puducherry for women, not only when they are out on the streets, but right inside their homes?\n\nThough official records show a decline in the registration of cases related to violence against women in Puducherry, the Union Territory seems to have failed in effectively implementing the Protection of Women from Domestic Violence Act, 2005.\n\n“There are no service providers, medical facilities or shelter homes that are essential for this Act. While the government has appointed two Protection Officers for Puducherry, the posts of service providers are yet to be filled. Besides, there are no medical facilities or shelter homes for those seeking aid under this Act,” said Perumal S, legal consultant, ADECOM Network, a non-governmental organisation in Puducherry.\n\nProtection Officers are appointed to report domestic violence incidents to the Magistrate upon receiving a complaint, help the aggrieved person with filing application and ensure that they are provided legal aid under the Legal Services Authorities Act, 1978.\n\nAccording to Chapter III of the Protection of Women from Domestic Violence Act 2005, the State government has to notify a medical facility for the purpose of this act. Besides, they have to appoint service providers as noted under Sub-section (1) of Section 10.\n\nThese service providers can be any voluntary association registered under the Societies Registration Act, 1860 or a company registered under the Companies Act, 1956 or any other law for the time being in force with the objective of protecting the rights and interests of women .\n\nThey have to report and forward a copy to the magistrate and the protection officer. The service providers also have to responsibility to get the aggrieved person medically examined and forward a copy of the medical report to the Protection Officer and the police station within the local limits. They should also ensure that the person is provided shelter at a home.\n\nP. Lalidamballe, Managing Trustee, ADECOM Network, said during a seminar on the Protection of Women from Domestic Violence Act 2005, that they have requested the government to immediately take steps to appoint service providers.\n\nThe NGOs have appealed to the government to also provide medical staffers who could provide medical facilities and set up separate shelter homes for women affected by domestic violence as directed by the Act.\n\nMr. Perumal said that failure to do so would imply that the government has not fully and effectively implemented this Act. “The best practices could be seen in States such as Kerala, Karnataka and Andhra Pradesh,” he said.\n\nThe statistics as shown by the Puducherry Police show a slight increase in the number of rape incidents reported and detected. Still a single digit number, the number of rape cases as reported in 2014 was only one in the Puducherry region. In 2015, four rape cases were reported in this region.\n\nThe number of women molested in 2014 was reportedly 15 and it has come down to 11 in 2015. Eve-teasing cases have increased from four in 2014 to seven in 2015. The number of dowry death and domestic violence cases has remained the same in the last two years with one and three cases reported respectively.\n\nPolice officials say that the number cases of violence on women in Puducherry has been decreasing owing to effective functioning of the State machinery.\n\nHowever, at least 59 girl child abuse cases have been reported since 2013.\n\nVidya Ramkumar, chairperson, Child Welfare Committee, who has been instrumental in bringing to the fore many child abuse cases in Puducherry, said:\n\n“Safety of women and children are of prime importance and the government has taken this seriously over years. The issues of safety of children are different in nature compared to that of women. Children being young may not even be aware of the safety that they need to adhere to. It is the responsibility of the society to understand this and provide opportunities of a safe upbringing of children,” Ms. Ramkumar said.\n\nConcerted efforts by the stakeholders to create awareness of the role of various institutions and legal protecting measures among the general public over the last few years have sensitised them to not only prevent, but also complain about abuse of children, to a great extent. This has reflected in the increased number of reporting of incidents leading to lodging of complaints .\n\nPuducherry-based human rights activist Sukumaran raised concerns over the failure in registering cases of violence against women in the women police station in Puducherry. “The statistics available at the police stations do not give the real picture. We have received many complaints related to refusing to register complaints against violence on women in the police station including the women police station in Puducherry. In such instances, the records will only show single digit number,” he said.\n\nHe called for a victim-oriented approach in addressing issues of violence on women.\n\nMs. Ramkumar stated that awareness has to be created on various forms of crimes or prevention or reporting mechanism, sex education be introduced at schools, knowledge spread on Child Helpline – 1098 and Women Helpline - 1091.\n\n“Women and girls should be empowered through education, for economic empowerment and independence. There should be a will and determination to fight against injustice. Media can play an important role in facilitating this. Women need to expose the injustices happening against them in society so that others become aware and confident of further reporting.”", 
    "section": "national", 
    "title": "Much needs to be done for women in Puducherry", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}