{
    "author": [
        "B Kolappan"
    ], 
    "text": "With narrow victory margins becoming more frequent in Assembly elections, major political parties cannot afford to ignore even minor parties that have the potential to tilt the scales in a close contest.\n\nThis may explain why the DMK, the principal challenger, is keen to rope in the DMDK, considered a force that may be in a position to swing the electoral fortunes in the former’s favour.\n\n“The DMK need not fear about the outcome of the polls as successive elections have seen the ruling party being unseated without any exception since the 1989 Assembly elections. As it is under compulsion to win the election, the DMK is taking all efforts to bring in more allies into its fold,” said Dravidian historian K. Thirunavukkarasu.\n\nHe said as early as in 1967 elections, M.S. Sivasami, the DMK candidate in the Thoothukudi Assembly constituency won the seat with a margin of merely 27 votes. The recounting of votes in Elayankudi sprang a surprise in 1977 as the CPI candidate S. Sivasami was declared elected by just one vote. DMK leader M. Karunanidhi scraped in with 599 votes in the Anna Nagar constituency in the 1980 Assembly elections.\n\nHowever, since 2006, victory margins across the state have narrowed even further, thanks to multi-cornered contests.\n\n“The trend has worked in favour of smaller outfit as both the DMK and the AIADMK have acknowledged their role,” said Panruti T. Velmurugan, founder of Tamilaga Vaazurimai Katchi (TVK) who won the 2001 election by less than 200 votes.\n\nThe 2006 Assembly elections saw CPI (M) floor leader A. Soundararajan losing in Singanallur constituency by a margin of 14 votes. His party colleague N. Nanmaran retained Madurai-East constituency by securing 51 votes more than his rival. In 2011, former minister Poongothai Aladi Aruna lost the election by a margin of 299 votes while another DMK MLA K. Anbazhagan won the Kumbakonam constituency by polling 1,272 votes more than his rival. In Egmore constituency, DMDK candidate K. Nallathambi defeated DMK’s veteran Parithi Ilamvazhuthi by a margin of 202 votes.\n\n“This shows the fractured polity of Tamil Nadu. The emergence of caste outfits also contributed to the trend in a major way. Winning is one thing. A candidate need these outfits support even to canvass during the polls,” said senior TMC vice-president Peter Alphonse.\n\nMr. Soundarajan said the first-past-the-post electoral system was to blame for the current state of affairs, apart from factors such as the reliance on alliance partners and the role of money power.\n\n“Even under Jawaharlal Nehru’s leadership, the Congress party could not get 50 per cent of the votes even though it had continuously ruled the country. Political parties haven taken advantage of the current system and it has paved way for corruption. That is why we advocate proportionate representation. It will not only ensure a presence for all political parties in legislatures and Parliament, but also put an end to all poll-related irregularities,” added Mr. Soundararajan.\n\nThe clamour for alliances has worked in\n\nfavour of\n\nsmaller outfits", 
    "section": "national", 
    "title": "Narrow victory margins make alliances inevitable", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}