{
    "author": [
        "S Prasad", 
        "R Sivaraman"
    ], 
    "text": "Women outnumber men in the electorate of 9,27,128\n\nAlthough women voters outnumber men in Puducherry, they are a far away from proportionate representation as Members of Legislative Assembly (MLAs) in more than half century of political history of the Union Territory.\n\nOnly seven women have become MLAs since 1963. In fact, there are no woman legislators at all in the current composition of the 30-member Assembly. This is when the electorate of 9,27,128 has 4,86,060 women as against 4,41,531 men according to the latest electoral rolls.\n\nS. Baskaran, president of Puducherry Development Party said, “There was nil representation by women in the last 15 years of Assembly. There is huge demand among voters through social media sites and WhatsApp Messenger for more women representation in the next Assembly.”\n\nEven though the objective of nominated members in the Assembly is to enable the unrepresented section to participate in the democratic process of Assembly, women had been largely ignored all along for nomination to the Assembly among political parties. Only two women were given nominated post since.\n\n“Unless there is mandatory reservation keeping one third of seats for women, there will no representation to women. Another reason for poor representation in the Assembly is that women are not active either in political and social activities.\n\nThey don’t want to enrol in political parties. Those already enrolled are not keen to contest. Political parties are not interested to see more women represented”, said former Member of Parliament M. Ramadass.\n\nEven after 12 elections to the territorial assembly, the women’s participation in political activities and contesting elections remain low.\n\nDMK's lone woman nominee\n\nThe DMK fielded its lone woman nominee A. Geetha in Neravy, T.R. Pattinam in the multi-cornered contest in the 2011 elections. However, she lost to the DMK rebel and Independent Legislator V.M.C. Sivakumar.\n\nThe BJP and BSP fielded women candidates in Kathirgamam, Uzhavarkarai, Tirunallar and Oussudu.\n\nHowever, major parties have not given thought to give representation to women to contest in the poll battle, especially as rivals to prominent candidates.\n\nIt was only in 1991 that the ruling Congress fielded women contestants and since then no women aspirant has been fielded in any of the constituencies in the Union Territory.\n\nPakkiri Ammal contested and won the Embalam (Reserved) seat in 1991 while former Minister Renuka Appadurai won the Reddiyarpalayam seat (deleted after delimitation exercise) in 1980. S. Arasi contested and won Thirubhuvanai (Reserved) seat in 1996 on an AIADMK ticket.\n\nMembers of the Mahila Congress had sought tickets for women on the Congress side to contest the forthcoming elections.\n\nAlthough the members of the Mahila Congress had sought tickets in the past too the demand went unheeded followed by a silent murmur of protests.\n\nThere had been rosy promises on the platforms but little action in practice on the part of major political parties, said a leader.\n\nDuring the 2011 Assembly elections, women candidates made their maiden attempts in contesting from Oussudu, Neravy, Thirunallar, Oulgaret, Kathirgamam and Yanam constitutencies where traditionally only men have been fielded. But, none of them were successful.", 
    "section": "national", 
    "title": "No women representative in last 15 years", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}