{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The district administration on Tuesday held a meeting of nodal officers on electoral preparedness. A release from the administration said that in the meeting that the Collector, Archana Patnaik, headed issues regarding election planning, monitoring of short service messages, information and communication planning, control room system, election expenditure and much more were discussed.\n\nThey also discussed equipment and accessories needed for the smooth conduct of election, law and order maintenance, identification of sensitive booths and a few other issues. District Revenue Officers T. Christuraj, Sri Venkatapriya, Noor Mohammad, Muthu Ramalingam, and Karpakam among others participated.\n\nFor the first time, Central paramilitary force personnel will be part of the zonal officers’ team monitoring Assembly elections.\n\nAccording to sources, the inclusion of the personnel comes following the Election Commission of India norms. Thus far only personnel from the State police force were part of the zonal teams.\n\nThe teams would have thasildars and officers from other government departments with the powers of executive magistrates. The district administration also planned to give a single window clearance to political parties applying for permission for electioneering.\n\nAt each Returning Officer’s office the single window clearance system would be in place.\n\nPolitical parties could either apply online or offline for the permission but the parties would be encouraged to adopt the former system.\n\nCash seized\n\nSpecial teams of poll officials have seized Rs. 41,68,780, in The Nilgiris. This included Rs. 4 lakh in Udhagamandalam assembly segment, Rs. 17.46 lakh in the Gudalur assembly segment, and 20.22 lakh in Coonoor assembly segment. On Tuesday, the special teams had seized Rs. 1.5 lakh from a man at Thalaikundah in Udhagamandalam assembly segment, Rs. 4 lakh from two at Nadugani and Mackamulla in Gudalur assembly segment, and Rs. 12.38 lakh from two at the Katteri Junction.\n\nTirupur\n\nElection officials on Tuesday seized Rs. 4.53 lakh from a realtor, as he could not provide proper documents, at Ammapalayam check post.\n\nTahsildar (Tirupur North) S. Murugadoss said that the cash would be released after he produce documents regarding transactions.", 
    "section": "national", 
    "title": "Nodal officers’ meeting held", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}