{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Meetings should be held only at designated places, campaigns should not go beyond 10 p.m.\n\nAn election officer addresses the all-party meeting in Puducherry on Tuesday.- Photo: S.S. Kumar\n\nChief Electoral Officer V. Candavelou has asked all political parties to strictly comply with the model code of conduct in the run up to the Assembly elections to the Union Territory on May 16.\n\nAddressing an all-party meeting here on Tuesday, he said that political parties should conduct public meetings only at the designated places and get prior permission from law enforcing authorities.\n\nThe campaigns should not go beyond 10 p.m. Political leaders should scrupulously adhere to the Election Commission of India guidelines.\n\nFlying squads\n\nThe Election Commission of India has categorised Puducherry as an expenditure-sensitive state and flying squads and video surveillance teams would be put in place to ensure that the elections were held in a free and fair manner without the abuse of money power, he said.\n\nPolitical parties should desist from indulging in corrupt practices such as bribing of voters with cash or in kind and intimidating them. The parties were also briefed about the model code of conduct, the number of vehicles allowed for candidates during the filing of nomination and the number of persons allowed during the nomination.\n\nMr. Candavelou said that candidates should also provide no-dues certificate from water and electricity departments as part of their affidavits. .\n\nPermission for advertisements\n\nPermission should be obtained from the Media Monitoring Committee for election-related advertisements.\n\nP.T. Rudra Goud, Joint Chief Electoral Officer, R. Shridaran, Deputy Chief Electoral Officer, representatives of AINRC, Congress, AIADMK, DMK and CPI (M) attended the meeting.\n\nMeanwhile, the CEO has appointed Electoral Registration Officers and Assistant Electoral Officers for all the 30 constituencies in the Union Territory.\n\nThe purview of each of these electoral registration officers and assistants would be three constituencies in Puducherry and the exclave of Karaikal, and one constituency each in the exclaves of Mahe and Yanam.", 
    "section": "national", 
    "title": "Parties told to comply with model code", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}