{
    "author": [
        "K Manikandan"
    ], 
    "text": "An officer has been appointed by the Railways to receive feedback from women commuters —Photo: R. Ragu\n\nThe Southern Railway has launched an initiative that would enable women travelling on long-distance overnight trains to request for change of their berth.\n\nAn official note said that instances of lone women travellers in train experiencing discomfort had come to their attention. To address the issue, they had now appointed an officer to receive feedback from women passengers, the note added.\n\nOfficials said the woman officer, in the rank of Assistant Commercial Manager, could be reached at Ph: 90031 60980. In case of any problems caused by the co-passengers, a woman could always contact the railway helpline 182 and also the Government Railway Police and Railway Protection Force control rooms, the numbers of which were on display at the compartments, they said.\n\n“But if the woman passenger sought a change of berth, the security personnel would not be able to act upon the request and hence we came up with this initiative,” officials of the commercial department of Southern Railway explained.\n\nThey said the officer-in-charge would coordinate with the travelling ticket examiners and also with their colleagues in other divisions on the route of the trains and ensure that berths were allotted to the woman who made a request for change.\n\nOfficials said they already started getting calls from women passengers who wanted to check if the number worked.\n\nAmong those who have welcomed the initiative is Durga Devi, who boarded Kanyakumari Express at Egmore on Tuesday to reach Nagercoil where she is studying in an Ayurveda college. Raja Thilagam, a senior citizen, said the railway administration should establish an arrangement whereby tickets could be automatically booked for women in a group. Officials, said this was not possible in the current system of booking tickets, adding that in case the officer was unable to attend to the call, it would be diverted to the commercial branch.", 
    "section": "national", 
    "title": "Passengers travelling alone can now seek change of berth", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}