{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The members of the special police team formed to investigate a loud blast that damaged the walls of a few houses in Mettupatti Thathanur near here on Monday visited about 20 villages and made enquiries with the local people and revenue officials.\n\nThe team also inspected the quarries in the area.\n\nThe blast caused minor damage to a couple of houses in Mettupatti Thathanur village. On receiving information, G. Subbulakshmi, Superintendent of Police, and senior police officials rushed to the spot and made enquiries with the local people.\n\nMeanwhile, on the direction of S. Nagarajan, Deputy Inspector General (DIG) of Police, Salem Range, Ms. Subbulakshmi formed a special police team to investigate the incident.\n\nThe police team, led by Deputy Superintendents of Police M. Somasundaram (Vazhappadi) and Namachivayam (Attur) and comprising four Inspectors, eleven Sub-Inspectors, and 30 police personnel visited about 20 villages in Karipatti police station limits, including Ayothiyapattanam, Mettupatti, Kullampatti Valathiyur, Kuppanur, Ramnagar, Selliyampalayam.\n\nThe team inspected all the quarries functioning in these villages. They combed the fields and open areas for the presence of any unusual object. “No suspicious objects were found anywhere”, police sources told The Hindu . The investigations will continue, the sources added.\n\nMeanwhile, a team of expert geologists and biotechnologists from National College, Tiruchi, is expected to visit Mettupatti and the surrounding villages on Wednesday to inspect the place.\n\nK. Anbarasu, Principal, National College and noted Geologist, will lead the team, which will include professors of the Biotechnology Department of the college.\n\nGeologists and biotechnologists expected to\n\nvisit the site in Salem today", 
    "section": "national", 
    "title": "Police team inspects blast site", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}