{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Registers 9.36 p.c. growth over last fiscal by handling 5,61,586 TEUs\n\nV.O. Chidambaranar Port here has achieved a momentous landmark in container handling by surpassing the previous financial year’s container traffic of 5,59,727 Twenty-Foot Equivalent Units (TEUs) by handling 5,61,586 TEUs.\n\nTill March 6, the port maintained an impressive growth at 9.36 per cent, as compared to the corresponding period of last financial year. V.O. C. Port offers the fastest transshipment time to Colombo among all Indian ports.\n\nAccording to a statement issued by VOC Port Trust on Monday, commodities such as cotton yarn, handlooms, seafood, paper, granite and coir pith and machinery were exported by containers to Europe, North America and Asian countries.\n\nCotton, metal scrap, waste paper, cotton fibre, chemicals, metal and rubber products were imported predominantly from Europe and East Asian countries.\n\nOne inland container depot and 13 container freight stations ensured seamless flow of containers to and from the port.\n\nThe port had also created a new record in handling copper concentrate on February 20. A quantity of 19,055 tonnes of copper concentrate was unloaded from vessel MV. Dynasty Shanga.\n\nThis was the highest tonnage ever achieved on a single day at the port, using hoppers, thus breaking the previous record of 17,105 tonnes of copper concentrate unloaded from vessel MV. Navios Celestial on May 23 last year.\n\nCurrently, there are two container terminals at the seventh berth with a capacity of 4.17 lakh TEUs.\n\nAnother terminal at the eighth berth commenced its partial operations on May 11, 2014, and the full-fledged operation with the capacity of six lakh TEUs was expected by December 2016 with the commissioning of quay cranes.\n\nS. Anantha Chandra Bose, Chairman while thanking all the stake holders, officers and employees of the port, and terminal operators for their contributions in achieving the record, said that the port was continuously striving to achieve improvement in performance and productivity in order to attract more traffic.", 
    "section": "national", 
    "title": "Port sets new record in containerised cargo handling", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}