{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Principal District Judge R. Poornima adjourned the temple pujari suicide case to March 9 here on Tuesday for continuous hearing as the district administration appointed a new public prosecutor as per the direction of the High Court.\n\nAll the seven accused, including the prime accused O. Raja, brother of Finance Minister O. Paneerselvam, appeared before the court in the morning. However, the newly appointed public prosecutor was not present.\n\nThe district administration submitted the order appointing High Court lawyer Mohan of Erode as public prosecutor to argue the case on behalf of the petitioner Subbu Raj, father of the deceased. (Subbu Raj had filed a case in the High Court seeking another lawyer in the place of the public prosecutor appointed by the government in Dindigul.)\n\nDefence Counsel M. Kannappan informed the court that Mr. Raja filed a writ petition in the High Court seeking clarifications on certain defects in the court decree directing appointment of a public prosecutor. The judge wanted to know whether the High Court issued any order in this connection. The lawyer replied that the writ was submitted in the HC and it was numbered. After hearing his argument, the Principal District Judge adjourned the case to Wednesday advising all the accused to appear before the court. Already, the Madurai bench had directed the subordinate court to dispose the case within four months.\n\nCharges were framed against O. Raja and others on December 15. The Theni District Court had transferred the case to Dindigul District Court on November 25 as per direction of Madurai Bench of the Madras High Court.\n\nS. Nagamuthu (22) of T. Kallupatti village, a Dalit, who worked as pujari in Sri Kailasanathar hill temple in Periyakulam had committed suicide by hanging on December 8, 2012 after he was allegedly subjected to harassment.", 
    "section": "national", 
    "title": "Pujari suicide case: new public prosecutor appointed", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}