{
    "author": [], 
    "text": "According to a report presented by a background verification company, eleven out of every 100 resumes in the fourth quarter of 2015 had discrepancies\n\nEmployment-related discrepancies continue to be high in the October-December quarter of 2015 as more than 11 per cent of job seekers have some form of discrepancy or the other in their resume, a report says. The discrepancy percentage has maintained the high trend at 11.4 per cent in the fourth quarter of 2015, which means that out of every 100 candidates screened, 11 were found to have mismatches in one or more components, First Advantage said in a report titled ‘Background Screening Trends Report: India’ The figure for the previous quarter (July—September) of 2015 stood at 11 per cent. The report is based on data collected from background verifications and reference checks conducted by First Advantage across India. The results of the report are segmented under critical discrepancy types — employment, education, finance-related, address, and database — that examine the discrepancy breakdown by verticals, states, regions, industry, age, gender and the like. In the fourth quarter of 2015, males with anomalies constituted 80 per cent and females the remaining 20 per cent. The highest discrepancy was noted in the BFSI sector at 38 per cent followed by IT at 23 per cent. The maximum increase in employment discrepancies was recorded in the engineering sector (from 10.5 per cent in Q3 of 2015 to 13.8 per cent in Q4 of 2015) followed by healthcare and pharma (from 10.7 per cent to 12.2 per cent). “With the latest economic developments indicating an aggressive hiring trend in coming quarters, employers are looking for best hiring and screening practices that will allow them to make judicious decisions for keeping their employees productive and safe,” First Advantage India Managing Director and Senior V-P Purushotam Savlani said.— PTI\n\nThis article has been corrected for a factual error.", 
    "section": "national", 
    "title": "Resumes with misleading information on the rise", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}