{
    "author": [
        "Staff Reporter"
    ], 
    "text": "With the model code of conduct in force, the administration has issued a series of directions to printing presses and owners of wedding halls.\n\nPrinters are mandated to print the name and details of the advertiser concerned for campaign adverts on the posters, leaflets and hoardings. They are also required to secure a declaration from the advertiser along with the signatures of two witnesses.\n\nA copy of the declaration shall be submitted to the district magistrate within a specified time limit in accordance with the model code of conduct.\n\nAny violation by the printers will invite action under the Sections 1 and 2 of the Representation of People Act, which includes a six month imprisonment or fine of Rs.2,000 or both. Earlier, a meeting was held with the printing press owners and operators here at the Collectorate under the aegis of District Collector C. Kathiravan.\n\nWedding halls\n\nWedding hall owners have been asked to be vigilant of model code of conduct violations and exercise caution before letting out halls. Wedding halls are forbidden for use by political parties for any campaign, meetings, or stay. No political symbols, flags, or banners shall be erected during weddings.\n\nWedding hall owners have been advised not to let out halls to political parties for serving non-vegetarian treats, liquor or for distribution of gifts.\n\nCollector C.Kathiravan has also asked caterers to refrain from taking catering orders from political parties to avoid violation.\n\nFurther, hall owners, pandal and chair hirers have been asked to ascertain the purpose for renting the hall, and preferably seek proof of clearances that have been obtained for public meetings and party campaign offices, for which pandals and chairs are sought. Also, proper receipts for the halls, chairs and pandals rented out shall be issued to the parties.", 
    "section": "national", 
    "title": "Rules for printing presses and marriage halls", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}