{
    "author": [
        "L Renganathan"
    ], 
    "text": "Dwindling water level and inadequate treatment of water for recycling have resulted in an unbearable stench emerging from the Mahamaham Tank in Kumbakonam.\n\nhe Mahamaham tank, which just two weeks ago was the destination for several lakhs of pilgrims on the occasion of masimaham , stinks. So does the Portramarai tank nearby while the Chakra Padithurai on the banks of the river Cauvery is a mess.\n\nThousands who are still thronging the Mahamaham sacred spots are putting up with the apathy unable to do anything else as they go through the motions of their spiritual pursuit. More than 60 lakh pilgrims have visited Kumbakonam for Mahamaham-related rituals since February 13 when the sacred flag hoisting took place in temples associated with the event.\n\nGut-wrenching stench hits the pilgrims even as they prepare to enter the Mahamaham tank from the eastern side late on Monday when Mahashivaratri was celebrated and thousands of devotees were waiting on the eastern bund to enter the tank. “I got wind of it as I went down the flight of steps to reach the water front. Muddied waters added to my woes and with the water to just the height of my ankle, I waded for sometime wondering whether to take a dip on just sprinkle on my head and for a moment even thought of getting out of the place. Finally, sanctity got the better of sanitation and I took the holy dip,” says P. Panneerselvam, a devotee from Samayapuram Tollgate, Tiruchi.\n\n“The Portramarai tank is wallowing in neglect,” says T. Vellaiyammal who has come with his son from Tirupur. The condition of Mahamaham tank is better compared to the Portramarai tank and the Chakra Padithurai. While the Portramarai tank is filthy, the bathing ghat on the banks of the Cauvery is swathed in outfits left behind by the devotees, leaving hardly any space to reach the small stream of water flowing in the middle, Ms. Vellaiyammal paints a grim picture.\n\n“It seems the official machinery did not anticipate the weekend surge of pilgrims into the temple town even after the Mahamaham was over and that is where they have been caught on the wrong foot,” points out Secretary of All Traders' Associations of Kumbakonam V. Sathyanarayanan.\n\nThe least the officials could do now is immediately recycle the water in the Mahamaham tank flushing out water and pumping in fresh supplies, open and clean up the temporary toilets at least in the vicinity of the sacred spots, tidy up the Portramarai tank and clear the textile garbage from the Chakra Padithurai.\n\nOnly that will keep not just the visiting pilgrims but also the people of Kumbakonam safe from communicable diseases.\n\nThe Portramarai tank is wallowing in neglect.”\n\nT. Vellaiyammal,resident of Tirupur", 
    "section": "national", 
    "title": "Sacred spots of Kumbakonam polluted", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}