{
    "author": [
        "S Sundar"
    ], 
    "text": "The city police on Tuesday claimed to have solved three bomb cases reported in January with the arrest of six persons, including advocate Pasumpon Pandian, who was expelled from the ruling party.\n\nCrude bombs were hurled on the office of Madurai West MLA at Sammattipuram and on All India Anna Dravida Munnetra Kazhagam urban district office on Panagal Road on January 9. Though no one was injured, the door at the MLA’s office was damaged in the petrol bomb attack.\n\nCommissioner of Police Shailesh Kumar Yadav told media persons here on Tuesday that political rivalry between the party urban district secretary and the West Assembly constituency MLA K. Raju and the accused Pandian led to the hurling of bombs.\n\nThe crude bombs containing iron nails and balls and lit petrol-filled bottles were hurled at both the places.\n\n“The low intensity blasts were aimed to scare away people. The motive was to disrupt a public meeting organised by Mr. Raju (Minister for Cooperation) the next day in the city and to sully his image,” Mr. Yadav said.\n\nThe next day, the city police recovered few bombs from the Madura College ground hours before the public meeting started.\n\nSpecial teams, led by Deputy Commissioner of Police (Law and Order) Bandi Gangadhar, arrested the accused on Tuesday.\n\nMr. Yadav said that two persons, identified as Kannan and Madasamy of Tuticorin district, had made the bombs at an apartment hired by the advocate. The accused had bought the ingredients for making the bombs in the city. “They had used the chemicals found in crackers to make the throw-bombs,” Mr. Yadav added.\n\nFour others, identified as Mani and Ajmal Khan of Sellur, Kannan and Madasamy of Morappanadu, had hurled the bombs at the two places and escaped on two-wheelers.\n\nThe Commissioner clarified that Pandian was among around 550 persons who were enquired earlier in connection with the case. However, he was not arrested for want of evidence.\n\nOthers among the arrested are Isaac Prabhakaran, Veerabadran and Muthupandi who were charged of abetting and harbouring the accused. The police are on the lookout for Madasamy and the owner of the apartment in connection with the case.", 
    "section": "national", 
    "title": "Six held for hurling bombs at AIADMK MLA’s office", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}