{
    "author": [
        "J Praveen Paul Joseph"
    ], 
    "text": "Two associates killed; attack is reportedly in revenge for murder of Pasupathi Pandian\n\nDeputy Inspector General of Police, Tirunelveli Range, R. Dinakaran and Superintendent of Police Ashwin M. Kotnis inspected the spot where the attack took placeon Tuesday.— Photo : N. .Rajesh\n\nTwo persons accused in the murder of Dalit leader Pasupathi Pandian were killed by a rival gang at the farm of Subhash Pannaiyar, a relative of late gangster Venkatesh Pannaiyar, at Pazhayakayal on Tuesday.\n\nSubhash Pannaiyar narrowly escaped the attack.\n\nAround 1 p.m. the gang entered the farm and hurled country-made bombs at Pannaiyar.\n\nIt then beheaded his accomplice M. Arumugasamy (32) of Surandai, and killed A. Kannan (52), a barber in Pazhayakayal.\n\nThe severed head was found at Deivaseyalpuram, sources said.\n\nA bomb found in the farm remained unexploded.\n\nA piece of broken glass was found in the rear side of a four-wheeler and a pouch to hold knife was recovered from the farm.\n\nThere is an impression that the attack was in revenge for the murder of Pasupathi Pandian by an armed gang at his residence in Nandhavanapatti, Dindigul on January 11, 2012.\n\nG. Ashokan, manager of the farm, said, “I only noticed a gang of around 40 men, who suddenly entered the farm carrying lethal weapons after parking their car and several bikes”.\n\nDeputy Inspector General of Police, Tirunelveli Range, R. Dinakaran and Superintendent of Police, Ashwin M. Kotnis inspected the area.\n\nMr. Kotnis said the police got crucial leads in the case and were closing in on the accused. Striking force personnel would be deployed at Authoor and Arumuganeri and its surroundings, the SP said.\n\nTiruchendur Deputy Superintendent of Police, V. Gopal and local police personnel were present.\n\nThe Authoor police are yet to file a case.", 
    "section": "national", 
    "title": "Subhash Pannaiyar escapes murder bid", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}