{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Training programme for zonal poll officers held at the District Collectorate\n\nA total of 33 flying squads and equal number of monitoring committees have been formed for the eleven Assembly constituencies in the district for the forthcoming Assembly elections.\n\nSpeaking at a training programme for the zonal poll officers at the collectorate here on Monday, V. Sampath said that zonal officers have to play a vital role in the successful and peaceful holding of the polls. The 33 flying squads, three for each Assembly constituency, will monitor the poll expenses incurred by the parties and candidates round the clock.\n\nThe 3,241 polling booths in the district have been divided into 302 zones comprising 10 to 15 polling booths each. The zonal officers will ensure strict adherence of model code of conduct and will be responsible for the smooth conduct of the polls.\n\nMr. Sampath directed the zonal officers to make three visits to the polling station in their respective jurisdiction and inspect the facilities available as per the Election Commission guidelines.\n\nOver 300 zonal officers participated in the training programme. C. Paul Princely Rajkumar, Revenue Divisional Officer, Sankagiri, gave a PowerPoint presentation on the poll process on the occasion. R. Sukumar, Revenue Divisional Officer, K. R. Selvaraj, Corporation Commissioner, and others participated in the programme.\n\nSP inspects sensitive polling booths\n\nG. Subbulakshmi, Superintendent of Police, inspected the sensitive polling booths in Attur Assembly constituency on Monday.\n\nThe polling stations in Gramanayakkanpalayam, Ambedkar nagar, Pudupettai, Mullaivadi have been identified by the Election Commission as sensitive booths in the constituency. Ms. Subbulakshmi inspected these booths on Monday and held discussion with the senior officials on strengthening the security arrangements in these booths. Namachivayam, Deputy Superintendent of Police, Attur, and senior police officials accompanied the SP.\n\nPoll code violations\n\nA total of 25 complaints on poll code violations have been received by the District Election Control Room functioning at the collectorate here till Monday evening.\n\nThe complaints related to the presence of the banners and flex boards of different political parties, graffiti on the public walls etc ever since the election schedule was announced on March 4.\n\nRemedial measures\n\nV. Sampath, Collector and District Election Officer, told presspersons here on Tuesday that as soon as the complaints were received by the control room, the officials were rushed to the spots to verify the genuineness of the complaints and take remedial measures. A total of 19 complaints were attended to immediately and remedial measures were taken instantly.\n\nThe rest of the complaints were also being looked into, he added.", 
    "section": "national", 
    "title": "Thirty-three flying squads formed in Salem district", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}