{
    "author": [], 
    "text": "RELIGION\n\nSri Srinivasa Perumal Temple, BHEL Township: Brahmotsavam, Soornabishekam, poonther, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Srinivasa Perumal Sannidhi, Amma Mandapam Road, Srirangam, 6 p.m.; Adhava Residential Complex, 81, Amma Mandapam Road, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 80, Nethaji Street, Ayyappa Nagar, 6 p.m.\n\nGENERAL\n\nThe Booksellers and Publishers Association of South India: Book fair, Corporation grounds, Anna Nagar, Thennur, 11 a.m.\n\nBharathidasan University Department of Environmental Management: Seminar on “Natural resources management”, D. Kannan, assistant professor, Thiagarajar College, speaks, 2.30 p.m.\n\nCARE Group of Institutions, Department of Science and Technology and Entrepreneurship Development Institute of India: Entrepreneurship awareness camp, 10 a.m. Bishop Heber College Student Counselling Centre and Junior Jaycees: Programme on Challenges faced by women in current scenario, 11.30 a.m.; Department of Social Work: Awareness programme on health and hygiene, Holy Cross Nest Special School, 2.30 p.m.; Awareness programme on tuberculosis, SVI College of Education, 2.30 p.m.\n\nNational College: Core group special meeting, S.P. Anand, assistant professor, speaks on “Medicinal Plants and its conservation”, 12.30 p.m.\n\nHoly Cross College: General valedictory ceremony, S. Padmavathy, principal, Bharathidasan University Constituent Arts and Science College, distributes prizes, 11 a.m.\n\nSt. Joseph’s College: Muthamizh Vizha, Tamizhini speaks, 10 a.m.\n\nSeethalakshmi Ramaswami College: Physics Association meeting, P. Kothandaraman, former DGM, BHEL, Tiruchi, and S.Mahadevan, renewable energy specialist, speak, 1.30 p.m.; Department of Zoology, TNAU and AICRP: Hands-on training on bee keeping, M.R.Srinivasan, professor, TNAU, and K. Gunasekaran, bee keeper, resource persons, 10 a.m.\n\nJamal Mohamed College: Lecture on “disaster management for specially abled persons” by M. Prabhavathy, head, Centre for Differently Abled Persons, 11 a.m.; Rotaract Club: Release of Petals 2016 – annual magazine,Venkataraman Prakash, director, Manashakthi, 3.30 p.m.; Media training programme, S. Mohamed Salique, principal, presides, 9.30 a.m.; valediction of Iqra Bisim Rabbik Arabic Association, K.Mujeeb Rahman, assistant professor, The New College, speaks, 11.30 a.m.\n\nChidambaram Pillai College for Women: College day, S. Subbaiah, vice-chancellor, Alagappa University, chief guest, Manachanallur, 4 p.m.\n\nRadio Mirchi and Cauvery College of Engineering and Technology, Perur: “Mirchi Kaloori Stars” – season five, N. Nallusamy, college chairman, presides, 2 p.m.\n\nM.A.M. College of Engineering: Tech meet, S. Sivakumar, founder director, Trichy Plus, resource person, 9 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}