{
    "author": [
        "Staff Reporter"
    ], 
    "text": "State government rolled out the project on January 29 this year\n\nTraders want the State government to roll back its ‘Total Solution Project’ (TSP) that envisages computerisation of services of Commercial Taxes Department. TSP traders are of the view that it will affect micro, small and medium traders.\n\nAs part of the State-wide protests on Tuesday, the Vellore unit of Tamil Nadu Vannigar Sangangalin Peramaippu staged a demonstration near the Collector’s office. R.B. Gnanavelu, district secretary, said the State government had rolled out TSP from January 29, 2016.\n\nTurnover of Rs. 10 lakh\n\n“This applies for micro, small and medium traders too. It will require a small shopkeeper in a village to keep a computer, which is not possible. This is because TSP is meant for traders with a turnover of Rs. 10 lakh,” he said.\n\nThe traders said it was possible for big traders to use computers, but for small and medium traders it was not so easy. “This system necessitates traders to enter details of transactions online within 20 days, failure of which becomes a violation,” he mentioned.\n\nHigh penalty\n\nIn addition, he pointed out that tax evasions attracted higher penalty. “The penalty has been increased by three times to Rs. 3,000. If a trader violates on three counts, the system will declare him/her as a black trader,” he said.\n\nMr. Gnanavelu said the traders wanted the State government to withdraw TSP as it cannot be implemented. “This cannot be forced on traders and is impossible to be implemented,” he added. As many as 300 traders took part in the protest.\n\nWith the model code of conduct in force, traders are concerned that their businesses will be affected due to curbs on carrying cash.\n\nCarrying cash\n\n'R.B. Gnanavelu, district secretary of Tamil Nadu Vannigar Sangangalin Peramaippu, Vellore, said the election officials are carrying out checks to ensure that people do not carry huge amount of cash to prevent its distribution to voters.\n\n“Majority of traders will carry only up to Rs. 5 lakh. The officials involved in checks can ask the traders to produce the identity cards issued by the traders’ association. ,” he said. Members of the association possessed identity cards, he added.\n\nHe urged the Election Commission to give its nod for accepting these cards as identity proof for traders. “Otherwise, these curbs will affect our businesses,” he added.", 
    "section": "national", 
    "title": "‘Total Solution Project’ will affect small businesses, say traders", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}