{
    "author": [
        "B Kolappan"
    ], 
    "text": "The Left parties’ surprise electoral “understanding” with long-time rival Congress in West Bengal has not ruffled its Tamil Nadu allies, the MDMK and VCK. Both MDMK founder Vaiko and VCK leader Thol Thirumavalavan feel that the Communists partnering with the national party in West Bengal would not dent the political legitimacy of the People’s Welfare Front (PWF) to take on the DMK-Congress combine in Tamil Nadu.\n\n“Political climate varies from State to State and the nature of alliance cannot be uniform in all States. In West Bengal, the Communists are being oppressed and a lot of them are killed. So they have made adjustments with the Congress. But they are going to fight the Congress in Kerala,” argued Vaiko, whose hatred for the Congress on the Sri Lankan Tamil issue is well known.\n\nHe pointed out that in the past too, the Left has been part of a DMK-Congress alliance (2004 Lok Sabha polls) while fighting the national party in Kerala, West Bengal and Tripura. “We have joined hands with the Left here to root out corruption and liquor trade,” he contended.\n\nAgreeing Mr. Thirumavalavan said, “We are driven by the priority of providing an alternative to the ruling AIADMK and the DMK. Attacking the Congress in Tamil Nadu or praising it in West Bengal will not affect our alliance.” Incidentally, when Mr Thirumavalavan had organised conferences to give shape to the idea of the PWF, he was keen on including other parties including the Congress to take on the DMK and the AIADMK. But at that time, he gave up the idea as the Left parties were not in favour of aligning with the Congress. “Since our agenda is to tackle corruption and liquor trade, the issue of the Congress-DMK letting down the Sri Lankan Tamils would not occupy the centre stage,” he added.\n\nCPI state secretary R. Mutharasan too sought to justify the party’s state-specific alliance. “The late A.B. Bardhan had campaigned for communists, who were in the company of the Congress in Tamil Nadu, after participating in the anti-Congress campaign in Kerala,” he said.\n\nMr Mutharasan alleged that the scale of corruption had reached unprecedented heights in Tamil Nadu and liquor had destroyed the society.", 
    "section": "national", 
    "title": "Vaiko, Thirumavalavan unruffled by Left’s truck with Congress in Bengal", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}