{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Series of events, including self-defence workshops and medical screening camps held\n\nAustralian High Commissioner Harinder Sidhu (fifth from left) launching the mobile cancer screening camp for women at Express Avenue Mall on Tuesday —Photo: M. Vedhan\n\nFrom running a marathon to participating in a legal awareness programme, self-defence course and health check-ups, women across the city marked International Women’s Day on Tuesday.\n\nThis year’s theme is ‘Pledge for Parity’.\n\nSeveral companies, organisations and institutions held special events to mark the day, while a few hospitals in the city offered women free or subsidised screenings and consultations.\n\nAt Express Avenue Mall on Tuesday morning, a mobile cancer screening camp for women was set up. Organised by the Women for Wellness Centre, Penn Nalam Hospital, the camp was supported by the Australian Consulate General in Chennai. About 100 women were given medical examinations and screened for cancer, free.\n\nThe Australian High Commissioner designate for India, Harinder Sidhu, who opened the camp, said the Australian government was committed to improving the lives of women and girls around the world. “Good health is central to the well-being and empowerment of women,” she said.\n\nThe mobile van which travels around the city offers subsidised services including breast cancer screenings, pap smears and cervical cancer vaccinations. Renowned actor Gautami, a breast cancer survivor, also participated. Aspire Systems, an IT solutions provider, held a ‘Run for a Cause’ marathon. Over 150 employees chose to run, a press release said, and Rs. 15,400 was raised, which will go towards educating girl children.\n\nAccess Healthcare Services, a BPO, kick-started their four-day celebrations on Tuesday. The events include a self-defence workshop for women employees, with sessions combining the basic principles of Indian martial arts, urban survival tactics and psychology, a press release said.\n\nHospitals in the city too, geared up to mark the day. At Kauvery Hospital, an event honoured five women in the field of education. Also, the hospital gave away discounted vouchers for women’s health check-ups. All women walking into the hospital until March 31 will be eligible for the special discounted vouchers, a press release said.\n\nFortis Malar Hospital too, has organised a month-long health check-up campaign where 21 check-ups will be provided at subsidised costs and with consultations. For details, residents can call 42892222, a press release said. On Sunday, Apollo Cradle organised a 2.3-km walkathon to increase awareness on sex-selective abortion, a press release said. The Tamil Nadu Federation of Women Lawyers held a legal awareness programme, and other organisations felicitated and honoured women achievers.", 
    "section": "national", 
    "title": "Women across the city come together to celebrate their day", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}