{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Women participating in a fashion show in Thoothukudi on Tuesday.— Photo: N. Rajesh\n\nInternational Women’s Day was celebrated at V.O.Chidambaram College here on Tuesday.\n\nS. Sornalatha, Advocate Notary, Thoothukudi, in her keynote address spoke on legal remedies for tackling problems of women harassment. Professors of various departments and students participated in the programme organised by the women’s counselling centre of the college. While V.Valliammal, Professor, welcomed the gathering, A.Sindhuja Cardoza, Professor, proposed a vote of thanks.\n\nSimilar programmes were organised at Annammal College of Education for Women.\n\nSterlite Copper also observed International Women’s Day. S. Nirmala Vijaya Kumar, Infertility Specialist and chief guest of the programme, presented awards to six self-help group members and six women entrepreneurs.\n\nPrizes were also distributed to winners of various sports events organised by the company recently.\n\nMembers of Southern India Regional Council of The Institute of Chartered Accountants, Thoothukudi branch, also celebrated Women’s Day. Women officers of various departments spoke on challenges being faced by women in the society and how to overcome them.\n\nM. Jamuna Devi, Deputy Commissioner of Income Tax, S. Shanthi, Financial Adviser and Chief Accounts Officer, V.O. Chidambaranar Port Trust, Manju Singhwi, Director, Ramesh Flowers, Sathya Priya, Superintendent of Police and Principal of Police Recruit School, Perurani, Jothi Motha, Proprietor, JM Associates, Sebasty, Associate Professor of English, St.Mary’s College, and Shubhaa , an entrepreneur, were present.\n\nNSS unit celebrates\n\nNational Service Scheme volunteers celebrated International Women’s’ Day at Agricultural College and Research Institute in Killikulam.\n\nM.Sundari , Senior Surgeon, Primary Health centre, Vallanadu, and chief guest, explained the importance of health for women. V. Subramanian, Dean, spoke about on this year’s theme, “Step it for gender equality.”", 
    "section": "national", 
    "title": "Women’s Day celebrated", 
    "subsection": "tamilnadu", 
    "date": "2016-03-09"
}