{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "India and Afghanistan are expected to sign an MoU for visa exemption on diplomatic passports\n\nFighting terror, visa liberalisation and improving India-Afghanistan business ties are on the agenda as Afghanistan Chief Executive Abdullah Abdullah lands in Delhi on Sunday.\n\nDr. Abdullah’s visit comes a month after Prime Minister Narendra Modi’s unannounced visit to Kabul on Christmas day, when he had also travelled to Lahore. This is the first meeting between the Indian and Afghanistan leadership since the attacks on the Pathankot airbase and the Indian Consulate in Mazar-e-Sharif, which many officials believe were synchronised.\n\nOn Tuesday, Dr. Abdullah is down to deliver the keynote address at a counter-terrorism conference in Jaipur, which he will attend along with President Pranab Mukherjee. At least three Union Ministers — Defence Minister Manohar Parrikar, Home Minister Rajnath Singh and Railway Minister Suresh Prabhu — are expected to be speak at the conference, in which Foreign Secretary S. Jaishankar will deliver a special lecture. National Security Adviser Ajit Doval will host a dinner. The presence of the entire Indian security establishment at the conference, organised by BJP general secretary and analyst Shaurya Doval’s private think-tank India Foundation, will be closely watched for the government’s thinking on the steps after the India-Pakistan relations came to a standstill after Pathankot.\n\nDuring his talks with Mr. Modi and External Affairs Minister Sushma Swaraj, Dr. Abdullah is expected to discuss leads in the attacks, cooperation on counter-terror operations, as well as the latest round of the four-nation Taliban talks that concluded this month. Officials said the two sides are expected to sign a memorandum of understanding (MoU) for visa exemption on diplomatic passports. Another MoU will be signed between the Afghan Chamber of Commerce and ASSOCHAM.\n\nTo meet Doval\n\nDr. Abdullah is also expected to meet Mr. Doval, on the sidelines of the conference, before he leaves for Kabul on Wednesday. The Pathankot and Mazar-e-Sharif attacks will be discussed. The attacks on January 2 and 3 came barely a week after India had announced the transfer of four Mi-35 helicopters to Afghanistan.", 
    "section": "national", 
    "title": "Abdullah to discuss terror, business", 
    "subsection": "general", 
    "date": "2016-01-31"
}