{
    "author": [], 
    "text": "Afghan boy becomes Internet star after plastic shirt goes viral\n\nFive-year-old Murtaza Ahmadi shows off his jersey as he plays football in Jaghori district of Ghazni province in Afghanistan.— Photo: AFP\n\nA five-year-old Afghan boy has become an Internet star after pictures went viral of him wearing an Argentina football shirt made out of a plastic bag, complete with his hero Lionel Messi’s name.\n\nMurtaza Ahmadi has never met his idol and lives in a Taliban-controlled area of Afghanistan but footage and photos of him wearing the improvised shirt, with Messi’s named scrawled in marker pen, went round the world.\n\nMurtaza’s elder brother Homayoun, 15, made him the shirt and first posted the photos of Murtaza wearing it on Facebook two weeks ago.\n\nAfter creating waves on social media there were claims Argentina and Barcelona star Messi wanted to find his young fan and give him a proper jersey.\n\nMurtaza, whose father admitted he could not afford to buy him a replica jersey, said he had only a punctured ball to play with in his village in Afghanistan’s Ghazni province. But the little boy said he idolised Messi.\n\n“I love Messi, he plays well, the shirt was made by my brother and I liked it very much,” Murtaza said. “We do not have a football playground near our house, and the only ball I have is punctured.” But he added: “I want to be like Messi, when I grow up.”\n\nInternet users had quickly tried to identify the boy shown in the pictures and it was initially claimed he was an Iraqi Kurd before Murtaza’s uncle Azim Ahamdi, who lives in Australia, posted pictures of his nephew and said he was the unwitting star of the story.\n\nThe family, who live in a remote rural area, only learned about Murtaza’s newfound fame from relatives when Murtaza’s father’s visited the Afghan capital Kabul. “He (Murtaza) asked me to buy him a Messi jersey but I am a farmer and could not afford it,” Mohammad Arif Ahamdi, a father of six, said.\n\n“Murtaza wants to meet Lionel Messi in person one day,” he added. “I want my son to become a good football player in the future and become the Messi of Afghanistan.”\n\nSport was rarely played under Taliban rule, and the football stadium in Kabul was a notorious venue for executions, stonings and mutilations.\n\nFootball and cricket are the two most popular sports in war-torn Afghanistan. — AFP\n\nI love Messi, he plays well, the shirt was made by my brother and I liked it very much", 
    "section": "national", 
    "title": "Afghan boy loves his plastic bag Messi shirt", 
    "subsection": "general", 
    "date": "2016-01-31"
}