{
    "author": [
        "Soumya Das"
    ], 
    "text": "West Bengal has recorded a major decrease of nearly 10 percent in terms of pregnant women who are anaemic in the last 10 years, according to report released by the National Family Health Survey (NFHS)-4 recently.\n\nIn the NFHS-3 report published in 2005-6, the corresponding figure was 62.6 percent and it has come down to 53.6 percent, registering a decrease of nine percent.\n\nThe current NFHS report states that while among pregnant women in the age group of 15 to 49 years in urban Bengal, 54.2 percent are anaemic, in the rural area it is 53.3 percent.\n\nPublic health experts have welcomed the “significant decrease”. Speaking to The Hindu , Mr. Asadur Rahman, who heads the United Nations Children Fund Field Office in the State, said: “We think the decrease in the number of women in the category concerned is a positive development.”\n\nHe also pointed out that in terms of other key health indicators such as institutional delivery and children immunisation, West Bengal has improved significantly.\n\nMr. Rahman, however, emphasised the importance of having disaggregated data regarding public health in tribal and urban slum areas as well as places such as the Sunderbans.\n\n“The situation may be not so good in such areas and therefore the need for disaggregated data assumes significance,” he said.\n\nThe figures on anaemia among non-pregnant women in the same age group in the State, however, are not very encouraging. While the NFHS-3 report pegged it at 63.2 percent, the latest one showed a marginal decreased to 62.8 percent. In the urban areas, the corresponding figure stands at 58.4 percent and in rural areas 64.8 percent.\n\nIn terms of awareness of AIDS, the report reveals that the number of women with “comprehensive knowledge” about the disease is only 18 percent.", 
    "section": "national", 
    "title": "Bengal registers dip in percentage of anaemic pregnancy", 
    "subsection": "general", 
    "date": "2016-01-31"
}