{
    "author": [
        "Muralidhara Khajane"
    ], 
    "text": "Director welcomes panel headed by Shyam Benegal to revamp CBFC\n\nThe party in power often misuses the Central Board of Film Certification (CBFC) to push its political agenda, which results in extra-constitutional authorities dictating terms, renowned film-maker Mani Ratnam has said.\n\nSpeaking at the Bengaluru International Film Festival (BIFFes) on Saturday, he welcomed the appointment of a panel headed by film-maker Shyam Benegal to revamp the censor board. “CBFC is not independent as desired. It is toeing the line of the ruling party,” he said, recounting how he faced issues with his films Bombay and Iruvar .\n\nThe head of CBFC, Pahlaj Nihalani, is expected at BIFFes on Sunday.\n\nAsked whether Indian society is ready to do away with censorship, Mr. Mani Ratnam said we often underestimate the intelligence of the audience.\n\n“The audience is dynamic. They expect something more, as they are exposed to a wonderful visual world of late,” he said.\n\nMr. Mani Ratnam credited the reality in his style of film-making to Mr. Benegal and K. Balachander. “They are the ones who taught me how to make serious and intense drama realistic,” he said. When a person from the audience complimented him saying his films made three decades ago still felt modern and contemporary, he was all praise for the films of Guru Dutt, saying most of his films have stood the test of time.\n\nSpeaking on the changes sweeping cinema, he said: “Though I am still enamoured by the depth of celluloid, there is no other way, except accepting the change.”\n\nMr. Mani Ratnam, who made his debut with Pallavi Anupallavi in 1983, may return to Kannada cinema after a gap of three decades.\n\nWhen film-maker S.V. Rajendra Singh Babu offered to produce the film if he made one in Kannada, Mr. Mani Ratnam readily agreed. “I got my first break in Kannada. It got the Karnataka State award for the best screenplay,” he recalled.\n\nA filmi moment\n\nFor 25-year-old Nirmal R., a student of St. Joseph’s College, it was a now-or-never moment to speak to his hero. The first-year student of filmmaking course is a volunteer at the festival. He went very filmi and asked ‘Mani Sir’ to give him five minutes backstage to make his pitch to great applause from the audience. And he got his chance after the seminar. “I asked if I could assist him. He replied: ‘Why do you want to be an assistant?’ He advised me to make my own films. The route people take now is to make short films, so he advised me to shoot my own short film and put it up on Youtube,” said Nirmal.\n\nIn fact, what was supposed to be a master class with Mani Ratnam turned into a fan club of sorts with some even turned away because the hall was full.", 
    "section": "national", 
    "title": "Censor board is often misused by party in power: Mani Ratnam", 
    "subsection": "general", 
    "date": "2016-01-31"
}