{
    "author": [
        "Somesh Jha"
    ], 
    "text": "The government has framed a new model law that will allow cinema halls, restaurants, shops, banks and other such workplaces to be open 24/7. The law will also enable women to work during the night in such offices with mandatory cab services and other workplace facilities for them.\n\nThe government has sent a draft Cabinet note on Model Shops and Establishments (Regulation of Employment and Conditions of Services) Act, 2015 for inviting comments from various Ministries and government departments. This will act as an advisory to the State governments which will have the option to either adopt this model law or make changes to it according to local needs.\n\n“All shops and establishments not covered under the Factories Act, such as malls, cinema halls or an information technology firm, may be open 24X7 and allowed to work 365 days in a year. We will issue an advisory to the States, which will not require approval from Parliament, and it is up to them to take it up or make changes,” Union Labour Secretary Shankar Aggarwal told The Hindu .\n\n“We have protected the workers’ rights while framing this law.\n\nIt will also give boost to the revenues of the services sector which can open all day long now,” Mr. Aggarwal added.\n\nThe draft law proposes to cover all premises, barring factories, or shops with work related to printing, banking, insurance, stocks and shares, brokerage or theatres, cinema and “any other public amusement” which is currently not covered under the Factories Act 1948. All such units which employ 10 or more workers are proposed to come under this Act, said a draft Cabinet note reviewed by The Hindu .\n\nFor the first time, godowns, warehouses or workplace related to packaging activities are proposed to be covered under the law.\n\nThe draft model law has laid down several provisions for workers in such establishments.\n\nIt said women would be permitted to work during night shift and there would be “no discrimination against women in the matter of recruitment, training, transfer or promotion.” Facilities such as cab services, night crèches and ladies toilets should be compulsorily provided by employers if women are working on the night shift.", 
    "section": "national", 
    "title": "Cinemas, shops may work 24/7", 
    "subsection": "general", 
    "date": "2016-01-31"
}