{
    "author": [], 
    "text": "Coldplay’s ‘Hymn For The Weekend’ video, with the festival of Holi as the backdrop, sparks Twitter debate\n\nColdplay may have shot the video of their song ‘Hymn For The Weekend’ in India with an intention to celebrate its vibrant and mystic hues, but it has sparked a debate on social media, with some calling it a “stereotypical” portrayal of the country.\n\n‘Hymn for the Weekend’ is the latest single from the band’s seventh album A Head Full of Dreams .\n\nThe song is a collaborative effort of the band with Beyonce. The video has Beyonce playing an Indian film star with the poster of her latest (fictional) film Rani on the billboards. Beyonce has henna on her hands and sports an ethnic outfit and jewellery.\n\nDirected by Ben Mor, the video also features a cameo by Bollywood actor Sonam Kapoor.\n\n“A story to tell my grandkids! I was in a @Coldplay video! Woo hoo! #biggestfan,” an excited Sonam tweeted.\n\nThe video was shot in the streets of Mumbai and other parts of India with its theme anchored on the festival of Holi.\n\nWhile a lot of fans have applauded the band for showcasing the myriads colours of India in a beautiful way there are some who have slammed the video for cultural appropriation.\n\n“No thanks for the bundle of stereotypes @coldplay. No wonder then that India will be known as the country of snake charmers & sadhus,” a Twitter user posted.\n\nAnother tweet said: “Coldplay’s new video ‘Hymn For The Weekend’ looks like ‘Slumdog Millionaire’ had a holi sequence.”\n\n“@coldplay don’t exoticize us. You’ve been to the clubs and everything. Why do you want to make it seem like all we do is dance in the streets,” another user wrote.\n\nThe four minute and 20 second video includes a ride in the famous black-and-yellow taxis of Mumbai to temple scenes.\n\nSome people showed support for the song. “All this ‘cultural appropriation’ talk. If anything, the video showcases the beauty of India. No need for all the drama,” one user tweeted. — PTI", 
    "section": "national", 
    "title": "Coldplay’s hymn to India gets a tepid reception on Twitter", 
    "subsection": "general", 
    "date": "2016-01-31"
}