{
    "author": [
        "Shiv Sunny"
    ], 
    "text": "A Class 1 student of Ryan International School in Vasant Kunj in south Delhi died after falling into a water harvesting tank in the school premises on Saturday afternoon.\n\nAccording to sources, the six-year-old boy was present in the school to practise for a poetry competition and is believed to have wandered outside his classroom, leading to the fatal fall.\n\nDeputy Chief Minister Manish Sisodia’s has ordered the District Magistrate of New Delhi to investigate the child’s death.\n\nThe deceased, identified as Divyansh Kakrora, was residing in Outer Delhi’s Sultanpuri with his parents, both paramedic staff at AIIMS. While his father is a radiographer, his mother is a member of the hospital’s nursing staff.\n\nFollowing the incident, Divyansh’s parents have accused the school authorities of negligence and concealing the boy’s death from them for too long. However, the school authorities have dismissed the allegations, claiming that the boy was suffering from attention deficit hyperactivity disorder, causing him to walk in and out of class on his own.\n\n“The boy’s parents and teachers knew of his medical condition. We were paying special attention to him,” said Sandhya Sabu, principal of the school, while speaking to a news channel. However, Divyansh’s parents have claimed that their son suffered no such medical condition. The death was discovered around 12 noon.\n\n“My son had been a student at the school for the last three years. He attended the school despite the holiday on Saturday because of a poetry competition organised by the school,” said Divyansh’s father Ramhet Meena.\n\nPolice said the incident took place sometime during the seventh period that concludes at 12. Finding the boy missing, the school authorities launched a search in the premises. Later, a school staff found the body floating in a water storage tank under the school’s amphitheatre. How and why the boy reached the obscure spot is under investigation, the police said.\n\nThe principal claimed the boy was pulled out, administered first aid and rushed to the nearby Indian Spinal Injuries Centre, where he was declared brought dead.", 
    "section": "national", 
    "title": "Delhi boy drowns in water harvesting tank in school", 
    "subsection": "general", 
    "date": "2016-01-31"
}