{
    "author": [], 
    "text": "Researchers have found the first reliable evidence that humans played a substantial role in the extinction of a giant bird in Australia.\n\nStudies have shown that more than 85 percent of Australia’s mammals, birds and reptiles weighing over 45 kg went extinct shortly after the arrival of the first humans.\n\nResearchers from the University of Colorado Boulder in the U.S. discovered the first direct evidence that humans were preying on the now extinct beasts —— in this case a bird weighing over 200 kg.\n\nThe flightless bird, known as Genyornis newtoni , was nearly seven feet tall and appears to have lived in much of the continent prior to the advent of humans 50,000 years ago, the study revealed.\n\nThe evidence consists of diagnostic burn patterns on Genyornis eggshell fragments that indicated that humans were collecting and cooking its eggs, thereby reducing the birds’ reproductive success, the researchers said.\n\n“We consider this the first and only secure evidence that humans were directly preying on now extinct Australian mega fauna,” said Gifford Miller, professor in the University of Colorado Boulder.\n\nIn analysing unburned Genyornis eggshells from more than 2,000 localities across Australia, primarily from sand dunes where the ancient birds nested, several dating methods helped researchers determine that none were younger than 45,000 years old.\n\nIt was likely that the blackened fragments were burned in transient, human fires — presumably to cook the eggs — rather than in wild fires, Prof. Miller explained in the paper published online in Nature Communications.\n\n“The conditions are consistent with early humans harvesting Genyornis eggs, cooking them over fires, and then randomly discarding the eggshell fragments in and around their cooking fires,” Prof. Miller noted. — IANS\n\nBurn patterns on Genyornis newtoni eggshells indicate that humans were cooking the bird eggs", 
    "section": "national", 
    "title": "Giant bird eaten to extinction by humans", 
    "subsection": "general", 
    "date": "2016-01-31"
}