{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Says new provisos in anti-money laundering law are not unconstitutional\n\nIn a setback to the former Minister Katta Subramanya Naidu’s family, the High Court on Thursday upheld the constitutional validity of several provisions of the Prevention of Money Laundering (PML) Act under which properties, in the name of K. Sowbhagya, wife of Mr. Naidu, were attached by the Enforcement Directorate (ED).\n\nJustice Anand Byrareddy passed the order while dismissing the two petitions filed by Ms. Sowbhagya, who had questioned the constitutional validity of at least 16 provisions of the PML Act and their amendments made between 2005 and 2013.\n\nThe ED had attached certain properties belonging to the petitioners in September 2012 after the Lokayukta police filed chargesheet against Mr. Naidu, his son Jagadish, and several others in the alleged multi-crore KIADB-ITASCA software scam.\n\nShe had also questioned ED’s September 25, 2012, order of attaching properties belonging to her by linking them to the scam.\n\nIt was contended in the petitions that some provisions gave “unfettered powers” to proceed against the persons who may have innocently acquired, “what is possibly the proceeds of crime.”\n\nAlso, it was argued that the several provisions were unconstitutional as a person could be prosecuted under the PML Act even without being chargesheeted in a scheduled offence and burden of proving contrary to the charges was transferred onto the accused persons, which was opposed to criminal laws.\n\nAnother grievance of the petitioner was that even if the case instituted in respect of a Scheduled Offences results in an acquittal of accused, such a person could still be prosecuted under the PML Act.\n\nHowever, the Court said that amendments made to the PLA Act, 2002 does not render them unconstitutional and they do not violate the Articles 14 and 21 of the Constitution of India.\n\nWith the amendments, the Court said, the offences of money laundering no more inextricably linked to only the “proceeds of crime” but extends to properties used in the commission of offence under the PML Act or any Scheduled Offences.", 
    "section": "national", 
    "title": "HC dismisses plea of Katta’s wife against ED attachments", 
    "subsection": "general", 
    "date": "2016-01-31"
}