{
    "author": [
        "S Anandan"
    ], 
    "text": "Six officers shortlisted for the historic voyage are undergoing training\n\nAnother male bastion is giving way. The Navy has firmed up its plans to embark on all-women circumnavigation under sail in August 2017, in a bid to push the frontiers of gender constructs. Six women naval officers shortlisted for the historic voyage are training under the first Indian solo circumnavigator on a sail boat, Commander Dilip Donde.\n\nA whole new sloop, of the class of the legendary INSV Mhadei with over one-lakh nautical miles under the keel and two circumnavigations behind it, is being built for the purpose. (Cdr Abhilash Tomy took the boat on a non-stop, unassisted solo circumnavigation in the wake of Cdr Donde’s feat).\n\n“We have awarded a fixed one-year contract to the same builder — Aquarius Shipyard (formerly Aquarius Fibreglas) in Goa — for a Mhadei-class boat. It’s slated for delivery in February 2017, and if everything goes as planned, the circumnavigation should get under way in August 2017 on the new boat, which remains unnamed as of now,” Captain Ashwin Arvind, Director (Sailing) of the Navy, told The Hindu.\n\nIn the run-up to this exciting new phase of the Navy’s Sagar Parikrama project, Lieutenant Commander Vartika Joshi — part of the present crew of Mhadei skippered by Cdr Donde as the 56-ft-long sloop leads a ‘Parade of Sails’ comprising 50 small boats at the International Fleet Review (IFR) in Visakhapatnam next month — will take command of the vessel in March. By mid-May, the all-woman crew of Mhadei will add zeal to their sea legs by embarking on a round trip under sail to Mauritius.\n\nThey will then be closely associated with the construction of the new boat, as Cdr Donde had been when Mhadei was being built, and its upkeep post-delivery, to build a bond with it.\n\nThe Mhadei will then have a whole new crew that will steer her to cruise across the South Atlantic in what was originally known as the Cape-to-Rio Ocean Race.\n\nMhadei at IFR\n\nNow at Visakhapatnam, Mhadei skipper Cdr Donde sounds confident about his crew of four women officers — Lt Cdr Vartika Joshi, a naval constructor; Lt Pratibha Jamwal and Swati P., both air traffic controllers; and Sub Lt Payal Gupta, an education officer.", 
    "section": "national", 
    "title": "In a first, all-woman naval team to go around the world under sail", 
    "subsection": "general", 
    "date": "2016-01-31"
}