{
    "author": [
        "Vidya Krishnan"
    ], 
    "text": "India faces serious challenges in implementing universal health coverage policies because of a “serious knowledge gap” among policy-makers and a “general unwillingness for change”, Rakesh Srivastava, former Director-General of Health Service, says.\n\nAt a session on “Enabling better decisions for better health: embedding fair & systematic processes into priority setting for universal health coverage” here, Mr. Srivastava said the priority-setting exercise in India was based on consultation with experts and not evidence, adding to the challenges of reaching the target of universal health care.\n\n“Priority setting exercise has been practised from the very beginning but it is not on the basis of scientific research and evidence, but through a consultative process. In addition, there is a serious knowledge gap among policy-makers and a general unwillingness for change. Further, when we do develop policies, there is a fight over ownership,” Mr. Srivastava said.\n\nWhile the Indian government, on paper, has agreed to the vision of universal health care under Modi government’s National Health Assurance Mission (NHAM), details of the policy remain unclear. A draft of India’s National Health Policy has been in the public domain for comments for over a year but is yet to be adopted as the definitive road map of declared government priorities.\n\n“The government has been snowed under with the comments they received on the draft. It will take some time,” said another senior official attending the summit, on the condition of anonymity.\n\nThe government spending on health system currently is 1.04 per cent of the GDP, while the national health policy aims at taking it up to 2.5 per cent by the end of the 12th Five-Year Plan. “Including the private sector, nearly 4.1 per cent of the GDP is spent on health sector. This spending needs to be streamlined in such a manner that we can use the money in the best possible way,” Mr. Srivastava said.\n\nUnder the Sustainable Development Goals (SDGs), India has signed up to revamp the country’s weak health system to keep pace with the global movement towards universal health coverage. Broadly speaking, the goal of universal coverage is considered achieved when citizens can access quality and affordable healthcare services without being pushed into poverty by what is called as ‘catastrophic healthcare expenditures.’\n\nThe discussion took place as part of the Prince Mahidol Award Conference, an annual event that brings together leaders in public health and stakeholders from across the global to propose solutions to challenges in the health sector. The theme for this year’s conference was ‘priority setting for universal health coverage.’\n\nEx-official says priority setting in India is based on consultation, not evidence", 
    "section": "national", 
    "title": "‘Knowledge gap blocking universal health coverage’", 
    "subsection": "general", 
    "date": "2016-01-31"
}