{
    "author": [
        "R Krishna Kumar"
    ], 
    "text": "Stirring up an aromatic flavour and interest in this brew over which “a lot can happen”, is an Indian entry to the Gourmand International (Book) Award on what till recently was a south Indian addiction — coffee.\n\nWith coffee culture proliferating across India thanks to outlets from Starbucks, Barista, Café Coffee Day, etc., the routine act of consuming the black decoction stirred in milk has acquired an uber-cool image among new generation consumers, besides emerging as a social drink.\n\nBengaluru-based journalist P.T. Bopanna has brought alive the trait in his book, The Romance of Indian Coffee . It has been shortlisted for the Gourmand International Award, where it will vie for the top honours with coffee books from Brazil, France, China, Thailand and the U.S., to name a few countries.\n\nHailing from Kodagu, which is the home of coffee in India, it was natural for Mr. Bopanna to feel inspired to write on the brew which has a universal appeal. “My earlier works were Kodagu-centric, but I found a wider canvas in coffee,” said Mr. Bopanna.\n\n“The book traces the history of coffee in India with interesting titbits about the brew and how its cultivation in the shade lends it a unique flavour unlike coffee grown in the open in most countries,” explained Mr. Bopanna, who feels coffee making is an art. But notwithstanding the proliferation of coffee bars, the best filter coffee, according to him, is still prepared in the bylanes of Chennai and other parts of Tamil Nadu.\n\nThe contribution of Ivor Bull, a British planter who introduced inter-cropping and is a legend among the locals, has been highlighted. So have the recipes for making coffee liqueur. There are entries from nearly 64 countries for the Gourmand Awards, introduced in 1995, as a celebration of global cookbook and wine book publishing. The final results will be announced on May 28 at Yantai, China.", 
    "section": "national", 
    "title": "Kodagu coffee goes places", 
    "subsection": "general", 
    "date": "2016-01-31"
}