{
    "author": [
        "Nikhila Henry"
    ], 
    "text": "Discrimination on the basis of caste has taken the centre stage in educational institutions, but another minority group, students hailing from the seven States in the North East of India, have been fighting against what they call “racial profiling” in the University of Hyderabad (UoH).\n\nFrom 2010 to 2015, students and faculty members of the seven sister States in UoH had raised some allegations against successive administrations of “racial profiling” and “targeting”. For instance, in 2011, a group of students protested against a letter sent out by the Vice-Chancellor’s office to all faculty members from the North East, asking their help in an initiative against alcohol and drug use on the campus, focusing first on students from their home States.\n\nMarginalisation\n\nThongam Bipin, a Manipuri research scholar of UoH, said his own experiences of marginalisation had led him to support and stand up against different forms of discrimination. Incidentally, the only faculty member from the North East (Meghalaya), who held an administrative post on campus, too has quit her position as a mark of protest and sat on a relay hunger strike called by the Scheduled Caste-Scheduled Tribe Teachers’ Association.\n\nFor some among the North East student community, the campus has been a place of differences.\n\nAs for Mr.Bipin, “profiling” has been an unaddressed issue which is spoken about when someone lodges a complaint. “In my 14 years of experience as a faculty member in the university, I have come across several instances of racial profiling of students from the North East,” said Ajailiu Niumai, Associate Professor of UoH.\n\nThe UoH in charge Vice-Chancellor said: “There is no exclusion and there is no discrimination in the university, by and large. If those who allege that discrimination exists can substantiate this, the university will look into the matter. When it comes to the North East, there have been some problems among the students. But the university has not discriminated against anyone.”", 
    "section": "national", 
    "title": "Not just caste, race question too rises in UoH", 
    "subsection": "general", 
    "date": "2016-01-31"
}