{
    "author": [
        "Satish Nandgaonkar"
    ], 
    "text": "The fire at Deonar dumping ground in Mumbai continued to simmer for the third consecutive day on Saturday and threatened to snowball into a huge political embarrassment to the Devendra Fadnavis government ahead of the Make in India event to be held in the city.\n\nThe event is less than two weeks away even as the city’s air quality index plummeted because of the smoke.\n\nThe fire that broke out on Thursday early morning continues to trouble the civic authority even as it refused to die down on Saturday morning.\n\nThe Brihanmumbai Municipal Corporation deployed a team of 21 officers and 132 fire fighters to control the fire and smoke.\n\nThe Mumbai Fire Brigade deployed 14 fire tenders each containing 4,500 litres of water, two mini water tenders (water mist), eight water tankers each containing 12 to 18,000 litres of water, three ambulances and breathing apparatus van.\n\nBy 7 pm, civic sources said the fire was under control and smoke had reduced, but the firefighting operations were going on till late night. Civic authorities suspect that some mischief mongers had intentionally fuelled the fire, and an FIR was lodged against an unknown person at Shivaji Nagar police station.\n\nState Health Minister Deepak Sawant said, “There is a possibility of poisonous elements in the smoke harming people. The government has taken this very seriously, and held discussions with the civic and health officials who will take precautions.”\n\nThe civic body also issued an advisory to the residents in north eastern suburbs such as Chembur, Deonar and Ghatkopar to cover their nose and mouths with wet handkerchief and suggested use of black goggles to protect eyes as from the smoke. Due to the thick smog, over 74 municipal schools run in Ghatkopar, Chembur, Mankhurd, Govandi and nearby areas remained closed for the second day on Saturday.\n\n“First solve the dumping ground issue and then only then think of ‘Make in India’ in Mumbai. First ‘Make Mumbai’, then ‘Make In India’. We will protest at Bandra Kurla Complex grounds and show all foreign investors the fumes and smoke of dumping ground. Let the whole world also see what Shiv Sena-BJP has done at the BMC for many years,” NCP leader Sachin Ahir told reporters.\n\nMinutes later, Chief Minister Devendra Fadnavis tweeted, “Spoke to Mumbai Municipal Commissioner. He assured that no stone will be left unturned to control the smoke at Deonar.”\n\nMumbai BJP chief Ashish Shelar, and BJP’s group leader in the BMC, Manoj Kotak, visited the dumping ground at 5.30 pm and urged the Chief Minister to order a probe the reason behind the fire, and why could it not be doused for three days, as well as the impact on the pollution on Mumbai residents.", 
    "section": "national", 
    "title": "Smoke from Mumbai dump forces closure of schools", 
    "subsection": "general", 
    "date": "2016-01-31"
}