{
    "author": [], 
    "text": "Childhood socio-economic status might influence an individual’s food choices as adults, says a study, adding that growing up poor has a long-term impact on eating patterns.\n\n“Our research finds that growing up poor promotes eating in the absence of hunger in adulthood, regardless of one’s adult socio-economic status,” said Sarah Hill from the Texas Christian University in the US.\n\nA person’s developmental history may play a key role in their relationship with food and weight management, rendering those from lower socio-economic status (SES) environments more vulnerable to unhealthy weight gain, the findings showed.\n\nPeople with higher childhood SES ate more when need was high than when need was low. This relationship was not observed among those with lower childhood SES.\n\nIndividuals with lower childhood SES consumed comparably high amounts of food whether their current energy need was high or low, revealed the study.\n\nIn a collection of three studies, each with 31 women, Hill measured or manipulated participants’ energy needs and gave them the opportunity to eat by providing snacks.\n\nWith many individuals facing issues with obesity weight management, social and personality psychologists are at the forefront of understanding the psychological motivations for healthy food choices and consumption patterns.\n\nAnother study, part of the same research, says serving order and labels influence healthy eating.\n\n“The word ‘healthy’ seems to turn people off, particularly when it appears on foods that are obviously healthy. The subtle health message, such as the healthy heart symbol, seemed to be more effective at leading people to choose a healthy option,” said Traci Mann and her lab at the University of Minnesota. — IANS\n\nStudy finds that growing up poor promotes eating in the absence of hunger in adulthood", 
    "section": "national", 
    "title": "Socio-economic status affects food choices", 
    "subsection": "general", 
    "date": "2016-01-31"
}