{
    "author": [
        "Girish Menon"
    ], 
    "text": "It aims to counter massive stir planned by LDF\n\nThe United Democratic Front (UDF) leadership has asked the Kerala government to order a comprehensive probe into the alleged “plot” hatched by the Communist Party of India (Marxist) and the liquor lobby along with solar scam accused Saritha S. Nair to topple the government.\n\nThe UDF leaders, who met here on Saturday, gave political clearance for such a probe against the backdrop of the massive agitation planned by the CPI(M)-led Left Democratic Front. Explaining the rationale for such a probe, UDF convener P.P. Thankachan said the CPI(M) and the liquor lobby had hatched a plot to topple the UDF government.\n\nMs Saritha’s sudden turnaround in her depositions before the solar scam commission and the Left Democratic Front-sponsored agitations were all part of this conspiracy.\n\n“The conspiracy has to be exposed by conducting a comprehensive probe,” Mr. Thankachan said.\n\nAccording to sources, the recommendation for a probe follows the insistence by several leaders on proactive moves rather than a mere campaign about the alleged conspiracy.\n\nBabu back\n\nChief Minister Oommen Chandy on Saturday rejected the resignation of Fisheries and Excise Minister K. Babu on the basis of the recommendation of the UDF leadership meeting. However, Kerala Congress (M) leader K.M. Mani who quit as Finance Minister appeared to be diffident to take up his job, even though the meeting requested him and his party to take a decision to return.\n\nMr. Babu, who had been initially firm in his resolve to quit, later issued a detailed statement explaining the reasons for going back on his stand. He said he was bound to accept the decision of the Chief Minister, his party and UDF leadership as he had won the Assembly elections under the Congress party’s symbol and was part of the ruling dispensation.", 
    "section": "national", 
    "title": "UDF seeks probe into ‘plot to topple’ Kerala government", 
    "subsection": "general", 
    "date": "2016-01-31"
}