{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Two RO plants with attached ‘ATMs’ in Alimedu and Orakkadu near Chennai cater to nearly 500 families\n\nTwo RO plants with attached ‘ATMs’ in Alimedu and Orakkadu, near Chennai, cater to nearly 500 families.— File photo: V. Ganesan\n\nPackaged drinking water and long queues are things of the past in Orakkadu village, located 30 km from Chennai. People here get drinking water at the swipe of a smart card.\n\nIt’s 10 a.m. and a few residents gather before a concrete structure at the village in Tiruvallur district. S. Deepa takes out the plastic card, holds it over the sensor of a machine and places a pot. In minutes, water gushes from the pipe and fills up the 20-litre pot. The machine calculates the volume dispensed and deducts the amount from her account. 20 litres cost Rs.2.\n\nUntil six months ago, Deepa used to buy packaged drinking water or walk to the neighbouring Nerkundram village to fetch water.\n\n“I had to wait for a long time or argue with people to take just two pots of water. Now, I get drinking water round the clock with my ATM card, it’s actually an ‘any time water’ card. I recharge it with Rs.100 every month. Many families have stopped buying packaged water and don’t have to plan their day around the water supply time,” she says.\n\nThe reverse osmosis plant and the ATM (the villagers prefer to call it ATM) are perhaps the first such facility in the State. It all started with a discussion on drinking water scarcity in the village, where the groundwater was saline. The total dissolved solids content was over 1,600 ppm.\n\nThe novel idea of a reverse osmosis plant with an ATM was mooted by Vasanthi Baskaran, panchayat president, to solve the water crisis.\n\nThe village now has two RO plants with attached ATMs in Alimedu and Orakkadu supplying water to nearly 500 families.\n\nGroundwater drawn from the borewell is stored in the overhead tank and transmitted to the plant, which has the capacity to treat 2,000 litres per hour. Though the Kosasthalaiyar river is just two km away, the village grappled with poor quality groundwater for a decade.\n\n“Residents are happy that they get water without much hassle now. We use the fund generated at the ATM to maintain the plants. Both the facilities supply drinking water of 8,000 litres every day. We provide 60,000 litres of water from overhead tanks for other needs,” says Ms Baskaran.\n\nWhile the plant was designed by a Chennai-based firm, pre-paid cards for the ATM were sourced from Pune. These facilities were established at a cost of Rs.9.7 lakh each under the self-sufficiency scheme. The rejected water is used to water plants in the neighbourhood.\n\n“A team from the Krishnagiri district recently visited our village to learn about this novel project. This would be the best low-cost solution for residents scrambling for drinking water,” Ms. Baskaran said.", 
    "section": "national", 
    "title": "Villagers here swipe a card to get drinking water", 
    "subsection": "general", 
    "date": "2016-01-31"
}