{
    "author": [], 
    "text": "“What happened was that when the Congress and the Speaker locked the Assembly House, the Congress rebels and BJP MLAs were not allowed to enter the Assembly. The Governor had asked MLAs to take up the motion for removal of the Speaker. When the MLAs found out that Assembly House was sealed, they sought permission for holding the session in a makeshift hall. At that time, Congress MLAs picketed the Raj Bhavan and slaughtered a Mithun at the gates. It cannot be slaughtered in this manner; it is related to feasts, local worship, etc. In tribal societies or anywhere, if you are slaughtering animals at someone’s gate, without any reason, it’s a sign of aggression and violence,” he said.\n\n“I don’t understand who has linked this to beef and cow slaughter. It’s an act related to law and order. In Arunachal Pradesh, except Congress supporters, people have taken exception to this kind of protest. It’s an uncivilised act. Had it happened in Uttar Pradesh, Bihar or any other place in the mainland, nobody would have excused the Congress. But since the incident happened in Arunachal Pradesh, people are cooking up stories. How can you lock the Assembly and surround the Raj Bhavan? It’s a breakdown of the constitutional machinery,” he said.\n\nAsked about the recent controversy over banning of beef, Mr. Rijiju dismissed any suggestion of such a ban being imposed in the Northeast. “In the Northeast, people eat beef, nobody has stopped it,” he said.\n\nAsked whether he ate it, he did not respond, but said: “I don’t want to discuss food habits; caste-based politics has diminished the status of the country and generated hatred. The ban on beef was imposed under other governments too. Why did it have to be an issue when the BJP did it?”\n\n“As Minister of State for Home, I’ve seen records for the last few years; there have been communal incidents, various activities by individuals and organisations, this is a huge country, diverse, and so many things are happening. But they never became a debate in the country. Why only after Narendra Modi became Prime Minister? How has the country dramatically changed in its ethos in the last 20 months,” he asked.\n\n“That is why the Prime Minister chooses not to answer all these diversionary tactics, generated by the Congress… I’m sure that after some time people will be fed up. The people have asked the Congress to sit in the Opposition, it should reconcile itself to the fact,” the Minister said.", 
    "section": "national", 
    "title": "We waited for a month: Rijiju", 
    "subsection": "general", 
    "date": "2016-01-31"
}