{
    "author": [
        "Shiv Sunny"
    ], 
    "text": "Anurag Thakur (centre), MP and Bharatiya Yuva Morcha president, leading a protest at the Congress headquarters in New Delhi on Saturday, demanding that the party clarify its stand on Parliament attack convict Afzal Guru; and National Students’ Union of India activists protesting against Union Human Resource Development Minister Smriti Irani near her residence in the national capital.— Photos: PTI & Sushil Kumar Verma\n\nAshutosh is among those accused of sedition after they participated in an event to mark the death anniversary of Afzal Guru on campus\n\nOne of the JNU students accused of sedition, Ashutosh Kumar, was called in for questioning on Saturday. The South District police had issued a summons to the former JNUSU president on Friday evening, asking him to appear at the R.K. Puram police station the next morning.\n\nAshutosh’s questioning began at 9 a.m. on Saturday and continued for almost 10 hours. Prem Nath, DCP (South), said the questioning would continue on Sunday.\n\nAshutosh was asked about his role in the controversial February 9 event on the campus and shown videos in which he is seen raising slogans seeking freedom from poverty and other issues plaguing the nation. He was also asked about the statements made by the other arrested accused — Kanhaiya Kumar, Umar Khalid and Anirban Bhattacharya.\n\nSources said Ashutosh cooperated with the interrogators, and said he had not raised any anti-national slogans. A decision on his possible arrest would be taken on Sunday, the source added.\n\nEven as the former JNUSU president was questioned inside the police station, around half a dozen of his friends patiently waited outside.\n\nAn asthma patient, Ashutosh needed an inhaler at one point during the questioning, which was instantly handed over to a policeman by one of his friends.\n\nAshutosh is among the three students accused of sedition who have not been arrested so far. In fact, Ashutosh, Rama and Anant had recently communicated to the police that they were willing to join the probe at any time required. They had also shared their contact numbers.\n\nAshutosh is an active member of the Left-backed All India Student’s Association (AISA) on the JNU campus.\n\nHe is currently pursuing a Ph.D. from the School of International Studies and is said to be one of the best speakers in the university.\n\nDuring the Presidential debate for the JNUSU elections in 2014, he had criticised the Modi government saying that the government had promised “achhe din”, but instead there have been riots in the country. He had also encouraged students to help the flood victims in Kashmir.\n\nAccording to a number of students at the university, who were eyewitnesses to the February 9 event, Ashutosh was heard raising slogans like: “ Khap se azaadi, mahilayen kya chahen azaadi, Kashmir se Kerala tab sabko aazaadi (freedom from khap panchayats, freedom for women, freedom from Kashmir to Kerala)”.\n\nThe eyewitnesses said that Ashutosh and other members of the students’ union had joined the event to pacify the ABVP members and the organisers after a scuffle ensued between them.\n\nThe former JNUSU president, who was grilled for 10 hours, denied raising\n\nanti-national slogans", 
    "section": "national", 
    "title": "Another JNU student questioned, decision on arrest today", 
    "subsection": "general", 
    "date": "2016-02-28"
}