{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Responding to the debate on the Governor’s address in the State Assembly on Saturday, Bihar Chief Minister Nitish Kumar charged that “nationalism for the BJP is RSS-ism and those who disagree with it are [termed] anti-nationals.”\n\nQuestioning the role of the Rashtriya Swamsewak Sangh (RSS ) in the freedom struggle, Mr Kumar also alleged that they (BJP-RSS) had no role in making the tricolor (national flag).\n\nThe Opposition BJP refused to attend the Assembly on Saturday which had been marked as a “holiday” earlier.\n\nFascism\n\n“It’s like Hitler’s fascism but we do not seek a certificate of nationalism from the BJP…the country will not tolerate such kind of nationalism,” Mr. Kumar added.\n\nBeef issue\n\nCriticising the BJP-led NDA government, Mr. Kumar said, “When they came first it was Love Jihad, followed by Ghar Wapsi, then the beef issue and now this anti-nationalism and all [these issues] have been rejected by the people of the country.”\n\nMr Kumar also raised the issue of the suicide by the University of Hyderabad student Rohith Vemula and said, “Rohith Vemula’s mother has contradicted all what they (BJP leaders) had said.”\n\nTaking on the BJP for their constant harping on the deteriorating law and order in the State, Mr. Kumar referred to the National Crime Records Bureau and said crime had, in fact, gone down in recent years. “Before raising their finger on Bihar they should also quote the crime graph and incidents in the BJP-ruled states,” he said in his speech that lasted for almost two hours.\n\nRule of law\n\nThough he admitted that there have been some incidents of rape and murder recently, the Chief Minister said the police were investigating the crimes. “Where will one escape from the rule of law?\n\nThere has been rule of law and there will be rule of law in Bihar,” Mr Kumar said emphatically, referring to an absconding RJD MLA, who has been accused of raping a minor.\n\n‘We don’t need certificates from the BJP,’ says the Chief Minister\n\nof Bihar", 
    "section": "national", 
    "title": "BJP’s nationalism defined by RSS: Nitish", 
    "subsection": "general", 
    "date": "2016-02-28"
}