{
    "author": [
        "Varghese K George"
    ], 
    "text": "The letter from U.S. lawmakers to Prime Minister Narendra Modi over the “increasing intolerance and violence experienced by members of religious minority communities” comes against the backdrop of the Centre’s unprecedented stifling of political dissent, increasingly a talking point in the U.S capital.\n\n“On June 17, 2014, more than 50 village councils in Bastar district of Chhattisgarh adopted a resolution banning all “non-Hindu religious propaganda, prayers, and speeches” in their communities. The Christian minority community has been dramatically affected: the ban effectively has criminalised the practice of Christianity for an estimated 300 Christian families in the region one day after a mob, which included members of the Vishwa Hindu Parishad and Bajrang Dal, seriously injured six Christians in the village of Sirciguda. Since the ban was implemented, Christians in Bastar district reportedly have been subjected to physical assaults, denial of government services, extortion, threats of forced expulsion, denial of access to food and water, and pressure to convert to Hinduism,” the letter said.\n\nBeef ban\n\n“We also are concerned that the nearly countrywide beef ban is increasing tensions and encouraging vigilante violence against the Indian Muslim community,” the letter says. “Mr. Prime Minister… We applaud your statements about religious freedom and communal harmony… We urge you to turn these words into action by publicly condemning the ban on non-Hindu faiths in Bastar district of Chhattisgarh, and …harassment against religious minorities throughout India,” the letter states.\n\n“Control RSS’\n\n“We also urge you to take steps to control the activities of groups, such as the Rashtriya Swayamsevak Sangh, and instruct Indian security forces to enforce the rule of law and protect religious minority communities from religiously motivated harassment and violence. ” the letter says.", 
    "section": "national", 
    "title": "Christians assaulted in Bastar, say U.S. lawmakers in letter to Modi", 
    "subsection": "general", 
    "date": "2016-02-28"
}