{
    "author": [], 
    "text": "French director Philippe Faucon poses with his trophy for Fatima during the 41st edition of the Cesar Ceremony in Paris on Friday. (Right) Screenwriter Alice Winocour (left) and French-Turkish director Deniz Gamze Erguven after they won awards for Mustang.— Photo: AFP\n\nFrance’s top film awards ceremony, the Cesars, celebrated diversity on Friday with honours for films about the struggles of life as an immigrant and forced marriage.\n\nThe crème de la crème of French showbiz gathered in Paris Friday for the 41st Cesars just two days ahead of its Hollywood equivalent, the Oscars, which have been panned as “too white.”\n\nMustang , which is up for a foreign film Oscar on Sunday, scooped three awards including for best first feature film. The film by Franco-Turkish director Deniz Gamze Erguven, tells the story of five sisters in rural Turkey forced into arranged marriages.\n\nImmigrant life\n\nThe best picture accolade went to Fatima , a movie about an immigrant Moroccan woman struggling to raise her two teenagers in France and working as a cleaning lady to give them the best life possible.\n\nHowever, with her rudimentary French while her daughters have trouble speaking Arabic, communication is strained, especially with her rebellious younger daughter. The leading role was played by Algerian Soria Zeroual, a real-life cleaning lady who found herself nominated for best actress alongside French cinema greats Isabelle Huppert and Catherine Deneuve.\n\nMichael Douglas became the latest Hollywood star to be honoured with a lifetime achievement award by the Cesars, and delivered his acceptance speech entirely in French.\n\n“It is a little like French cuisine, to make a great dish you need excellent ingredients. To make a great film you need a brilliant screenplay, a great director and exceptional actors,” said Mr. Douglas. “I have nearly always had the chance to count on these good ingredients.”\n\nThe broad sweep of actors and film themes on offer comes in stark contrast to those up for the Oscars, which have been rocked by controversy after no minority actors were nominated for a second year running.\n\nSeveral leading black Hollywood stars such as Spike Lee and Will Smith have vowed to boycott the “lily white” awards, while the hashtag #OscarsSoWhite has swept social media.\n\nIn France, three women film-makers were nominated for a Cesar — none of them won — while not a single woman got the nod in that category at the Oscars.\n\nThe best actress gong went to 10-time Cesar nominee Catherine Frot, 59, for her role in Marguerite , which tells the tale of a diva who wants to be an opera singer and seems oblivious to the fact that she cannot sing.\n\nLindon is best actor\n\nVincent Lindon, 56, scooped the best actor prize for his role in Le Loi Du Marche (The Measure Of A Man) in which he plays an unemployed factory worker faced with humiliating job interviews and useless internships. Lindon already won best actor for the film during the 2015 Cannes film festival, and won the Cesar accolade after five previous nominations.\n\nOscar-winning Birdman by Mexican director Alejandro Gonzalez Inarritu scooped a Cesar for best foreign film on Friday. A showbiz satire about the dark side of fame starring Michael Keaton,\n\nBirdman won four Academy Awards last year, including the coveted best picture prize. The film Le Petit Prince (The Little Prince), which has scored huge success abroad and is the first feature film adaptation of the novel by Antoine de Saint-Exupery, won the Cesar award for best animated film. — AFP\n\nThe broad sweep of actors nominated were in stark contrast to lack of diversity in Oscars", 
    "section": "national", 
    "title": "French film awards honour diversity in Fatima, Mustang", 
    "subsection": "general", 
    "date": "2016-02-28"
}