{
    "author": [
        "Shiv Sunny"
    ], 
    "text": "Fears for her safety forced a 19-year-old German woman to stay silent about her rape by an autorickshaw driver in the national capital for almost two months before writing to the Delhi Commission for Women.\n\nAccording to Swati Maliwal, the DCW chief, the rape was followed by molestation by a group of men before the victim managed to escape, the victim who runs an NGO in Nagpur, has alleged.\n\nA rape case was registered at Prasad Nagar police station on Wednesday night after the victim’s statement was recorded . The suspects have not yet been identified. The incident took place on the night of December 14, 2015. The woman was in the national capital with a female friend and was staying in a Patel Nagar hotel in central Delhi.\n\nAccording to Ms. Maliwal, the victim, who lost her way to the hotel, had asked an autorickshaw driver for directions.\n\n“He offered to drop her to her hotel. Instead of dropping her to her hotel, the driver assaulted and raped he,” said Ms Maliwal on Saturday.\n\nThe woman fought back and ran into a street, but the auto driver allegedly chased her along with four other men, said Ms. Maliwal quoting the victim.\n\n“The men chased her and began molesting her. But the woman bit the tongue of one of the molesters, causing him to yell in pain. That caused a commotion and the assailants fled fearing that the injured man’s cries would draw attention,” said Ms Maliwal.\n\nThe dazed woman wandered on the road for a few moments before a young man, who was passing by, saw her in a pathetic state and dropped her back to the hotel.\n\nAfraid to report the matter to the police, the victim returned to Nagpur and had only recently decided to write to the DCW, Ms Maliwal said.\n\nThe victim kept silent about the incident for two months, fearing\n\nfor her safety", 
    "section": "national", 
    "title": "German woman alleges rape by auto driver in Delhi", 
    "subsection": "general", 
    "date": "2016-02-28"
}