{
    "author": [
        "National Bureau"
    ], 
    "text": "Parliament’s Standing Committee on Defence has expressed dismay over the government’s reluctance to commit to a minimum percentage of its expenses for the armed forces, despite its recommendations.\n\n“The committee also feel dismayed to note that although the Ministry of Defence has reportedly conveyed the concern expressed by them to the Ministry of Finance on 14 January 2015, the response of the Ministry of Finance is still awaited,” said an action-taken report submitted to Parliament on Friday.\n\n“The committee desire that this declining ratio should be arrested in the next financial year itself, so that the services are provided adequate funds, and hence they are not deprived of essential equipment and ammunition,” it had said earlier.\n\nThe committee had then told the government that it should “consider fixing a minimum benchmark for this percentage, which should be adhered to, in every case”.\n\nThe Defence Ministry told the committee that it had written to the Finance Ministry on January 14 last year, drawing its attention to the recommendation of the parliamentary committee. The Ministry did not respond.\n\n“The Ministry of Finance was informed about the committee’s emphasis on the need for increase in defence expenditure in proportion to the total Central government spending and fixing a minimum benchmark percentage in this regard. Response from Ministry of Finance is awaited,” the Defence Ministry told the committee.\n\nThough the defence budget is increasing numerically annually, as a proportion of the Central budget, it has consistently been declining. In 2009-10, the defence expenditure of Rs. 1,41,781 crore was 13.84 per cent of the total expenditure. In 2010-11, the budget increased in absolute terms, but in percentage terms, it came down to 12.87 per cent. In 2011-12, the defence expenditure rose to Rs. 1,70,913 crore, but in percentage terms, it was merely 13.1 per cent of the government’s expenditure. Since then, it has been sliding continuously.\n\nIn 2012-13, the defence expenditure was pegged at Rs. 1,81,776, which was 12.89 per cent of the government’s expenditure. However, it further came down to 12.81 per cent under the revised budget.", 
    "section": "national", 
    "title": "House panel seeks higher defence outlay", 
    "subsection": "general", 
    "date": "2016-02-28"
}