{
    "author": [], 
    "text": "What is out there at the edge of our solar system? Scientists using data from NASA’s Interstellar Boundary Explorer (IBEX) have pinned down an interstellar magnetic field which lies at the very edge of the giant magnetic bubble surrounding our solar system called the heliosphere.\n\nImmediately after its 2008 launch, IBEX spotted a curiosity in a thin slice of space: More particles streamed in through a long, skinny swathe in the sky than anywhere else. The origin of the so-called “IBEX ribbon” was unknown — but its very existence opened doors to observing what lies outside our solar system, the way drops of rain on a window tell us more about the weather outside.\n\nThe new study, published in Astrophysical Journal Letters , precisely determines the strength and direction of the magnetic field outside the heliosphere. The study is based on one particular theory of the origin of the IBEX ribbon, in which the particles streaming in from the ribbon are actually solar material reflected back at us after a long journey to the edges of the sun’s magnetic boundaries, researchers said.\n\n“The theory says that some solar wind protons are sent flying back towards the sun as neutral atoms after a complex series of charge exchanges, creating the IBEX ribbon,” explained Eric Zirnstein, space scientist at the Southwest Research Institute in San Antonio, Texas. “Simulations and IBEX observations pinpoint this process — which takes anywhere from three to six years on average — as the most likely origin of the IBEX ribbon,” he added.\n\n“Only Voyager 1 has ever made direct observations of the interstellar magnetic field,” Mr. Zirnstein added.\n\n“But the new analysis provides a nice determination of its strength and direction farther out,” he noted. “The new findings can be used to better understand how our space environment interacts with the interstellar environment,” said Eric Christian, IBEX programme scientist. — IANS", 
    "section": "national", 
    "title": "Interstellar magnetic field decoded by NASA", 
    "subsection": "general", 
    "date": "2016-02-28"
}