{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "During Japanese PM Shinzo Abe’s visit to India, the countries had concluded agreements on transfer of technology for the US-2 amphibious aircraft. —Photo: Wiki Commons\n\nIndia’s plans to acquire amphibious aircraft from Japan, in the first big military deal between the two countries, is facing serious challenges, senior diplomatic sources told The Hindu on Saturday.\n\nIndicating at a longer waiting period for India’s plans to acquire the amphibious aircraft, US-2, in a deal involving 12-18 aircraft, senior diplomatic sources from Tokyo said on Saturday that Japan had no immediate plans for “selling or delivering” the capacity-multiplier aircraft to India.\n\n“There is no decision about its delivery nor did the Foreign Secretaries discuss the timing of the delivery”, Yasuhisa Kawamura, Director General of Press and Public Diplomacy of Japan told The Hindu after India and Japan held Foreign Secretary-level talks in Tokyo on Friday. Mr. Kawamura said that though Friday’s bilateral dialogue, which was held on the sidelines of a trilateral meeting of India, Japan and Australia, discussed a wide range of maritime security-related issues, the issue of supplying US-2 amphibious aircraft to India did not come up during the talks.\n\nThe absence of diplomatic progress on India acquiring the aircraft is significant in view of the fact that during Prime Minister Shinzo Abe’s visit to India in December 2015, the two countries had concluded agreements on Transfer of the Defence Equipment and Technology, and, Security Measures for the Protection of Classified Military Information, aimed at deals such as the one on the US-2.\n\nThe joint statement issued during Mr. Abe’s visit had also mentioned that both sides were to work on the US-2 deal. The US-2 aircraft has been part of a long-pending demand from India and was specifically mentioned by Prime Minister Narendra Modi during his 2014 Japan visit. During Friday’s dialogue, the two countries discussed enhanced maritime security and freedom of navigation-related issues in the East China Sea and South China Sea as well as security-related issues of the Indo-Pacific Ocean.\n\nThe Ministry of External Affairs, however, refused to respond to Mr. Kawamura’s comments on the aircraft deal. However, strategic affairs commentators sense a looming crisis regarding the deal.", 
    "section": "national", 
    "title": "Japan non-committal on supply of strategic amphibious aircraft to India", 
    "subsection": "general", 
    "date": "2016-02-28"
}