{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "The ongoing lectures on nationalism at the Jawaharlal Nehru University each evening — as it faces barbs on its commitment to nationalism — are not something new to the prestigious institution.\n\nGenerations of schoolchildren have learnt their lessons in Indian nationalism and on the struggle for freedom from the British rule from NCERT textbooks, penned by historians from the Centre for Historical Studies at the JNU.\n\nFrom the 1970s, it was the late professor Bipan Chandra’s Modern India , an NCERT text for Class 12, that disseminated the history and values of Indian nationalism among schoolchildren in India. It was often read even by those seeking admission to history departments in postgraduate courses. It was briefly replaced midway by the Vajpayee government, when the then Human Resource Development Minister, Murli Manohar Joshi, set out to get textbooks rewritten.\n\nBut the UPA government again replaced the NDA textbook, with Professor of Modern History at the JNU Neeladri Bhattacharya being made the chief adviser to a new set of the NCERT history textbooks that are still current but already under a potential “review”.\n\nJNU Professor Aditya Mukherjee told The Hindu : “The modern historian by bringing out the values of nationalism can contribute to Indian nationalism, something that is very relevant today.\n\nCelebrating civil liberties and supporting one another amid differences were central values of the freedom struggle.”\n\nThis isn’t all, so far as Indian nationalism is concerned.\n\nA quick Internet check on arguably the most popular academic take on Indian nationalism — late professor Bipan Chandra’s India’s Struggle for Independence — shows that it has sold well over 1,00,000 copies since it was published in 1989.\n\nAll the five authors — Professors Bipan Chandra, Mridula Mukherjee, K.N. Panikkar, Aditya Mukherjee and Sucheta Mahajan — have taught at the JNU.\n\nThe book is referred to not just by modern history students but also civil services and UGC-NET applicants.", 
    "section": "national", 
    "title": "JNU and the school lessons in Indian nationalism", 
    "subsection": "general", 
    "date": "2016-02-28"
}