{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "Union Human Resource Development Minister Smriti Irani may have strongly objected in Parliament to a purported pamphlet by a group of students in JNU criticising Goddess Durga and celebrating Mahishasura, but icons like B.R. Ambedkar and Jyotirao Phule, who the BJP is seeking to appropriate, were also critical of Hinduism.\n\nThe Narendra Modi government is celebrating with great aplomb the 125th birth anniversary of Dr. Ambedkar, with the Prime Minister making announcements for setting up a memorial and pledging to stay committed to the ideals of the man described as the architect of the Indian Constitution.\n\nBJP’s Maharashtra Chief Minister Devendra Fadnavis has also called for a Bharat Ratna for Mahatma Phule.\n\nHowever, in Riddles in Hinduism , Dr. Ambedkar, quoting from classical and religious texts, critiqued Hindu gods like Ram and Krishna, who were both described in terms far removed from the dominant narrative. “Ms. Irani’s comments on the observance of Mahishasura anniversary has exposed the fault lines once again between a dominant religion and several other traditions and revived the debate that occurs when they come in conflict,” said Dr. Ambedkar’s grandson, Prakash Ambedkar. “I doubt whether the RSS has the capacity to understand this,” he said.\n\nIn Annihilation of Caste , Dr. Ambedkar wrote: “If you wish to bring about a breach in the system, you have got to apply the dynamite to the Vedas and the Shastras which deny any part to reason, to Vedas and Shastras, which deny any part to morality. You must destroy the Religion of the Shrutis and the Smritis. Nothing else will avail. This is my considered view of the matter.”\n\nPhule was no less critical. In Ghulamgiri, he said the Buddha made “beef-eating” Brahmins also his disciples, adding: “He brought back to their senses those Brahmins who followed texts that had nothing but claims to magic in them.” He went on to criticise Shankaracharya for having woven a new web to ensure Pandits were not deprived of their livelihood by the surge of Buddhism.\n\nHaving re-opened the clash of the Great Tradition with the Little Tradition, Ms. Irani has reopened an old debate that many had tried to put a lid on.\n\nEven icons like\n\nB.R. Ambedkar and Jyotirao Phule were critical of Hinduism and its texts", 
    "section": "national", 
    "title": "Mahishasura debate reveals alternative traditions", 
    "subsection": "general", 
    "date": "2016-02-28"
}