{
    "author": [
        "Mohammed Iqbal"
    ], 
    "text": "Anurag Thakur (centre), MP and Bharatiya Yuva Morcha president, leading a protest at the Congress headquarters in New Delhi on Saturday, demanding that the party clarify its stand on Parliament attack convict Afzal Guru; and National Students’ Union of India activists protesting against Union Human Resource Development Minister Smriti Irani near her residence in the national capital.— Photos: PTI & Sushil Kumar Verma\n\nPolice provide seven specific reasons to support plea for extension of their confinement in the lock-up for interrogation\n\nThe police custody of the JNU students — Umar Khalid and Anirban Bhattacharya— facing sedition charges in connection with a controversial event organised on the university campus, was extended by two more days on Saturday after the police contended that they were required for further probe in the case.\n\nThe remand proceedings were conducted at a makeshift court at R.K. Puram police station in South Delhi, where the two students were produced before a Metropolitan Magistrate on the expiry of their three-day police remand. The prosecution reportedly sought five days’ police custody of the accused students, while providing as many as seven specific reasons to support its plea for extension of their confinement in the police lock-up for further custodial interrogation.\n\nMr. Umar and Mr. Anirban were interrogated in the presence of JNU Students’ Union president Kanhaiya Kumar, who was arrested earlier, to get the details of the February 9 event organised against the hanging of Parliament attack convict Afzal Guru, in which some anti-India slogans were said to have been raised.\n\nMr. Umar and Mr. Anirban had surrendered before the police on February 24 midnight after going missing for 10 days.", 
    "section": "national", 
    "title": "One more student joins probe, custody of two extended", 
    "subsection": "general", 
    "date": "2016-02-28"
}