{
    "author": [
        "Staff Reporter"
    ], 
    "text": ": In a video made by a committee of six lawyers appointed by the Supreme Court to visit the Patiala House Courts on February 17, JNU Students’ Union president Kanhaiya Kumar can be seen recounting details of the physical assault meted out to him in the court premises. Nailing police inaction, Mr Kumar says they didn't nab his attacker even after he identified him.\n\nHowever, a Delhi Police report submitted to the Supreme Court had given a different version.\n\nMr Kumar recounts how the police stood by as he was attacked by separate mobs on several occasions on February 17. The panel comprised senior advocates Kapil Sibal, Rajeev Dhavan, Ajit Kumar Sinha, Dushyant Davej, Harin P. Raval and advocate A.D.N. Rao. It was Mr. Raval who recorded the entire fact-finding enquiry on his personal cellphone.\n\nMr Kumar says it seemed as if the mob was waiting for him, fully prepared, to attack. He says his trousers slipped down, shirt got unbuttoned and lost slippers while he was being kicked and punched by the mob. “I told the police he was hitting me, they didn't do anything. I told the judge I have full faith in the Constitution. These are highly politically motivated persons.”\n\n\" Main is desh ka naujawan hoon, main JNU mein Ph. D kar raha hoon, log keh rahe hain ki main desh drohi hoon, kuch media mera trial kar rahi hai (I am a youth of this country, I am doing Ph. D in JNU and people are calling me ‘anti-national’, a section of the media has put me on trial),\" an emotional Mr Kumar recounts. \"How did you allow the attack to take place inside court premises? Your men were there. What were they doing? How he (the man who attacked Mr Kumar outside the gate of the courtroom) was allowed to come inside,\" the panel members are seen asking DCP Jatin Narwal.", 
    "section": "national", 
    "title": "Police did not nab my attacker: Kanhaiya", 
    "subsection": "general", 
    "date": "2016-02-28"
}