{
    "author": [], 
    "text": "Fresco fragments from what is believed to be a 14th-century copy of Giotto’s Navicella mosaic inside a church ruin in Romania.— Photo: AFP/Moller Istvan Foundation\n\nA jewel among the wild grass? A Hungarian historian is convinced that patches of fresco in a Transylvanian church ruin are a rare medieval copy of a legendary masterpiece by Italian maestro Giotto.\n\nThe fragments found deep in the Romanian region are part of a 14th century fresco reproduction of Giotto’s Navicella mosaic that used to adorn St. Peter’s Basilica in Rome, Szilard Papp said in Budapest last week.\n\nOnly three other 14th Century copies of the work, depicting Christ walking on water before apostles in a boat, are known to exist, in Strasbourg in France and in Florence and Pistoia in Italy.\n\n“This is definitely the fourth,” said Mr. Papp of the Transylvanian fresco, in the village of Jelna, 430 kilometres northwest of the Romanian capital Bucharest.\n\nGiotto made the vast mosaic — measuring roughly 10 by 14 metres and considered a marvel of medieval art — for the basilica’s atrium around 1300. It was later destroyed during the 17th century reconstruction of the basilica.\n\n“It is astonishing that such a major work was reproduced in a small village church on the periphery of western Christianity at that time, so far from Rome,” said Mr. Papp, who works for the Budapest-based Istvan Moller Foundation, a heritage protection body.\n\nMystery painter\n\n“Who painted the fresco and how will likely forever remain a mystery,” he added.\n\nMr. Papp’s theory is that probably a sketch of the mosaic somehow made its way from Rome through painters workshops to Transylvania where a local artist painted the copy in the church.\n\nDuring a trip to Jelna in 2014, he first saw the fragments of colour on the wall in the mostly roofless church, abandoned since its congregation of ethnic-German Lutheran Protestants died out in 1976.\n\nLast year, he examined photographs from 2003 of the fresco in a less degraded state, but it was not until he later came across fragments on bits of plaster stored in a museum warehouse in nearby Bistrita that his pulse quickened. Poring over academic literature on Giotto’s mosaic, Mr. Papp finally arranged the pieces of the puzzle in January.\n\n“When I put together all the elements — the sail, mast, apostles, the Christ figure, the heads with their particular gestures — visible separately on the wall, in the photos, and on the museum fragments, I realised it must be the Navicella ,” he said.\n\n“There is a lot (in the findings) that makes sense”, Ciprian Firea, a historian in the Transylvanian city of Cluj-Napoca’s Institute of Archaeology and Art History, said.\n\nThe church was built in the second half of the 14th century by ethnic Germans, thousands of whom settled in Transylvania, then part of Hungary, after an invitation by a 12th century Hungarian king.\n\nAfter the 16th century Reformation, frescoes were whitewashed or plastered over by Protestant converts from Catholicism who frowned upon imagery inside churches. — AFP\n\nItalian painter Giotto is among the great artists who contributed to the Renaissance", 
    "section": "national", 
    "title": "Rare Giotto copy emerges from Transylvanian church ruins", 
    "subsection": "general", 
    "date": "2016-02-28"
}