{
    "author": [], 
    "text": "Aam Aadmi Party convener Arvind Kejriwal on Saturday accused Punjab Deputy Chief Minister Sukhbir Singh Badal of trying to mislead people by quoting ‘fabricated statistics’ on drug menace.\n\n“Instead of taking deterrent steps to control drug abuse, Sukhbir Badal is presenting fabricated data by claiming the state only has 0.6 per cent drug addicts. He knows everything, if he doesn’t, he has no right to continue as Deputy CM,” he said here.\n\nOn the third-day of his Punjab tour on Saturday, the Delhi Chief Minister was addressing a gathering of the families of youth, who had fallen prey to drug abuse.\n\nSukhbir Badal had recently said only 0.06 per cent youths in the State are prey to drug abuse.\n\nAttacking the SAD-BJP government on drug issue, the AAP leader said, “It is a shame for the government that the State which was once known for its sheer beauty, lush green farms, gleaming water streams and stunning backdrops, is now popular for drug abuse as well.”\n\nEarlier, families of youths, who had fallen prey to drug-abuse arranged a gathering and narrated tales how their wards got trapped in the drug net, the AAP release said.\n\nIt also claimed that the villagers revealed how the police tried to sabotage the arrangement of the gathering, by forcibly ‘picking up’ the owner of land, where Mr. Kejriwal’s meeting was arranged.\n\nAddressing the gathering, Mr. Kejriwal said: “ Goondagardi (hooliganism) of Akalis will no more be tolerated in Punjab.We will not bow before under any pressure and Akalis must understand that AAP is not only a wave but a storm to finish them.”\n\n“Once voted to power (in Punjab), AAP will not spare any drug lord and will not only rehabilitate the drug-addicts, but curb the supply chain, which is currently being patronised by politicians,” Mr. Kejriwal claimed.\n\n- PTI", 
    "section": "national", 
    "title": "Sukhbir misleading people on drug menace: Kejriwal", 
    "subsection": "general", 
    "date": "2016-02-28"
}