{
    "author": [], 
    "text": "Umar Draz of Okara district in Pakistani Punjab spent more than a month behind bars on treason charges for hoisting the Indian flag atop his home.\n\nA Pakistani court has granted bail to Umar Daraz, a fan of Indian batsman Virat Kohli, after he spent more than a month behind bars on treason charges for hoisting the Indian tricolour atop his home.\n\nThe Additional District and Sessions Court in Okara admitted the bail plea of 22-year-old Umar Daraz, a tailor by profession, who was arrested on January 25 from his home in Okara district, 200 km from here, in Punjab province.\n\nMr. Daraz, who had said he hoisted the tricolour to show his love for the batsman, was accused of acting against Pakistan’s sovereignty and could face up to 10 years in prison or fine or both.\n\nAdvocates Rizwan and Muhammad Yousaf applied for his bail at the court of judge Asadullah Siraj after the District Court judge Anique Anwar rejected Mr. Daraz’s bail plea on February 18, notwithstanding a police clean chit.\n\nOn Friday, after examining the police and judicial case files and hearing the arguments of both sides, the court admitted the plea and ordered him to furnish a surety bond of Rs. 50,000, the Dawn reported.\n\nMr. Daraz was arrested on a day when India beat Australia in a T20 match in which Kohli scored 90 runs and was adjudged “man of the match”.\n\nThe police raided his home on a complaint that he had hoisted the Indian flag on the rooftop of his house and seized the flag along with Kohli’s posters and pictures.\n\nA case under Section 123-A of the Pakistan Penal Code and Section 16 of the Maintenance of Public Order law was registered against him. Section 123-A (acts damaging the sovereignty of the country) carries the maximum punishment of 10 years in jail or fine or both.\n\nMr. Daraz said he had no idea that he had committed a crime, urging the authorities concerned to pardon him as he should be seen as “an Indian cricketer’s fan and not a spy”. — PTI", 
    "section": "national", 
    "title": "Virat Kohli’s Pakistani fan gets bail", 
    "subsection": "general", 
    "date": "2016-02-28"
}