{
    "author": [
        "Muralidhara Khajane"
    ], 
    "text": "The ongoing feud between Karnataka Chief Minister Siddaramaiah and the former Chief Minister H.D. Kumaraswamy over the luxury watch got a backward classes twist on Saturday.\n\nWhile Mr. Siddaramaiah accused Mr. Kumaraswamy of gunning for him because he was “jealous” of a backward classes’ leader becoming Chief Minister, the latter attacked the former for “using the backward classes tag” to protect himself from the issue, which has reached the party high command.\n\n‘Wild allegations’\n\nA day after Mr. Kumaraswamy accused the Chief Minister of wearing a “stolen” watch, an enraged Mr. Siddaramaiah retaliated on Saturday by stating that Mr. Kumaraswamy was making wild allegations out of frustration as “he could not digest a backward classes’ leader occupying the top post.”\n\nCiting instances from the political history of Karnataka on how backward classes’ leaders were hounded out of power, Mr. Siddaramaiah said S. Bangarappa, senior Congress leader, who was a backward classes’ leader, was removed from the post of Chief Minister in 1992. Similar was the fate of M. Veerappa Moily, another OBC leader.\n\n“Now, a similar attempt is being made, as Mr. Kumaraswamy and others could not tolerate a leader from the backward classes leading the State,” Mr. Siddaramaiah alleged.\n\nResponding to this, Mr. Kumaraswamy said that the Janata Dal (Secular) had no hand in either unseating Mr. Bangarappa or Mr. Moily. It was the Congress, which was instrumental in removing both, he said. “In fact, it was the JD(S) which promoted backward classes’ leaders and Mr. Siddaramaiah could become the Chief Minister because he was groomed by the Janata Dal,” he said. “Mr. Siddaramaiah, who has forgotten his socialist roots after joining the Congress, is now using the backward classes tag to protect himself,” he said.", 
    "section": "national", 
    "title": "Watch issue raked up as I am from BC community, says Siddaramaiah", 
    "subsection": "general", 
    "date": "2016-02-28"
}