{
    "author": [
        "Shiv Sunny"
    ], 
    "text": "Police say they are in the process of contacting these ‘eyewitnesses’\n\nA woman seeking help from a policeman during the violent agitation by Jat protesters in Rohtak last Monday. Several women are suspected to have been raped at Murthal in Haryana during the agitation.— File Photo: PTI\n\nThree days after a news report said that at least 10 women were gang-raped by a mob in Murthal in Haryana during last week’s agitation by Jats seeking reservation, at least two men, claiming to be eyewitnesses, have come forward with accounts of the alleged sexual assault.\n\nThe two truck drivers said they witnessed dozens of men drag or divert women towards the nearby fields, where they allegedly ripped off the women’s clothes.\n\nThey, however, said they did not see what took place in the fields thereafter. One of the men said he was willing to tell the police whatever he saw.\n\nThe two drivers’ description of the incident was limited to what they saw in broad daylight on two separate days. Certain media reports had said incident took place after midnight last Monday.\n\nCM’s directive\n\nSenior police officers said they were in the process of contacting these “eyewitnesses”. Terming it their “duty”, Haryana Chief Minister M.L. Khattar on Saturday had urged these eyewitnesses to share their inputs with the police.\n\nThe Haryana police and government had said that it appeared to be rumours as they had not been contacted by any victim or eyewitness.\n\nIn the days after the crime came to light, women’s undergarments and other clothes were also found in the fields of Murthal, giving weight to the allegations that the rapes did take place. The police and some locals, though, had claimed that these clothes could have spilled out of luggage bags being robbed by the mobs.\n\nBut the emergence of these eyewitnesses could give police some direction into their probe.\n\nOne of these men is an elderly truck driver Niranjan. “I saw from a distance some men taking women to the fields and tearing their clothes,” he told a news channel. He said he was busy trying to save his life because of which he could not see what took place in the fields.He said the men had fooled the women into stepping into the fields along the highway by telling them that they would stay safe if they took to the nearby villages.\n\n“Men [women’s male family members] were also there along with the women, but they could not do anything as they were trying to save their lives,” he said.\n\nAnother truck driver Sukhvinder said he saw women being dragged into the fields last Saturday afternoon. “I saw many men run behind the women into the fields, but did not see what happened inside the fields,” he said, adding the mob was 100-150 strong.", 
    "section": "national", 
    "title": "We saw women being assaulted in Murthal, say lorry drivers", 
    "subsection": "general", 
    "date": "2016-02-28"
}