{
    "author": [
        "Neeti Sarkar"
    ], 
    "text": "Some women say the belief that they can propose only on a Leap Day is outdated\n\nLeap Day will soon be here, and jokes surrounding it have been doing the rounds on social media over the last week. There’s one that reads ‘Leap Year gives me extra time to reflect on how unproductive I am with extra time’. And then there’s this — ‘If Christmas was today, I would only have to see my family every four years!’\n\nJokes apart, February 29 has a definitive air about it. If you’re tired of waiting for him to get down on one knee to propose marriage with a rock bigger than your head, apparently today is that one day when you can pull off a Margaret Tate from The Proposal . And if you’re worried about him saying ‘no’, you must know that he cannot get away without paying a fine.\n\nThe tradition, which has its origins in Ireland, was also subscribed to by the Scots. Legend has it that in Denmark, if a man turns down a proposal today, he would have to give the woman 12 pairs of gloves (the gloves are meant to hide the woman’s embarrassment of not having an engagement ring), and in Finland, the penalty is fabric for a skirt!\n\n“I wouldn’t mind proposing to my boyfriend on Leap Day, but then again, I don’t want to celebrate my engagement anniversary only every four years. And perhaps for that very reason, if I proposed, my boyfriend would happily say ‘yes’,” quips Ariana Gonsalves, a lifestyle blogger.\n\nHowever, Shipra Rajeev-Kumar, a social activist, thinks: “This is easily the most anti-feminist practice. We live in a time and age where we are advocating gender parity, so a woman should be allowed to propose or do anything else she wants to (and that society perceives is only a man’s thing to do) whenever she wants to. We don’t need an extra day every four years to take a leap of any sort.”\n\nApart from bizarre customs such as this, does the leap year make much of a difference to anyone?\n\n“I think it’s just another day added to the year, and unfortunately this time, I will be getting my salary one day later than usual. So, that’s the only bummer,” laughs Nitish Desai, a copy editor. He adds: “But I have friends who wouldn’t start anything auspicious on February 29. Even in Greece, people don’t get married on Leap Day, as it’s considered unlucky!”\n\nFor leaplings (those who are born on February 29), celebrating an official birthday, there is some amount of excitement. “I’m turning five this year, and unlike other five-year-olds, no colouring books for me! My parents are gifting me my dream bike and my friends and I are going to party at a farmhouse. I love that I get to do something extra special every four years,” says Aymaan Khan, a college student.", 
    "section": "national", 
    "title": "Whimsical tradition or empowering moment?", 
    "subsection": "general", 
    "date": "2016-02-28"
}