{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Dr.M.Nalini copying one of the inscriptions found at theSri Saptarishiswarar Temple at Lalgudi.\n\nMore than 20 inscriptions of different periods, including three from the Chola period, have been discovered from Sri Saptarishiswarar Temple at Lalgudi by research scholars.\n\nThe inscriptions were discovered by R. Akila, Assistant Professor of History, Arignar Anna Government Arts College, Musiri, and M. Nalini, Head of the Department of History, Seethalakshmi Ramaswami College, while undertaking a study at the temple, according to R. Kalaikkovan, Director, Dr. M. Rajamanikkanar Centre for Historical Research, Tiruchi.\n\nThe temple enjoyed the patronage of almost all the major dynasties that ruled Tamil Nadu and has more than a hundred stone inscriptions and excellent sculptures providing useful information to reconstruct the history of Thiruttavatturai and its surrounding villages, Dr. Kalaikkovan said in a press release.\n\nReferring to the latest finds, Dr. Kalaikkovan said an inscription found on the north wall of the larger mandapam in front of the sanctum sanctorum of the temple throws light on the ancient merchant guild Manikramam that was conducting business from Parantakapuram, a village that had existed near Lalgudi.\n\nAran Kailayan alias Mananthachetti, a merchant had purchased a fallow land from the administration of Parantakapuram, to provide a grand meal to the presiding deity on the day of hunting festival conducted during Vaikasi Visakam.\n\nProvisions were made to provide garlands and 100 bananas.\n\nAn inscription belonging to the 28th regnal year of Rajadhiraja I brings to light that his daughter Cholakulasundari’s maid, Singan Kuppai, had gifted 11 kalanju of gold to the temple to light a perpetual lamp in front of the presiding deity.\n\nThe temple authorities purchased a piece of land with that gold from the Urar of Kavithikudi of Nerkuppai kandam as tax-free Devadana and utilised the proceeds to light the lamp for ever.\n\nThis record provides a list of taxes that were collected during that period.\n\nAn inscription of 12th century copied from the larger mandapa names the entrance as Alakiyaseman thiruvasal. Gangan Perumal alias Rajaraja Malanadalvan made this entrance and also a dance hall named as Alakiyaseman niruttha mandapa.\n\nA two piece record found at the eastern wall of the mandapa adjoining the temple tank named as Sivagangai theertha reveals that the tank was desilted and revived in C. E. 1548 by Maligaiudaiyan Nayakapillai, an oil merchant from Tiruchirappalli.\n\nA mutilated record of Virarajendrachola throws light on a gift of land made tax free by a royal order.\n\nSeveral short label inscriptions found spread on the front courtyard of the entrance to the inner ambulatory passage provide the names of more than 25 individuals who contributed towards the service of the temple.\n\nTwo interesting engravings found at the base of the inner compound wall on the north and the south name the sites as Somasthanam and Chandasthanam, Dr. Kalaikkovan said.", 
    "section": "national", 
    "title": "20 ancient inscriptions found at Lalgudi temple", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}