{
    "author": [
        "Deepa H"
    ], 
    "text": "Over 400-odd fuel outlets in Salem, Namakkal, Krishnagiri, Karur, Dharmapuri, Erode and Coimbatore districts run by members of the Tamil Nadu Petroleum Dealers Association (TNPDA) on Monday begun an indefinite stop-purchase protest demanding withdrawal of discounts offered by fuel outlets run by local lorry owners associations (LOA). As a result, these outlets could very well go dry by Tuesday evening, say dealers.\n\nOver 700 of TNPDA members sat on a protest in front of the Indian Oil Corporation Limited’s Sankari refinery in Salem district on Monday stressing their demand for a tri-party agreement between the LOA, TNPDA and oil industries agreeing to withdraw the discounts.\n\nTNPDA president K.P. Murali told The Hindu that around 30-plus outlets run by the LOA had been offering Re. 1 per litre for consumers buying diesel as discount for several years now.\n\n“That is affecting the business of TNPDA members very badly. So much so, people are selling very small quantities most times. We are demanding the oil marketing companies to withdraw the discount they are offering to the LOA-run bunks,” he said.\n\nMr. Murali said that from February 9 the oil companies had announced a discount of Rs. 2.11, which too the LOA were passing over to the consumers. This was s over and above the company-fixed dealer margin of Rs. 1.40 per litre. “If the companies do not step in quickly, the stop-purchase will spread to other parts of the State as well,” he said.\n\nHowever, oil industry sources said that the companies do not give any discount to the LOA.\n\n“They give the discount out of their own commission. Similarly, a section of TNPDA dealers extend credit to transporters. We have nothing to do with the discounts or credits. To beat competition, the LOA bunks give discounts,” sources said.", 
    "section": "national", 
    "title": "400 fuel outlets in western districts may go dry in a day or two", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}