{
    "author": [
        "M K"
    ], 
    "text": "Family of the six migrant workers, who were killed in a boiler explosion at the outskirts of the city last Thursday, arrived here on Monday morning and were shattered to see the bodies of their dear ones at Coimbatore Medical College Hospital (CMCH).\n\nOnly two weeks ago the families had sent four of the victims, including A. Gunal (19) and his cousin A. Dharun (19), to Coimbatore. They are all from a tribal hamlet in Alipurduar district in West Bengal.\n\nGunal, Dharun, S. Birjune (20), J. Saroj (20), D. Bicose (19) and S. Preetham (25), who were employed at Shree Nagalakshmi Pyrolysis Private Limited at Oratukuppai near Chettipalayam here, were killed when a boiler at the unit last week.\n\nWith burns all over their body they were admitted to the CMCH and gave the dying declaration to a magistrate the same day. They died one after the other on Friday and Saturday. Their relatives reached Chennai by air on Sunday night and Coimbatore on Monday.\n\nAfter post mortem the bodies were handed over to the relatives in the afternoon.\n\nFinal rites were performed for the victims at an electric crematorium on the Nanjundapuram Road.\n\nThe families were unable to take the bodies as the victims had suffered 100 per cent burns and the bodies were damaged. “Had we known they would suffer this fate we would not have sent them here,” said one of the relatives.\n\nMembers of CITU and some of the family members of the victims, who were present at the hospital, claimed that the company had said it would pay Rs. 5 lakh compensation to each victim.\n\nJabbir Hussain was the first from the village to come to Coimbatore to work about six years ago said, “In our village, we get about Rs. 1,200 a month working in the tea estate and did not have work through out the year.”\n\nThey came here because of job opportunities and higher wages.\n\nMembers of the Centre of Indian Trade Unions (CITU) staged a demonstration here on Monday asking the government to pay compensation of Rs. eight lakh for the families of each victims.\n\nThey also sought safety measures for the more than 60,000 migrant labourers at work in various industries in Coimbatore.\n\nThey are all from a tribal hamlet in Alipurduar district in West Bengal", 
    "section": "national", 
    "title": "Bodies of migrant workers cremated", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}