{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "The high-level bridge across 16 Gate Ellis Surplus sluices in Mettur constructed at an outlay of Rs. 23.21 crore was declared open by Chief Minister Jayalalithaa through video conferencing on Sunday.\n\nThe bridge has come on Thoppur – Mettur – Bhavani – Erode road and the project was executed with financial assistance from the National Bank for Agriculture and Rural Development (NABARD). The project was sanctioned in 2012-13.\n\nThe existing bridge near the sluices was constructed in 1934 and residents of Thangamapuri Pattanam used the bridge to proceed to Salem Camp area. Since the bridge was more than 80 years old, only school vans and two-wheelers were allowed during the morning and evening hours.\n\nTraffic on this bridge was completely closed whenever the water level in the 120-feet Mettur Dam surplussed. On such occasions, the road users have to use the circuitous route of a passing through Thermal Bridge.\n\nThe AIADMK cadre distributed sweets to the passersby as soon as the Chief Minister opened the bridge.\n\nAnother major high-level bridge declared open was the one across River Cauvery connecting the villages of Mohanur (Namakkal district) and Vangal (Karur district) at an outlay of Rs. 43.5 crore.\n\nThe State Government accorded sanction for this project in 2008 and the construction work commenced in 2009. The bridge is to a length of 1.5 km and has 56 decks. The project was executed by the Projects Wing of the State Highways Department.\n\nPeople of these two villages were till now taking the circuitous route covering a distance of 36 km to reach one village from another, which is separated by the River Cauvery.\n\nThe Chief Minister also opened the new bridges at Edapadi (project cost Rs. 1.98 crore); bridge across River Sarabanga at Pappampadi (Rs. 1.87 crore); bridge across River Swethanadhi at Kavarpanai (Rs. 3.30 crore); at Omalur (Rs. 2 crore); at Karungalur (Rs. 1.80 crore) all in Salem district and at Erumapatti in Namakkal district (Rs. 1.35 crore).", 
    "section": "national", 
    "title": "CM declares open bridges in Salem, Namakkal", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}