{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "(Top) Members of TACBEA staging a demonstration in Ramanathapuram; Co-operative Bank Employees’ Association members staging a demonstration in Dindigul on Monday.— Photos: L. Balachandar and G. Karthikeyan\n\nDistribution of essential items in fair price shops run by Cooperative department employees would be affected as members of the Tamil Nadu State Primary Cooperative Bank All Employees’ Union announced an indefinite strike, pressing a charter of demands.\n\nAfter leading a demonstration here on Monday, pressing the demands including pay parity, introduction of pension scheme and grant of grace pension to retired employees, G. Muthuramalingam, district secretary of the association said as the government had not responded to their long pending demands, they have decided to launch an indefinite strike.\n\nAs all those employed in 131 fair price shops run by the Primary Agriculture Cooperative Credit Societies (PACCS) would join the strike, distribution of essential commodities, including 20 kg free rice to poor family card holders would be totally hit, he said. Work related to distribution of revenue, income and other certificates at the e-service centres would also be hit, he said.\n\nExplaining the demands, he said though the nature of work and timings were same for both the employees of Cooperative department and Tamil Nadu Civil Supplies Corporation (TNCSC) working in fair price shops, the TNCSC employees drew more pay.\n\n“We have been demanding pay parity between the two but the government remained silent,” he said.\n\nThey have also been demanding pension for all cooperative employees, including fair price shop employees on the lines of pension paid to cooperative employees in Kerala and Karnataka, he said.\n\nDindigul\n\nHundreds of employees in the Department of Cooperation and Primary Agricultural Cooperative Societies staged a demonstration near Dindigul Corporation office here on Monday demanding pension and other benefits. Ration shops in the district were functioning with skeleton staff.\n\nEmployees in 4,534 PACSs and 45,000 workers in 23,000 ration and fair price shops in the State would take part in the strike, said district president K. Anbarasu.\n\nIn Dindigul, 1,135 employees would boycott work, he added.\n\nSimilar demonstration was staged in Theni also.\n\nDemand for pension for cooperative employees on the lines of pension paid to those in Kerala, Karnataka", 
    "section": "national", 
    "title": "Cooperative employees stage protest", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}