{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The district police on Monday arrested a couple in connection with the murder of history-sheeter G. Rengasamy (55) of Muniyandipuram under Villur police station limits.\n\nThe police identified the accused as S. Murugesan and his wife Mariammal, of the same locality. They were arrested and sent for remand, the Deputy Superintendent of Police (Peraiyur), V. Gomathi, said.\n\nA simmering anger over Rengasamy after he cheated Murugesan’s relative of huge tract of land, assaulted him and tried to encroach upon Murugesan’s land, led to the accused killing him after extending an invite for consuming liquor at his home, she said.\n\n“Rengasamy had cheated Murugesan’s relative, a person with not-so-sound mind, of his land and did not compensate him properly. When the man questioned him, he was beaten with footwear,” the DSP said.\n\nMurugesan, who was waiting for an opportunity to finish off Rengasamy, on Saturday found him alone in the village.\n\n“He invited Rengasamy for a drink and paid him Rs. 150 for buying liquor in the evening. After drinking at Murugesan’s house, Rengasamy had dozed off. Murugesan hit his head with a boulder twice. After confirming his death, he covered the head of the body with a plastic cover to prevent blood from spilling on the floor,” Ms. Gomathi said.\n\nSwitched off street lights\n\nLater after midnight, Murugesan had pulled out the fuse carrier meant for the streetlights around 1 a.m.\n\nHe dragged the body out of his house under the cover of darkness and dumped it on the street near the house of Rengasamy’s wife, Pappathi, who is the vice-president of Thennamanallur panchayat.\n\nThe police said that the accused had sprinkled chilli powder on the body to prevent the sniffer dog from tracing him.\n\n“We interrogated some 15 suspects and zeroed in on Murugesan with specific input. Only Murugesan was involved in the murder, while his wife is booked only for washing the blood-stained floor (for screening of evidence),” the DSP added.\n\nThe deceased had a history-sheet with the Villur police since 2008.\n\nSimmering anger over Rengasamy after he cheated Murugesan’s relative of huge tract of land", 
    "section": "national", 
    "title": "Couple arrested for murder of history-sheeter", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}