{
    "author": [], 
    "text": "In Srirangam, construction debris is dumped indiscriminately in public spaces exposing residents to grave hazards. As per rules, the debris should be disposed of safely from the construction site without affecting people. But this rule is violated with impunity. The debris is dumped on the roadside and in drains. The civic authorities have turned a blind eye to this serious problem. As construction activity is going on at a frenetic pace in many areas of Srirangam, people expect strong and deterrent action against the polluters.\n\nJ. Anantha Padmanabhan,\n\nSrirangam\n\nPuthanampatti\n\nmissing in the boards\n\nPuthanampatti is 30 km away from Tiruchi. Recently, signboards were put up from Mannachanallur to Edumalai Road. But Puthanampatti is not mentioned in them. I request the authorities to add Puthanampatti in the signboards.\n\nSaravanan Natesan,\n\nPuthanampatti\n\nComplete bypass\n\nwork quickly\n\nThe bypass under construction by NHAI (National Highways Authority of India) to link Tiruchi-Thanjavur road with Tiruchi-Pudukottai and Madurai Highway from Asoor near Thuvakudi is yet to be completed though it was supposed to be completed by May 2013. Being laid as part of the 108-km Tiruchi-Karaikudi two-lane project, the bypass would serve as a semi-ring road, easing congestion in the city enabling faster movement of material between BHEL and ancillary industries at Mathur. Will the NHAI expedite the work?\n\nH. Ghouse Baig,\n\nEdamalaipatti Pudur\n\nInstall more\n\nescalators\n\nThe new escalator installed on platform number two at Tiruchi Junction will provide great relief to passengers, especially senior citizens. This has been funded under the Member of Parliament Local Area Development Scheme (MPLADS) by N. Siva. The Railways should come forward to install similar escalators in all other platforms as well.\n\nK. Muthuswamy,\n\nTiruchi\n\nTickets for\n\nJan Shatabdi\n\nIssuing of tickets for the Jan Shatabdi Express operated between Coimbatore and Mayiladuthurai at Tiruchi Junction is delayed till the arrival of train causing hardship to passengers as they have to dash to board the train at the last minute. I request Railway authorities to start issuing tickets at least an hour before the arrival of the train to avoid this.\n\nRavi Ramanujam,\n\nTiruchi\n\nMosquito\n\nmenace\n\nMosquito menace has become rampant Thangaiyan Street and Railway Station Road in Srirangam. The threat of an outbreak of vector-borne diseases looms large. I request the corporation to take steps to curtail the problem.\n\nAravind K. Rao,\n\nSrirangam\n\nClear the mess at\n\nMGR statue junction\n\nThe MGR statue at Lawsons Road end near Ayyappan Temple can be shifted to a suitable place and the new traffic island reoriented with a signal system to avoid traffic congestion. In the absence of a signal system, motorists find it difficult to turn to the Lawsons Road from Bharatidasan Salai. Buses simply pass through the traffic island, causing congestion. The authorities should take steps to set right the problem before any major accident at this place.\n\nS.R. Dasarathan,\n\nKarumandapam\n\nStop insisting on\n\nration card as ID\n\nRation card is an important identity document. are still regarded as the most important identity document. Many people would like to stop using ration card with the intention of benefitting poor people. Officially, ration card is the first valid identification card. Government must allow genuine citizens to surrender their ration cards and use Aadhaar cards, PAN cards, Electors Photo Identity Cards as valid identification documents. This method can help poor people benefit from the Public Distribution System (PDS) and stop leak of grain from this system. In a country where 25 per cent of the people live below poverty line (BPL) and billionaires club is growing, it is criminal to insist on the ration card for everyone.\n\nA. Prabaharan,\n\nPuthanampatti\n\nRoad neglected\n\nfor 10 years\n\nThillai Nagar 10th Cross West Extension 80 feet road has been neglected for 10 years and is in bad condition. It was last re-laid in 2007. Representations to the officials have gone in vain.\n\nN. Vasudevan,\n\nThillainagar\n\nLook at options\n\nfor Gandhi Market\n\nGandhi Market traders shut their shops recently to protest against shifting of the market to Kallikudi. It is not safe for businessmen to travel to Kallikudi daily carrying cash. Public, especially won’t turn up to buy vegetables, which in turn would lead to rise in the price of vegetables. Ariyamangalam residents have already demanded that the garbage dump should be shifted to another place. Perhaps, Gandhi Market can be shifted to Ariyamangalam after clearing the garbage dump. Alternatively, women’s prison at the heart of the city could be shifted and Gandhi Market can be expanded.\n\nDimple R. Mohan,\n\nMahalakshimi Nagar East Extension\n\nTipsy railway staff\n\non Rockfort Exp\n\nMany railway employees travel from Chennai Egmore to Tiruchi in Rockfort Express inebriated. They speak loudly disturbing other passengers. Although this is a regular feature, the RPF and TTEs are not taking any action. Railway higher officials must take stringent action in this matter.\n\nS. Prakash,\n\nTiruchi\n\nSuper fast train\n\nneeded\n\nIntroduction of a super fast day train from Thanjavur to Chennai Egmore via Kumbakonam has been a long-pending demand. The issue has been taken up by several service and welfare organisations and many agitations have been organised. The train could be named Brihadeeswarar Day Express. We hope that the Railway Minister would fulfil the expectation in the Railway Budget.\n\nU. Joseph,\n\nState Vice-President\n\nTamil Nadu State Federation of\n\nSenior Citizens’ Council, Thanjavur", 
    "section": "national", 
    "title": "Crack down on dumping of debris", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}