{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Gandhigram Trust plans to start a cotton procurement and sales centre, a first for the State. Among other efforts, it plans to revive ‘karunkanni,’ a cotton variety getting extinct. It will convert cotton into value-added products, including naturally-dyed yarn, and sell it to other khadi units for cloth production. It has roped in traditional farmers in Athoor and Reddiyarchathiram blocks in Dindigul district to raise this variety. Similar efforts are on to revive 23 traditional cotton varieties throughout the country.\n\nThese points were highlighted at a workshop on ‘Revival of desi cotton and contemporary khadi’ held at Gandhigram near here on Monday. Trust secretary K. Siva Kumar said that the proposed facility would procure the entire produce from farmers and add value to it. The main aim was to end farmers’ marketing problem. This short staple yarn was best suited for producing bandage cloth and bed sheets.\n\nThe natural dying unit would use cotton to make naturally-dyed yarn to tap emerging markets. Seeds would be supplied to farmers and the unit would act as a full-fledged model centre for organic cotton and value addition. It would also facilitate formation of a federation of desi cotton producers in the State, he added.\n\nAnanthoo of TULA Organic Clothing said that 97 per cent of cotton produced in the country before Independence was of traditional variety. The British, who tried to kill native varieties, and introduce foreign varieties could convert just three per cent of farmers. But, after Independence, Indian scientists had successfully killed traditional varieties and converted 97 per cent per cent of farmers into ‘hybrid cultivation.’ Now, khadi units were using foreign cotton. Production and input costs for traditional varieties were very less when compared to those from Egypt and the US, he added.\n\nOther varieties\n\nKrishna Prasad of Sahaja Samrudha, a people’s movement in Karnataka, said that 23 traditional varieties, especially Bengal Desi, Pundur, Kaala cotton, Wagadh, Karunganni, Jayadhar and Pandrapura, were being raised in the country for the past 1,000 years. Efforts were under way to revive these varieties. All Indian varieties had been grown as inter-crop to channa, coriander, chillies, pulses, tomato and onion, he said.\n\nTraditional cotton grower Visvasam of Vellode said that 500 acres of karunkanni variety had been raised in Reddiyarchatram and Athoor blocks. Owing to lack of marketing facilities, many farmers had shifted to other crops. These farmers would be encouraged to grow this variety. Besides Dindigul, Karunkanni was grown in Kovilpatti and Vilathikulam only, he added.", 
    "section": "national", 
    "title": "Desi cotton procurement centre planned", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}