{
    "author": [
        "B Kolappan"
    ], 
    "text": "‘Anbumani as CM candidate has captured the imagination of voters’\n\nDespite the DMK forging an alliance with the Congress and the People’s Welfare Front (PWF) seemingly marching ahead, the PMK chief ministerial candidate Anbumani Ramadoss remains undaunted. In an interview to The Hindu on Monday, he insists that the DMK-Congress is not strong enough to dislodge the AIADMK and the PWF’s electoral strength is only an illusion.\n\nThe DMK and Congress have come together again. How do you view this development when the PMK is yet to find an ally?\n\nIf you consider the three decades of Tamil Nadu politics, the incumbent AIADMK government is the most corrupt regime. The DMK, however, cannot seek to replace it, because even in 2006 Assembly polls it could not gain majority despite forming a mega alliance. It was pushed to a third position in the 2011 Assembly polls and again could not win a single seat in the 2014 parliamentary polls. Its base is eroding and it is a sinking ship. Now, the DMK and the Congress have come together after pointing an accusing finger at each other over their involvement in 2G spectrum scam. The DMK held the Congress responsible for the plight of the Sri Lankan Tamils before quitting the UPA government. They are now pretending as if nothing happened in the past. The vote base of the Congress is negligible to make the difference for the DMK after G.K. Vasan left the party. How do you expect the DMK to win when the party leader’s son M.K. Alagiri has predicted a victory for the ruling AIADMK?\n\nNo political party has evinced interest in an electoral pact with the PMK…\n\nWe are open for an alliance. But we will lead the front in Tamil Nadu. The BJP allowed the Shiv Sena to lead the alliance in Maharashtra in the past, Akali Dal in Haryana, Telugu Desam Party in Andhra Pradesh and Biju Janata Dal in Odisha. It can join us here. If it is not ready, we are not bothered. We have the goodwill of the people.\n\nThe PWF seems to be gaining ground with support from various sections. It is also believed that it is elbowing out the PMK. Your comments.\n\nThis is an illusion. Those who cannot digest the growth of the PMK as an alternative to the Dravidian parties are indulging in this campaign, while the reality at the ground level offers a different picture. In the 2014 Lok Sabha polls, the Left parties together polled a total of 4,30,000 votes in Tamil Nadu, whereas in the Dharmapuri constituency alone I polled 50,000 more votes than this. The MDMK has become weak after the exit of almost all senior leaders. The educated people, even from the Dalit community, are disenchanted with the VCK for its politics of violence and antagonism.\n\nBut the PWF has a presence across the State, while the PMK’s support base is confined to northern districts...\n\nThis is again a motivated campaign. Our regional conferences and public meetings in southern districts attracted very huge crowds. In Dindigul, Thoothukudi and Pudukottai we witnessed unprecedented response from the people. Even 20 years ago, we were able to win in four Assembly constituencies. We have the self-confidence and repose faith in the people who are desperate for a change. Anbumani as chief ministerial candidate has captured the imagination of voters, particularly neutral and young voters.", 
    "section": "national", 
    "title": "‘DMK-Congress no match for AIADMK; PWF an illusion’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}