{
    "author": [
        "S Senthalir"
    ], 
    "text": "Team members of Mission Smile preparing a child for cleft lip defect surgery at New Medical Centre in Puducherry on Monday.— Photo: S.S. Kumar\n\nLavanya and her husband had come all the way from Nellore to the New Medical Centre (NMC) in Puducherry with their six months old daughter Nanditha, with the hope of bringing a smile to their child who was born with a cleft lip.\n\nOne in 700 children in India suffers from such birth defects. Among them, one in 10 does not live to see their first birthday. Cleft lip and cleft palate are the most common birth defects affecting children.\n\nMany misconceptions and superstitious beliefs surrounding these birth defects have affected children from getting the right treatment.\n\nMission Smile, a non-profit organisation, in association with Muthoot Pappachan Foundation has taken the task of spreading awareness and identifying the patients from impoverished background for the reconstructive surgery. Taking help from the New Medical Centre, free surgeries are being conducted at the hospital to children and adults with cleft lip and cleft palate.\n\nPatients from Puducherry and districts like Villupuram, Cuddalore, Nagapattinam, Vellore and even Nellore in Andhra Pradesh have registered for the surgery. “The team of doctors, medical and non-medical staff from New Medical Centre and Mission Smile will conduct the surgeries on 54 children over a period of five days,” said Dalip Pande, director-partnerships, Mission Smile.\n\nPrasanthkumar Nellickal, senior manager, Corporate Social Responsibility, Muthoot Pappachan Foundation, said: “The surgeries are conducted free of cost. The travel and accommodation expenses of patients and their families are also taken care,” he said.\n\nThe team of volunteers working in this mission includes four surgeons, three anaesthetics, a dentist, a speech therapist, paediatrician, a child psychologist and six nurses. “Over 575 children have already undergone this free surgery programme in Kerala, Tamil Nadu and Andhra Pradesh. This will be the 1{+s}{+t}attempt taken to help the Children of Puducherry through this initiative. Twelve surgeries would be conducted per day,” he said.\n\nPatients can register for the reconstructive surgery by Wednesday. “If there is more number of patients registered, we would schedule the surgery after three months. It is a continuing process so people are welcome to register till Wednesday,” Mr.Pande added.\n\nOne in 700\n\nchildren in the country suffers from such birth defects", 
    "section": "national", 
    "title": "First free cleft surgical mission launched", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}