{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "(Top) Government employees picketing AMC Road in Dindigul; staging a picketing agitation in front of the Panchayat Union Office in Ramanathapuram on Monday.— PHOTOs: G. Karthikeyan and L. Balachandar\n\nThousands stage picketing agitation and court arrest\n\nMore than 3,500 government employees, including a large number of women, courted arrest in Ramanathapuram and Sivaganga districts on Monday when they staged picketing agitations, pressing a 20-point charter of demands.\n\nOn the fifth day of the indefinite strike launched on February 10 as part of the State-wide stir, 1,563 government employees from various departments, including more than 1,200 women employees squatted on the roads in six different places in Ramanathapuram district, defying police orders and courted arrest.\n\nS. Ganesamoorthy, district president, Tamil Nadu Government Employees’ Association, who led the protest here, said that teachers, who were members of the Primary School Teachers’ Association, joined the stir and courted arrest, expressing solidarity with the striking government employees.\n\nA large number of noon meal and anganwadi workers took part in the picketing and road roko agitations staged in Paramakudi, Mudukulathur, Kadaladi, Kamudhi and Thiruvadanai, he said. They were pressing for scrapping of the new pension scheme and bringing the non- standard time pay scale employees to time pay scale among other demands, he added. He said that work in the rural development, employment and commercial tax and survey departments affected for the third day.\n\nPolice detained the arrested employees in a marriage and community halls and released them in the evening.\n\nSivaganga\n\nIn Sivaganga district, more than 2,200 employees staged picketing agitations in front of government offices in Sivaganga, Manamadurai, Ilayankudi, Kalayarkoil and Tirupattur and courted arrest, S. Kumaresan, district vice-president of the association and district president of Tamil Nadu Rural Development Officers’ Association said.\n\nThe arrested employees were detained in community and marriage halls before they were released in the evening.\n\nDindigul\n\nMore than 2,500 government employees in Dindigul and 1,500 employees in Theni districts were arrested when they picketed roads on Monday.\n\nIn Dindigul, government employees took out a rally to the Kamarajar bus stand from the union office.\n\nWhen the police erected metal barricades to prevent them on AMC Road, the officials pushed the barricades down and proceeded to the entrance of Tiruchi and Palani bay to block buses coming out of the bus stand. The police had a tough time in handling the agitators.\n\nLater, they managed to stop a majority of employees in front of the entrance. But one group blocked the entrance and raised slogans against the police. The employees squatted on the road and raised slogans against the government. They appealed for discussion to settle their grievances.\n\nTheni\n\nThe striking employees took out a rally from Madurai highway. Later, the police arrested them as they picketed the road. Majority of them did not report for duty.\n\nTirunelveli\n\nOver 2,000 government employees, including 1,755 women, were arrested when they staged road roko at four places in the district on Monday to highlight their demands. When the government employees staged road roko at Tenkasi, Ambasamudram, Sankarankovil and A.R. Line Road in Palayamkottai on Monday, the police arrested 2,062 protestors, including 1,755 women.", 
    "section": "national", 
    "title": "Government employees’ strike continues", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}