{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Employees staging a demonstration in Tirunelveli (left) and Thoothukudi on Monday.— Photos: A. Shaikmohideen and N. Rajesh\n\n“Indefinite strike will continue till demands are accepted”\n\nOver 2,000 government employees, including 1,755 women, were arrested when they staged road roko at four places in the district on Monday to highlight their demands.\n\nWhen the government employees staged road roko at Tenkasi, Ambasamudram, Sankarankovil and A.R. Line Road in Palayamkottai on Monday, the police arrested 2,062 protestors, including 1,755 women.\n\nThe protesting government employees said the contributory pension scheme should be withdrawn as promised by Chief Minister Jayalalithaa during her electioneering in 2011 and all perks being given to the Union Government employees extended to State government employees also. Fifty per cent dearness allowance should be merged with basic pay and 10 per cent of the arrears should be given as interim relief. The protestors also urged the State government to fulfil 15 more demands, mostly pertaining to wage hike and other monetary benefits.\n\nIn the protest held at Tenkasi, the police arrested 1,091 persons, including 965 women, and 389 agitators, including 336 women, were detained in Sankarankovil.\n\nIn the agitation organised at Ambasamudram, the police arrested 386 protestors, including 340 women.\n\nThe arrested protestors were released in the evening.\n\nMeanwhile, employees of Department of Commercial Taxes continued their fast in front of their office on Monday also.\n\nThoothukudi\n\nA total of 1,501 employees, including 733 women, were arrested in various parts of Thoothukudi district while staging road rokos in support of their demands.\n\nTeachers of primary schools also joined the agitation, demanding hike in salary on a par with teachers drawing salaries in Central government schools. Earlier, the teachers took out a procession.\n\nApart from Thoothukudi, where the employees blocked Tiruchendur road, road blockades were held in Kovilpatti, Tiruchendur, Sathankulam and Tiruchendur, sources said.\n\nKanyakumari\n\nA total of 289 government employees were arrested for staging a road roko in front of the Collectorate.\n\nThe Tamil Nadu Government Employees Association, which spearheaded the indefinite strike, claimed that over 2,500 employees were absent for duty on Monday.\n\nC.R. Rajkumar, district secretary, TNGEA, told The Hindu that the indefinite strike would continue till their demands were accepted and implemented by the government. The arrested were kept in a marriage hall and released in the evening.", 
    "section": "national", 
    "title": "Govt. staff arrested, released", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}