{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Minister for Municipal Administration S.P. Velumani watering a sapling planted on Boluvampatti Forest Range Office campus in Coimbatore on Monday.\n\nA massive greening drive, as part of the 68th birthday celebration of Chief Minister Jayalalithaa, was launched in Coimbatore and The Nilgiris on Monday.\n\nAbout 2.12 lakh saplings each are expected to be planted.\n\nThe Nilgiris District Forest Officer, C. Badrasamy, said that the survival rate of saplings planted as part of the Chief Minister’s birthday was 80 per cent.\n\n“Last year it improved to 90 per cent,” he said.\n\nThis year, forest personnel are planning to plant more than 30 varieties at various places across the district depending on the climatic conditions prevailing there.\n\nIt includes flowering trees such as Spethodia, a host of ornamental native conifers, bottle brush, and silver oak on private lands.\n\nThe plantation will be completed in a phased manner before December, based on the rainfall and climatic conditions.\n\nPlantation in the upper plateau areas will be done in June and July, and in Kotagiri and Burliar in October and November, during the North East Monsoon.\n\nTen nurseries are getting ready in Coimbatore district to raise saplings for the drive.\n\nMinister for Municipal Administration S.P. Velumani, who launched the drive at Boluvampatti Forest Range Office, at Iruttupallam, said that a good share of the saplings will be planted and maintained in the forest areas, education institutions, and parks.\n\nDistrict Collector Archana Patnaik; Conservator of Forests I. Anwardeen; and District Forest Officer C.H. Padma; were present.\n\nCompensation for crop loss was given to 10 farmers, and Rs. 2.75 lakh was given to the mother of Dharman who was trampled to death by a wild elephant a few weeks ago.\n\nDepartment personnel said that they were studying survival rate of the saplings planted in similar drives in the last few years.\n\nTirupur\n\nMinister for Forests M.S.M. Anandan on Monday inaugurated the massive planting programme in the district as a continuation of the State Government's vision to plant 68 lakh saplings across the State.\n\nDistrict Forest Officer A. Periasamy told The Hindu that 2,19,350 saplings would be planted in Tirupur district under the project during 2016-17.\n\nThe saplings were provided by the Forest department.\n\nDistrict Collector S. Jayandhi; Chief Conservator of Forest V. T. Kandasamy; district panchayat chairman M. Shanmugam; among others were present.", 
    "section": "national", 
    "title": "Greening drive launched", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}