{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "There was cheer all around in the Coimbatore District Basketball Association (CDBBA) camp as its under-13 girls (mini) clinched their maiden title in the State basketball championship for boys and girls at Thoothukudi last week.\n\nThese children drubbed strong contender Chennai 65-36 to wear the crown.\n\nIt was no fluke because the girls had worked very hard with their coach (R. Jagadeesan) prior to the championship.\n\n“Chennai has been dominating over the years but we made it a point to stop them this time around. And my wards did not disappoint me,” said Jagadeesan.\n\n“We are thrilled to have done our district proud by bringing home the cup that has eluded us for sometime now,” said S. Pavithra Sre, the captain, who played the role of a pivot.\n\n“We did not rely on any one individual, we worked as a unit,” she added.\n\nM. Deepa Dharshini, S. Indhuja Kumari, Jyotsna stood out for the team.\n\nThe girls did go through a tough grind against Salem in the semifinal.\n\n“But we played to the situation and the rest came easy,” said K. Dharini.\n\n“We were not afraid at all,” quickly added siblings K. Kaviya and K. Sathya.\n\n“After every day, we analysed where we went wrong and ironed them out nicely in our next game. We also did a lot of meditation and prayer. It did work wonders for the team,” said J. Lavanya, the team’s manager.\n\n“I must give it for their confidence. They showed fire right through,” she added.\n\nThe CDBBA president G. Selvaraj and its secretary Syril Irudhayaraj were pleased with the efforts of the girls.\n\n“It clearly shows that we have done our homework right. We are heading the right direction. The infrastructure development and player encouragement has done the team a world of good,” they explained.\n\nThe CDBBA has other plans such to further upgrade the game in the district.\n\n“We plan to conduct summer camps and are in talks with the Delhi-based Dribbling Academy. The idea is to develop the skills of the players. We want to concentrate from the base level. We are even keen to bring the NBA coaches. Everything will happen over the next couple of years,” said Mr. Selvaraj.", 
    "section": "national", 
    "title": "Impressive show by Coimbatore girls", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}