{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The issue of permitting politicians and other prominent personalities to occupy chairs meant for lawyers, whenever they want to argue cases on their own, came to the fore in the Madras High Court Bench here on Tuesday when Justice S. Manikumar, the administrative judge, took exception to Puthiya Tamilagam leader K. Krishnasamy occupying a chair in the front row.\n\nLeading a Division Bench along with Justice C.T. Selvam, the senior judge requested Mr. Krishnasamy to wait in the litigants’ enclosure till a public interest litigation petition filed by him, seeking CBI probe into a double murder case reported in Pavoorchatram of Tirunelveli district in February last, was taken up for hearing.\n\nThe Ottapidaram MLA acceded to the request, but chose to wait outside the court hall.\n\nWhen the case was taken up for hearing after an hour, the judge objected to the presence of huge number of supporters of the MLA, residents of Pavoorchatram and relatives of the deceased in the litigants’ enclosure.\n\n“We have a practice in this court where parties can appear but the entire set of villagers cannot. Some procedure must be followed in court. This is not a public hearing,” he said.\n\nCrowd asked to disperse\n\nWhen the MLA claimed that the relatives of the deceased had come on their own to observe the proceedings, the judge gave a few illustrations to stress his point that the presence of such a crowd during court proceedings had the potential of snowballing into a clash. Then, Mr. Krishnasamy asked the crowd to disperse.\n\nHowever, after the judges heard the arguments advanced by the MLA on the PIL petition and ordered notice to the Home Secretary and Director General of Police, he broached the issue of the judge taking exception to his sitting in the lawyers’ enclosure and said that he had never faced such a situation despite having filed and argued many cases in the High Court as well as Supreme Court in the last 20 years.\n\nTo this, Mr. Justice Manikumar said: “Don’t mistake me, but I follow certain procedures. I think everybody is equal before this court.”\n\nHe refused to accept the MLA’s request to post his case during the post lunch session on March 7, the next date of hearing, and said that it would be put in the regular list on that day as per procedure.", 
    "section": "national", 
    "title": "Judge objects to litigant occupying lawyer’s chair", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}