{
    "author": [
        "L Renganathan"
    ], 
    "text": "Main roads repaired and LED lights installed to illuminate the town\n\nMunicipal Chairperson Rathna Sekar interacting with pilgrims at the Mahamaham Tank in Kumbakonam on Monday.\n\nThe Kumbakonam Municipality, celebrating its sesquicentennial this year, has spent more than Rs. 50 crore from improving civic infrastructure to ensuring a hygienic environment so that the visiting devotees of Mahamham have a memorable outing.\n\nAfter the Maratha King Serfoji II ceded Kumbakonam to the East India Company in 1799, the town progressed rapidly and the British elevated the town as a municipality in 1866.\n\nEstablishment of rail link connectivity to important ports in the Madras Presidency in 1877 propelled the town's economy.\n\nWhat started off initially as a 7.68 square kilometre civic body with a population of around 40,000 in 1866 has now grown to be among the oldest municipalities in the State covering an area of 12.58 square kilometre divided into 45 wards and with a population of 1,40,156 as per 2011 census.\n\n“We are privileged to host the Mahamaham 2016 in our sesquicentennial year. For this to remain etched in the memory of the visiting pilgrims, the municipality has carried out numerous development work to the tune of Rs. 50 crore,” said chairperson Rathna Sekar.\n\nSpecial arrangements have been made for augmenting water supply facilities in the town at a cost of Rs. 2.44 crore in creating three new infiltration wells, installing two 180 HP turbines and provisioning for non-infrastructure work such as engaging tankers and trucks for water supply on rental basis during the festival period.\n\nWhile street lighting has been upgraded by spending Rs. 5.40 crore for installing 500 LED street lights, 20 mini high mast lamps and two high mast lamps, solid waste management work including complete renovation of the Thepperumanallur compost yard through the bio-mining concept have been implemented in the run up to the Mahamaham festival at a cost of Rs. 11.17 crore.\n\nIn the bio-mining work, 18,000 cubic metre of the 1.31 lakh cubic metres of assessed garbage has been processed and cleared.\n\nThe town roads underwent extensive face lift with Rs. 1.58 crore sanctioned for improving temple car routes, another Rs. 1.88 crore for providing interlock blocking arrangements for sanitary lanes while restoration of 121 stretches of bitumen topped surface and cement concrete roads were completed at a cost of Rs. 10.76 crore.\n\nThe municipality is also carrying out restoration works including dredging, providing rain water harvesting and walk ways around six tanks within the civic body boundaries at a cost of Rs. 3.60 crore in view of the Mahamaham.\n\nThe tanks getting a new lease of life include Pachaiyappan tank. Sei Kulam, Ayee Kulam, Bairagi Kulam, Pidari Kulam and Banadurai Kulam.", 
    "section": "national", 
    "title": "Kumbakonam Municipality turns 150", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}