{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Forest Department in association with other departments and voluntary organisations has proposed to plant 2.10 lakh saplings in different parts of the district.The department will soon raise the saplings in the nurseries.Edappadi K. Palanisamy, Minister for State Highways and Minor Ports, launched the programme on the Nurse Training School premises in the city on Monday.\n\nAlam, pungan, iluppai, mantharai, magizham, poovarasu, vembu will be planted near forest lands, education institutions, on campuses of government and private offices, parks, and along side roads.\n\nThe Forest Department sources said that the saplings will be raised in four nurseries in Salem Forest Division -- Hasthampatti (Shevaroys South Forest Range), Pappireddipatti (Shevaroys North range), Danishipet (Danishpet range) and Mettur (Mettur range); and three in Attur Forest Division -- Karumanthurai (Karumanthurai range), Puzhuthikuttai (Vazhappadi range) and Panamadai (Attur range).\n\nThe planting of saplings will commence in October and November.\n\nGvernment employees, members of voluntary organisations, students, and representatives of residential colonies welfare associations will be roped in for the planting and maintain them.\n\nIn Namakkal district, P. Thangamani, Minister for Industries and Transport, inaugurated the drive at the Collectorate.\n\nDistrict Collector V. Dakshinamoorthy was present.\n\nErode\n\nErode district will witness planting of 2,19,350 saplings during this year through the Departments of Forest and Rural Development.\n\nEnvironment Minister Thoppu N.D. Venkatachalam initiated the greening programme marking the 68th birthday celebration of Chief Minister Jayalalithaa on the premises of Aavin Headquarters at Chithode on Monday.\n\nDistrict Collector S. Prabakar and others were present.\n\nThe initiative to enlarge green cover in non-forest area has been in operation since 2012 coinciding with the 64th birthday celebrations of the Chief Minister. The number of saplings planted has been increasing progressively every year since then.\n\nThe Forest Department has been entrusted with the responsibility of planting 25,800 saplings and the rest would be planted by the Rural Development Department by dovetailing the task with Mahatma Gandhi National Rural Employment Guarantee Scheme.\n\nThe saplings of banyan, iluppai, palm, mantharai, pungan, magizham, and poovarasu will be planted on the premises of the offices of government and private establishments, parks, and along roadsides.\n\nDharmapuri\n\nMassive sapling plantation drive was launched here by the District Forest Department on Monday to mark the 68th birthday celebrations of Chief Minister Jayalalithaa.\n\nThe Forest Department sourced sacred fig saplings (ficus religiosa) to be planted over a course of time. Over 68 lakh fig saplings are proposed to planted.\n\nAccording to the department, this year over 2,19,350 saplings are proposed to be planted across the district. Over 25,800 saplings would be planted in reserve forests, and over 1,93,550 saplings at various places under the MNREGA.\n\nOn Monday, 68 saplings were planted on the premises of Government Engineering College, Chettikarai.\n\nMinister for Higher Education P. Palaniappan; District Collector K. Vivekanandan; and Conservator of Forest Ulaganathan; were present.", 
    "section": "national", 
    "title": "Massive greening drive begins", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}