{
    "author": [
        "Special Correspondent"
    ], 
    "text": "ore than four lakh pilgrims have taken a holy dip in the Mahamaham tank here in the first three days of the event that commenced on Saturday. While the official estimated head count was one lakh on the first day and 2.5 lakh on the second, Monday saw pilgrim number swell by another 50,000.\n\nEven as the pilgrims thronged the temple town, officials started cracking the whip on over ambitious hoteliers and autorickshaw operators against whom sections of pilgrims had complained of fleecing. Getting to know of the complaints Collector N. Subbaiyan formed 10 special flying squads to monitor food prices in hotels and restaurants as the quality of the food stuff being sold in the town while issuing a stern warning that over zealous activities would land operators in trouble.\n\nMoreover boards sporting emergency contact numbers to prefer complaint in case of fleecing have been hung in several restaurants in the town to help the pilgrims.\n\nAnother felt need of the pilgrims, secured dress changing enclosures for women, was met when two chambers each were readied in the western and the north western bunds of the Mahamaham tank. Similar facilities were being readied at Portramarai tank and Chakara Padithurai areas where too devotees are taking bath. In a gesture to reach out to the visiting outstation pilgrims, Dr. Subbaiyan ordered extending the duration and scope of catering services at the Amma Unavagam in the town. While so far 1,200 idlis and 300 units of variety rice were being sold to the public a day, from now on 5,000 idlis and 2,000 units of variety rice would be made available to the pilgrims. The Life Insurance Corporation of India and the Kumbakonam Municipality have made available 25 lakh non woven carry bags for the benefit of visiting pilgrims.\n\nThe issue of bags for the pilgrims to carry their footwear and edible waste was launched by Dr. Subbaiyan in the presence of Superintendent of Police N.M. Mayilvahanan, LIC Senior Divisional Manager B. Sathyavathi, Kumbakonam Sub Collector M. Govinda Rao and Municipal Chairperson Rathna Sekar.", 
    "section": "national", 
    "title": "More facilities extended to pilgrims", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}