{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The recent pilot whales stranding has raised concern among conservation managers and researchers to understand marine mammals more. As there is no data on the diversity and status of marine mammals in India, the first step required is to build capability among researchers in identifying marine mammals and rescuing strategies of stranded animals, according to Dipani Sutaria, a marine mammal expert from Ahmedabad.\n\nAddressing a workshop organised by Suganthi Devadason Marine Research Institute (SDMRI) on introductory work on marine mammals research, data collection and rescue strategies here on Monday, she spoke on marine mammal diversity in India, their adaptations, species list and dealing with stranded marine mammal.\n\nDr. Sutaria stressed the need for data collection of stranded animals and said suitable strategies were required to be adopted for marine mammal research and conservation in Tamil Nadu.\n\nReferring to mass stranding of pilot whales at Manapad coast and its neighbouring coasts, she told The Hindu that such stranded ones should be carried by stretcher or by a similar position and let into sea to save their lives under any such circumstance.\n\nThe rescuers should never carry stranded whales by hand since its organs could get damaged. Besides, people should not be crowded as they could catch viral disease while getting close to or by touching any dead mammal.\n\nShe also sought the need for establishing the marine mammal stranding network involving officials from Departments of Forest, Fisheries, Indian Coast Guard, Coastal Security Group, Navy, researchers, local community and NGOs.\n\nDiscussions were also held among the participants to develop a species identification booklet for field staff of various conservation and enforcement agencies in local language and also a survey on marine mammal species diversity in Gulf of Mannar and Palk Bay.\n\nEarlier, J.K. Patterson Edward, Director, SDMRI, welcomed. The programme was attended by the Wildlife officials from Gulf of Mannar Marine National Park (GOMMNP) and research scholars of SDMRI.\n\nDeepak S. Bilgi, Wildlife Warden, GOMMNP, S. Ganesalingam, Forest Ranger, Ramanathapuram, and others took part.", 
    "section": "national", 
    "title": "Need for marine mammal stranding network stressed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}