{
    "author": [], 
    "text": "MRTS users are active in informing railway agencies about malfunctioning facilities, especially on Twitter\n\nRegular commuters at the Chintadripet Mass Rapid Transit System (MRTS) railway station were in for a pleasant surprise recently as all the escalators and lifts were functioning.\n\nAt the first station on the elevated corridor from the Chennai Beach direction, commuters have had to put up with damaged escalators and non-functional lifts for years together.\n\nThe amenities are a huge relief to the disabled and senior citizens, who all these years had no other option but to climb the steep flight of steps.\n\nThough there seems to be some progress in making such passenger-friendly amenities operational in some of the stations, things remain the same in some others, say commuters.\n\nThey say that making them operational was commendable, maintaining them in proper working condition is even more important. With the Ministry of Railways, Southern Railway and its administrative and technical wings active on Twitter, commuters are often prompt in taking pictures of amenities that do not function and sharing them on the micro-blogging site, tagging the authorities concerned.\n\nWhile some of the problems are immediately solved, many others take time. For commuters who are active on social media, getting an acknowledgement from the authorities itself is an indication that their grievances are being heard, unlike in the past.\n\nIntroduction of small buses in villages and small towns in the extended areas of the city has brought great relief to many residents.\n\nFor instance, in areas like Avadi, Pattabiram and Thirunindravur, these services have become a key link to spots from where residents can take buses to other parts of the city. Thus, trips to office or relatives’ houses have becomes far more convenient. New bus services like S-49 (Avadi – Thirunindravur via Hindu College), S-50 (Avadi – Pattabiram via Mittanamalli) have been added to the existing service S-47 (Avadi – Pattabiram via Anna Nagar). “The new small bus service S-49 connects important neighbourhoods like Sekkadu and Hindu College along Chennai Tiruvallur High Road,” say residents, who are glad that they are finally free from the mercy of share auto drivers. The new services connect areas like Balaji Nagar and Prakash Nagar in Thirunindravur town panchayat where last year’s rains had caused large scale flooding. Now, that the water has drained, the new small buses are a boon, residents say. Earlier, residents and school students from Thirunindravur had to walk two kilometres to reach Nemilichery, Hindu College and Avadi railway stations to reach the city. It has now become a thing of the past.\n\n(Reporting by K. Manikandan and\n\nD. Madhavan)", 
    "section": "national", 
    "title": "Of functioning escalators and commuter activism", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}