{
    "author": [
        "S Senthalir"
    ], 
    "text": "Martinican singer enthralsaudience at Alliance Française\n\nIt was a night to immerse in Caribbean jazz music. With her melodious crooning in French, she mesmerised the audience at a chock-a-block full hall at the Alliance Française in Puducherry.\n\nErika Lernot, the Martinican singer, sang her way into the hearts of the audience at Alliance Française.\n\nThe Caribbean music was organised as part of the Puducherry Heritage Festival 2016 early this month.\n\nThe foot-tapping Caribbean jazz music synchronised with French West Indies songs introduced the audience to the album Le Voyage . “The songs are about courage and happiness,” says Erika Lernot.\n\nThrough her song ‘ Leve ’ ( Raise or Wake up ), she made the audience sing along with her. Enthralled by the music, people stood up and danced, applauded and joined her in singing the songs from the album that spoke about love, unity, lost worlds and hopelessness.\n\n“My first album is Le Voyage which means ‘ The Journey’ . My parents are from French Caribbean island Martinique. When I was growing up I used to travel between France and Martinique. I love to travel and that is why it is called The Journey . I composed the songs while travelling to France, Caribbean islands, New York, Brazil and many countries around the world,” she says.\n\nThe songs were composed by Ms.Lernot along with guitarist Siam Lee, who is a composer and director of the opus. Erika says: “What I want to share in my songs is all about courage and happiness. It is about happiness during hard times because happiness is the only way to live in this very difficult world. If we can change this world through happiness and singing, we wouldn’t need anything else.”\n\nErika grew up in Paris under the influence of traditional drums from the Caribbean Island, also a mix of music: Jazz, soul, hip hop, oriental music etc. She decided to mix all the influences into her songs, and to experiment with her ideas in a lot of shows in Paris.\n\nIn her concert tours across the world, she is usually accompanied by musicians Stephane Castry, Regis Therese, Arnaud Dolmen, Olivier Juste, and Adriano Dd Tenorio with the whole soundscape orchestrated around the guitars of Siam Lee.", 
    "section": "national", 
    "title": "Puducherry jives to Caribbean jazz", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}