{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A group of farmers from a few villages on the Palayamkottai outskirts appealed to the district administration to release water from Palayam Channel to save the standing paddy crop.\n\nSubmitting a petition to District Revenue Officer M.G. Kulandaivel during the weekly grievance day meeting held on Monday, the farmers said farming activities in Ariyakulam, Thalavaipura, Melakulam, South Ariyakulam, Sirukulam, Kuththupaaraikulam, Muththarasankulam and Uththamapandiankulam were being taken up with the water being released in the Palayam Channel. Since the irrigation tanks feeding the ranches of these hamlets did not have sufficient water, the water to be released from the Palayam Channel alone could save the standing paddy, which would be ready for harvest in another fortnight.\n\n“When we submitted petition to the Public Works Department officials 15 days ago, they replied that water from Palayam Channel could be released only after removing water weeds obstructing the flow of water from the irrigation channel. However, the officials did not keep their promise and the crop was gradually withering,” said the petitioners.\n\n“Open DPC”\n\nFarmers from Gangaikondan, led by panchayat president S. Arulmani submitted a petition seeking opening of paddy direct procurement centre in their village as farmers cultivated paddy on over 6,000 acres with the water available in the irrigation tanks in over 30 villages.\n\nAs a paddy direct procurement centre functioned at Gangaikondan during the last season, it could be reopened at the same place or at Aladipatti or Anaithalaiyoor, the farmers said.\n\n“Ensure regular disbursal”\n\nMembers of the Tamirabharani Visually Challenged Persons’ Association submitted a petition to ensure regular disbursal of monthly assistance to them, which was stopped a few months ago. The State Government’s order that the differently abled persons should be 80 per cent impaired for getting the assistance should be withdrawn and assistance should be given to even persons having 40 per cent disability.\n\nThe monthly assistance of Rs.1,500 being now given to the physically challenged should be increased to Rs.5,000.", 
    "section": "national", 
    "title": "“Release water to save paddy crop”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}