{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Residents of Ukkan Nagar in Chikkadasampalayam village were at the Coimbatore Collectorate on Monday demanding basic amenities.\n\nIn their petition, the residents said that they had been living in the area for the past seven years without basic amenities. The State Government had given them free title deeds to reside in the area. They had urged the local body to assess their houses for property tax so that they could get basic services like road and water, but there had been no solution in sight. The panchayat authorities had told them that they would be in a position to assess the houses for property tax only on the orders of the District Collector.\n\n‘Improve water supply’\n\nRepresentatives of DMK, MDMK, Congress, CPI, CPI-M, TMK, DMDK and BJP in Ward 38 and 39 of the Coimbatore Corporation submitted a petition demanding improvement in water supply. They said that the Coimbatore Corporation supplied water only once in about 12 days. In the absence of sufficient pressure for uniform flow, the residents were getting inadequate water.\n\nPlea for free title deeds\n\nCoimbatore District Agriculture Labourers’ Union on Monday urged the district administration to provide free title deeds to 150 families in Vadugapalayam, near Annur Pachapalayam. In a petition submitted , the Union said that the residents had applied for free title deeds more than two years ago but there had been no action on their petition. If the residents did not get title deeds within a reasonable time, they would stage a protest.\n\nFair probe sought\n\nM. Yesudas of Ketti Palada in The Nilgiris on Monday petitioned the Coimbatore district administration demanding a fair probe into the death of his daughter, Priscilla. In his petition, he had said that on February 7, his daughter had called him to complain about a few students who had harassed her. She had also spoken about living in a not-so-conducive environment. After her accidental fall to death from the hostel, none of the members of the college management went to see her body. The management had also declared 10-day holiday for the students.\n\n‘Retrieve encroached land’\n\nSri Vaishnava Dharma Samrakshana Society has petitioned the district administration to retrieve the land belonging to the Sri Karivaradharaja Perumal Temple. In a petition , the Society said that a private trust had encroached the land that was donated to the temple. The trust had then sold the land to 35 persons between 1994 and 2011. It said that it had submitted petitions to the Hindu Religious and Charitable Endowments Department and also the anti-land grab cell police but thus far they had not taken action.", 
    "section": "national", 
    "title": "Residents demand basic amenities", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}