{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Farmers with small landholdings working hard for harvest\n\nPaddy being thrashed at Kumaravayalur near Tiruchi. Labour shortage has made it a tough task for small farmers.— PHOTO: A. MURALITHARAN\n\nHarvest of “samba” has been completed in about 50 per cent of the area of 51,758 hectares of land in the district — 34,440 hectares in the delta segment and 17,318 hectares in non-delta category.\n\nHarvest had been completed on about 50 per cent so far while harvest would be in the balance areas of 26,840 hectares – 22,500 hectares in the delta region and 4,340 hectares in non-delta area.\n\nAn official of the Agriculture Department told The Hindu here on Monday that the productivity was more in non-delta region. than the delta area.\n\nThe department has completed 22 crop cutting experiments across the district so far. The yield was eight tonnes in the non-delta fields against 6.12 tonnes in delta region.\n\nSmall land holdings\n\nThe official said that farmers of smaller land holdings toiled hard in harvesting the paddy. Members of families of small land-holdings had been adopting economic measures for raising paddy crop. “They work jointly right from transplanting the nurseries to protecting the crop from weeds and from application of fertiliser to manually harvesting it,” the official said.\n\nThe phenomenon was more pronounced at Kumaravayalur and surrounding villages where a large number of members — all relatives, have been working hard in harvesting the ‘BPT 5204’ popularly known as ‘Andhra Ponni’ variety.\n\nAccording to P. Karuppan, a farmer of the Kumaravayalur, non-availability of workers posed a great challenge for paddy growers. He said that while women members in a family looked after the major work such as transplanting the nurseries and clearing the weeds, men were responsible for harvest and post-harvest related works.\n\nOfficial source said the percentage of farmers with small land-holdings was far less as compared to the total number of farmers in the district. In several cases, these small land-holdings were cultivated on lease basis.", 
    "section": "national", 
    "title": "Samba paddy harvest over in about 50 per cent of the area", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}