{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Plans on to bring common application system for 100 schools\n\nWith serpentine queues outside schools during the admission season becoming common, a few Central Board of Secondary Education (CBSE) schools are doing something to prevent this — they are working towards giving parents the additional option of applying online.\n\nAjeeth Prasad Jain, Senior Principal of the Bhavan’s Rajaji Vidyashram and Secretary of the Chennai Sahodaya Schools Complex (CSSC) said that they were exploring the possibility of having a common online application system for over 100 CBSE schools in the city that are members of the CSSC cluster.\n\n“We are planning on having talks with the managements and principals of the member schools soon. This will put in place an easier process for parents,” he said, adding that besides promoting efficiency, this process would also usher in greater transparency.\n\nThe Bhavan’s Rajaji Vidyashram, which started offering admission forms online nearly six years ago, has had around 1,400 applicants on their website this year during the admission season.\n\n“There has been a 10 per cent increase in the number of applications received online, when compared to last year and the parents are extremely happy which is why we want to introduce a common platform,” he explained.\n\nMany CBSE schools have, this year, begun to offer the option to parents of downloading the application forms and submitting them in person or through post.\n\n“This has definitely made it less stressful for parents. This year, we’ve received 50 per cent of the applications online and the rest directly on the school premises,” said Padmini Sriraman, principal of Hindu Senior Secondary School, which introduced the online option for parents two years ago.\n\nParents and activists, who have long been voicing the need for regulations in the admission process, said that making it mandatory for schools to offer an online option for admissions was the need of the hour.\n\nAravind, a resident of the city who had submitted an online application for his nephew at a CBSE school in Nanganallur, said that the process was a hassle-free one. “However, there were limited seats available for LKG and the admissions too were quickly stopped as the school had received a large number of applications. A more streamlined process online would be of great help,” he said.\n\nParents, activists voice the need for mandatory online option for all CBSE schools in city", 
    "section": "national", 
    "title": "Some CBSE schools mull online process", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}