{
    "author": [
        "S Prasad"
    ], 
    "text": "Will help in removing multiple entries, EPIC numbers that have been repeated\n\n(Second from left) Chief Electoral Officer V.Candavelou addressing mediapersons at the Chief Secretarit on Monday..- Photo : T.Singaravelou\n\nThe Election Commission of India (ECI) on Monday has launched a special drive for purification of the electoral rolls to remove multiple entries, repeated EPIC numbers and names of deceased voters in the electoral roll said Chief Electoral Officer V. Candavelou.\n\nTalking to reporters here, he said the drive was held in all poll bound states from February 15 to 29. A de-duplication software developed by the Commission would be run Assembly constituency wise on the electoral roll to remove repeat or multiple entries or EPIC numbers and entries of deceased voters followed by field verification.\n\nList of deceased persons\n\nMr. Candavelou said the Elections department had collected the list of deceased persons from the concerned municipalities and commune panchayats in the Union Territory.\n\nThe list will be handed over to the Electoral Registration Officers (EROs) for field verification by the Booth Level Officers (BLOs) in association with Booth Level Agents of recognised political parties.\n\nA meeting would also be held with representatives of political parties to prevail upon them the features of the special drive and to appoint Booth Level Agents. The BLOs will exchange information with BLAs of recognised political parties. Voters may also come forward to disclose such repetition and repeat EPIC numbers in the electoral roll, he said.\n\nThe Elections department will publish the list of probable repeat/multiple entries, repeated EPIC numbers and names of deceased voters in the electoral roll on the website:http://ceopuducherry.\n\npy.gov.in\n\nIf multiple/repeat entries and entries pertaining to deceased voters are found even after filed verification they would be deleted suo motto under Section 2 of the Representation of People Act, 1950 after following due procedures and directions of the ECI.\n\nRepeated EPIC numbers\n\nRepeated EPIC numbers would be corrected after due verification by cancelling the EPIC number if it belongs to the same voter or it would be replaced with new EPIC if it belongs to some other voter.\n\nThe filed verification made by the BLOs would be cross-checked by the Assistant Electoral Registration Officers, concerned Electoral Registration Officers and the District Election Officers.\n\nMr. Candavelou said that over 12,000 application forms were received in special camps held at polling stations in all the 30 Assembly constituencies across the UT.\n\nThe camps were organised for enrolment of voters, deletion of names and corrections in electoral roll on February 7 and 14.\n\nA total of 9,641 Form - 6 for enrolling as new voters, 125 Form 7 for deletion of voters from electoral roll, 1,967 Form 8 for making modifications and 992 Form 8 (A) for change of address within a constituency were received.", 
    "section": "national", 
    "title": "Special drive for purification of electoral rolls launched", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}