{
    "author": [], 
    "text": "The stretch between Kandiyur and Palliagraharam does not have streetlights making it difficult to drive at night. Action should be taken to install streetlights and ensure safe driving.\n\nG. Sathyanarayanan Iyer,\n\nThanjavur\n\nMisleading\n\nsignboard\n\nThe traffic signboard erected near Sundaraperumalkoil railway crossing on the Kumbakonam-Thanjavur main road is confusing motorists. The signboard gives wrong directions towards Thanjavur and Sundaraperumalkoil village. This often leads to accidents. Vehicles bound for Thanjavur, Tiruchi, and Madurai from Chennai and Puducherry via Kumbakonam are made to take the wrong direction. As the mahamaham celebrations are on now, a large number of vehicles pass through this route. The Highways Department should correct the signboard immediately to avert accidents.\n\nM. Baluswamy,\n\nKumbakonam\n\nRun share auto\n\nto Sanapiratti\n\nShare auto rickshaws are plying from Karur Bus Stand to Housing Board colony at Gandhigram, Thanthimalai Perumal Temple, and Government Arts College but not to Industrial Estate in Sanapiratti where hundreds of people from northern States are working and living with their families. The district administration should order the operation of share auto services to Sanapiratti.\n\nR.S. Moorthy\n\nKarur\n\nInstall overhead\n\nshowers\n\nA walk-through overhead showers can be installed at the Mahamaham tank as an effective way to regulate crowd. The showers can have supply from the tank wells and emergency exits could be set up. Mini buses should be operated continuously.\n\nV. Srinivasan,\n\nThirupanandal\n\nNot wide enough\n\nThe road between Nal Road and Bypass at Kumbakonam has not been satisfactory for residents of Chettimandapam area. The road should be at least 40-foot wide but it is only 22 feet. The Highways Department should widen the road so that adequate space is available for pedestrians.\n\nS. Lakshmi,\n\nKumbakonam\n\nParking problem on\n\nPachyappa Street\n\nIn Kumbakonam, Pachyappa Street has a marriage hall which is hired throughout the year making it a busy area. The street is always busy as the share trading company is very active. Indiscriminate parking makes it impossible to enter the street. I appeal to he authorities concerned to look into the problem and find a remedy.\n\nS. Krishnan,\n\nThippirajapuram\n\nInstall more\n\nescalators\n\nThe new escalator installed on platform number two at Tiruchi Junction will provide great relief to passengers, especially senior citizens. This has been funded under the Member of Parliament Local Area Development Scheme (MPLADS) by N. Siva. The Railways should come forward to install similar escalators in all other platforms as well.\n\nK. Muthuswamy,\n\nTiruchi\n\nTickets for\n\nJan Shatabdi\n\nIssuing of tickets for the Jan Shatabdi Express operated between Coimbatore and Mayiladuthurai at Tiruchi Junction is delayed till the arrival of train causing hardship to passengers as they have to dash to board the train at the last minute. I request Railway authorities to start issuing tickets at least an hour before the arrival of the train to avoid this.\n\nRavi Ramanujam,\n\nTiruchi\n\nStop insisting on\n\nration card as ID\n\nRation card is an important identity document. are still regarded as the most important identity document. Many people would like to stop using ration card with the intention of benefitting poor people. Officially, ration card is the first valid identification card. Government must allow genuine citizens to surrender their ration cards and use Aadhaar cards, PAN cards, Electors Photo Identity Cards as valid identification documents. This method can help poor people benefit from the Public Distribution System (PDS) and stop leak of grain from this system. In a country where 25 per cent of the people live below poverty line (BPL) and billionaires club is growing, it is criminal to insist on the ration card for everyone.\n\nA. Prabaharan,\n\nPuthanampatti\n\nTipsy railway staff\n\non Rockfort Exp\n\nMany railway employees travel from Chennai Egmore to Tiruchi in Rockfort Express inebriated. They speak loudly disturbing other passengers. Although this is a regular feature, the RPF and TTEs are not taking any action. Railway higher officials must take stringent action in this matter.\n\nS. Prakash,\n\nTiruchi\n\nFast track gauge\n\nconversion work\n\nThe BG conversion of railway line between Tiruvarur and Karaikudi is a long-pending demand of people of Tiruvarur, Thanjavur, Pudukkottai, and Sivaganga districts. This line covers Thiruthuraipoondi, Muthupet, Adirampattinam, Pattukkottai, Peravurani, and Aranthangi. The gauge conversion work is progressing t snail’s pace. Southern Railway should speed up the work.\n\nA. Haja Abdul Khader,\n\nAdirampattinam\n\nSuper fast train\n\nneeded\n\nIntroduction of a super fast day train from Thanjavur to Chennai Egmore via Kumbakonam has been a long-pending demand. The issue has been taken up by several service and welfare organisations and many agitations have been organised. The train could be named Brihadeeswarar Day Express. We hope that the Railway Minister would fulfil the expectation in the Railway Budget.\n\nU. Joseph,\n\nState Vice-President\n\nTamil Nadu State Federation of\n\nSenior Citizens’ Council, Thanjavur", 
    "section": "national", 
    "title": "Streetlights not installed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}