{
    "author": [
        "C Jaisankar"
    ], 
    "text": "It is done under IPDS at a cost of Rs. 40 crore\n\nThe Tamil Nadu Generation and Distribution Corporation (Tangedco) plans new sub stations at 22 places in delta region, including four in Tiruchi district.\n\nIt is part of Integrated Power Development Scheme (IPDS), which is to be implemented in 522 statutory towns of the State.\n\nIn Tiruchi district, new substations, each 33/11 kV, will come up at Manaparai (Vidathilampatti), Kallakudy, Sirugamani, and Balakrishnapatty.\n\nThe Tangedco will set up sub stations at eight places in Thanjavur district. They are: Peravurani, Papanasam, Madhukkur, Ammapettai, Orathanadu, Veppathur, Swamimalai, and Melathirupathuruthi. In Pudukottai district, the new sub station will be established at Annavasal.\n\nThree places such as Kulithalai, Aravakurichi, and Uppidamangalam in Karur district have been identified for installing 33/11kv sub stations. In Nagapattinam district, the substations will be set up at Thittacherry, Velankanni, and Kuthalam. Similarly, Tiruvarur district will have new station at Thruthuraipoondi.\n\nA senior official of Tangedco told The Hindu that it would cost Rs. 40 crore for establishing 22 substations.\n\nThe cost of 2x8 mvA capacity sub station would be Rs. 2.12 crore. It was Rs.1.46 crore for 1x8 mvA sub stations. It had been planned to complete the installation work by August.\n\nIn addition to establishing new substations, the IPDS would cover strengthening of sub-transmission network (HT/LT lines), augmentation of existing substations, carrying out Repair and Maintenance works in existing substations, bay extension, and installation of capacitor banks and others. The scheme would cover replacement of 3.24 lakh existing electro mechanical meters by static meters.\n\nSub stations to\n\nbe established\n\nat eight places\n\nin Thanjavur\n\ndistrict", 
    "section": "national", 
    "title": "Tangedco plans major upgrade", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}