{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Nature Club carries out campus bird count\n\nThe Nature Club of the National Institute of Technology, Tiruchi, has carried out a campus bird count (CBC) to document birdlife in the campus.\n\nThe CBC is a coordinated effort to document the birdlife in multiple campuses across India. The Club has been systematically recording data about birds of their campus over the past three years. As part of the CBC, members of the club sighted over 100 bird species and uploaded their lists on a global bird listing tool, according to a NITT press release. The list can be accessed at: goo.gl/J1Rb5j\n\n“Our campus is home to over 120 species of birds. Migration season brings more birds to our campus. We have sighted rare birds such as the Eurasian Wryneck, Streaked Weaver, and Bailon's Crake here,” said Amol Mande, the President of the Nature Club\n\nEighty-five of the bird species are found locally and are spotted commonly. Twenty bird species are local migrants. Besdies, 20 migratory bird species stay in the campus during the winter. Over 12 species of raptors and 30 species of water birds can also be spotted in the campus, the press release said.\n\n“The rich diversity in our campus is due to the varied habitats. Though it appears to be a dry, scrubby area from outside, it actually attracts a lot of birds. The dry-scrublands and the lake, which has patches of tree plantations, attract a variety of local as well as migratory birds,” said Pradeep, a bird watching enthusiast.\n\nIt is important for students and residents in the campus to recognise the importance of having a rich ecosystem and take steps towards the conservation of the species. Towards this objective, the club organises Nature Walk for the campus inmates including children to create awareness and oneness with Nature, said the faculty Advisor A.K.Bakthavatsalam. The club has also brought out a book – a compilation of campus flora and fauna.", 
    "section": "national", 
    "title": "Tiruchi NIT campus, home to over 120 species of birds", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}