{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Coimbatore, Madurai pull ahead of Chennai\n\nIn the pan-India Swachh Bharat survey commissioned by the Ministry of Urban Development, Chennai has been ranked 37, but three other cities from the State are ahead of the capital city. Tiruchi has come third with a score of 1715 points out of 2000, Coimbatore is at the 18{+t}{+h}position with 1361 points and Madurai is at the 26{+t}{+h}position with 1245 points. Chennai has scored 1194 points.\n\nThe Quality Council of India carried out the survey, surveying 73 cities with a population of over 10 lakh people.\n\nTiruchirapalli missed the second spot by a whisker, losing out to Chandigarh by one point. Coimbatore has improved upon its last year’s performance (21).\n\nThe gap between Tiruchirapalli and the winner Mysuru is just 34 points. Tiruchirapalli is said to have scored well on drinking water coverage, community participation in garbage collection, control of communicable and waterborne diseases, and efforts to minimise open defecation.\n\nM. Vijayalakshmi, Commissioner, Tiruchi Corporation, attributed the result of the survey to the collective efforts of elected representatives, officials, field staff and residents. Tiruchi had done well on all aspects of sanitation and hygiene management, she added.\n\nOfficials of Coimbatore Corporation said that in the run-up to the 2014 survey, the city corporation had failed to furnish all the details that the Government had asked for. This time, it has done its homework. In 2014, when 476 cities with a population of over one lakh were surveyed, Coimbatore had secured the 169{+t}{+h}rank. According to the survey, only 11 percent of those surveyed have said that the 'temple' city of Madurai was clean. Only 32 per cent have said that there are adequate dustbins or dumper bins . Though the City Health Officer Yasodamani has said a little over 500 tonnes of garbage are lifted every day from the 100 wards by conservancy workers, parts of the city, especially slums and unplanned colonies, face mosquito menace due to uncleared garbage.\n\nGoing by the findings of the survey, the major challenges faced by the Greater Chennai Corporation include installation of public toilets, provision of dustbins and door-to-door collection of garbage. Just 11 per cent of residents surveyed in Greater Chennai Corporation have said the city is ‘always clean’. Only 14 per cent of the residents have said public toilets are well-maintained. Only 34 per cent of the residents could locate dustbins. Forty-two per cent of residents have said there is door-to-door collection of municipal solid waste.", 
    "section": "national", 
    "title": "Tiruchi walks away with Swachh Bharat honours", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}