{
    "author": [], 
    "text": "RELIGION\n\nSrirangam Sri Ranganathaswamy Temple : Thirupallioda thiruvizha, Namperumal purappadu from Sandhanu Mandapam, 6.45 p.m.; reaching sanctum sanctorum after Nellalavu kandarulal and thiruveedhi valam, 9 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Sri Venugopalan Sannidhi, No.15, Ranganathapuram, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama nama parayanam, 28, Amman Street, Amman Nagar, 6 p.m.\n\nGENERAL\n\nNational Institute of Technology Department of Chemistry : Lecture on ‘ZnS materials – from synthesis to photocatalytic applications,’ by Jerry J.Wu, professor, Department of Environmental Engineering, Feng Chia University, Taiwan, 10.30 a.m.\n\nHallmark Business School: Training programme on “Banking and Finance”, N. Pattabiraman, former Senior Manager, Canara Bank, S. Lakshmanan, former Branch Manager, Canara Bank, and R.S. Mani, former AGM, Bank of India, resource persons, 10 a.m.\n\nSchool of Computer Science, Engineering and Applications, Bharathidasan University : Consultative workshop on “World class curriculum in Computer Science,” V.M. Muthukumar, Vice-Chancellor, Bharathidasan University, inaugurates, 10 a.m.\n\nGlobal Talent Track Private Limited: Nitin Suvarna, vice-president, Capgemini India, inaugurates Capgemini’s Employability and National Digital Literacy Mission (NDLM) Centre, No.3, Ramanathan Arcade, 3{+r}{+d}floor, Tennur, 4 p.m.\n\nJamal Mohamed College Department of History : National seminar on ‘Tiruchirapalli under the Nayaks of Madurai,’ N. Rajendran, dean of arts, Bharathidasan University, inaugurates, 9.30 a.m.\n\nNational College Department of Economics : D. Kumar, Associate Professor, Jamal Mohamed College, delivers a lecture on “Urban Economic Issues,” 11.30 a.m.\n\nHoly Cross College Department of Rehabilitation Science and Rajiv Gandhi National Institute of Youth Development : “Catalyst – make a difference,” a youth festival on civic, good citizenship, inclusion and social justice, F. Samuel Christopher, Vice-Principal, Bishop Heber College, chief guest, 9 a.m.\n\nM.I.E.T. Engineering College Department of Management Studies : Workshop on “Global talent search,” Dhaarini Srinivasan, Associate CIPD, UK, chief guest, 10 a.m.\n\nSEVAI Shanthi Matriculation Higher Secondary School, Arumbugal Nagar: Anniversary celebrations, P. Sona Selvam, chairman, Sirugamani Town Panchayat, presides, 10 a.m.\n\nSt. Joseph’s College Department of Physical Education : Centenary tournaments – football, 7 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}