{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Students urged to research local problems such as pollution, environment\n\nGovernor K. Rosaiah hands over the Ph.D certificate to P. Mani, associate professor and head of Economics, Arignar Anna Government Arts College, Villupuram.- Photo: C. Venkatachalapathy\n\nUniversity Grants Commission’s (UGC) Vice Chairman H. Devaraj asked the Thiruvalluvar University to apply for grants under its flagship programme Centres with Potential for Excellence in Particular Areas (CPEPA) and also for constructing a large auditorium.\n\nDelivering the address at the university’s 11th convocation on Monday, he requested Vice Chancellor K. Murugan to seek funds from the UGC to construct a large auditorium.\n\nThe convocation was organised in the university’s auditorium that can accommodate 300 persons, and Mr. Devaraj felt that parents should be provided with seats inside to witness the convocation ceremony.\n\nHe said this can be done under the grant for young universities or catch-up grant instituted by UGC.\n\nMore funds\n\n“We want to give more funds for Thiruvalluvar University. It has got its first grant of Rs. 12 lakh for development of sports after receiving the 12B and 2F status,” he said.\n\n“UGC is giving Rs. 10 crore for CPEPA. Four or five departments of the university can apply for this programme,” he noted.\n\nMr. Devaraj said studies relevant to particular areas should be undertaken by universities.\n\n“Vellore has problems of environment pollution and there are several tanneries. The university can focus on such relevant areas, and not go after fanciful topics. There can be focus on environment studies,” he added. He also said that the UGC was willing to provide funds for social sciences.\n\nWith the university having seven departments, he said the number of departments should be increased. Efforts were on to reverse funding pattern through Rashtriya Uchchatar Shiksha Abhiyan (RUSA) that aims at providing funding for State higher educational institutions, he said.\n\n“So long, 96 per cent of budget was allocated to Central universities, while the remaining four per cent went to State universities and colleges. However, 96 per cent of Gross Enrollment Ratio was from State institutions, and hence, we are reversing the funding pattern by giving more money to States through RUSA to encourage all States,” he explained.\n\nModel colleges\n\nThe idea, he added, was that State governments can establish model colleges and develop State universities, bringing in quality in higher education.\n\n“Tamil Nadu is progressing well in higher education. It has three universities with University with Potential for Excellence status – University of Madras, Madurai Kamaraj University and Anna University,” he said.\n\nHe added that Anna University will receive funding to the tune of Rs. 50 crore to 70 crore. The institution was working on an anti-bacteriogram.\n\nHe earlier said that India was doing well in science, such as missile technology, but what was missing is that it has not marketed or exposed its activities.\n\nK. Murugan, Vice Chancellor of Thiruvalluvar University, in his annual report, said there was considerable increase in Ph.D enrolment in the university during the last two years. The number of candidates registered for Ph.D was 353.\n\nGovernor K. Rosaiah presented the degrees to the candidates on the occasion.", 
    "section": "national", 
    "title": "UGC Vice Chairman asks university to apply for grants", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}