{
    "author": [
        "K Lakshmi"
    ], 
    "text": "The second phase of improving amenities around the waterbodies will resume after a lull of three months\n\nAfter a lull of over three months, work on improving three waterbodies in the western part of the city will resume. The State government has sanctioned funds to ensure this.\n\nThe Water Resources Department recently received Rs.13 crore to proceed with the work to rejuvenate the lakes in Ambattur, Korattur and Madhavaram. This will be part of the second phase of an exercise to improve these lakes.\n\nResidents are already enjoying the scenic beauty of the lakes, thanks to projects that had been initiated to rejuvenate them after decades of neglect.\n\nAmong the three waterbodies, the one in Madhavaram has undergone considerable improvement, including formation of mud flats in the middle of the lake.\n\nNearly 85 per cent of the project to beautify the lake located on either side of GNT Road was completed in the first phase.\n\nThe lakes are brimming with water after the northeast monsoon. Officials of the WRD said: “We plan to complete the works such as construction of a boat quay and planting of saplings in the small islands that have been created in Madhavaram lake. The project to turn Korattur lake into an eco-restoration spot will also be given greater impetus this year.”\n\nSpread over 680 acres, Korattur lake gets several visitors every day. Many of them take a walk around the footpath formed over the three-km bund or enjoy a spot of fishing.\n\nHowever, residents want the work to be expedited so that they get to see a lake that is transformed in all respects.\n\nThanu Subramanian, president of Santhosh Nagar Residents’ Welfare Association, Korattur said: “Groundwater level and quality of water has improved after the work was initiated. I come for walks and also to enjoy watching the birds that visit the waterbody. But, the footpath needs to be properly laid. Many motorcylists and autorickshaw drivers ride on the bund damaging the footpath.”\n\nResidents demanded that the fencing must be provided to ensure the safety of visitors and prevent any pollution.\n\nThe department plans to take up works to desilt the Korattur lake, provide children’s park with ornamental lighting and a tree cover and build boat jetties to have visitors take a ride to the small islands.\n\n“We plan to complete the work in eight months. The lake in Ambattur will also be desilted with the available funds,” said an official. The entire project cost to improve the lakes is estimated at Rs. 60 crore.", 
    "section": "national", 
    "title": "Work on rejuvenating lakes to pick up", 
    "subsection": "tamilnadu", 
    "date": "2016-02-16"
}