{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "FIR lodged against Sarfaraj Alam\n\nRashtriya Janata Dal chief Lalu Prasad and his Minister-son Tej Pratap Yadav on Friday said action should be taken against the ruling JD(U) MLA accused of misbehaving with a couple on a running train. The MLA had, earlier, denied that he travelled on the train but after initial investigations, the Railway Police served him a notice to appear before them by Saturday evening.\n\nA police report said an FIR was lodged against JD(U) MLA Sarfaraj Alam for allegedly misbehaving with a Delhi-based passenger couple on Guwahati-Delhi Rajdhani Express on January 17. The MLA was said to be drunk at the time. The passengers, Indrapal Singh Bedi and his wife Rupasi Bedi, lodged a complaint under Sections 341, 323, 290, 504, 354A and 34 of the IPC with the Railway Police at Patna Junction.\n\nMr. Alam is a ruling party MLA from the Jokihat constituency in Araria district. “I was not even travelling in the train. So how can someone charge me with all this? It is a big political conspiracy against me,” said the MLA. But, the police reportedly found sufficient evidence to prove that the MLA was on the same train. The video footage, his mobile phone location and the witnesses’ accounts have confirmed the MLA’s journey on train, a police official told The Hindu .\n\n“If the Jokihat MLA is found guilty in the probe the JD(U) should take action against him … such things cannot be tolerated as it brings infamy to the government,” said Mr. Prasad. Significantly, Mr Alam’s father Mohd. Taslimuddin is RJD MP from the Araria Lok Sabha seat. Health Minister Mr. Tej Pratap Yadav too said “such a person should be put behind bars.” State JD(U) president Basistha Narayan Singh said the party would take action “if charges are proved against him.”", 
    "section": "national", 
    "title": "Act against JD(U) MLA for misbehaviour: Lalu", 
    "subsection": "general", 
    "date": "2016-01-23"
}