{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Enforcement Directorate has issued summons to Ralph Marshall, former non-executive director of Maxis Communications Bhd in Malaysia, as part of ongoing investigations into the Aircel-Maxis deal case.\n\nIt is learnt that the summons is being sent through the Union Home Ministry and the Indian High Commission in Malaysia.\n\nThrough the notice, the agency intends to record Mr. Marshall’s statement in the case.\n\nHe resigned from the post of non-executive director of Maxis in July last.\n\nThe ED has already sent four judicial requests to Malaysia, Mauritius, Singapore and the United Kingdom seeking assistance in unearthing the money trail.\n\nThe agency recently filed the first charge sheet in the case under the Prevention of Money Laundering Act against former Union Minister Dayanidhi Maran, his brother Kalanithi Maran, Kavery Kalanithi, K. Shanmugam, Sun Direct TV Pvt. Ltd. and South Asia FM Ltd.\n\nThe ED is conducting its probe on the basis of the charge sheet filed by the Central Bureau of Investigation in October 2014 against Mr. Dayanidhi, Mr. Kalanithi, Mr. Marshall and others.\n\nAccording to the ED, Rs. 742.58 crore was allegedly paid by the companies based in Mauritius for Mr. Dayanidhi in the two firms, Sun Direct TV Pvt. Ltd and South Asia FM Ltd.\n\nIt has been alleged that these companies are owned and controlled by Mr. Kalanithi.\n\nAssets attached\n\nIn connection with the case, the agency has also attached assets of Mr. Dayanidhi , Mr. Kalanithi , Ms. Kavery and others.\n\nThe agency is also probing the FIPB clearance given to the Aircel-Maxis deal, in terms of suspected receipt and transfer of funds in and outside India from Aircel Televentures Ltd. and Maxis, directly or indirectly, to certain suspected Indian “entities”.\n\nThe agency recently filed charge sheet against Dayanidhi Maran and others", 
    "section": "national", 
    "title": "Aircel case: ED summons ex-Maxis director", 
    "subsection": "general", 
    "date": "2016-01-23"
}