{
    "author": [
        "Ranjani Govind"
    ], 
    "text": "Among the many traditional practices that are slowly disappearing is ‘Sobaane Paadugalu’ that forms part of traditional marriage songs or Hase Haadu . These are simple melodies that are passed on through generations. To reinforce their relevance, Gamaka artist Gangamma Keshavamurthy will sing some marriage songs as part of the All-Women World Folk Arts Festival, which was inaugurated here on Friday.\n\n“I will sing some folk songs I learnt from my mother Somanayakamma. She had nearly 3,000 couplets in her memory bank,” says Ms. Gangamma, president of the Karnataka Sangeetha Nritya Academy.\n\nAs she renders the sonnet-like songs — woven in classical ragas such as Karaharapriya, Darbar and Madhyamavati — Ms. Gangamma explains, “the flow is so raga-based and classical that it envelops even the lyrical beauty found in sonnets.”\n\nSongs meant for early-morning marriage rituals were composed in morning ragas such as Bhoopala, and the lyrics were straightforward; they were prayers for the well-being of the newly-weds or jovial rendering of the long list of wedding recipes.\n\n“What is unique is Gangamma’s ability to sprinkle Hase Haadu with nuances unique to Gamaka styling, giving it a new format. We plan to record them and present them to the Karnataka Janapada Parishath for its archives,” said Srivatsa Shandilya of IntlArts, which is organising the event.\n\nThe Karnataka Janapada Parishath, created by the late folklorist H.L. Nagegowda, has nearly 200 hours of ‘Sobaane Paadugalu’ in its archives. “We have CDs of some of the best yesteryear experts like Sobaane Ramaiah,” says Sarvamangala, archives head at the parishath.\n\nGamaka artist Gangamma will render fast-disappearing marriage songs at a folk arts festival", 
    "section": "national", 
    "title": "Bid to revive tradition in Kannada weddings", 
    "subsection": "general", 
    "date": "2016-01-23"
}