{
    "author": [
        "S Prasad"
    ], 
    "text": "The idol of Ganapathy, which was allegedly stolen from the Sri Abath Sahayeswarar Temple. It was photographed by the French Institute of Pondicherry.— Photo courtesy: IFP\n\nThe French Institute of Pondicherry (IFP) has confirmed that three ancient stone sculptures presently in the custody of the United States Department of Homeland Security were stolen from a Chola-era temple in Villupuram district of Tamil Nadu.\n\nThe Department of Homeland Security Investigations, on the trail of an international antique smuggling racket, recently alerted the Tamil Nadu Idol Wing to verify the provenance of around 30 idols, mostly stolen from temples in Tamil Nadu. The team had shared photographs of various idols it recovered from various museums in the U.S.\n\nAfter receiving the samples, the Idol Theft Wing shared them with IFP by running a match against the IFP’s vast photo-library of religious art and architecture of south India. Researchers at IFP cross-matched the samples with the photo archive containing 1.35 lakh images on south Indian iconography, temple architecture and rituals, to verify the provenance of the smuggled idols and correlate them with the temples of their origin.\n\n“The samples provided by the Idol Wing included the photographs of idols of Ganapathy, Narthanar Sambandhar and Bairavar. After examining the samples with the photo archives, we believe that the idols were stolen from Sri Abath Sahayeswarar Temple located at Senthamangalam in Ulundurpet taluk in Villupuram district,” an IFP official told The Hindu .\n\nThe temple was documented by IFP in 1976.\n\nIn the past too, a number of dilapidated temples have been restored and stolen bronze idols identified using the photographic collection.\n\nThe photographs archived at the institute, which has been documenting temples, have helped the investigators trace a smuggled stone idol of Lord Arthanareeswarar and a bronze idol of Lord Nataraja to the National Gallery of Australia.\n\nBoth were later handed over by former Australian Prime Minister Tony Abbott to his Indian counterpart Narendra Modi.\n\nAround 30 ancient idols that were either smuggled out of the country or exported have been identified by IFP.\n\nThe IFP has been helping establish provenance of idols based on images supplied by U.S. Homeland Security sleuths investigating suspected international antique smuggler Subash Chandra Kapoor.\n\nThe samples provided by U.S. investigators included the photographs of the idols of Sambandhar and Lord Ganapathy which are under their custody.", 
    "section": "national", 
    "title": "‘Chola-era idols in U.S. custody belong to Villupuram temple’", 
    "subsection": "general", 
    "date": "2016-01-23"
}