{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "Student-activists stage a protest in New Delhi on Friday against the University of Hyderabad for the suicideof Dalit research scholar Rohith Vemula.— Photo: Sandeep Saxena\n\nThe student outfits see ABVP as adversary, but they do not toe the line of the Left either\n\nOn January 3, Dalit students of Maharshi Dayanand University, Rohtak, celebrated their own version of Teachers’ Day to coincide with the birth anniversary of Savitribai Phule, a prominent social reformer who founded a girls’ school in Pune in the mid-19th century.\n\nThe students are members of the Dr. Ambedkar Students’ Front of India (DASFI), headed by Sanjay Bauddh, a student of Chinese language in the university, and the programme had discussions by Professors and Dalit thinkers. The organisation has its presence in universities in Haryana, Rajasthan, Madhya Pradesh and Uttar Pradesh.\n\nFor these students, September 5, the birth anniversary of India’s second President, S. Radhakrishnan, is not Teachers’ Day, as others everywhere celebrate.\n\nDalit student politics is making its presence felt in many Indian universities. With the alleged suicide of a Dalit student at the University of Hyderabad, this movement is suddenly in the news. And Dalit student politics has its own language and beliefs.Many of their outfits celebrate the birth anniversary of B.R. Ambedkar and Jyoti Rao Phule, holding discussions on their lives. Campuses across India have multiple Dalit organisations, some contesting in polls and some staying off them.\n\nThe DASFI believes all-pass for students until Class 8 is working against Dalits, as their children in government schools are not learning enough to compete with private-school students, many from the so-called upper castes. The organisation feels commercialisation of education poses a threat to reservation. “Often, mainstream organisations are wary of Dalit outfits. We deprive them of a supply of Dalit foot-soldiers even where we are not in the fray,” said Arvind Kumar, who has been active in the United Dalit Students’ Forum (UDSF) at Jawaharlal Nehru University (JNU).\n\nOne organisation that the UDSF identifies as an adversary is the ABVP, affiliated to the RSS. “They celebrate ancient India and Hindu texts and we despise them, seeing in them the roots of discrimination. We also despise the Youth For Equality as their politics is against reservation,” said Mr. Kumar, a student of Political Studies.\n\nThey are not anti-Left, though their approach to justice is different. Dalit activists say the Left’s class analysis cannot combat the cultural hegemony of caste elites. Only a Dalit can be a member of the UDSF. At their meetings, often at a hostel mess after dinner, they have been known to request non-Dalits to leave. Sometimes, they encounter violence on campuses.\n\nAt the JNU, the ABVP, Dalit activists say, scuffled in 2012 with the UDSF and the All-India Bahujan Students’ Forum, having many members from most backward castes, amid tensions over the celebration of Mahishasur, a demon ‘slain’ by Goddess Durga, on the campus.\n\nReservations and discrimination are major issues for these organisations.\n\n“We do not talk about water, hostels, etc., as all student organisations talk about them. But we take up issues of discrimination and reservations, which other organisations don’t take up,” Mr. Bauddh said.\n\nOne main issue for the DASFI has been to track what it claims is a discrepancy between the marks Dalit students get in exams — where the examiner doesn’t know their names — and internal assignments, wherein their identity is known. “Students getting good marks in exams fare badly in assignments. This is a caste bias,” he said.\n\nCut to the JNU, and the UDSF has its own innovative way of tracking what it labels discrimination. The organisation has filed RTI applications in the last several years to find out the break-up of marks of students appearing for the M.Phil. entrance written test and interview. “I appeared for the M.Phil. entrance test at three centres. My interview marks out of 30 are 21, 16 and 2. The responses to RTI applications in the last several years have revealed that many Dalit students got zero out of 30,” said a member of the UDSF.\n\nThe member, however, said that for all the problems, the JNU, the Tata Institute of Social Sciences (Mumbai) and the University of Hyderabad were the most “inclusive” campuses.\n\nThe UDSF does not contest in polls, unlike the DASFI.\n\nAs for cases of discrimination, the UDSF takes legal recourse.", 
    "section": "national", 
    "title": "Dalit activism is now a reality across campuses in India", 
    "subsection": "general", 
    "date": "2016-01-23"
}