{
    "author": [
        "National Bureau"
    ], 
    "text": "Members of Parliament, cutting across party lines, issued a statement on Friday against the Centre’s bid to strip Aligarh Muslim University and Jamia Millia Islamia University of their minority status, seeing this as part of an “unholy agenda.”\n\nThey said that they would launch a signature campaign, approach President Pranab Mukherjee and raise the matter in Parliament in the upcoming Budget session.\n\n“We, the Members of Parliament, believe that this is a sinister move to promote an unholy communal agenda and dilute the special character of these two premier seats of learning,” the statement said. The signatories are Pramod Tiwari, (Congress), K.C. Tyagi (JD-U), Sukhendu Sekhar Roy (Trinamool Congress), D.P. Tripathi (NCP), D. Raja (CPI), Jay Prakash Yadav (RJD), Bhagwant Mann (AAP) and Ritabrata Banerjee (CPI-M), according to a press release issued by Mr. Tyagi.\n\nThey also condemned the statement of Attorney-General Mukul Rohatgi that the two institutions are not minority institutions.\n\n“The Attorney-General has blatantly tried to outrage the rich Ganga Jamuni Tehzeeb (composite culture) by mentioning before the Supreme Court that these are not minority institutions,” the MPs said.\n\nThe BJP, however, said the government was only reiterating the stand taken by previous governments.\n\nParty leader M.J. Akbar said the Constitution mentions three Central institutions — Delhi University, BHU and AMU.\n\n“When they are included in the Constitution, we cannot move away from the Constitutional obligations. These are Central institutions and they will remain so. They cannot be converted into minority institutions,” he said.\n\nThis is a sinister move to\n\npromote an\n\nunholy communal\n\nagenda, say MPs", 
    "section": "national", 
    "title": "‘Do not dilute character of minority universities’", 
    "subsection": "general", 
    "date": "2016-01-23"
}