{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "These Chhattisgarh women have testified to police about incident, says lawyer\n\nEight tribal women from Bijapur district of south Chhattisgarh have accused the security forces of “repeated gang rape and physical torture” between January 11 and 14. Four others have alleged that they were “molested” and their property was “plundered” by the security personnel.\n\nThe women belong to Nedra village and surrounding Para (surrounding small village localities) under the Basaguda police station limits of Bijapur.\n\nAccording to Isha Khandelwal, the lawyer of the victims, eight women had testified to the police that they were gang-raped by security men.\n\n“There are many women in the village who have been raped by the security forces, of whom 12 gave a statement to the police. Eight have said that they have been gang-raped. Some of them have even named the policemen who raped them. The incident took place between January 11 and 14,” Ms. Khandelwal told The Hindu .\n\n“The women came to the Bijapur district headquarters on January 18 but the police did not register their complaint. The FIR was lodged only last night [on Thursday night] after avoiding it for four days,” the lawyer said.\n\nForced to file FIR\n\nAccording to some local sources, the police were forced to file an FIR after tribal activist and Aam Aadmi Party leader Soni Sori addressed a press conference with all the victims on Thursday.\n\n“All the victims told a press conference that they were gang-raped by the security men. Most of these women are married and have kids. Each of them has claimed that they were raped by more than three-four security men,” Ms. Sori told this reporter.\n\nWhen asked about the allegations, Bijapur Superintendent of Police K.L. Dhruw admitted that the police force was present in the Nedra area between January 11 and 14.\n\n“Some NGOs have raised this issue. But I have not seen the entire matter as I was away from the district headquarters and returned a day ago,” said the SP.", 
    "section": "national", 
    "title": "Eight tribal women allege gang-rape by security forces", 
    "subsection": "general", 
    "date": "2016-01-23"
}