{
    "author": [
        "T K"
    ], 
    "text": "Indian students turned back from entering the United States last month were only “denied entry” and not deported, Joseph M. Pomper, Minister-Counselor for Consular Affairs, U.S. Embassy, said on Friday.\n\nMr. Pomper also said the two U.S. universities — Silicon Valley University, San Jose and Northwestern Polytechnic University, Fremont — to which most of these students were headed, were not blacklisted as was being made out..\n\n“These universities are not blacklisted. They issue I-20s (student visas). As long as a student is bona fide, they should not have any problem,” Mr. Pomper said. Nearly 100 students were sent back by the U.S. in the recent past.\n\nAsked how the United States could not honour their own visas issued to these students, he said a visa was only a permission to get to a port of entry. He said that currently 1,32,000 Indian students were studying in the United States, second only to China. “India had a 30 per cent increase since last year.”\n\nMr. Pomper, while refusing to go in to the details of these cases, added that these students could reapply for U.S. visas in the future. “Every case is adjudicated individually on its merit,” he said.\n\nHe added that prospective students could get in touch with EducationUSA to get real and accurate information about universities, visa processes and other details.\n\n“Many countries, including the U.S. and India, have a two-step process. A visa is a permission to come to a port of entry. At the port of entry, the Customs officials, border control, immigration officials… they are the ones who decide who would be admitted, why they would be admitted and under what status they would be admitted,” he said.\n\nThe issue has snowballed into a controversy with students alleging that they were harassed by U.S. immigration authorities. India’s External Affairs Ministry, on December 30, issued an advisory to Indians travelling to the United States to carry additional supporting documents with them.\n\nTerming the hike in visa fees for H1B and L1 visas as “Congressional decision”, Mr. Pomper said India had got two-thirds of the H1B visas and one-third of the L1 visas till date.", 
    "section": "national", 
    "title": "Indian students ‘denied entry’, not deported, says U.S. official", 
    "subsection": "general", 
    "date": "2016-01-23"
}