{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "“India and France are carrying out Shakti 2016 in Rajasthan which reflects our common interests,” French Ambassador to India Francois Richier said on Friday, referring to the joint exercise under way in Rajasthan, which focusses on counter-terror and counter-insurgency operations.\n\nCommentators have pointed out that there are differences between the French and Indian experience of handling terror, but both sides will benefit by exchanging ideas and strategies for a larger goal. “Terror threats to France are from Syria, Iraq and other such unstable spots faraway from French borders. But the terror we face in India is of cross-border nature, from Pakistan. That is why we need international collaboration so that financial channels and political supporters of state- sponsored terrorism can be dealt with by using the United Nations,” said Gen. (retd.) Ved Prakash Malik, former Chief of the Army Staff.\n\n“Collaboration with France on counter-terror will also help to bring in anti-terror resolutions at the United Nations and on other multilateral platforms in near future,” he said, explaining that the armed counter-measures were not sufficient to deal with terror sponsors and terrorists as the global war on terror demanded a multi-layered strategy.\n\nLast year, India’s Permanent Representative to the United Nations spoke about the organisation’s inability to give a “robust” response to international terrorism after the India-backed resolution against 26/11 plotter and LeT commander Zakiur Rehman Lakhvi failed to go through the Security Council because of Chinese opposition.\n\nGreater French support for India’s decades-old anti-terror struggle would help India attain both regional as well as global targets in the fight against terrorism, Gen. Malik said.", 
    "section": "national", 
    "title": "‘India, France can gain by sharing strategies against terrorism’", 
    "subsection": "general", 
    "date": "2016-01-23"
}