{
    "author": [], 
    "text": "Illustrators work on various projects at Comic Republic founded by Jide Martins in Lagos in Nigeria.— Photos: AFP\n\nYoung illustrators are creating caped crusaders who are born, raised and fight crime in Africa, and the response has been tremendous.\n\nIn the first issue of Aje , a Nigerian comic offering a new breed of superheroes strictly from Africa, university student Teni casts a curse on her friend in a rush of jealous rage and purple lightning.\n\n“Koni dara fun o ni yi aye (it will never be better for you in this life),” snarls Teni in Yoruba, a language and one of the major ethnic groups in Nigeria. Teni is the creation of Jide Martins, the founder of Comic Republic, one of a handful of comic startups making African superheroes to rival Iron Man, Batman and Spiderman.\n\nUnlike Storm, a beloved X-Men superhero who is a dual citizen of the United States and the fictional country Wakanda, the superheroes Mr. Martins brings to life are born and raised in Africa — and fight there too.\n\n“In university, I started wondering what it would be like if Superman came to Nigeria,” Mr. Martins said at his flat in Lagos, where his dining room doubles as a studio for his team of young illustrators. “People are trying to break away from the norm and find new things to aspire to,” he said. “You don’t have to be white to save the world.”\n\nDigital and free\n\nIn 2013, Mr. Martins, a slim 37-year-old with a freckled nose and goatee beard, published his first issue of Guardian Prime , a hero wearing a forest green and snow white super-suit in the colours of the Nigerian flag. Since then, readership has swelled from 100 an issue to over 28,000. Despite the 30-plus page comic books being free and only available as a digital download, Mr. Martins is able to generate enough money through advertising and spin-off projects, including educational booklets on malaria featuring his characters, to keep the business running. “People had this idea that African comics had to be with people in traditional clothes, but I don’t agree with that,” Mr. Martins said. “Let them have Nigerian names, saving people in Nigeria, but let’s put them in spandex.”\n\nMr. Martins isn’t the only one realising the potential of the burgeoning African superhero industry, which adapts the continent’s long tradition of voodoo and the occult for a modern-day audience.\n\nRoye Okupe is the creator of E.X.O. — The Legend of Wale Williams , a graphic novel set in Lagoon City, a futuristic Lagos riddled with corruption and besieged by an extremist insurrection.\n\nOkupe, a 30-year-old who grew up in the Nigerian megacity of 20 million people, saw a market for an African character grounded in reality. “You’re probably not able to name five African superheroes off the top of your head,” Mr. Okupe said from Washington, where he is based. “And as much as I love Black Panther, he’s from a fictional African country.”\n\nAt a time when superheroes dominate the international box office, Mr. Okupe says Nigerians are uniquely poised to offer alternatives to the waspy roster of Clark Kents and Peter Parkers.\n\n“Ten years ago if you released a superhero from Nigeria, I don’t think anybody would have cared,” Mr. Okupe said. “But now that it’s a popular industry, people want diversity.”\n\nFor scholars on comic books, African superheroes are an inevitable reaction to a predominantly white cast of caped crusaders.\n\n“I think it’s long overdue,” said Ronald Jackson, co-editor of the 2013 book Black Comics: Politics of Race and Representation . “As we begin to appreciate other identities, we’re going to become increasingly more embracing of the kind of images coming out of African comics.” Back in the Comic Republic studio, the team of illustrators — all under 30 — hope that one day their characters will appear on the silver screen.\n\nSoon in theatres?\n\nThey’re betting that their African cast, including witches stronger than the Jedi warriors in Star Wars , will be more than enough to keep international audiences excited.\n\n“You hear about Greek gods like Zeus but no one has heard of Shango, the god of lightning in Yoruba,” 23-year-old illustrator Tobe Ezeogu said. “It's a different take to what people are used to.” — AFP", 
    "section": "national", 
    "title": "Make way for Nigerian superheroes as comic book start-ups grow", 
    "subsection": "general", 
    "date": "2016-01-23"
}