{
    "author": [], 
    "text": "Facebook has launched Sports Stadium — a dedicated place to experience sports in real time with your friends and the world.\n\nIn Facebook Sports Stadium, you can see posts from your friends and their comments on plays as well as hear commentary from teams, leagues and journalists with easy access to their Facebook Pages.\n\nLike and comment\n\nYou can follow the action as the game unfolds with a ‘live play’ mode, and even like, comment, and share individual games.\n\nYou can also get up to speed quickly with live scores and the most discussed plays.\n\n“With 650 million sports fans, Facebook is the world’s largest stadium. People already turn to Facebook to celebrate, commiserate, and talk trash with their friends and other fans,” wrote Steve Kafka, product manager, in a Facebook Post.\n\nWith Facebook Sports Stadium, it may be tough for Sports Twitter to keep up as Twitter has only 320 million monthly users.\n\n“We’ve now built a place devoted to sports so that you can get the feeling you’re watching the game with your friends even when you are not together,” Mr. Kafka said.\n\nWith Facebook Sports Stadium, all the content on Facebook related to the game is assembled at one place and it comes in real time and appears chronologically.\n\n“It’s a second-screen experience that we hope makes watching the broadcast even better,” Mr. Kafka said.\n\n“You can get to Facebook Sports Stadium by searching for the game, and we will surface new ways to get there as the product evolves,” he said.\n\n“We’re rolling this out for American football games and will support other sports around the world like basketball, soccer, and more soon. The experience is available now on iPhone in the U.S., and will expand to other platforms in the coming weeks,” a Facebook post said. — IANS", 
    "section": "national", 
    "title": "Now, enjoy sports in real time on Facebook", 
    "subsection": "general", 
    "date": "2016-01-23"
}