{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "C.U. Singh, senior advocate and counsel for Arundhati Roy, on Friday read out in the Supreme Court her article published in an English magazine on May 9 last year and argued that its contents only revealed the author’s personal anguish at the plight of wheelchair-bound Professor G.N. Saibaba, who is 90 per cent disabled and suffers from a degenerative medical condition that required constant medical care.\n\nShe contended there was no “game plan” or “ mala fide motive” to interfere in the administration of justice on behalf of the Delhi University professor, lodged in the infamous ‘Anda’ cell of the Nagpur prison on the allegation that he had Maoist links.\n\n“By criticising the actions or the lack thereof, of the legislature, the judiciary or the executive, a citizen is merely exercising his or her fundamental right to express ‘Opposition’ to the government or one of its wings… Opposition is sacrosanct and indispensable to the functioning of democracy, and more so to that of a democratic welfare State,” Ms. Roy said, opposing the December 23, 2015 criminal contempt notice issued by the Bombay High Court.\n\nThe Bench, however, declined Mr. Singh’s plea to exempt Ms. Roy from appearing before the single judge on January 25 as passions were whipped up against her.\n\n“Why should she have any fear of going to court on Monday? We are there, we have appreciated the arguments made by you, we have thought about it carefully, applied our minds... Go appear in court,” observed Justice J.S. Khehar, sitting on the Bench with Justice C. Nagappan.\n\nMr. Singh argued that the single judge had deviated from procedure while entertaining the plea by some intervenor-advocates to initiate contempt proceedings against Ms. Roy. As per the procedure, such an application from intervenors should be referred to the Chief Justice of the High Court to decide prima facie whether there was any cause for action. Mr. Singh submitted that the High Court judge had even wondered why the State government and the police should respond to the article.", 
    "section": "national", 
    "title": "Opposition must in democracy: Roy", 
    "subsection": "general", 
    "date": "2016-01-23"
}