{
    "author": [], 
    "text": "Nayantara Sahgal says she has decided to take back her Sahitya Akademi award as there is no provision to return it, and Nand Bhardwaj says that he respects the Akademi's condemnation of the killing of writers.\n\nCulture Ministry says nine other writers have agreed to follow suit\n\nThe Sahitya Akademi on Friday said that some of the writers, including Nayantara Sahgal, had agreed to take back the awards they had returned in protest against “growing intolerance” in the country.\n\n“The Sahitya Akademi has started sending back the awards to the writers... It has already been sent to Nayantara Sahgal. Another writer Nand Bhardwaj has also agreed to take back the award. It will be sent to other writers as well,” Sahitya Akademi president Vishwanath Prasad Tiwari said.\n\nHe said the Akademi was also sending a copy of its resolution, which was passed in the October meeting, to all writers mentioning that there was no provision in its constitution to return the honours.\n\nAbout 40 writers had returned their awards in the past few months to the Sahitya Akademi in the backdrop of the Akademi’s silence on the murder of fellow writer M.M. Kalburgi as well as against the “communal” atmosphere in the country following the Dadri lynching incident.\n\nOn October 23, the Sahitya Akademi passed a unanimous resolution appealing to State and Central governments to take steps to prevent such incidents and asked authors to take back the awards they had returned to protest against “rising intolerance”.\n\n“The Akademi strongly condemns the killing of writer Kalburgi and appeals to the State and Central governments to take steps to prevent such incidents in the future,” Krishnaswamy Nachimuthu, an executive committee board member had said, after the nearly two-hour meeting.\n\nMeanwhile, a Culture Ministry source said, “There is a list of 10 writers who have agreed to take back the awards they had returned. Sahgal and Bhardwaj are two confirmed names on the list.”\n\nAccording to the source, Ms. Sahgal decided to take back her award as there was no provision to return the award, while Rajasthani writer Bhardwaj was “satisfied” with the response of the Akademi, condemning incidents of violence against writers.\n\nAfter agreeing to take back the Sahitya Akademi award that he returned, writer and former Doordarshan director Nand Bhardwaj, on Friday said the Akademi cannot be held responsible for the rising intolerance in the country.\n\nSpeaking to reporters, Mr. Bhardwaj said: “The situation in the country was different when we returned the award. At that time writers and rationalists were being killed. [Kannada writer] Kalburgi was with the Sahitya Akademi and that is why so many award-winners objected to the Akademi’s silence over his killing.”\n\nMr. Bhardwaj, a Rajasthani and Hindi writer, said the Akademi held a meeting when the awards were being returned and condemned the killing. “The Akademi has stated that it would stand with the writers. I respect the Akademi’s decisions. Intolerance and other issues remain, but now I wouldn’t hold the Akademi responsible since that’s not its mandate,” he said.\n\nWelcomes decision\n\nMeanwhile, Culture and Tourism Minister Mahesh Sharma welcomed the decision of the writers to take back the awards. “This is a welcome step,” he told reporters when asked about the move by some of the writers. Asked about the number of writers who had agreed to take back the awards, he said, “I don’t know the number, but if the writers have decided to take back the awards, I welcome their decision.” — PTI\n\n(With additional reporting by Kavita Upadhyay)", 
    "section": "national", 
    "title": "Sahgal to take back award", 
    "subsection": "general", 
    "date": "2016-01-23"
}