{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Joyride on luxury vehicle ends in the arrest of Haji Amin Yusuf Khan; victims include 4-year-old boy\n\nThe car which hit five people on Mohammed Ali Road in Mumbai on Thursday night.— Photo: Vivek Bendre\n\nIn yet another instance of out-of-control drivers endangering lives on Mumbai’s roads, a BMC contractor failed to handle the acceleration of the supercar he was driving and hit five persons sleeping on a pavement on Mohammad Ali Road on Friday, injuring them.\n\nThe victims included a four-year-old boy.\n\nThe police on Friday arrested Dongri-based Haji Amin Yusuf Khan, 46, for allegedly injuring five persons after he lost control over his car. According to the Pydhonie police, the incident occurred around 12.30 a.m. at the Bhendi Bazaar junction. Khan was trying his hand at driving his friend’s car, a top-end model said to have sold for over Rs. 2 crore in India.\n\nSenior Police Inspector Sunil Kavlekar with Pydhonie police station said: “Khan’s friend told him to be careful as the car picks up speed very quickly. Instead of slowing down, Khan accelerated saying he wanted to test the car’s speed. The car shot ahead and hit five people sleeping on the pavement.”\n\nKhan allegedly fled the scene, even as eyewitnesses informed the police about the incident.\n\nWhen a police team reached the spot to make inquiries, Khan, who is well-known in the area, was identified by eyewitnesses and a manhunt was launched to apprehend him.\n\nMr. Kavlekar said: “The injured were taken to J.J. Hospital. Meanwhile, Khan reached the hospital a short while later to get himself checked. Our team had received information during inquiries that he was on his way to the hospital and nabbed him there. He was subjected to medical tests and was not found to be drunk at the time of the incident. He has been charged with causing injury due to rash and negligent driving under the Indian Penal Code and the Motor Vehicles Act.”\n\nKhan was produced in a metropolitan magistrate’s court on Friday and released on bail.", 
    "section": "national", 
    "title": "Speeding car hits Mumbai pavement dwellers, injures 5", 
    "subsection": "general", 
    "date": "2016-01-23"
}