{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Arrests come aheadof French President’s three-day visit\n\nThe family members of Mudabbir Sheikh, who had allegedly designated himself as the Ameer of the Islamic State in India,at his residence in Mumbai on Friday.— PHOTO: Kistu Fernandes\n\nThe Union Home Ministry did not say that the young men arrested in a nationwide crackdown on terror on Friday belonged to the Islamic State. A spokesperson said, “They were radicalised online. It is too early to say whether they belonged to any particular outfit. Some IED materials have been recovered from Mumbai and Hyderabad.”\n\nThe arrests come ahead of French President Francois Hollande’s three-day visit to India from Sunday. The security establishment of both sides have heightened sensibilities about a possible threat from the IS. The French sensitivities regarding the IS, which has repeatedly carried out attacks in Paris, was one of the reasons the Ministry tried to play down the crackdown, sources said.\n\nThe NIA registered a case in Delhi and all the accused are being brought to the capital for further interrogation. Various sections of the Unlawful Activities Prevention Act pertaining to conspiracy, recruitment for a terrorist outfit and being members of a banned organisation have been invoked.\n\nMumbai resident Mudabbir Sheikh (33), who was among those arrested, had designated himself as the Ameer of the IS in India, sources said.\n\nLate on Friday, the NIA arrested another accused, Khan Mohammad Hussain (36), from Mumbai.\n\nThe NIA officials picked up Sheikh from his Mumbra residence in the early hours of Friday. Sheikh is a former Web developer who holds a diploma in Software Engineering. The money received by Sheikh could have been used to procure weapons, the Ministry spokesperson said.\n\nOfficials said he had been under the surveillance of intelligence agencies for six months, but was in touch with a former Indian Mujahideen (IM) member, Mohammad Shafi Armar, for the past two-and-a-half years. He was in touch with several other IS members in Syria as well, officials said.\n\nSheikh’s wife Huzma (28) said a team of NIA officials reached their residence at 3 a.m. on Friday. “My husband was questioned in the kitchen for an hour, with the door closed, after which they came out and said that they were taking him with them for further questioning,” she said.\n\nSheikh was produced in a special NIA court and the NIA was granted transit remand for three days. In its remand application, the NIA said Sheikh had been charged with serious offences and charges related to waging war against India and countries friendly to it. Investigators have recovered Rs. 6 lakh from Sheikh which he allegedly got through the hawala route.\n\nOfficial says it is\n\ntoo early to say if the arrested men belong to any particular outfit", 
    "section": "national", 
    "title": "Terror recruits were radicalised online: MHA", 
    "subsection": "general", 
    "date": "2016-01-23"
}