{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "I am a good friend of Modi but will fight his policies and ideology, says Tarun Gogoi.\n\nAssam Chief Minister and senior Congress leader Tarun Gogoi on Friday said the party would “fight alone” in the coming Assembly elections, ruling out the possibility of forging a formal alliance with other political groups.\n\n“There will be no seat sharing. There will be no ‘mahajoth’,” Mr. Gogoi said.\n\nBut he was quick to add that the party was talking to “likeminded” political outfits so as to establish an informal tie-up with a common goal to defeat the BJP.\n\n“Understanding means vote for the Congress but not the BJP. Vote for the AGP but not for the BJP,” he added.\n\nThe 73-year-old Congress veteran, who has been ruling Assam for the third consecutive term, met Congress vice-president Rahul Gandhi on Thursday. The purpose of the meeting, he said, was to discuss the election strategy.\n\nA senior Congress leader privy to the meeting told The Hindu that Mr. Gandhi expressed his concern to Mr. Gogoi over the BJP’s rising influence in upper Assam, where several Congress workers who exerted strong influence in tea plantation districts had joined the BJP in the last few months.\n\nAt the press meet, Mr. Gogoi did recognise the BJP as his major political challenge, saying that the elections would be an open battle between him and Prime Minister Narendra Modi. “If you ask me individually, I am a good friend of Modi,” said Mr. Gogoi. “But I will fight his policies and ideology.”\n\nThough Mr. Gogoi acknowledges that the BJP has made significant gains in Assam, he said he “welcome[s] tough election.” “A tough election makes a man tougher,” he said.\n\nRejecting the contention that anti-incumbency factor might hurt the Congress in Assam, he said such things only mattered if a ruling party failed to live up to the expectations of the people.\n\n“Whatever little anti-incumbency is there, it will be overcome by our development work,” he said.", 
    "section": "national", 
    "title": "We will go it alone in Assam, says Gogoi", 
    "subsection": "general", 
    "date": "2016-01-23"
}