{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "Activist plans to alight from a helicopter to offer worship at the prohibited inner platform\n\nActivists of the Ranragini Bhumata Brigade have decided to offer worship at the platform of the Shani Shingnapur temple, which has been out of bounds for women.— File photo\n\nWith just three days to go for Republic Day, the symbolic struggle in Maharashtra to break the gender barrier at the Shani Shingnapur temple in Ahmednagar is turning into a battle of wills between activists of the Ranragini Bhumata Brigade and the local administration.\n\nThe brigade, headed by activist Trupti Desai, has decided to stage a flamboyant pageant by offering worship to Lord Shani at the sacred platform which has been out of bounds for women as per centuries-old tradition. According to the plan, Ms. Desai will alight from a helicopter to offer worship at the prohibited inner sanctum.\n\nThe brigade’s demonstration, and its refusal to call it off, has discomfited the district authorities, which are worried about the effects of a possible backlash on Republic Day. The brigade has gathered 400 women.\n\n“There is a strong apprehension that the property might be in serious jeopardy if the Bhumata Brigade goes ahead with the demonstration,” said Shivkumar Dighe, adding that the Shani Temple Trust comes under the Charity Commissioner’s duties.\n\n“While the Constitution accords every individual the right to protest, there is nothing constitutional about a gathering of 400 persons performing rituals at a temple which could offend locals and result in a fracas, causing possible damage to property. So, the Bhumata Brigade has been restrained from entering the prohibited, inner sanctum of the temple till further orders,” Mr. Dighe said.\n\nThe Ahmednagar District Collector Anil Kawade has banned the assembly of people till February 4. The Bhumata Brigade’s protest could coincide with political rallies around the area and give rise to a law and order situation, the order said.\n\nThe brigade, however, remains defiant.\n\n“We were prepared for these restrictions. We are planning to book a helicopter and are seeking permission for the flight from the Pune District Collector,” said Ms Desai.\n\nThe Brigade’s repeated assertion of breaching the inner sanctum has earned the resentment of tradition-bound locals, who perceive the outfit’s actions as a mere “publicity-garnering stunt”.\n\nBesides administrative objection, the brigade’s plan has attracted strident opposition from the fringe-right, represented by the Sanatan Sanstha, the Hindu Janjagruti Samiti (HJS) and its women’s wing, the Ranragini Shakha.\n\nBracing for a showdown with the brigade’s activists, these organisations have mobilised 2,000 women to form a protective ring outside the temple in collusion with the locals of Shani Shingnapur village.\n\n“Women villagers at Shani Shingnapur have agreed to support us. If anyone tries to break the tradition, we will stop them with the help of police,” said Monika Gawade of the Ranragini Shakha.", 
    "section": "national", 
    "title": "Women plan to enter sanctum on R-Day", 
    "subsection": "general", 
    "date": "2016-01-23"
}