{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Nityashree honoured at the music fest\n\nPresenting ‘Muthamizh Peraringnar’ award and ‘porkizhi’ on Carnatic musician Nityashree Mahadevan, Meenakshi Temple Board of Trustees Chairman and industrialist Karumuttu T. Kannan said that the establishment of sabhas such as Tamizh Isai Sangam here helped to a great extent in spreading the nuances of the 3,000-year-old ‘Tamizh isai’ to the masses.\n\nPresiding over the inaugural of the 10-day-long 41st Tamizh Isai Vizha at Rajah Muthiah Mandram, he said that the founding fathers of this great institution for Tamizh Isai earned a special niche in the world of music.\n\nFrom time immemorial, Madurai had always been the preferred choice for very many noted musicians like Ms. Nityashree Mahadevan, who had sung more in Tamil than in other languages.\n\nThis was a major factor for Tamizh isai to be remembered.\n\nCommendable work\n\nApart from conducting such music festivals every year for the last four decades, the role played by Tamizh Isai Sangam in disseminating “Thevara paadal” to as many as 2,000 students in the past was commendable.\n\nEven when the late M.A.M. Ramasamy, who was the president of the Sangam here, was not keeping good health, he made it a point to be present here at the annual music festival and this showed his love for music, Mr. Kannan said and added that in yesteryears, when music was dominated by languages such as Telugu and Sanskrit, the establishment of institutions like Tamizh Isai Sangam gave a new life to Tamizh Isai and took it to a new high.\n\nIn her acceptance address, Ms. Nityashree said that it was a great honour to have been bestowed with the award from Tamizh Isai Sangam.\n\nAs long as visionaries such as the founders of Tamizh Isai Sangam contributed, music, especially, Tamizh isai, would live long.\n\nSangam president A.C. Muthiah welcomed the gathering. Kundrakudi Adheenam Ponnambala Adigal released a souvenir. Devaki Muthiah lit the kuthuvilakku. Sangam trustee S. Mohan Gandhi, treasurer R.M. Somasundaram spoke.\n\nLater, Sirkazhi Sivachidambaram presented a vocal concert.", 
    "section": "national", 
    "title": "10-day Tamizh isai vizha begins", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}