{
    "author": [
        "Dennis S"
    ], 
    "text": "In the next batch of voluntary repatriation, 12 Sri Lankan refugees, living in various camps across the State, would be leaving for Colombo from Tiruchi on Friday.\n\nTheir repatriation is being assisted by the United Nations High Commissioner for Refugees (UNHCR) and financially supported by the German Consulate in Chennai.\n\n“I came here with my family in 2006 when there was trouble in my native Trincomallee due to the conflict [civil war]. We fled Sri Lanka by boat and reached Arichamunai near Rameswaram. Now, I hear things have changed for the good. I have already sent my family and I’m going now,” says C. Manimaran.\n\nWhile one of his two daughters is married and living in India, his wife, another daughter and son have returned to the island already. “I remained here to clear some debts. I have repaid them now and I am now free to return,” he notes.\n\nThe 48-year old, who has been working as a painter in the neighbourhoods of Vedar Colony in Coimbatore district, is planning to take up fishing there.\n\nSo does he think that conditions in the island have improved?\n\n“I am going because I heard the situation has improved. Five to six more families from this camp have already registered for repatriation and they would return in a few days,” observes Mr. Manimaran. The camp in Vedar Colony has about 300 refugee families.\n\nAccording to the Consul-General of the Federal Republic of Germany in Chennai Achim Fabig, the Consulate has agreed to assist 420 Sri Lankan refugees living in India with a budget of over Rs. 37 lakh (50,000 euros).\n\nThe UNHCR has been assisting the voluntary repatriation of Sri Lankan refugees. An official of the UNHCR says the German Consulate in Chennai expressed interest in supporting the repatriation and its support is expected to continue till March . With the assistance of UNHCR, 452 refugees returned to the island last year.", 
    "section": "national", 
    "title": "12 Tamil refugees to return to Sri Lanka tomorrow", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}