{
    "author": [
        "V S"
    ], 
    "text": "Traffic police created two green corridors to enable Fortis Malar, Apollo Hospital to receive the organs\n\nA poor washerman family’s magnanimity in its time of grief saved the lives of eight people.\n\nOn Monday evening, Ramesh, a first year engineering student who was riding a two-wheeler back home from college, was seriously injured in a head-on collision with another two-wheeler. Passers by admitted him to the nearby Dharapuram Government Hospital. He was later referred to the KMCH hospital for further treatment.\n\nRamesh, a resident of Kilangundal village near Mulanur in Dharapuram Taluk, was declared brain dead on Tuesday morning. His father Ramalingam, who had learnt about organ donation from newspapers, agreed to donate Ramesh’s organs.\n\nA team of doctors from KMCH and the Coimbatore Government Hospital completed the formalities, and on Wednesday, Ramesh’s heart, liver, pancreas, kidneys, corneas and skin were donated.\n\nWhile liver and one kidney were transplanted to patients registered in KMCH, the heart was sent to Fortis Malar and the pancreas to Apollo Hospital in Chennai. Another kidney, the corneas and skin were sent to other private hospitals in Coimbatore.\n\nOn Wednesday, the traffic police created two green corridors to enable Fortis Malar and Apollo Hospital to receive the organs for transplant. “We received a call on Tuesday night and reached Coimbatore around 8.40 p.m. We wanted both the heart and the lungs but unfortunately the lungs were not in good condition. The heart was harvested this morning and it reached the hospital around 10.30 a.m.,” said K.G. Suresh Rao, head of Cardiac Anaesthesia at Fortis Malar Hospital.\n\nWithin an hour, the organ was transplanted in a 14-year-old Russian boy. He had suffered a stroke last month as his heart was weak and blood clots had travelled to his brain. It made him a candidate for transplant, said K.R. Balakrishnan, a cardiothoracic surgeon who did the surgery. The boy is recovering in the ICU. The second green corridor was created to transport the pancreas which arrived by a Jet Airways flight around 1.58 p.m. A 33-year-old recipient at the hospital, who was suffering from type 1 insulin-dependent diabetes mellitus, was transplanted with the organ. Surgeon Anil Vaidya, who led the team, said the patient had been suffering from diabetes since the age of 12. “Diabetes affects a lot of organs, the heart, the blood vessels eyes and kidneys. This chap had lost all the warning signals of low sugar,” Dr. Vaidya said.\n\nA routine visit to the clinic proved lucky for the patient. Dr. Vaidya said the patient’s blood sugar did not normalise even after a cup of tea, indicating that it was a severe attack of very low sugar. “Mostly world over, pancreatic transplants are done in conjunction with kidney. We usually take the patient for dialysis. But this patient did not need a kidney. This is the first time in India we did a lone pancreas transplant. He is now cured of diabetes and does not require insulin,” Dr. Vaidya said.\n\nThe organ left Coimbatore airport at noon and reached Apollo Hospital at 1.58 p.m. The surgery took about five hours. Dr. Vaidya said the pancreas was functioning normally in the transplanted patient.", 
    "section": "national", 
    "title": "Brain-dead student injects life into 8 others", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}