{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "Noting that some political leaders are considered as “demigods” by their followers, the Karnataka government on Wednesday asked the Supreme Court whether money allegedly received from party cadres as “birthday gifts” can be categorised as a legal source of income.\n\nThis was part of the second day of hearing before a Bench of Justices P.C. Ghose and Amitava Roy on appeals filed against the acquittal of Chief Minister Jayalalithaa and three co-accused in the disproportionate assets case.\n\n“Can Rs. 1.5 crore received from (party) cadres as gifts on birthdays be said to be lawful source of income,” senior advocate Dushyant Dave, for Karnataka, asked.\n\nIf so, Mr. Dave, contended such a defence would open the doors for a free-for-all for politicians to escape criminal liability under the Prevention of Corruption Act, saying the “gifts” were a manifestation of the reverence cadres felt for their leaders.\n\n“These leaders are like demigods. They command enormous power. They have the capacity to subvert the system to their advantage,” Mr.Dave said.\n\nOn the question of the loan of Rs. 15 crore allegedly taken by Jaya Publications, Mr. Dave, assisted by Special Prosecutor B.V. Acharya and Karnataka State counsel Joseph Aristotle, said no intimation of the loan was given to the authorities during the check period between 1991 and 1996.\n\nDelayed intimation given to the Income Tax after a period of five years was just an “after-thought”.\n\n“A public servant is required to intimate the authorities about loans taken or properties acquired,” Mr. Dave argued.\n\nThis saw the Bench ask whether there is any legal requirement of rule in Karnataka which mandates a public servant to disclose his assets while in office. Mr. Dave said Civil Services Conduct Rules require government servants to disclose their assets.\n\nThe hearing will continue on Thursday.", 
    "section": "national", 
    "title": "‘Can birthday gifts be legal source of income?’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}