{
    "author": [
        "R Sujatha"
    ], 
    "text": "Cancer Institute and the Centre for Global Health, National Cancer Institute (NCI), USA, will collaborate on research, following a memorandum of understating signed by Prime Minister Narendra Modi and U.S. President Barack Obama last June.\n\nNCI’s Director Edward Trimble said the current visit was to explore opportunities to work with Cancer Institute as it was involved in several prevention programmes at the community level. The NCI is also looking at learning from the institute’s experiences in implementing training for healthcare workers in early detection and screening.\n\nCancer Institute chairperson V. Shanta said the aim was to translate the findings of research to benefit the patient. “Many of the personalised care (procedures) reach only five per cent of the population. But in a country with limited resources we need procedures that can reach a large population,” she explained.\n\nDr. Shanta recalled the institute’s experience in Tirunelveli, where the problem was evaluation of the camps that were held. It is in areas such as these that the institute is looking for inputs from the NCI.\n\nFrom offering pap smear test to using the visual inspection using acetic acid (VIA vili) method it was a big jump in widening the scope of the screening programme.\n\nIt had also ensured that diagnosis was done earlier. But given the huge population and the limited resources at the country’s disposal, the institute was constantly trying to find low-cost options, she said.\n\nIn its ongoing screening programme in Villupuram district, which aims at covering one lakh women, the institute has moved from VIA, which is done by trained health workers, to capturing the DNA. This is one step beyond mere screening and helps to address a focused segment of women, doctors say.\n\nThe institute is currently developing an Elisa test which would provide more specificity in identifying pre-cancerous lesions.\n\nWith the results being provided within a few hours, the patient would also undergo further treatment if necessary immediately.\n\nThe test can be done at the block primary health centre level which is also equipped to offer minor corrective procedure.\n\nMeanwhile, the institute has evolved a new strategy of roping in self-help groups to spread awareness about the screening camps.", 
    "section": "national", 
    "title": "Cancer institutes in Chennai, US to collaborate", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}