{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "For the 13 textile units in Tirupur knitwear industry, which became the part of the Confederation of Indian Industry’s first cluster constituted a year back to improve manufacturing excellence on a consortium platform, the initiative has paid rich dividends.\n\nAn assessment carried out revealed that the units collectively had saved around Rs. 15 crore in one year since adopting the techniques that were commonly disseminated by the experts to the units.\n\n“Since came together, the cost of utilising the services of the experts to overcome the shortfalls in the production process has been very low”, pointed out the entrepreneurs who were part of the venture.\n\nThe common platform also provided them with an opportunity to deliberate techniques among themselves to overcome the wastages and improve manpower utilisation.\n\nR. Narayanan, Head of CII- Avantha Centre for Competitiveness for SMEs, told The Hindu that the units saved huge amount mostly by improving inventory management, reducing the time consumption between different segments in the production chain, optimal utilisation of every employee in the units and phasing out old equipment.\n\n“The weaknesses were first identified by the experts provided by the CII-Avantha Centre for Competitiveness for SMEs and then the unit owners have been educated accordingly to overcome the operational deficiencies”, he said.\n\nSeeing the success of the cluster activity, the CII is now planning to constitute more such clusters of units to improve manufacturing capabilities and thereby, help the industrialists register improve savings.\n\n“We are also planning to take up advanced cluster activities with the same 13 units that were part of the first cluster.\n\n“It includes implementation of quality control measures integrated with human resource and energy management techniques”, said Mr. Narayanan.", 
    "section": "national", 
    "title": "CII initiative to improve manufacturing prowess pays rich dividends", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}