{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "To mark the 68th birthday of Chief Minister and AIADMK general secretary Jayalalithaa, 710 saplings were planted in 142 temples functioning under the control of the Hindu Religious and Charitable Endowment (HR and CE) department in Kanyakumari district on Wednesday.\n\nFive saplings each were planted in all the temples. The saplings planted were Vilvam, Punnai and Magizham, said a top official of the HR and CE department.\n\nPrior to the planting of saplings, special pujas were also performed in all the temples, an official said.\n\nOf the total number of 142 temples, 129 are functioning under the Joint Commissioner of HR and CE and 13 under the Assistant Commissioner of HR and CE, the sources said. S. Jeevanantham, general secretary of the Senior Grade Temple Employees Association, planted saplings in Suchindram temple in the presence of temple manager Nainar Arumugam.\n\nThe AIADMK district secretary and former Minister N. Thalavai Sundaram cut 68-kg cake and distributed it to foreign tourists who thronged Kanyakumari.\n\nTo mark the birthday celebrations, the mega cake was cut in the presence of two MLAs A. Nanjil Murugesan and K.T. Pachiamal and other party leaders, at the district headquarters of the party on court road in Nagercoil at 12 a.m. on Tuesday.\n\nMr. Thalavai Sundaram gave away welfare assistance such as sewing machines, iron boxes, medical and scholarships and free saris worth Rs. 5 lakh at the party office in Nagercoil.\n\nHe also participated in special poojas and yagams organised at the Nagaraja Temple, three mosques in Edaladukkudi, Elangadai and Kottar and offered prayers at Kottar St. Xavier Church.\n\nA special Sudharshana Yagam was conducted at the Vadiveeswarm Perumal temple. He also participated in the 68-sandal pot rally in Ayya Vaikundasamy Pathy temple, distributed 68 coconut saplings to the Agasteeswaram temple authorities and planted a few saplings inside the temple complex, party sources said.\n\nThoothukudi\n\nTourism Minister S.P. Shunmuganathan planted a sapling on the premises of Arulmigu Sankararameswarar temple in Thoothukudi in the presence of Collector M. Ravikumar. Under this massive tree plantation scheme of the State government, 1,225 saplings would be planted in temples across the district, the Minister said.\n\nWhile ‘vilva’ tree species would be planted in 62 temples of Lord Shiva, other tree species of ‘punnai’ and ‘mahilampoo’ would be planted in 183 Perumal temples.\n\nA series of welfare schemes launched by the Chief Minister and benefits enjoyed by beneficiaries during this ongoing regime were displayed through photos at an exhibition organised by Department of Information and Public Relations at Thoothukudi old bus stand. C. Kumar, Public Relations Officer, T.Ram Kumar, Assistant Public Relations Officer, and others were present.", 
    "section": "national", 
    "title": "CM’s birthday: 710 saplings planted in 142 temples", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}