{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Minister for Sports and Youth Welfare S. Sundararaj cutting cake in Ramanathapuram on Wednesday.— Photo: L. Balachandar\n\nPlanting of saplings, cake cutting, special prayers and inauguration of photo exhibition, highlighting the achievements of the AIADMK government marked the 68th birthday of Chief Minister Jayalalithaa in the district.\n\nAccompanied by Collector S. Natarajan, Minister for Sports and Youth Welfare S. Sundararaj planted tree saplings in the precincts of Sri Ramanathaswamy temple and offered worship for the long living of the Chief Minister. The Minster, accompanied by the Collector and Municipal Chairperson S.K.G.S. Santhanalakshmi later inaugurated the photo exhibition, showcasing the achievements of the AIADMK government and listing the welfare schemes implemented by the government.\n\nThe photo exhibition, set up by the Information and Public Relations Department near the new bus stand, provided opportunity to scores of people to take glimpse of some of the rare photos, featuring the Chief Minister. District secretary Dharmar and party office-bearers, Angusamy, Muniasamy, Murugesan were among others present.\n\nDindigul\n\nDistribution of gold rings to newborns at government hospitals, special prayers in temples and common feast marked the birthday celebrations in Dindigul and Theni districts.\n\nIn Dindigul, special pujas were arranged in major temples. Special feast was also offered to pilgrims and public. Women party workers took out milk pot procession in Oddanchatram.\n\nAt Chinnamanur in Theni district, gold rings were offered to two children born at Chinnamanur government hospital on Wednesday morning.\n\nVirudhunagar\n\nAn exhibition of photographs, showcasing the achievements of the State government on various fronts, was declared open at Desabandu Maidan here by Minister for Information and Special Programme Implementation K.T. Rajendra Balaji on Wednesday.\n\nCollector V. Rajaraman presided over the event. Those who participated in the inaugural function included Santhi Mariappan,\n\nMunicipal Chairperson, according to an official press release.", 
    "section": "national", 
    "title": "CM’s birthday: Saplings planted in temples", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}