{
    "author": [
        "Staff Reporter", 
        "M K"
    ], 
    "text": "RELIGION\n\nThe Pentecostal Mission: Annual convention and divine healing service, 9.30 a.m. and 6 p.m.\n\nCULTURE\n\nKasthuri Sreenivasan Trust : Coimbatore Artists Meet 2016 series and 145{+t}{+h}painting exhibition by T. Mathiniraiselvan, Kasthuri Sreenivasan Art Gallery, 10 a.m.\n\nGENERAL\n\nRanganathan Polytechnic College: NSS special camp, Ikkarai Boluvampatti Village,\n\n6 a.m.\n\nSree Saraswathi Thyagaraja College: Campus drive by WIPRO Limited, 9 a.m.\n\nGEM Hospital: Laparoscopic colorectal surgery training programme, 9 a.m.\n\nAJK College of Arts and Science: Inter-collegiate cultural fest ZEBICOM 2K16,\n\n9.30 a.m.\n\nKarunya University: 4{+t}{+h}symposium on Shock Waves (NSSW-4), 9.30 a.m.\n\nTamilnadu College of Engineering: Intercollegiate management meet M-FEST 2016, 9.30 a.m.\n\nEASA College of Engineering and Technology: Technical symposium Erectus’ 16, 9.30 a.m.\n\nBishop Appasamy College of Arts and Science: Seminar on financial planning initiated by SEBI, 10 a.m.\n\nNehru Arts and Science College: Kaolin short film fest 2016, 10 a.m.\n\nThe Coimbatore Productivity Council: Productivity Conclave – 2016, ‘Make In India’ Opportunities and Challenges, Hotel The Residency, 10 a.m.\n\nG.R. Damodaran Academy of Management: Conference, 10 a.m.\n\nHindusthan College of Arts and Science: Inaugural of Meraki 2k16, 10 a.m.\n\nSankara Institute of Management Studies and Rajiv Gandhi National Institute of Youth Development: Workshop on Awareness of Reproductive Health Issues and its Impact on Academic Performance of Adolescent Girls, 10 a.m.\n\nSri Krishna College of Engineering and Technology: Students convention AUTOZINIOS V5.0, 10 a.m.\n\nAITUC: 41{+s}{+t}session of All India Trade Union Congress, Ayisha Mahal Campus, Kuniyamuthur, 10.30 a.m.\n\nSankara College of Science and Commerce: Guest lecture on capital markets, 1.30 p.m.\n\nSri Ramakrishna Engineering College: Entrepreneurship week on “Innovative Ideas for a Better World”, 1.45 p.m.\n\nDr. R.V. Arts and Science College, Mettupalayam: Computer science department association meeting, 2.30 p.m.\n\nSri Ramakrishna Institute of Technology: Valediction of regional level project exhibition SRIT Explore 2016, 3.45 p.m.\n\nDr. Dasarathan International School: 6{+t}{+h}Founder’s Day 4.30 p.m.\n\nMedical Fraternity of Coimbatore Region and Committee of Hosts: Award ceremony, Hotel Le-Meridien, 5.30 p.m.\n\nTIRUPUR\n\nNIFT-TEA College of Knitwear Fashion: Free eye check-up camp, 9.30 a.m.\n\nPALLADAM\n\nSCAD Institute of Technology: Campus interview, 9 a.m.", 
    "section": "national", 
    "title": "Coimbatore Today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}