{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Two students were injured and a few girl students fainted as more than 100 students of CBM College of Arts and Science, who were on an indefinite strike, picketed the collectorate on Wednesday.\n\nStudents, including about 60 girls, had come to meet the Collector to urge the government to take over the government aided college that reportedly lacked basic amenities and faced shortage of staff.\n\nThe students were stopped when they tried to make their way through police barricades.The students were pulled down when they climbed over the barricades and the main gate of the collectorate.Two second year students Hariharan and Vekson Babu suffered minor head injuries as they hit the barricades. They were taken to the Coimbatore Medical College Hospital. The students raised slogans condemning the police for their act and sat in front of the collectorate seeking appointment with the Collector from the afternoon to late in the evening when a few girls fainted under the scorching sun.\n\n“We want to know the action taken by the district administration after the tripartite talks with us (students) and the management held on February 8. With only days left for the semester exams which will be the last semester exam for the final year students we have not had staff to handle classes for months. It has pushed us into lot of hardships,” students association chairman R. Rajesh said.\n\nUnable to meet the Collector the student protesters left in the evening and said they would come back to the collectorate on Thursday and try to meet the Collector.\n\nNext meeting\n\nMeanwhile, a college management representative said that no solution could be attained at the meeting on February 8 as the government officials did not have the required time for the meeting on that day. “Of their three demands we cannot fill up the vacancies unless the government sanctions funds,” he said and added that they cannot comment on the demand that the government should take over the college.\n\n“The college has required basic amenities and we have promised to provide the amenities that they lacked. Officials concerned said that the next meeting has got delayed due to the indefinite strike by government employees. We are awaiting the next round of talks to attain a solution for the smooth functioning of the institution,” he added.", 
    "section": "national", 
    "title": "College students picket collectorate", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}