{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Protesters threaten picketing agitation in Chennai\n\nVillagers from four fishing hamlets and the family members of 11 of the 44 Tamil Nadu fishermen arrested and detained in Iran took out a rally and staged a demonstration in front of the Collectorate here on Wednesday, urging the State and Central governments to secure the release of the fishermen.\n\nCITU-affiliated Tamil Nadu Meenpidi Thozhirsanga Koottamaippu which organised the protest warned that it would stage a picketing agitation in Chennai by mobilising the family members of the fishermen if the governments failed to initiate action to secure their release within a week.\n\nCommunist Party of India (Marxist) Dindigul MLA K. Balabharathi, who addressed the agitation, said that the 44 fishermen, including 11 from Ramanathapuram district, 31 from Kanyakumari and two from Thoothukudi, were detained in an island in Iran for nearly 85 days but the authorities had not taken any step to secure their release.\n\n“If the governments failed to initiate any step in the next one week, we will organise a protest in Chennai to draw the attention of the External Affairs Ministry,” she said.\n\nThe families had been struggling for the past three months after their breadwinners got arrested, but the State government did not bother to take care of their needs, she said.\n\nM. Karunamurthy, district secretary of the Kootamaippu, said that the Iran navy had arrested the fishermen on a charge of poaching and confiscated their five trawlers. The fishermen, who were held in their boats in Kish island in Iran, were struggling to get food and water, he said.\n\nThe 11 fishermen from the fishing hamlets of Kalimangundu, Muthupettai, Periyapattiam and Mayakulam went to Dubai in two batches in April and June last year on contract fishing, he said.\n\nAfter the demonstration, a delegation called on Collector S. Natarajan and presented a memorandum. The Collector assured the delegation that he would take up the issue with the government.", 
    "section": "national", 
    "title": "Demo staged for release of fishermen from Iranian jail", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}