{
    "author": [], 
    "text": "ERODE\n\nErode Sengunthar Engineering College: Knowledge-sharing session on ‘Understanding prepositions’ by S. Johnson Karunakaran, Assistant Professor, Department of English, 4.30 p.m.\n\nBannari Amman Institute of Technology: Conference on ‘Innovations in Information Technology,’ 9 a.m.; E-Week 2016 Celebration on ‘Innovate ideas for a better world’ by Entrepreneurship Development Cell and National Entrepreneurship Network, 9 a.m.\n\nEBET Group of Institutions: Talk on ‘The challenges in the work place - people management perspective’ by E. S. Sivashankar, management consultant, Chennai, 10.30 a.m.\n\nKalyan Jewellers: Inauguration of new showroom by Prabhu Ganesan, actor, Cauvery Road, Karunkalalayam, 12 noon.\n\nSALEM\n\nTamil Nadu Iyal Isai Nataka Manram and Department of Art and Culture: Ramayanam festival, ‘Varna Kalanjiyam,’ bommalattam by M. Somasundaram and troupe, Vijaragavachariar hall, Cherry road, 6.30 p.m.\n\nPeriyar University: Department of Physics conducts conference on ‘Advanced materials,’ V. Ganesan, Centre Director, UGC-DAE Consortium for Scientific Research, Indore, chief guest, 10 a.m.; Department of Sociology conducts seminar on ‘Sustaining Indian culture and tradition through historical studies,’ K. Gulam Dasthagir, Associate Professor, Department of Sociology, Pondicherry University, key note address, 10.30 a.m.\n\nV.M.K.V. Engineering College: Campus recruitment by MRF Tyres Limited, Chennai, 9.30 a.m.\n\nKnowledge Institute of Technology: Science Club organises Science Day celebrations, T. Jayamurugan, senior quality control inspector, Salem Steel Plant, chief guest, 10 a.m.\n\nKavery Educational Institutions, Mecheri: Annual day, K.N.K. Venkataraman, executive vice-president and head of global business operations, L and T Infotech Limited, Bengaluru, and G. Gnanasambandam, Tamil scholar, chief guests, 9.30 a.m.\n\nNew Century Book House Limited: Book exhibition, Bose Maidan, 9 a.m. to 9 p.m.\n\nNAMAKKAL\n\nGnanamani College of Engineering: Workshop on ‘realisation of automotive sensors using arduino controller,’ 10 a.m.\n\nMahendra Engineering College: Workshop on ‘networking for engineers,’ Baldev Krishnamoorthy, CEO, 128 Bits Technologies, Bengaluru, resource person, 10 a.m.; Campus recruitment drive by TVS Harita, Chennai, 10 a.m.\n\nK.S.R. Institute for Engineering and Technology: Department of Computer Science and Engineering, CSI Student Chapter, regional level convention, 9.30 a.m.\n\nVivekanandha College of Engineering for Women: Department of Electrical and Electronics Engineering, entrepreneurship awareness camp, 10 a.m.\n\nKSR Akshara Academy: KG Fiesta celebrations, Abirami Vadivelkumaar, registered dietitian, Salem, chief guest, 10 a.m.\n\nExcel Group of Institutions: Campus interview by First Flight Couriers Limited, Chennai, 9.30 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}