{
    "author": [
        "Deepa H"
    ], 
    "text": "The latest amendments to the marine fishing law in Tamil Nadu are expected to protect the rights of traditional fishermen, while at the same time giving a thrust to deep sea fishing. In an attempt to encourage deep sea fishing, the dimensions of mechanized boats have been increased so that the estimated untapped potential of 2.6 lakh tonnes of fish in the Exclusive Economic Zone can be exploited without damaging the marine eco-system.\n\nSome of the long-pending demands of traditional fishermen including more space in the sea have been met. “Providing more space for traditional fishermen is a welcome change. Trawling has spoilt fishing near the coast where traditional fishers work. If you provide diesel to the mechanised sector at cost price, it would help them go deeper into the sea and keep them away from the traditional fishing grounds,” said G. Anton Gomez, president, National Union of Fishermen.\n\nThough the Act came into force in 1983, it was not enforced effectively. In the last 10 years, very few cases have been booked against offenders for possessing banned equipment including fishing nets. U. Arulanandam of Alliance for Release of Innocent Fishermen, while appreciating the State government, said that steps must be taken to ensure that the Act is enforced. “That will help protect and respect the rights of the traditional fishers. Their livelihood must be respected as most of them remain illiterate and do not earn much thanks to brokers. Since some nets can no longer be used, fishermen can be given other nets,” he said.\n\nAnother new provision bans engagement of children below the age of 18 on fishing crafts. “Many times such children too get caught by the Sri Lankan Navy and are taken to juvenile homes in that country. It is very sad to see the plight of the families,” Mr. Arulanandam added. A former fisheries department official said the section would also help improve literacy rates among the community. “It is in their nature to take to fishing. But they give up schooling. We have seen men coming and not knowing how to fill up application forms. That must change,” he said.", 
    "section": "national", 
    "title": "‘Ensure new fishing norms are enforced’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}