{
    "author": [
        "Special Correspondent"
    ], 
    "text": "AIADMK cadre celebrate the day at the party headquarters in Chennai on Wednesday.— Photo: M. Vedhan\n\nAs Chief Minister and AIADMK general secretary Jayalalithaa turned 68 on Wednesday, party cadre celebrated her birthday with great enthusiasm. Cadre cut cakes, distributed food, sweets and freebies, performed special pujas in temples, and organised health camps and cultural programmes to mark the day.\n\nAt the party headquarters in Royapettah, a cake weighing 68 kg was cut by Social Welfare Minister and AIADMK literary wing secretary B. Valarmathi. Party presidium chairman E. Madhusudanan released a special souvenir to mark the occasion.\n\nAt the 282 Amma Unavagams run by the Chennai Corporation, patrons were not charged for the food they consumed.\n\n“Breakfast was accompanied by ‘kesari.’ Last year too on Amma’s birthday we served free food at the unavagams,” said Chennai Mayor Saidai Duraisamy, adding that the expenses will be met from his personal funds.\n\nThe MGR youth wing too cut a cake weighing 68 kg at Padi. “We donated a cow to the Thiruvalleeswarar temple in Amma’s name. We have been donating one cow every year for the past five years,” said V. Alexander, secretary of the wing.\n\nAIADMK’s Chennai South (south) district secretary M.M. Babu distributed copies of Bibles, Quran and Bhagavat Gita to 68 persons each.\n\nStudents of Church Park School wished Ms. Jayalalithaa, an alumni of the school, a very happy birthday.\n\nSimilarly, at the Tamil Nadu Music and Fine Arts University, founder’s day was celebrated with the inaugural of a three-day festival, Jayam 2016. “The cultural extravaganza will feature film shooting demos, exhibitions and painting by 68 artists,” said university Vice-Chancellor Veena E. Gayathri.\n\nPrime Minister Narendra Modi, Governor K. Rosaiah, Andhra Pradesh Chief Minister Chandrababu Naidu, Union Ministers Arun Jaitley, M. Venkaiah Naidu, Minister of State for Shipping Pon. Radhakrishnan called Ms. Jayalalithaa over telephone and wished her.\n\nExternal Affairs Minister Sushma Swaraj, Telecom Minister Ravishankar Prasad and Kerala Governor P. Sathasivam sent their greetings with bouquets, a party release said.\n\nGovernor K. Rosaiah’s greetings message read, “Your rich acumen, wisdom, dynamism and affection towards the people have made Tamil Nadu a model State for people’s welfare projects", 
    "section": "national", 
    "title": "Enthusiasm marks CM’s birthday", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}