{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Public, NGOs can provide information to Corporation\n\nLocal bodies have also instructed house owners to construct proper septic tanks.—Photo: C. Venkatachalapathy\n\n: An enumeration of persons involved in manual scavenging was carried out in Vellore Corporation.\n\nAlready, the work was taken up in 2014, and presently it is being done to identify persons who have been missed out.\n\nThe work was initially taken up by the State government on behalf of the Union Ministry of Social Justice and Empowerment to identify persons involved in manual scavenging.\n\nThe process was carried out in Vellore Corporation from February 22 to 24, a press release said.\n\nThe enumeration was aimed at identifying persons involved in removing human excreta from insanitary toilets, open drains, septic tanks and railway tracks, and provide exclusive rehabilitative measures for them.\n\nPublic and members of non-governmental organisations (NGO) could also provide information on those involved in manual scavenging to the Corporation (all the four zonal offices were open to receive information).\n\nThe enumeration was also taken up at Ranipet Municipality. Information was provided at the municipality office and municipality’s marriage hall at R.R. Road, Ranipet.\n\nMeanwhile, officials of the Vellore Corporation said they were taking efforts to see that no person is involved in manual scavenging, and is mechanising such works.\n\nProhibited by law\n\n“We have trained workers of private contractors on precautionary measures. We have explained to them that involving persons in removing human excreta is an offence, and has been prohibited by law,” an official said.\n\nLocal bodies have also instructed owners of houses with insanitary latrines to convert the facility into proper ones.\n\nThey have been asked to construct proper septic tanks for the toilets, and not let out human excreta into open drains.\n\nThe process was carried out in Vellore Corporation from February 22 to 24", 
    "section": "national", 
    "title": "Enumeration of manual scavengers on", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}