{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Get ready to watch the Pondicherry Equestrian Challenge on the 22 acres of lush green international township of Auroville on February 26.\n\nOrganised by Red Earth Riding School, Auroville, and Equestrian Promotion Private Limited (EPP), the Pondicherry Equestrian Challenge will take place over two weekends.\n\nIn the first three-day weekend, riders will test their jumping skills and those of their horses on jump courses of varying height. “This year, the height of the jumping event will range from 90 cm to 135 cm in height,” said Jacqueline Kapur, president, Ayesha Accessories, one of the organisers of the Pondicherry Equestrian Challenge.\n\nThe next phase of the competition will begin on March 3 with the International Dressage Development League (IDDL) competition where the riders will perform prescribed dressage tests and it will continue till March 4 morning. The tests will be judged by Fédération Équestre Internationale, an international federation for equestrian sports.\n\nFrom the afternoon of March 4 till March 6, jumping competition will continue to even higher range jumps. The weekend will conclude with two grand-pix-style jumping events, whose results will be compiled with the results from the first weekend to determine the best riders.\n\nFor the 16{+t}{+h}year of the equestrian sports, the youngest rider is 4 years old and the eldest rider 54 years old. Red Earth Riding School, Auroville, has been hosting equestrian competitions since 2000 .\n\nRiders from Puducherry, Chennai, Bengaluru, Coimbatore, Mumbai will participate. Kaevaan Setalvad, who bagged the Indian National Championship this year, from Mumbai will also participate. International riders including three from France and one from USA will also take part in the competition.\n\nThe clubs attending would be Embassy International Riding School, Equestrian Club of Excellency and Team Marcotte from Bengaluru, My Pony Club from Chennai, Red Earth Riding School, Puducherry, and International Riding Academy from Tirupur and Vediparai Stables from Coimbatore.\n\nThere will be 75 horses competing in this year’s event, of which, 60 are foreign breeds. “The Department of Tourism, Puducherry, is also one of the sponsors of the event,” Ms. Kapur said.\n\nLieutenant Governor A.K.Singh will inaugurate the event on February 26.", 
    "section": "national", 
    "title": "Equestrian Challenge begins at Auroville tomorrow", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}