{
    "author": [
        "R Rajaram"
    ], 
    "text": "Fire Fighters had received distress calls mainly pertaining to devotees who fainted in Mahamaham\n\nResponding swiftly to emergency calls, fire fighters carried out several rescue missions in temple town Kumbakonam during the 10-day Mahamaham festival.\n\nDeployed in substantial numbers exclusively for the Mahamaham festival, teams of fire fighters were posted at several vantage points in Kumbakonam town, including at the Mahamaham temple tank – the epicentre of activity.\n\nThe fire fighters drawn from across the State were deployed on February 11 — two days before the commencement of the festival that started with the flag hoisting ceremony on February 13.\n\nAccording to Fire and Rescue Services department, the fire fighters received 17 rescue calls during the period from February 13 to 22 and acted upon them immediately.\n\nIn a majority of the cases, fire fighters rescued devotees who fainted either at Sakkarai Padithurai or at Mahamaham tank while proceeding to take a holy dip or after that. These cases were reported on different dates between February 13 and 22.\n\nThe maximum number of rescue calls was received on February 21 — on the eve of Mahamaham — when lakhs of devotees thronged the temple town to take a holy dip in the Mahamaham tank, Potramarai Kulam and the Cauvery river.\n\nIn one such case, the fire fighters rescued a 52-year-old man who fell unconscious in the temple tank itself while taking a holy dip. In another instance, a 65-year-old woman who suffered chest pain at Sakkarapani temple was rescued by the fire fighters and shifted to hospital.\n\nThe devotees who fainted were all immediately shifted to the nearby special medical camps established across the town for the festival to provide them first aid treatment. Fire and Rescue Services authorities said they had drafted a comprehensive plan exclusively for the festival deploying manpower armed with necessary paraphernalia and vehicles.\n\nA number of 1,032 Fire and Rescue Services personnel were deployed across the temple town for the Mahamaham festival, said G. Sathyanarayanan, Deputy Director in-charge, Fire and Rescue Services, Central Region, Tiruchi.\n\nIn addition to fire fighters from the Central region, those from Northern, Southern, Western and North Western regions were drawn to augment manpower strength.\n\nIn all, 27 fire tenders, seven quick response vehicles, 10 bullet vehicles, couple of Emergency Rescue Tenders, 15 ambulances, and a foam tender were deployed during the 10-day festival period.\n\nSplit into teams, the fire fighters along with vehicles were deployed at 27 identified places in Kumbakonam town including Mahamaham tank, railway station, bus stand, Chettimandapam, Darasuram bus stand, Kumbeswarar temple, Sarangapani temple, Town High School, Sakkottai, Ramasamy temple and Darasuram railway station.\n\nA team of fire commandos were deployed in the Mahamaham tank to carry out rescue missions. In addition to rescue calls, the fire fighters attended to seven fire calls reported in different places in the town during the 10-day festival period.\n\nMr. Sathyanarayanan said the fire fighters from different regions would be withdrawn from Kumbakonam on Wednesday evening.\n\nRESCUE MISSION\n\nFire and Rescue Services had drawn up a comprehensive plan\n\nFire fighters were deployed at 27 identified places in Kumbakonam", 
    "section": "national", 
    "title": "Fire Fighters responded quickly", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}