{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Muktesh K. Pardeshi, Joint Secretary and Chief Passport Officer, Ministry of External Affairs and K. Balamurugan, Regional Passport Officer, Chennai at a press conference at the Passport Seva Kendra in Puducherry on February 22, 2016.- Photo: T. Singaravelou\n\nFive new Passport Seva Kendras (PSK) including one each in Andhra Pradesh and Bihar will be set up by the end of this fiscal, a top official said here on Monday.\n\nTalking to reporters here, Joint Secretary and Chief Passport Officer Muktesh K. Pardeshi said the PSK in Bhimavaram in Andhra Pradesh and Darbhanga in Bihar would be operational by next month.\n\nIndia has around 37 Passport Offices supported by 90 Passport Seva Kendras. The Ministry is in the process of opening five more PSKs in the current fiscal for issuing passports.\n\nIndia ranks third in the world after China and the United States in issuing passports to citizens. Around 1.2 crore passports were issued in 2016 and the Government is geared up to issued 1.4 crore passports this fiscal.\n\nDuring the last two years, there was 20 per cent growth annually in issuance of passports. For the current fiscal the Government is geared up to reach a growth of 15 to 20 pe rcent, he said.\n\nPolice verification\n\nMr. Muktesh said that all the Passport Offices across the country were connected with the Police districts and the time taken for Police verification had also come down.\n\nApplicants submitting forms with copies of Aadhaar, Voter ID and PAN card will help to get the passport first. It leaves police verification for a later date. The whole idea is that the passport process should be easy and not a tedious or expensive affair for citizens.\n\nTie-up with Aadhaar\n\nThe Ministry has introduced a new facility. It has tied up with Aadhaar by which the details furnished by the applicants including their biometric fingerprints will be cross checked online with Aadhaar.\n\nThe system was introduced from August last year and has started picking up. The idea is to document the correct person and in rare instances people have been detected for furnishing fake documents.\n\n“If we come to know that there is some conspiracy we make an FIR and the case is given for police enquiry.\n\nDuring 2015, as many as 50,000 passports were cancelled in the country due to multiple reasons including adverse report from the police and for submitting false documents.”\n\ne-passport project\n\nReplying to a question, Mr. Muktesh said that India Security Press is in the process of inviting global tenders for the e-passport project.\n\nIt is a little long process and tendering has some statutory requirements. The works will be awarded after finalisation of tenders, he said. Regional Passport Officer K. Balamurugan was also present.\n\n‘PSKs in Bhimavaram in AP and Darbhanga\n\nin Bihar would be operational by\n\nnext month’", 
    "section": "national", 
    "title": "Five new PSKs coming up", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}