{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Joint Secretary to Union Ministry of Commerce, Ravi Capoor, explaining the trading opportunities offered by Free Trade Agreements to knitwear exporters during an outreach programme the Ministry had organised at Tirupur Exporters Association hall on Wednesday.\n\nJoint Secretary to Union Ministry of Commerce, Ravi Capoor, has called upon the exporters in Tirupur knitwear cluster to concentrate on building common brands so as to project the collective prowess of the cluster to the foreign buyers.\n\nHe cited the example of Dimlah tea from Sri Lanka as an example of how a common brand could enhance the image of products from a particular region.\n\nMr. Capoor was addressing the apparel exporters here during an outreach programme which the Union Ministry of Commerce organised with the support of Apparel Export Promotion Council, Federation of Indian Export Organisations and Tirupur Exporters Association.\n\nThe official expressed the hope that duty tariff issues would not be much of an issue in another one-and-an-half decades when Free Trade Agreements (FTAs) become more and more of a buzzword in the global trade.\n\n“However, the exporters still need have to comply with compliances pertaining to labour standards and social issues if their products have to be preferred by the global buyers”, he reminded the exporters.\n\nOn the FTAs, he cautioned that the entire stakeholders in the industrial development should understand both the advantages and also the trade-related issues that could crop up subsequent to the signing of FTA with a particular country or group of countries.\n\nDeputy Director General of Foreign Trade D. Sridhar said India had so far signed six individual FTAs which include the ones with Sri Lanka, Singapore, Malaysia, Japan, Korea and ASEAN (Association of South East Asian Nations).\n\nTirupur Exporters Association president A. Sakthivel also addressed the exporters.", 
    "section": "national", 
    "title": "Focus on building common brands, exporters told", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}