{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Trade and industry sectors in Erode have sought an exclusive rail track for a few kilometres either from Perundurai or Ingur rail stations to SIPCOT Industrial Growth Centre, to derive multi-pronged benefits of income generation for Railways, reducing traffic congestion in the city limits, and saving on freight charges that are otherwise incurred for to-and-fro transportation of containers between the Goods Shed close to the railway junction in the city and the manufacturing hub located 20 km away.\n\nThe Federation of All Trade and Industry Associations (FATIA) has represented to the Union Railway Ministry through the Erode MP S. Selvakumara Chinnaiyan the imperative need for laying the exclusive line to the SIPCOT Growth Centre that would not exceed 3 km from Perundurai RS and 2.5 km from Ingur.\n\nUnlike roads, the land requirement for laying rail track is much less and the project that should also include a state-of-art warehouse at the Growth Centre must be given a serious thought for funding in the current year itself keeping in mind the convenience it would provide to the manufacturers to transport their products to Northern States and Kerala without having to touch Erode, N. Sivanesan, FATIA president, said.\n\nOn its part, the district administration has reportedly conveyed to the Railways its readiness to provide land at Ingur for shifting the Goods Shed. On an average, 300 lorries ply between the SIPCOT Growth Centre and Goods Shed every day, and the vehicles can enter and exit the city limits only within the specified four-hour duration: 12 noon to 4 p.m.\n\nThe Railways that has been laying exclusive lines to even private industries, ought to promptly attach priority to the SIPCOT Industrial Growth Centre keeping in mind the State’s ownership of the property.\n\nThere are several industries manufacturing textile, leather, food and various other products counting on timely movement of raw materials and finished products.\n\nThe State Government had, earlier this year, provided land for Saint Gobain Glass India to establish its production unit at an investment of Rs. 300 crore.\n\nIn the event of the Goods Shed being shifted to Ingur and the separate track being laid to the Growth Centre, the lorries could be diverted through the ring road all through the day without any need to enter the city limits, Mr. Sivanesan said.", 
    "section": "national", 
    "title": "Growth Centre: rail link sought", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}