{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Unknown persons also threaten security personnel\n\nThe damaged portion of the foundation stone at the Hoverport project site at Veerampattinam in Puducherry on Wednesday. — Photo: S.S. Kumar\n\nUnknown persons have trespassed the site which was allotted to Coast Guard for the construction of hoverport at Ariyankuppam on the late night of Tuesday and damaged some properties besides threatening security personnel who were guarding the site.\n\nThe fisherfolk of Veerampatinam village have been conducting series of protests against the establishment of hover port in recent days. Though the fisherfolk have been opposing this project since its conceptualisation in 2004, the villagers have intensified their agitations against the project for recent days after Chief Minister laid the foundation stone for port on January 15. Apprehending that their livelihoods would be affected by the setting up project, they alleged that their movement already has been restricted.\n\nA week ago, the Chief Minister N. Rangasamy had said the works for construction of a hover port in the coastal hamlet of Veerampattinam had been temporarily suspended and that the government would not do anything that is against the interests of fishermen.\n\nUnder such circumstances, unknown persons entered the premises in midnight and damaged foundation stone kept there and the fence which was erected around the site.\n\nThey allegedly threatened the security personnel who were on duty.\n\nFollowing complaint from Satish Yadav, an officer from Coast Guard lodged a complaint, Ariyankuppam police registered a case against unknown person under sections of 147,(Punishment for rioting), 148 (Rioting, armed with deadly weapon), 353(Assault or criminal force to deter public servant from discharge of his duty),323(Punishment for voluntarily causing hurt), 506(ii) (Criminal Intimidation) of Indian Penal Code and provisions of the Prevention of Damage to Public Property Act 1984.", 
    "section": "national", 
    "title": "Hoverport site vandalised", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}