{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In a fishing adventure gone awry, a man was electrocuted after falling into a stream into which a live wire was thrown to stun fish for easy catch at Rasimalai in Dharmapuri on Tuesday.\n\nThe victim Balaji (35), a cane-harvesting labourer from Denkanikottai, had gone with a group of 12 fellow workers to Perumpalai on a wage work. He along with three others had gone fishing in a local stream near Rasimala. According to the police, the four-member party had stolen electricity from a nearby field to stun fish in a stream. In a hasty bid to gather the fish, Balaji had leaped into the water and was electrocuted. Perumpaali police registered a case and arrested Marimuthu, Govindasamy and Rajagopalan.\n\nThree arrested\n\nPolice have arrested three persons for their alleged involvement in a robbery attempt at the Subramanya Siva Cooperative Society at Paapireddypatty near Dharmapuri .\n\nThe arrested were Biman alias Jeganathan(35) of Indur, Periyasamy (35) of Anjarahalli, and Rajkumar (35) of Koorapatty.\n\nIn June 2015, a group entered the society by breaking the windows.\n\nHowever, the alarm at the safe room went off forcing the gang to scoot off, before the police arrived.\n\nThe search for the accused was on since then.\n\nOn Tuesday, the police made the arrest following a tip-off that the three men had planned to surrender before the Tahsildar of Pennagaram. The men had arrived at the Tahsildar’s office premises, when the police rounded them up before they could surrender.\n\nPolice also seized hacksaw blades and two iron rods from their custody. The accused were remanded in Salem prison.\n\nMan killed in accident\n\nA 29-year-old lorry driver was killed and the cleaner of the vehicle was injured in an accident near Rayakottai Bridge in Krishnagiri on Tuesday. The victim Sunil, hailing from Asan Marigudikuppan near Bengaluru, was driving the lorry laden with poultry to Bengaluru when he lost control over the vehicle and rammed the rear of another lorry near Rayakottai bridge. Sunil was killed on the spot, while the cleaner Rakesh was injured. Krishnagiri police have registered a case.", 
    "section": "national", 
    "title": "Illegal fishing: man electrocuted", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}