{
    "author": [
        "S Sundar"
    ], 
    "text": "“They will also provide higher load carrying capacity”\n\nFOR BETTER RIDE:Worn-out rails being replaced with longer rails near Samayanallur in Madurai on Wednesday.— Photo: R. Ashok\n\nMadurai Division of Southern Railway has been using 20-rail-panels (260 metres long) to replace worn-out rails in Madurai-Samayanallur stretch of Madurai-Dindigul section.\n\nThe rails do not have welds and fish-plates, and will provide better riding comfort, higher load carrying capacity and prevent rail and weld fractures.\n\n“Traditionally, rails of 13 metres standard length were used for tracks. These rails were connected with fish-plates… The nuts and bolts in the fish-plates could be removed without much difficulty,” said Divisional Engineer (Central) S. Marimuthu.\n\nBesides, the wheels of speeding coaches and wagons hitting the fish-plates created loud noise and jerks, and led to wear and tear of rails and wheels.\n\nLater, the railway started welding the rails. The three 13-metre rails (or three-rail-panels) were welded using alumino thermite welding technology. “Since foreign materials were used in the welding of the iron rails, the strength at the welded joints was reduced to 57 per cent of the strength of the rails,” Mr. Marimuthu said.\n\nThen another technology of flash butt welding was used wherein the tips of the rails were melted for the joints. “The strength at the welded joints increased to 80 per cent,” he said.\n\nLater, Indian Railways started using 10-rail-panels (130 metres) and subsequently 20-rail-panels (260 metres) that were moved with specially-designed bogie for rails to various parts of the country.\n\nReplacing of worn-out rails between Koodal Nagar and Samayanallur stations for a distance of nearly 1.4 km on the upline of the double-line section is under way. The rails that were laid in 1993 were replaced in 2001.\n\nBased on the proposal given by Divisional Railway Manager Sunil Kumar Garg on replacement of worn-out rails, Principal Chief Engineer (Southern Railway) S.S. Gupta allotted the work for two km at a cost of Rs. 2 crore.\n\nThe division has already used the longer rails for more than 30 km.\n\nThe work in Samayanallur and for a 600-metre stretch on platform one in Madurai junction is expected to be completed by March.", 
    "section": "national", 
    "title": "Longer rails used for smoother train travel", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}