{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The city is indeed safer compared to other metros. But much needs to be done in ensuring safety of its residents, particularly women, and to reduce crimes with coordinated efforts from various government agencies.\n\nReacting to the Mercer’s Quality of Living ranking survey that rated Chennai the safest Indian city, residents said that though people feel safer here when compared to other metros like Delhi, it did not mean that the city was entirely safe in terms of secure public spaces and less crime rate.\n\n“Chennai is safe compared to other cities. People may have a better sense of safety unlike in Delhi or other cities. We can see police even during night time. But, safety of women in public spaces still remains a problem,” said Prasanna Gettu, CEO and founder trustee of International Foundation for Crime Prevention and Victim Care (PCVC).\n\nThe organisation had conducted a research among college students recently wherein they spoke about unsafe environment in public transport system and desolate streets during late evenings. “We need to have collective responsibility and coordinated approach among government agencies like Chennai Corporation, the Transport Department and residents to ensure safe environment in city,” she said.\n\nActivists like Sujata Mody asked what had been done structurally in the city to ensure citizens’ safety.\n\nFor instance, she said the number of private taxi operators had increased in recent years. But, very little had been done to collate data on drivers or monitor them to step up passenger safety.\n\n“There have been instances of women working in export companies being attacked while returning home through dark lanes. But, many of them do not report it as it may curb their freedom. There is a lack of coordination among government agencies in providing a secure environment. Simple measures like providing better lighting on roads and railway stations will be of help,” said Ms. Mody, president of Working Women’s Association.", 
    "section": "national", 
    "title": "More needs to be done, say residents and activists", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}