{
    "author": [], 
    "text": "RELIGION\n\nBhagavatham: Kidambi Narayanan, Asthika Samajam, Venus Colony, Alwarpet, 6.30 p.m.\n\nKenopanishad: Suprajnananda, Ramakrishna Math, Mylapore, 5.30 p.m.\n\nVishnu Sahasranamam: Sudha Seshayyan, Sri Krishna Gana Sabha, T. Nagar, 6.30 p.m.\n\nPanchapadika: R. Manidravid, Sri Sankara Gurukulam, 8/20, C.P. Ramaswamy Rd., Abhiramapuram, 5 p.m.\n\nPanchapadasi: Satyavratananda Saraswati, Mylapore Club, Luz Church Rd., Mylapore, 11 a.m.\n\nLalitha Trishati: V. Abhiramasundaram, Sri Sankara Gurukulam, 8/20, C.P Ramaswamy Rd., Abhiramapuram, 7 p.m.\n\nThayumanavar: P. Venkatesan, Kothandaramaswamy Temple, Old Washermenpet, 6.30 p.m.\n\nGENERAL\n\nCSIR-SERC: National Science Day, lecture on ‘Chemical Ecology: A Discipline at the Border of Chemistry and Biology’, CSIR Campus, Taramani, 10.30 a.m.\n\nAssociation of Infrastructure Engineers and Technocrats: Launching of association, Alumni Centre, College of Engineering, Guindy, 6 p.m.\n\nTriplicane Cultural Academy: Talk on ‘Crisis in the Banking Sector – Reasons and Remedies’, PS HSS., Mylapore, 6.15 p.m.\n\nSathyabama University and ISRO: Inauguration of conference on ‘Emerging Novelties and Vistas in Space Technologies and Applications’, Rajiv Gandhi Rd., 10 a.m.\n\nValliammai Engineering College: Lecture on ‘Virtual instrumentation using lab view, Kattankulathur, 2 p.m.\n\nSaveetha School of Management: Inauguration of ‘Pride 2k16 Rendezvous Management fest’, Poonamallee High Rd., 10 a.m.\n\nVels University: Inauguration of workshop on ‘Women Empowerment’, Pallavaram, 9 a.m.\n\nRamakrishna Mission Vivekananda College (Evening): Graduation day, Mylapore, 3.30 p.m.\n\nLoyola Institute of Frontier Energy: Inauguration of workshop on ‘Flood Management’, Nungambakkam, 10 a.m.\n\nM.O.P. Vaishnav College for Women: Programme on ‘Workforce management strategies for gaining competitive edge – Issues and challenges’, Nungambakkam, 10 a.m.\n\nSoka Ikeda College of Arts and Science for Women: Graduation day, Madhanangkuppam, 9 a.m.\n\nJ.H.A. Agarsen College: Programme on felicitation to NCC student and trainer, Madhavaram, 1.30 p.m.\n\nD.R.B. Calavala Cunnan Chetty’s Hindu College: Programme on ‘Youth connect on Civic and Good Citizenship’, Pattabhiram, 10 a.m.\n\nICAI–SIRC: Interactive meeting, ICAI Bhawan, M.G. Rd., Nungambakkam, 5.30 p.m.\n\nChartered Accountants Study Circle: Talk on ‘TDS – Recent Trends’, Prince Arcade, Cathedral Rd., 6.30 p.m.\n\nOrganising Committee: Distribution of prizes to elocution competition winners, Amma Auditorium, Shenoy Nagar, 1 p.m.\n\nUravu Surangam and Sri Krishna Sweets: Programme on ‘Sigarathai Thotta Sivasankari’, Bharatiya Vidya Bhavan, Mylapore, 6.30 p.m.\n\nAdvocates Link Academy: Pattimanram, 322 Law Chamber 2{+n}{+d}Floor, Madras High Court, 4 p.m.\n\nPeriyar Library Reader’s Circle: Meeting, Periyar Thidal, Vepery, 6.30 p.m.\n\nNarcotics Anonymous: Meeting, Keep It Simple Group, St. Joseph High School, Vepery High Rd., Vepery, 7 p.m.\n\nAl-Anon: Meetings, Divine School, Perumal Koil St., Pudur; CSI Inbarasu Aalayam, Tollgate; Puthiya Shakthi Group, Ezhil Nagar 3{+r}{+d}St., Kodungaiyur; Santhome Boys HSS., Santhome; and Philomina MHSS., Injambakkam, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Church of Christ, Anna Nagar; Chennai School, Arunachalam St., Chintadripet; Victory Child Development Centre, Muthalamman Koil St., Selaiyur; Church of Victorious Cross, Jawaharlal Nehru Salai, Ashok Nagar; St. Joseph Church, Cholapuram Rd., Ambattur; St. Sebastian Church, Madhavaram; Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; C.S.I. Church, Thiruvottiyur; and Christ Church, Porur, 7 p.m.", 
    "section": "national", 
    "title": "MRR/CHENNAI TODAY FOR FEBRUARY 25 (THURSDAY) FOR CHENNAI CITY FOR PAGE 4", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}