{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Medical Council of India (MCI) has directed Pondicherry Institute of Medical Sciences (PIMS) to discharge nine post graduate medical students as they have less than the prescribed percentage marks in the post graduate entrance exam for admission.\n\nIn a recent communication to the principal of the private medical college, the MCI named the nine students and asked the institution to submit compliance within two weeks for further consideration in the matter.\n\nOriginally a sub-committee considered the admission of PG students in PIMS for the academic year 2015-16 at its meeting held on September 30, 2015 and a clarification of the college.\n\nThe private medical college clarified that the institute is an unaided private Christian religious minority institution. The admission for the PG course for the year 2015-16 has been made as per the directives of admission committee constituted by the Government of Puducherry headed by Justice A.C.Arumugaperumal Adityan, retired judge of Madras High Court through common entrance test for the private medical colleges in Puducherry and the admission are made as per the merit list. The management said, “A few seats were not filled in the counselling and lapsed, hence we have admitted.\n\n“There is no concessional agreement between the Government of Puducherry and the private unaided institutions at Puducherry for any percentage of seats in the PG courses. Hence, the government has not sponsored any PG students, thus all admissions were made under management quota”, said the private medical college.\n\nConsidering the clarification of the college, the MCI Committee decided, “All the above nine students are required to be discharged as they have less than the prescribed percentage marks for the respective categories in the PG entrance exam and also the sub-committee accepted all admissions made by the institute in management quota.”\n\nThe matter along with recommendations of the monitoring subcommittee was placed before PG committee which approved the minutes of sub-committee.\n\nAccording to sources in the Director of Medical Education and Research, the MCI's directions have been sent to Pondicherry University for necessary action. “The admission of 10 candidates is against the prescribed minimum qualification of both MCI and Supreme Court”, the sources added.\n\nMCI has named nine students\n\nwho have less than the prescribed marks", 
    "section": "national", 
    "title": "PIMS asked to discharge 9 PG students", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}