{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The district police on Wednesday launched an exercise to visit all the vulnerable and sensitive polling stations in four assembly constituencies in the district and identify mischief mongers and notorious criminals to ensure that the coming assembly elections were held in a free and fair manner.\n\nAddressing the Deputy Superintendents of Police and Inspectors of all the seven police sub divisions in the district here, Superintendent of Police N Manivannan directed them to visit all the 122 vulnerable polling stations and prepare the list of trouble mongers.\n\nGiving details of the deliberations to the reporters, the SP said the Police personnel were asked to maintain good rapport with village leaders and take stock of the weapons held by 149 licensed weapon holders in the district as they would be required to surrender the weapons once the Election Commission announced the election notification.\n\nThe police have identified about 300 ‘trouble mongers’ and they would be booked under section 107 Cr PC and asked execute a bond for keeping peace for one year. Those who violated the bond could be arrested and detained for the rest of the bond period under the provisions, the SP said.\n\nThe notorious criminals who were likely to disrupt the election process would be detained under preventive detention, he said.\n\nThe SP said the district police have decided to increase the number of permitted public meeting venues and street corner venues to provide more space for various political fronts to address election rallies during the campaign period. Presently, there were 103 such places after the recent increase of 14 places and this would be further increased, the SP added.\n\nThe police have also taken steps to expedite the trial proceedings of cases registered during 2011-2014, he said. The 300 Youth Brigades, who have been assisting the police in the district, would be sent to Madurai for six months training. On completion of training they would be deployed in the Armed Reserve Police, he said. A total of 137 Youth Brigades, including 46 from Thoothukudi and 91 from Ariyalur would be trained at the Police training college in Kamudhi in the district, he said.", 
    "section": "national", 
    "title": "Police to visit sensitive polling booths", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}