{
    "author": [
        "Special Correspondent"
    ], 
    "text": "He is suffering from a mysterious skin disease\n\nA poor mother is running form pillar to post to save her six-year-old son suffering from a mysterious skin disease since birth.\n\nK. Manthiramoorthy’s skin peels off like wafer from head to foot and eyelids are almost absent.\n\nWhen the poverty-stricken K. Uma Maheshwari of Puttaraththi Amman Temple Street in Tirunelveli Town met Mayor E. Bhuvaneshwari at the Corporation along with her son on Wednesday to explain the trauma she is undergoing and seek assistance for treating her son, the frail-looking mother could not explain the situation in which she has been placed now.\n\n“When some of our close relatives prescribed ‘mercy killing’ as the only remedy for this problem, I vociferously objected to it, saying that my son, like any other child, will be alright one day after undergoing the right treatment. But poverty and ignorance are hindering my son from getting the right treatment,” the mother told the Mayor.\n\nAs the peeled-off skin has made Manthiramoorthy’s body so soft, the boy suffers a lot as the temperature around him rises. “He suffers a lot during summer and we have keep pouring water on him at regular intervals,” said his grandmother Muthulakshmi.\n\nAfter being let down by her husband Kuppusamy, a labourer, Ms. Uma Maheshwari has spent more than Rs. 2 lakh for curing the yet-to-be diagnosed mysterious disease. “With the 10 sovereigns of gold I had, I managed to meet the medical expenses to some extent. Now I have nothing as even my husband is not interested in spending more for the treatment,” the wailing mother said.\n\nBesides assuring her of all possible help, Ms. Bhuvaneshwari also promised Ms. Uma Maheshwari that she would take efforts for getting assistance under the Chief Minister’s Health Insurance Scheme, as a special case. She also deputed two of her women officers to the Collectorate, along with the family, to meet Collector M. Karunakaran.\n\nOn seeing the woman cuddling the boy with the flaked- off skin, Dr. Karunakaran immediately contacted K. Sithy Athiya Munavarah, Dean, Tirunelveli Medical College Hospital, and asked her to ensure the best possible treatment.\n\n“The boy will be admitted to the TVMCH on Thursday for investigation and treatment,” said one of the woman officers of the Corporation who accompanied the boy to the TVMCH.\n\nPhilanthropists or doctors, who want to help the boy may contact 81909 27974.", 
    "section": "national", 
    "title": "Poor family struggles to save 6-year-old boy", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}