{
    "author": [
        "S Ganesan"
    ], 
    "text": "The People’s Welfare Front will form vigilance groups, comprising cadre of its alliance partners, to prevent the distribution of cash by political parties to voters in the run up to the Assembly election, front coordinator and MDMK general secretary Vaiko said here on Wednesday.\n\n“The groups would maintain vigil round the clock. They will seize the cash meant to be distributed to voters and hand it over to the authorities,” he said.\n\nCiting past experience, Mr. Vaiko said the Election Commission could do little to prevent cash being transported by political parties through various modes. “I do not find fault with the Election Commission. The recent statements of the Chief Electoral Officer give us some hope. But, political parties find new ways to disburse cash,” he told a press conference held on the sidelines of the party’s general council meeting here.\n\nExpressing confidence that more parties would join the PWF, Mr. Vaiko said the Desiya Murpokku Dravida Kazhagam and the Tamil Maanila Congress would respond positively to the invitation sent to join the front.\n\nOn whether the PWF would accept Vijayakant as the ‘king’ if the DMDK joined the front, Mr. Vaiko said the PWF leaders would consult each other and consider all aspects when such the situation arises. Seat-sharing talks among the PWF partners would be taken up in due course and there would not be any hitch. “There is perfect understanding among the partners,” Mr. Vaiko said.\n\nHe expressed confidence that the people of the State would support the PWF as an alternative to the two main Dravidian parties. “We are confident that we will establish a corruption-free and liquor-free coalition government with checks and balances,” he said.\n\nExpressing condolences to Nalini, one of the life convicts in the Rajiv Gandhi assassination case, on the death of her father, Mr.Vaiko said the government should have given a longer parole to enable her participate in the rituals. He also demanded that A.G. Perarivalan, another life convict in the case, be given parole to visit his ailing father.\n\nEarlier, the general council, in a resolution, appealed to the people to support the PWF to retrieve the State from the clutches of the DMK and the AIADMK.", 
    "section": "national", 
    "title": "‘PWF will stop cash distribution to voters’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}