{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Express train between Puducherry and Chennai tops demands\n\nUpgradation of Puducherry Railway Station from B to A class is one of the demands.— Photo: S.S. Kumar\n\nPeople and civic organisations hope that their long-pending demands such as introduction of daily express train between Puducherry and Chennai and laying of a new line between Chennai and Cuddalore via Mamamallapuram and Puducherry will be fulfilled in the Railway Budget to be presented in Parliament on Thursday.\n\nLaying new lines\n\nThey demand the Railways to take up pending projects such as laying a new line between Chennai-Cuddalore via Mahabalipuram and Puducherry and complete the project as early as possible.\n\nThey also want better connectivity between the city and other regions such as Karaikal, Mahe and Yanam, besides connecting all the four regions to some of the State capitals.\n\n‘Woefully inadequate’\n\nM. Ramadass, former member of Parliament said, “The existing railway facilities are woefully inadequate reflecting high degree of railway backwardness. It is high time that hereafter, Puducherry also receives its due share from the annual Railway Budget.”\n\n‘No progress’\n\nM. Sivasankaran, Traders’ Federation said the new line between Chennai and Cuddalore was proposed in 2008 and the Union Railway Ministry approved and accorded sanction for the new line. However, there was no progress so far.\n\nSome of the demands\n\nOld Pending Projects (Railway lines) to be implemented and completed: Chennai-Cuddalore Via Mahabalipuram, Puducherry- Kakinada-Yanam -Tindivanam-Cuddalore - Puducherry-Cuddalore - Peralam-Tirunallar (Karaikal)\n\nUpgradation of Puducherry Railway Station from B to A Class Station with all modern infrastructure.\n\nEstablish direct rail link between the four regions of the Territory.\n\nConnect all the four regions to some of the State Capitals.\n\nLink the capital city of Puducherry with New Delhi and other major State capitals.", 
    "section": "national", 
    "title": "Rail budget raises people’s expectations", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}