{
    "author": [
        "C Jaisankar"
    ], 
    "text": "The elephant calf donated to Samayapuram Sri Mariamman Temple arriving at the temple on Wednesday.— Photo: M. Srinath\n\nHigh drama was witnessed at Samayapuram near here on Wednesday when a group of people belonging to four villages blocked a truck carrying an elephant calf donated by Chief Minister Jayalalithaa to Sri Samayapuram Mariamman Temple.\n\nThey were demanding that the female elephant calf, Masini, be taken out in a procession from the arch located a km from the temple rather than being taken directly to the temple premises.\n\nSoon after the Forest Department truck reached the arch, the residents of Mahalikudi, V. Thuraiyur, Marudhur and Panamangalam stopped the truck.\n\nThey claimed that the elephants donated to the temple would generally be taken in procession from the arch after a customary reception given by them. They had been following the practice for years whenever the temple received a new elephant.\n\nHowever, citing the unfamiliar terrain and young age of the animal, the authorities said it would be offloaded only at the temple premises. They also said that the villagers could formally receive the calf at the temple.\n\nA section of protestors entered into heated exchange with Joint Commissioner of the temple G. Thennarasu over the issue.\n\nPolice and revenue authorities held negotiation with the villagers, who gave up the protest after the authorities agreed to offload the elephant and agreed to take out a procession.\n\nThe villagers received the elephant by offering fruits and flowers.\n\nIt was then taken in a procession to the temple, where special pujas were performed.\n\nMinister for Khadi and Village Industries T.P. Poonatchi, Collector K.S. Palanisamy and District Forest Officer N. Satheesh were present.\n\nThe elephant donated by the Chief Minister was formally handed over to the temple on her birthday.", 
    "section": "national", 
    "title": "Row over receiving temple elephant", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}