{
    "author": [
        "Special Correspondent"
    ], 
    "text": "With public examinations fast approaching, a century-old school in the city has issued transfer certificate (TC) to 56 SSLC students.\n\nD. Arockiam of Vidiyal, an NGO, which works with underprivileged children, who obtained the information through RTI Act, said that the school, which had Mahakavi Bharathi as a teacher, had promoted 390 students last year from ninth standard to tenth standard. At the beginning of this academic year, it had admitted nine students in the 10{+t}{+h}standard. However, at the fag end of the academic year, it had issued TC to 56 students and informed that 17 more were marked as “long absent” and thus had 325 on rolls. Instead of giving special coaching for weak students, the school, he alleged, had preferred to issue TC.\n\nThere were apprehensions that most of these students would be forced by their parents to seek jobs or might ultimately turn into vagabonds. The idea of imparting education to the underprivileged had been defeated by such an act, Mr. Arockiam said.\n\nVidiyal has planned to approach other forums to ensure that the students are not denied an opportunity to appear for the public examinations.\n\nWhen contacted, headmaster Balagurunathan denied that the school had issued TC with an intention to score 100 per cent results in public examinations. “Our school encourages students, especially those in the BPL category and first generation learners, coming to school. Since the boys were not interested in pursuing education, they had obtained their TC,” he maintained.\n\nFurther, he said that NGOs like Vidiyal should just not confine to finding mistakes with institutions. They should play a positive role in helping such children shape up well. “This school, which has a chequered tradition, is functioning with the sole objective of educating children. Our pass percentage last year in SSLC was 85,” he replied.\n\nAn official in the Chief Educational Office said that they had asked for details from the school.", 
    "section": "national", 
    "title": "School issues TC to 56 10 {+t} {+h} standard students", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}