{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "APPARENT LETUP:A slippery and uneven mud path is what serves as a service road for the National Highway intersecting Chithode town in Erode.– PHOTO: M. GOVARTHAN\n\nThe condition of service roads at vital points dotting Bhavani-Vijayamangalam stretch of Salem-Coimbatore National Highway leaves much to be desired.\n\nResidents in localities on either sides of the Highway are cut up with the National Highways Authority of India for not prevailing upon the concessionaire to expedite the service road works. The difficulties due to the inadequacy is quite glaring at Kanjikovil diversion near Perundurai, Chithode, Olapalayam and Lakshmi Nagar.\n\nFarmers in villages on the sides of the Highway have been urging the district administration at almost every monthly grievance meeting to do its part to prevent road accidents that take place due to the absence of proper service roads.\n\nIn the first place, the concessionaire must not have been permitted to operate the toll plaza at Vijayamangalam with incomplete service roads, regular users of the Bhavani-Perundurai stretch say.\n\nAt Chithode, accidents are reported at regular intervals due to the uneven surface of the mud paths that serve as service roads. It becomes slushy and slippery at times of rain. In the absence of lighting, two-wheeler riders face an ordeal on a daily basis.\n\nA few political parties also conducted agigations in the recent past to highlight the plight of motorists, but there has been no progress.\n\nThe Highway Patrol Police who have been regular witnesses to accidents on the stretch, especially during night time, say the NHAI has not responded despite repeated representations.\n\nAccording to police sources, service roads and even overbridges are a necessity at Thudupathi and Kanjikovil intersections along the Highway. Two-wheeler riders are more susceptible to accidents during night hours, locals complain.\n\nProtest\n\nAccording to sources, residents in localities in Thudupathi area have planned to block the National Highway to convey their disgust over the NHAI's neglect of their genuine demand for black-topped service roads.", 
    "section": "national", 
    "title": "Service roads to NH in a pathetic condition", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}