{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Textile industry in the State has sought three per cent export incentive, which is now available to other textile products, for cotton yarn too.\n\nAt a meeting with Union Commerce Minister Nirmala Sitharaman here recently, Southern India Mills’ Association chairman M. Senthil Kumar said cotton yarn exports used to be about 140 million kg a month at the beginning of 2014. Since then it has fallen to less than 100 million kg a month now. One of the main reasons is the cotton policy announced by China.\n\nImport duty\n\nFurther, Pakistan has imposed 10 per cent import duty on cotton yarn. The industry will have to export at least 150 million kg of yarn a month and with decline in demand from China, it has to look at other markets. If three per cent export incentive is available for cotton yarn, textile mills will be able to tap new markets, he said.\n\nThe association also appealed to the Government to conclude Free Trade Agreement with European Union soon as EU accounts for 40 per cent of textile exports. Countries such as Vietnam, Cambodia, Bangladesh and Pakistan enjoy duty free access, while Indian textiles attract four per cent to 16 per cent duty in the EU.\n\nThe Centre should also introduce a special debt restructuring scheme for the small and medium-scale enterprises in textiles. A delegation from Indian Texpreneurs Federation, which met the Union Minister, sought duty rationalisation for manmade fibre. Only this will enable the industry realise 300 billion dollars worth exports in the next 10 years.\n\nThe government should organise a global textile fair every year so that overseas buyers could meet the suppliers here and source their requirements.\n\n‘Organise textile fair every year so that overseas buyers can meet suppliers here’", 
    "section": "national", 
    "title": "Textile sector seeks export incentive for cotton yarn", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}