{
    "author": [
        "S Senthalir"
    ], 
    "text": "Hues of rich green, sky blue, sepia, pink, yellow and red recreated nature, politics and culture on canvases, which decorated the walls of Crafts Bazaar in Gandhi Thidal on Wednesday.\n\n‘Images of Eternity’ – paintings by Mahe MLA E.Valsaraj brought out the artist in a politician who has completed 25 years as a legislator, holding important portfolios in the Puducherry cabinet.\n\nChief Minister N.Rangasamy inaugurated the exhibition which is open to the public till Saturday.\n\nAs a violin played, people walked on the red carpet under a roof decorated with golden serial lights admiring the deft strokes of his brush on canvas.\n\n“I started painting when I was a student. I am fond of nature. Due to my active engagement in politics there was a long gap. But, I restarted painting in 2010.\n\nValsaraj took up training in fine arts from the Kerala School of Arts for two years. ‘Oil on Canvas’, a painting he did in 1973 during his training in School of Arts was also on display.\n\n“People believe that there will be no time for arts in politics. Everyone has 24 hours and it is a matter of time management. I love to paint and take time off from politics to pursue my passion,” he said.\n\nAs many as 32 of his paintings were kept on display at Gandhi Thidal. From ‘Matrimandir’ in Auroville, Aayi Mandapam to knife work and collages of nature, to Kathakali dance-drama and Puthalam Temple in Mahe were painted in water colours.\n\n“When I was a student I used more oil paint but it consumes more time. I slowly started using water colours. It is a difficult medium and challenging,” he said. Mr.Valsaraj takes three to four hours to complete an art work.\n\nFrench Consul General Philippe Janvier-Kamiyama, Tourism Minister P.Rajavelu and MLA K.Lakshminarayanan were present during the inauguration.", 
    "section": "national", 
    "title": "This politician seeks a larger, colourful canvas", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}