{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Adhi Mariamman Temple, Inam Samayapuram: Car festival, abishekam, 6 p.m.; Ambal purappadu in Rishaba vaganam, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Ranganayaki Thayar Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6 p.m.; Sri Dhanvanthri Sannidhi, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, Sri Murugan Temple, Sathanur Main Road, 6 p.m.\n\nGovindammal Tamil Mandram: U. Thandapani speaks on Kandapuranam, Pappammal Anna Chathram, Keezha Chinthamani, 6.30 p.m.\n\nCULTURE\n\nOrganising Committee: Sri Thyagabrahma aradhana, vocal concert by S. Kasthuri Rangan and party, Goratha Moolai, North Chithirai Street, Srirangam, 6 p.m.; concert by T.M. Krishna and party, 8 p.m.\n\nRasika Ranjana Sabha: Centenary programmes, vocal concert by Geetha Jayagopal and party, W.B. Road, 6.30 p.m.\n\nHoly Cross College Department of Visual Communication: Media.com – inter-collegiate cultural fest, Kavin, chief guest, 9 a.m.\n\nGENERAL\n\nNational Institute of Technology: Inauguration of Pragyan, Commander K.S. Nathan, vice-president, Defence Ship Building, Larsen and Toubro, chief guest, 5 p.m.; star night with Krishnamachari Srikanth, former India cricket captain, 6.30 p.m.; infotainment by Girasomnis – projection dance, 8.30 p.m.\n\nBharathidasan University Department of Biotechnology: International conference on Bio diversity and bio technology, V.M. Muthukumar, Vice-Chancellor, inaugurates, SRM Hotel,10.30 a.m.\n\nBishop Heber College: International conference on Chemistry for renewable energy, J.K. Rath, Group Leader, Debye Institute for Nanomaterial Science, Utrecht University, The Netherlands, inaugurates, 9.30 a.m.\n\nBharathidasan University Department of Commerce and Financial Studies: Debate on “Focus of India should be Make in India or Invent in India”, V. Sethuramalingam, Head, Department of Social Work, Bharathidasan University, chairs,10 a.m.\n\nSaranathan College of Engineering Department of Management Studies: Lakshya 2016 – national-level management meet, Gayathri Ragavan, Vice President (engineering), Sri Energy Valves, Viralimalai, inaugurates, 9.30 a.m.\n\nSt. Joseph’s Institute of Management: Mancon 2016 – State-level management meet, Rev.F.Andrew, Principal, presides, 9 a.m.\n\nSt. Joseph’s College and Bharathidasan University Department of Educational Technology: Inauguration of national conference on “Higher education in the knowledge age: Techno-pedagogical perspectives and innovations,” 9.30 a.m.; valedictory address by S. Xavier Alphonse, former principal, Loyola College, 3.45 p.m.; Department of Commerce and School of Management Studies: National seminar on Emergency management, 9 a.m.; valedictory address by S.Kandasamy, General Manager, District Industries Centre, 4 p.m.; Shepherd Extension Department: Presentation of audio speakers, Nehru Memorial Corporation Middle School, 3 p.m.\n\nRotary District 3000: Vision 2020 – One Rotary Centre Tiruchi Project planning meet, M. Muruganandam, District Governor Elect, chief guest, PL.A.Ratna Residency, 6.45 p.m.\n\nPeriyar E.V.R. College Training and Placement Cell: Youth-led sustainable development programme in higher educational institution, Youth Connect – Make in India through employability skills, 10 a.m.\n\nJamal Mohamed College Department of Mathematics: Jamatics 2016 – inter-collegiate competition, 9.30 a.m.; valedictory address by T.Nallathambi, Syndicate Member, Bharathidasan University, 4 p.m.\n\nUrumu Dhanalakshmi College Department of Tamil: Special seminar, K. Sivapillai, chief guest, 10.30 a.m.\n\nJ.J. College of Engineering and Technology: Webinar on “engineering women faculty in institutes: case study”, J.S. Awati, assistant professor, Rajarambapu Institute of Technology, Sakharale, resource person, 3.30 p.m.\n\nM.A.M. College of Engineering and Technology: Lecture on “Green IT” by Ramjeevan Singh Thakur, associate professor, Maulana Azad National Institute of Technology, Bhopal, 10.30 a.m.\n\nSharon and JCI Tiruchi Excel: Quiz fest for Rane TRW Rolling Shield, R.C. Middle School, Uyyakondan Thirumalai, 11 a.m.; prize distribution, K.Sudhakar, Plant Head, Rane TRWSSl, Viralimalai, chief guest, Panchayat Union Middle School, Edmalaipattipudur, 3.30 p.m.\n\nM.A.M. School of Engineering and Rotary Club of Tiruchi: Inauguration of Crossroads Ryla – Rotary leadership awards, R.V.N. Kannan, chief guest, noon; Technical quiz, M.A.M.Peer Mohamed, correspondent, presides, 3 p.m.\n\nBishop Heber College Department of Social Work: Awareness programmes on health and hygiene, Bishop Heber Primary School, Teppakulam, 2.30 p.m.; Adaikampatti, Anna Nagar, Thuvarankurichi, 5 p.m.\n\nNehru Memorial College, Puthanampatti: State level workshop on ‘Code yourself with Python,’ S.T. Rajan, associate professor, St. Joseph’s College, distributes certificates,3 p.m.\n\nAIMAN College of Arts and Science for Women: Entrepreneurship awareness programme, Raja Maheswari, entrepreneur, and M. Hemalatha, Head, MBA Department, M.A.M. College of Engineering, speak, 10 a.m.\n\nMIET Engineering College: Entrepreneurship awareness camp, 10 a.m.\n\nHallmark Business School: Workshop on “Financial Statement Analysis”, V. Sreeraman, chartered accountant, speaks, 10 a.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti: Lecture on “Introduction of SAP solutions and support” by M. Soundar and R. Chandra of Technoble Solution India Ltd., 11 a.m.; seminar on “Recent trends in Stenography”, 5.30 p.m.\n\nRajaji Vidyalaya: Annual Day, Rev.Andrew Francis, Principal, St.Joseph’s College, chief guest, 5.30 p.m.\n\nBishop Heber College: Finals of golden jubilee State-level inter-collegiate volleyball tournament for Rev. G.H. Launder Memorial trophy, Rev. G. Paul Vasanthakumar, Bishop, CSI Tiruchi-Thanjavur Diocese, distributes prizes, 6.30 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}