{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Tamil Nadu was the only State in the country giving free power to small and marginal power looms, said M. Duraisamy, Chairman, Powerloom Development and Export Promotion Council, here on Wednesday.\n\nSpeaking to reporters at the inauguration of TEXPO-2016 at MADITSSIA Hall, he said that six million people were involved in power loom sector, the second largest employment provider in the country. Tamil Nadu had six lakh of the 22 lakh power looms established across the country. Biwandi in Maharashtra had the highest number of power looms.\n\nMany States gave sops to the industry, and the Tamil Nadu government gave the first 500 units of power for free to small/marginal power looms, and subsidy for consumption beyond 500 units.\n\nAround 65 per cent of the total fabric produced in the country was contributed by power looms.\n\nThe Ministry of Textiles spent huge amounts for promotion of products through expos in metro cities, tier-II cities and small towns, among other activities.\n\nExhibitors were encouraged to display their products at such exhibitions, which directly benefitted end-users, Mr. Duraisamy said, adding the prices of goods purchased at exhibitions would be at least 30 per cent cheaper.\n\nThe expo has 28 stalls and will be open from 10 a.m. to 8 p.m. till February 28. Exhibitors from different parts of the country have displayed their goods, including saris, furnishings, bed sheets and bed linen. The PDEXCIL has conducted 23 expos this financial year.\n\nMadurai Collector K. Veera Raghava Rao inaugurated the expo.\n\nR. Arasu, an industrialist from Karur, who won the gold medal for the year as top exporter hailed the Central and State governments for the support they extended to the sector. It had enabled entrepreneurs to give competitive prices. The training programmes, offered by Skill Development Corporation, turned unskilled/semi-skilled workers into skilled persons, he added.\n\nT.L. Balakumar, Deputy Director, Coimbatore Region, presided.", 
    "section": "national", 
    "title": "“TN is the only State giving free power to small power looms”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}