{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Police conducting investigation at the house on Avinashi Road in the city on Thursday where two women were found murdered. —Photo: M. Periasamy\n\nRemains of two women in bad shape were found in a house attached to a commercial complex opposite The Residency Hotel on Avinashi Road on Wednesday.\n\nThe Race Course Police said that they could have been murdered more than a month ago.\n\nThe victims were occupants of the house R. Anthonyammal alias Papathi aged over 60 years and her daughter Geetha (38).\n\nAfter the death of her husband Raju (an industrialist) about 10 years ago, Papathi, Geetha and brother of the latter Saravanan alias Saravana Kumar lived there.\n\nPreliminary inquiries revealed that all three of them were mentally disturbed and that Saravanan used to beat his sister and mother if they refused to give him money. The police, quoting neighbours, also said that there were not many visitors to the house.\n\nThe murder came to light on Wednesday morning when Ramakrishnan, a realtor saw the unused property on the prime location and tried to find out whether it was up for sale.\n\nWith nobody responding, he tried to get into the house when he saw two bodies in bad shape. He immediately informed the police, who found a beheaded woman’s body and another woman’s body that was completely burnt.\n\nDeputy Commissioner (Law and Order) Nisha Parthiban visited the place. Police sniffer, finger print and forensic experts were also pressed for duty.\n\nPolice sources said that they suspected it to be the above said women. Vital evidences collected from the house were sent for examination.\n\nThree special teams were formed under Assistant Commissioner (Law and Order) - Central sub division, S. Ramesh Krishnan, to probe the murder. Police said that they are also on the look out for Saravanan, who was missing.\n\nThe police also suspect that they could have been murdered over a property dispute.\n\nInspector V. Selvaraj said that a case has been registered under sections 302 (murder) and 201 (causing disappearance of evidence of offence, or giving false information to screen offender), of the Indian Penal Code. Since bodies were in bad shape, a team of doctors will conduct a post-mortem examination at the crime scene on Thursday, as taking it to the hospital could destroy some clues.", 
    "section": "national", 
    "title": "Two women found murdered in vacant house", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}