{
    "author": [
        "Prince Frederick"
    ], 
    "text": "The layout had its defects.The stands were primitive. The track was bumpy. But Sholavaram had something going for it\n\nOn a late-February evening in 1984, when British racing driver Jim Crawford sat down for an interview, the first few questions sought his views on the Sholavaram Race Track. He had triumphed gloriously on this track driving a Formula II Chevron, and Crawford was honest in his analysis. He said the track was “not as bad as he had imagined it would be”, but called it “bumpy.”\n\nHowever, when asked about how the races were organised, he spoke in superlatives, going as far as rating the event notches above some of the races “in Europe and other parts of the world”.\n\nThese races put Sholavaram, around 25 km from Madras, on the map. Of course, it has always been known for its reservoir but the abandoned World War II airstrip lent it a rare lustre and gave it an almost international identity.\n\nThe abandoned airstrip might have been light years away from being an ideal motor racing track, but everybody, from participants to motoring enthusiasts, would keep returning to it every February, for the way the races were organised and the inexplicable excitement they generated. During the racing season, leaders and celebrities made the trip to Sholavaram.\n\nAnd, this is an unlikely success story. For, the T-shaped layout of the track was defective. Made of casurina poles, the spectator stands were primitive. And, of course, as Crawford pointed out, the track was bumpy. But Sholavaram had something going for it. They called it ‘atmosphere’.\n\nFrom the late 1950s to the late 1980s, the track fuelled famous rivalries, showcased champions and, more importantly, led to a motoring folklore that included spectators.\n\nOn the Sundays in February, when the races were conducted, the spectator was king. Special buses would ply on the dusty roads to Sholavaram, carrying motor racing enthusiasts. Booklets on racing schedules would be available. Thanks to what would follow later, these enthusiasts could easily yield to the illusion that the motoring spectacle had been organised only for their delectation.\n\nThe tough races were really tough and the close ones, really close, many of them are still remembered by racing enthusiasts from that era.\n\nIn February, 1986, the tussle between Jim Crawford, who was driving a Lola-powered Formula Atlantic, and a Chevron-driving Vicky Chandhok is said to have been incredibly engrossing for the skill involved in it.\n\nAnd in February, 1984, the contest between ‘Bullet’ Bhaskie, as Madras bike racer P. Bhaskar Rao would be called, and a younger, Jawa-riding Ashok Krishnan was so neck-and-neck that even after Rao won the battle, in everyone’s mind, there were two winners that day.\n\nSholvaram also derived much of its charm from the wheels that rolled over its track. In February, 1971, Maharajkumar of Gondal enthralled the spectators driving his Jaguar XK 150 in the Grand Prix for cars. He won a close contest with Mike Rauf from Ceylon, who was at the wheel of what he called ‘Rauf Special’. In February, 1973, Dr. C. C. Rossi, treated the spectators to a red-coloured Ferrari, which he drove adeptly to win the Grand Prix for cars.\n\nAnd, of course, Sholavaram was loved, and still is, for the legends it produced – Sundaram Karivardhan and others.\n\n(‘Throwback Thursday,’ a weekly feature, will focus on a variety of aspects of the city’s heritage)", 
    "section": "national", 
    "title": "When February arrived, Madras hit top gear", 
    "subsection": "tamilnadu", 
    "date": "2016-02-25"
}