{
    "author": [], 
    "text": "Aviation fuel costs account for over 40 per cent of an airline’s cost of operations, and hence an increase or decrease in ATF prices has an impact on air fares.\n\nThe airlines argued that average crude prices declined 69 per cent from April 2014 to February 2016, and during this period, the exchange rate went up by 12.7 per cent.\n\nIt said the ATF prices should have been 25 per cent lower than Rs. 34,284 a kilolitre (in Mumbai) announced in February 2016. “The difference of Rs. 8,650 a kilolitre has been pocketed by oil companies as it is a case of profiteering. According to our estimates, the annual ATF bill for airlines is around Rs. 10,000 crore,” the promoters said, and this translated to a higher cost of Rs. 300 a ticket for passengers.\n\nRecent revision\n\nOn March 1, the ATF prices were revised up by 12 per cent to Rs. 38,425 a kilolitre. While airlines had threatened to move the Competition Commission of India at that time, the government said five per cent of the increase could be accounted for by a rise in ATF input costs and the rest was attributable to an increase in excise duty in the Union Budget.\n\nWhile the airlines said they were ready to pay the increase in excise duty on ATF prices, the letter demanded “a quick rollback in the unreasonable prices” effective from March and a reduction in the base price of the fuel on which duties are calculated, stressing that ATF is a “de-regulated product.”\n\n“ATF in India is subject to a multiplicity of taxes and fees, the result of which is that domestic carriers pay up to 50 per cent more for fuel than in Dubai or Singapore… It is further imperative that oil companies realise that the benefits of a lower-cost environment will stimulate business and tourism,” the promoters said.", 
    "section": "national", 
    "title": "Airlines question fuel price hike, cite drop in crude rates", 
    "subsection": "general", 
    "date": "2016-03-28"
}