{
    "author": [
        "Kavita Upadhyay"
    ], 
    "text": "Pins the blame on Minister Harak Singh and former CM Vijay Bahuguna\n\nWhile the BJP is being held responsible for the imposition of President’s Rule in Uttarakhand, Harish Rawat, who was removed as Chief Minister, believes that an alliance between two Ministers — Harak Singh Rawat and former Chief Minister Vijay Bahuguna — caused the downfall of his government.\n\nMr. Rawat replaced Mr. Bahuguna as Chief Minister in 2014, and since then there has been a growing feud between their respective groups in the party.\n\nMr. Harak Singh on Saturday presented to the Press the video of a sting that showed Mr. Rawat discussing some figures with an individual, identified as a journalist associated with a Hindi news channel, in an alleged effort to win back rebel MLAs to prove his majority in the Assembly on March 28.\n\nThe press conference was co-hosted by Mr. Bahuguna’s son Saket Bahuguna, who has been expelled from the Congress for “anti-party activities” after his father’s show of dissent.\n\nMr. Harak Singh had earlier told the media that the Rawat government was a “one-man Army” and that the Chief Minister was never available for a direct communication with the MLAs. Expressing his anger against the two, Mr. Rawat on Sunday described Mr. Harak Singh as “money hungry” and Mr. Bahuguna as a “frustrated man.”\n\n“It is the saddest episode in my life that I had to deal with a Minister in my Cabinet who was only after money,” he said about Mr. Harak Singh.\n\nIn a revelation of sorts, Mr. Rawat said on Sunday that he had had to “compromise at many levels” in order to maintain political stability in the State. Putting the major blame for the rift in the Congress on Mr. Harak Singh, he regretted that he could not muster the courage to sack him.\n\n“I tried to control him on many occasions and that’s why he became rebellious.”\n\n“I was handling a very delicate majority. To ensure that another Harak Singh Rawat does not create political instability, I would like the number of seats in the Assembly increased from 70 to 90,” he said.\n\nHe swore vendetta against the rebel MLAs. “I will make these people repent,” he said. “Rebels have no place in the Congress and they will not be accepted by the people either.”\n\n‘I will make these people repent; the public will not accept them,’\n\nsays Rawat", 
    "section": "national", 
    "title": "An unholy nexus did us in: Rawat", 
    "subsection": "general", 
    "date": "2016-03-28"
}