{
    "author": [
        "Sangeetha Kandavel", 
        "Udhav Naig"
    ], 
    "text": "In Tamil Nadu, the dish has replaced upma as the flavour of election season\n\nAsk anyone how political parties in Tamil Nadu entice crowds to attend their public meetings or rope them in for campaigning and you are more likely to hear that it takes just a quarter bottle of liquor and a packet of meat biriyani.\n\nWhile the Persian delicacy has become an inseparable part of elections in Tamil Nadu, its inclusion as a must-serve dish is not as old as elections in the independent India.\n\nAn ideologue closely aligned with one of the two major Dravidian parties says that biriyani became popular only in the recent past. “When the Congress was ruling the State, they only used to give ‘upma' and coffee’for those who came to their party meetings. Till the 80s, parties never had a culture of giving food to its cadres. The party workers never really expected anything,” he said.\n\n“Previously, only booth agents were given food to ensure that the agent didn’t leave his place. But now, every cadre is demanding it.”\n\nWhen asked how parties manage to ensure food for such a large number of cadres while campaigning, Viduthalai Chiruthaigal Katchi general secretary Ravi Kumar said that when he fought for an MLA seat in 2006 elections, the cadres were given a packet of curd rice or sambhar rice. “Meat is expensive. Smaller parties like us cannot afford it,” he said.\n\nExplaining why biriyani has become so important these days, Mr. Ravi Kumar said cadres have to feel reinvigorated because campaigning is tough. “Many party workers come from economically weaker sections, so meat is something they prefer,” he said.\n\n‘A great combo’\n\nBut why is meat biriyani such a hit with the cadres? Mariappan, who runs a biriyani shop near Egmore, says, “Liquor doesn’t go well with dosa or idli. Only biriyani and liquor make for a great combo.”\n\nIn Tamil Nadu, the dish has replaced upma as the flavour of the election season", 
    "section": "national", 
    "title": "Biriyani and the ballot", 
    "subsection": "general", 
    "date": "2016-03-28"
}