{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Explaining his understanding of the origins of “untouchability” in India, senior BJP leader L. Ganesan, on Sunday, said what was a “method of self-restraint for hygiene purposes” by those who handled carcasses was later institutionalised by others as a form of discrimination.\n\nThe claim received sharp responses from Dalit politicians and writers, who said the “theory” had no basis whatsoever and was in a manner of belittling the victims of untouchability.\n\nElaborating on the comments he made on a television programme, Mr. Ganesan said years ago those who handled carcasses could have possibly kept themselves away owing to hygiene issues.\n\n“Unfortunately, the other side slowly institutionalised this and started demanding the exclusion. If you look at the Bhagavad Gita, Varna is defined on the basis of qualities and duties of a person. There was no birth-based discrimination,” he added.\n\nMaking it clear that Rashtriya Swayamsevak Sangh, of which he has been a long-time member, abhorred any form of untouchability, Mr. Ganesan said he went by the Constitution, which considers all citizens as equals.\n\n“In the RSS, we never ask the caste of the other person,” he said.\n\nMr. Ganesan’s claims drew flak from Dalit intellectuals. Writer Imayam said the remarks “undermined” the draconian problem of untouchablity.\n\n“Caste-based untouchability was systematically developed as a tool of oppression. To say that the victims could have unknowingly started it is an insult to them,” he charged.\n\nThe award-winning writer said rather than making “baseless” claims, RSS members should graciously accept that untouchability was a creation of the Brahminical religion and intervene concretely to put an end to it.\n\nHistorically, the question of untouchability has attracted wide attention among leaders in Tamil Nadu.\n\nOne of the earliest to propound a theory on its origins was Dalit icon Pandit C. Iyothee Thass, who postulated that the modern untouchables were descendants of Buddhists who were persecuted for opposing Brahminism.\n\nCommenting on Mr. Ganesan’s remarks, VCK general secretary D. Ravikumar said the BJP leader was no expert to formulate theories. “Is he a historian, sociologist or anthropologist to make such claims? What is the evidence,” he asked.", 
    "section": "national", 
    "title": "BJP leader’s remarks on untouchability draw flak", 
    "subsection": "general", 
    "date": "2016-03-28"
}