{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Adopting a softer attitude towards Pakistan and China, Defence Minister Manohar Parrikar on Sunday suggested that the confidence-building measures taken for improving India-China ties could be used in the case of relations with Pakistan too.\n\n“I am not born anti-Pakistan. There are a few steps they have taken. I hope they continue with the steps. Like we are building up confidence bridges with the Chinese, [similar measures] may result in better relations [with Pakistan],” Mr. Parrikar told a website on defence affairs ahead of Defexpo 2016 to be held in Goa from Monday to Thursday.\n\nPositive on Pakistan\n\nMr. Parrikar especially made a positive mention of Pakistan Army Chief Gen. Raheel Sharif’s recent pledge to eradicate Pakistan-based terrorism.\n\nThe Minister hinted that Pakistan too could participate in the Defexpo-like events in India in future since no “calibrated decision” had been taken to prevent it or China from doing so.\n\nTies improving\n\nHe highlighted that the ties with China were getting “better”, and that the India-China border dispute may be resolved in future, indicating a high level of mutual confidence before his three-day visit to Beijing, scheduled for April. Mr. Parrikar’s comments are significant in the backdrop of the arrival of the Joint Investigation Team (JIT) from Pakistan on Sunday to participate in the investigation into the January 2 terror attack on the airbase in Pathankot.\n\nMr. Parrikar had earlier resisted the idea of allowing the Pakistani JIT accessing the Pathankot airbase for investigation, but mellowed down after the meeting in Kathmandu between External Affairs Minister Sushma Swaraj and her Pakistan counterpart Sartaj Aziz on March 17 that created better bilateral understanding to take the process of investigation forward.\n\nDiplomats have, however, pointed out that Mr. Parrikar’s comments on both China and Pakistan are more of an expression of hope rather than a pragmatic position.\n\n“Comments from the Defence Minister indicate a position born out of hope that India’s ties with China and Pakistan will improve,” R.S. Kalha, former Ambassador of India to China, told The Hindu , highlighting that China and Pakistan are part of a strategic challenge to India which is not dependent on a couple of factors like terrorism (from Pakistan) and border dispute (with China).\n\n“India has to deal with a broad spectrum of challenges and not just few issues,” said Ambassador Kalha, who emphasised that India cannot afford to wish away greater strategic calculations while shaping its ties with regional players like China and Pakistan.", 
    "section": "national", 
    "title": "‘Border dispute with China can be solved’", 
    "subsection": "general", 
    "date": "2016-03-28"
}