{
    "author": [], 
    "text": "The report of the Comptroller and Auditor General of India (CAG) cannot be the sole basis for any liability being caused or for prosecution to be launched, the High Court of Karnataka has said, while terming as illegal the action of the State-owned Karnataka Power Corporation Ltd. (KPCL) in recovering Rs. 52.37 crore from two private mining companies based on a CAG report.\n\nThe court directed the KPCL “not to initiate recovery against” Kolkata-based EMTA Coal Ltd. and Karnataka EMTA Coal Mines Ltd. “solely on the basis of the CAG report of March 2013”.\n\nA Division Bench comprising Chief Justice Subhro Kamal Mukherjee and Justice Ravi Malimath delivered the verdict on Thursday while allowing the petitions filed by the companies questioning the KPCL’s letters issued in July and December 2014, and March 2015 on recovering the amount as per the CAG report.\n\nThe Bench cited the Supreme Court’s verdict, in Arun Kumar Agarwal vs. Union of India 2013, which had held that reliefs cannot be granted merely based on CAG reports as they are subject to Parliamentary debates and scrutiny before being accepted or rejected.\n\nReferring to the criminal case registered by the Central Bureau of Investigation (CBI) solely based on the CAG report, the Bench said, “… mere drawing up of the FIR by the CBI against unknown officials of KPCL, EMTA and KEMTA cannot provide legal basis or impetus for unilateral demand by the KPCL for recovery of Rs. 52.37 crore. We hold that such action is arbitrary and unsustainable in law.”\n\nThe CAG report had said that the KPCL had paid Rs. 52.37 crore in excess to these companies without deducting the price for 8.28 lakh tonnes of coal rejects out of the total production of coal from one of the KPCL’s open-cast mines during 2008–12.\n\nThe KPCL, which was allotted certain coal mines by the Union government for captive consumption of coal in its thermal power projects in Karnataka, had in 2002 selected EMTA Coal Ltd. for the formation of a joint venture for development of captive mines and supply of coal from them.\n\nHowever, the Bench observed, “It seems that the KPCL forgot that in their response to the audit query by the CAG, they admitted that such a quantification of rejects was erroneous. In their response [to the CAG], the KPCL stated that rejects consisted of only stones and boulders used for levelling and other improvements in the mine.”\n\nThe Bench also noticed that neither was there any dispute between the KPCL and the EMTA nor the KPCL initiated any process for adjudication for quantifying the loss prior to the CAG report in 2013.\n\n‘Reports subject to Parliamentary debates and scrutiny before being accepted or rejected’", 
    "section": "national", 
    "title": "CAG report can’t be sole basis for liability or prosecution: HC", 
    "subsection": "general", 
    "date": "2016-03-28"
}