{
    "author": [
        "Devesh K"
    ], 
    "text": "The Central Bureau of Investigation has registered two more cases in connection with the killings of two persons and an attempted murder of a hotelier in Mumbai, allegedly involving underworld don Chhota Rajan.\n\nThe first case registered against four unknown persons pertains to a shooting in the Bhendi Bazar area of Mumbai, where contract killers allegedly hired by Rajan gunned down Shakeel Modak and Irfan Qureshi in February 2010. Their associate Asif Dadhi was seriously injured in the incident.\n\nModak worked for an MLC, while Irfan ran a fishing trawler.\n\nThe Mumbai Crime Branch arrested four alleged members of the Chhota Rajan gang, identified as Ali Jaan, Adnan, Umaid Ur Rahman and Pranay Rane. Though the accused disclosed that they killed Modak and Irfan at the underworld don’s instance, the police were unable to establish the motive behind the murders.\n\n“The case has been registered under the relevant provisions of the Indian Penal Code (IPC) and the Arms Act, on a reference from the Maharashtra government. Rajan has not been named, as his name initially did not figure in the FIR registered by the Mumbai Police, but his role is being investigated,” said an official.\n\nThe CBI registered the second case of attempted murder of hotelier B.R. Shetty on October 3, 2012. Two motorcycle-borne assailants, suspected to be Rajan’s men, had opened fire at the businessman in Andheri (West) when he was on his way back home. The hotelier escaped with two bullet injuries in the right shoulder.\n\n“The case has been registered against two unknown persons under relevant provisions of IPC, the Arms Act and the Maharashtra Control of Organised Crime Act (MCOCA),” said the official.\n\nContract killers allegedly hired by Rajan gunned down two people in February 2010.", 
    "section": "national", 
    "title": "CBI probing Chhota Rajan’s role in two murders", 
    "subsection": "general", 
    "date": "2016-03-28"
}