{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘Bihar is economically poor, but it has never been intellectually weak’\n\nBihar Chief Minister Nitish Kumar with economist Lord Meghnad Desai on the second day of an international conference organised by the Asian Development Research Institute, in Patna on Sunday.— Photo: Ranjeet Kumar\n\nBihar Chief Minister Nitish Kumar on Sunday accused the Central government of raising emotive issues to divert attention from real issues.\n\n“If you do not want to work, you can engage intellectuals, politicians, social scientists and economists in so many ways, like what is happening in our country today. First people are offered something to dream about and then emotive issues are raised to engage them,” said Mr. Kumar. “Today, in print, electronic or social media, the debate is not on economic growth or employment-generation, but on emotional issues.”\n\nSpeaking on the second day of the five-day International Conference on “Development and Growth: Experience and Theories” at Asian Development Research Institute’s silver jubilee deliberations here, the Chief Minister spoke about his government’s success in bringing down the number of out-of-school children from 12 to 0.86 per cent. “Bihar is economically poor, but it has never been intellectually weak. Bihar has always been the centre of knowledge,” he said.\n\nMr. Kumar attributed the slow speed of industrialisation in Bihar to its narrow economic base. “Bihar needs Central support for its industrial promotion policy to become effective. We shall accept packages or even re-packages,” he said reiterating his demand for “special category status” for the State. “Bihar is now seen as a destination.”\n\nHe also spoke at length about the contribution of institutions like ADRI in the development of the State.\n\nLater, he criticised the imposition of President’s rule in Uttarakhand. “President’s rule in Uttarakhand is a blatant assault on democracy and exposes Modi government’s so-called commitment to cooperative federalism,” he said in a tweet.", 
    "section": "national", 
    "title": "Centre raising emotive issues to divert attention: Nitish", 
    "subsection": "general", 
    "date": "2016-03-28"
}