{
    "author": [
        "Soumya Das"
    ], 
    "text": "Yusuf Khan (name changed) emerges from his small house at Nalpukur in the Bhangar Assembly constituency in South 24 Parganas district. Sitting on a rickety plastic chair, Mr. Khan, a slightly built Trinamool Congress worker, is silent for a moment when asked about the party leadership’s decision to field expelled Communist Party of India (Marxist) leader Abdur Rezzak Molla in Bhangar. Mr. Molla joined the Trinamool only recently.\n\nMr. Khan has only bitter memories of the time when Mr. Molla was in the CPI(M). “They hurled bombs at us and assaulted us with rods, leaving 34 severely injured,” he recalls a day in 1997 when he and others went to the police station in 1997 to submit a petition.\n\nHe says he is in two minds about a candidate who had been in a party which had “committed countless atrocities” on Trinamool workers and his own family when the Left Front was in power. Angry and afraid, he does not want to reveal his name, fearing repercussions from the local Trinamool leadership.\n\n“… I will never vote for him. But as a dedicated Trinamool worker, I have to,” Mr. Khan told The Hindu .\n\nMr. Molla had been an undisputed peasant leader of the CPI(M) in parts of South 24 Parganas for decades. Despite several complaints against him, the CPI(M) could not take any action against him as he had been winning successive Assembly elections from the Canning East constituency since 1972. He was expelled from the CPI(M) in 2014.\n\nTrinamool leader Arabul Islam, who was defeated by the CPI(M) earlier in Bhangar, was expecting the ticket this time. Party sources say disgruntled supporters of Mr. Islam can even “sabotage” Trinamool’s prospects. “The Trinamool will never be able to win in Bhangar with Mr. Molla contesting. The party leadership’s decision will backfire,” a party leader from the constituency told The Hindu .\n\nBhangar, where the minority community makes up 65 per cent of the population, has more than two lakh voters. It has always been a tricky seat for the Trinamool, divided as it is among four factions led by Arabul Islam, Kaizar Ahmed, Ohildul Islam and Nannu Hossain, all with ambitions to enter the Assembly.\n\nParty insiders say that even after the Trinamool leadership made Mr. Arabul Islam the head of Mr. Molla’s campaign, he is fuming. “If I have any discontent, I will keep it to myself. If people have any grudge [regarding Mr. Molla], they will speak about it,” he says. Mr. Molla has not yet directly criticised Mr. Islam. However, his associates are accusing Mr. Islam of trying to “back-stab” the party candidate.\n\nDiscontent is not limited to its local cadres. A sense of fear is rising among the local people. “People prefer not to speak about politics in public,” Sirajul Islam, a homoeopathic doctor, says.\n\nMany of them are loath to back an ex-CPI(M) leader as their candidate in the constituency", 
    "section": "national", 
    "title": "For Bhangar’s Trinamool cadre, the enemy is within", 
    "subsection": "general", 
    "date": "2016-03-28"
}