{
    "author": [], 
    "text": "Upholding the conviction of three persons for gang-raping five mentally challenged girls at an orphanage run by them, the Bombay High Court has come down heavily on the state Child Welfare Committee (CWC) for failing to do its duty as a watchdog.\n\nA division bench of Justices RV More and Anuja Prabhudessai upheld the conviction of Ramchandra Karanjule, Nanabhau Karanjule and Khandu Kasbe on charges of gang-raping and molesting five girls, including three minors, at an orphanage run by private trust Kalyani Mahila Bal Seva Sanstha at Kalamboli in Navi Mumbai. Ramchandra Karanjule and his wife were trustees of the orphanage.\n\nIn its 120-page judgement on March 11, the HC said, “The CWC is a primary body for addressing needs of children in need of care and protection. The CWC is required to play a role of watchdog at the district level and ensure that standards of care are maintained and the incidents of exploitation and abuse in all child care institutions are addressed.”\n\nIt added, “In the present case, facts clearly indicate that the CWC members have not acted in the best interest of the child. The insensitive role of CWC in adopting an ‘I see no wrong and hear no wrong’ stand greatly perturbs our judicial conscience,” the bench observed in its order. It said that had CWC performed its duties sincerely and with sensitivity, the truth would have been unearthed and the young helpless and vulnerable victims would not have been physically, sexually and emotionally traumatised. The HC, while upholding the conviction of the three persons, observed that the prosecution has proved beyond reasonable doubt that the girls were raped. The court observed that Karanjule, as director of the orphanage, portrayed himself to be a “savior, protector and guardian” of such girls who were abandoned by their families and shunned by the society. —PTI", 
    "section": "national", 
    "title": "Gangrape at orphanage: High Court raps CWC for failing to do its duty", 
    "subsection": "general", 
    "date": "2016-03-28"
}