{
    "author": [
        "A D"
    ], 
    "text": "LPG-fired crematorium being built at a cost of Rs. 1.5 crore promises easy disposal of bodies\n\nIn a marked shift to an eco-friendly way of disposing dead bodies, the temple city of Tirupati will soon get a first-of-its-kind LPG-fired crematorium.\n\nChristened ‘Govinda Dhamam’, the Rs. 1.5 crore-facility coming up at Thimminaidupalem on the city outskirts is the result of painstaking efforts by Maha Prasthana Seva Samithi, a conglomerate of the city’s elite.\n\nThe idea is to shun the unhygienic practice of doing away with the bodies and bring in a system that gives clean, decent and respectable farewell to the departed . While the body is laid on the cot-like surface, LPG is used to fire the furnace underneath. Typically, a full gas cylinder is required to decimate a body at a high temperature of 800-1000 degrees Celsius. The smoke is sent out through a 100-ft tall chimney, while the remnants are washed away with a constant gush of water. The ash (asthikalu) is handed over to the kin in 90 minutes after the cremation starts, and in case of delay, will be stored in lockers similar to banks. In true corporate style, the organisers are also installing CCTV cameras at the spot to facilitate viewing of the last rites by relatives situated far away.\n\nTwo cremation units\n\nTwo cremating units coming up at the complex facilitate cremation of two bodies simultaneously. The units, costing Rs. 30 lakh each, were procured from Coimbatore. Collector Siddharth Jain has agreed to fund one unit under the ‘Smart Village’ project, while Telugu Association of North America (TANA) representatives Komati Jayaram and Satish Vemana are sponsoring the second. RASS seneral secretary Padma Shri G. Muniratnam announced Rs. 11 lakh, while Amara Raja group offered Rs. 15 lakh for the project. Advocate M. Purushotham Reddy, who is associated with the project since its inception, donated Rs. 3 lakh.", 
    "section": "national", 
    "title": "‘Govinda Dhamam’ on Tirupati outskirts", 
    "subsection": "general", 
    "date": "2016-03-28"
}