{
    "author": [], 
    "text": "India will convey its concerns to the U.K. about the new British immigration law that will affect professionals earning below £35,000 annually.\n\nCommerce and Industries Minister Nirmala Sitharaman said: “We will take it [new U.K. visa law] up” with the British authorities.\n\nUnder the new rule coming into effect in April, professionals living and working in Britain on a Tier-2 visa who earn less than £35,000 a year at the end of five years of their stay in the country could be deported.\n\nIn an interview to PTI, the Minister said that India had taken up similar issues concerning visa rules of the U.S. government at the World Trade Organisation.\n\n“We have challenged [the U.S.] in the WTO... we have challenged one, so the principle applies for anybody else,” Ms. Sitharaman said.\n\nIndian professionals have formed the largest category of individuals issued such visas by the U.K. over the years.\n\nAccording to the U.K.’s Office of National Statistics, of the 55,589 Tier-2 sponsored visa applications cleared in 2014-15, nearly 78 per cent were for Indians (31,058).\n\nThousands of Indians in the U.K. may get hit by this new law. The exact figure of those affected by the salary threshold requirements remains uncertain but it is estimated to be between 30,000 and 40,000 workers.\n\nThe visa is issued on the basis of a “certificate of sponsorship” issued to U.K.-based firms to hire such professionals from outside the EU and allows them a maximum stay of six years. At the end of five years, these workers can apply for permanent residency or “Indefinite Leave to Remain (ILR)” in the U.K.\n\nBut from next month, those qualifying for the ILR under the five-year category must prove they earn at least 35,000 pounds a year or face the prospect of a rejection, which means they would have to return to their home country or ultimately be deported if they refuse to leave voluntarily. — PTI", 
    "section": "national", 
    "title": "India to take up new visa law with British authorities", 
    "subsection": "general", 
    "date": "2016-03-28"
}