{
    "author": [], 
    "text": "Pakistan's Joint Investigation Team arrives in New Delhi on Sunday to carry forward the probe into the Pathankot airbase attack.— PHOTO: PTI\n\n“We will be handing over the DNA code to the Pakistan team and expect them to match it with the families in Pakistan. For this, they will have to locate their families first,” said the official.\n\nOfficials said they had “irrefutable evidence” for the JeM’s involvement in the attack. The NIA is also expected to ask the team about the progress on the Letter Rogatory sent earlier.\n\n“The four JeM terrorists, all of whom have been identified, dialled six numbers in Pakistan. The numbers belonged to various service providers in Pakistan and we would like to get the call record details of these numbers,” said the official.\n\nThe NIA has prepared a dossier on JeM chief Masood Azhar, his brother Abdul Rauf (one of the handlers) and another handler Kaashif Jaan, who had dropped the terrorists at the Punjab border on the night of December 31.\n\nKaashif Jaan, who exchanged a number of calls with the terrorists, has been under the scanner of intelligence agencies for long.\n\nAn analysis of his Facebook profile revealed that of the 1,200 people on his Friends list, 130 belonged to the JeM. According to the NIA, Kaashif Jaan was also friends with a few Kashmir-based groups. through his Facebook page.\n\nNot only the attack on the Pathankot airbase, India will also underscore the similarities with the attack on a police post at the Rajbagh police station in Kathua, Jammu, on March 20, 2015 and the attack on an Army camp in nearby Samba on March 21, 2015. All these places are located within 15-20 km of the Pakistan border and along the National Highway 1A, and the attacks were suspected to have carried out by JeM militants.\n\nThe NIA has found that Chawinda in Pakistan is connected to Bamiyal in Punjab, where terrorists are suspected to have infiltrated into India.\n\nThe Pakistani team will be taken to the village in Bamiyal from where the terrorists infiltrated into India. The Pakistani team, which was received by officials of the NIA and the Pakistan High Commission, will visit Pathankot on Tuesday. It will be flown in an Embraer aircraft owned by the Border Security Force.", 
    "section": "national", 
    "title": "India to hand over DNA samples of Pathankot attackers to Pak. team", 
    "subsection": "general", 
    "date": "2016-03-28"
}