{
    "author": [], 
    "text": "With its moat, wall, barbed wire, armed guards and security cameras, the facility could be mistaken for a military base if it weren’t for the pungent odour of marijuana in the air.\n\nHere, on the outskirts of a quiet village in northern Israel, 50,000 plants of 230 varieties grow at the country's second-largest medical cannabis plantation.\n\n“For cannabis, we are in the promised land with a good climate, 300 days of sunshine each year and perfect levels of humidity,” said Tamir Gedo, head of BOL Pharma, a company authorised by the Israeli Health Ministry to grow and distribute medical cannabis.\n\nThe recreational use of cannabis is illegal in the Jewish state, but for the past 10 years its therapeutic use has not only been permitted but also encouraged.\n\nLast year, doctors prescribed the herb to about 25,000 patients suffering from cancer, epilepsy, post-traumatic stress and degenerative diseases.\n\nThe purpose is not to cure them but to alleviate their symptoms.\n\nThe use of cannabis in medicine divides doctors around issues of addiction and behavioural problems such as aggression.\n\nNevertheless, it has long been known to revive lost appetite and to help in treating sleep disorders, anxiety and inflammation, its supporters say.\n\nThey say much research remains to be done but it is advancing faster in Israel, where authorities allow human clinical trials, than in many other countries.\n\nEntrepreneurs, investors and researchers are increasingly entering the business and searching for the holy grail of medicinal marijuana: a purified form of the drug with minimal side-effects and which can be administered in accurate doses.\n\nInside the fortified premises of BOL (Breath Of Life) Pharma are laboratories and greenhouses, with each plant monitored by software that remotely controls its biochemical parameters.\n\nForbidden to export its cannabis plants, Israel is concentrating instead on marketing its agronomic, medical and technological expertise in the hope of becoming a world hub in the field.\n\nThe prestigious Hebrew University of Jerusalem has just opened a cannabis research centre joining 19 other teams from local academic institutions.\n\nIn January, U.S. tobacco giant Philip Morris ploughed $20 million into Israeli company Syke, which produces precision inhalers for medical cannabis. — AFP", 
    "section": "national", 
    "title": "Israel sees a heady future for medical marijuana", 
    "subsection": "general", 
    "date": "2016-03-28"
}