{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Union Finance Minister Arun Jaitley on Sunday said the actions of the Uttarakhand government — starting with the way the Finance Bill was deemed passed on March 18 despite at least nine Congress MLAs openly rebelling against the government in the Assembly — showed the government was “non-constitutional”.\n\n“It is perhaps the first and only example in independent India that a failed Bill was passed in the Assembly without a proper vote. The government that was in power after March 18 was non-constitutional,” he told the media.\n\nBut Congress spokesperson Manish Tewari said, “A floor test is the lone constitutionally ordained method of testing the strength of a government. In case, the floor test is not possible, it is obligatory on the part of the Governor to give written reasons for not holding it.”\n\nSources in the Congress said the Union government had moved precipitately as the Rawat government managed to win over Independents and members of the neutral parties and the deadline set by Speaker Govind Kunjwal for the rebels to respond to the show-cause notice was about to expire.\n\n“With nine MLAs disqualified, the Rawat government would have won the floor test anyway,” said a senior leader.\n\nSigns of nervousness were visible in Congress headquarters on Saturday night, when Prime Minister Narendra Modi called an emergency Cabinet meet on the Uttarakhand crisis, hinting at the likelihood of President’s Rule.\n\nAppeal to Pranab fails\n\nMr. Modi’s Cabinet did not reveal its cards and senior Congress leader Ambika Soni urged President Pranab Mukherjee to “find out everything and look at the greater impact of such actions [President’s Rule]” on the democratic tradition of India.\n\nSince Ms. Soni’s appeal failed to stop President Mukherjee from dismissing the government, the party’s senior leadership unleashed a barrage of criticism on the BJP government, with some describing President’s Rule as a “murder of democracy” and others accusing the BJP of pursuing its “Congress-free India” agenda.\n\nIn his report to the President, Governor K.K. Paul said that despite opposition, the Appropriation Bill was passed in the Assembly in controversial circumstances. It charged there was breakdown of law and order and the sting operation where the Uttarakhand CM is purportedly seen offering money to rebel MLAs was found to be genuine by the Central Forensic Science Laboratory, Chandigarh.\n\nThe Ministry of Home Affairs appointed former CRPF DG Prakash Mishra and former Culture Secretary Ravindra Singh as advisers to the Governor.", 
    "section": "national", 
    "title": "It was a non-constitutional government: Jaitley", 
    "subsection": "general", 
    "date": "2016-03-28"
}