{
    "author": [
        "G Anand"
    ], 
    "text": "Aboobacker Siddique’s path to perdition began at the Karipur international airport on a hot April afternoon in 2015 when he boarded a flight to Kuwait.\n\nThe 34-year-old native of Kasargod was arrested soon after his arrival at the Farwaniyah airport on the charge of smuggling heroin into that country.\n\nAccording to DIG, Intelligence, P. Vijayan, who is also the chief of the newly formed Kerala Police Anti-Narcotic Team, Siddique was among scores of Keralites languishing in Kuwait jails on drug charges.\n\nMany faced the prospect of death sentence. Some of the detainees were innocents duped into carrying narcotics for others. Most had been lured into smuggling heroin by offers of job visas, free air-tickets or hefty commissions.\n\nThe other detainees known to the State police included Shahul Hameed of Mannarkkad in Palakkad district and Faisal of Vazhakkad in Malappuram district. The Kuwait police suspect they were all part of the same heroin smuggling ring, Mr. Vijayan said.\n\nThe State police have now formed a special team under SP Debesh Kumar Behera to find out the source of the heroin smuggled to the Gulf from Kerala and expose the local networks involved in the international racket.\n\nMr. Behera said his team would collect the details of all Keralites jailed or executed on drug smuggling charges in the Gulf in the past five years to identify crime patterns, if any. Such information was still sketchy. The police would use its resources in Kuwait to interview the detainees in jails there.\n\nThe decreased availability of contraband heroin sourced from Afghanistan has forced drug smugglers to procure the stuff illegally from licenced opium growing areas in central India.\n\nErrant growers in the region often under-report the acreage under cultivation to squeeze profits by selling the unaccounted opium to drug rings, he said.\n\nM.P. Mohanachandran, Dy.SP, a seasoned anti-narcotic investigator on Mr. Behera’s team, said the Kuwait-link first came to light in 2013 when the police investigated a network that routinely smuggled heroin sourced from Afghanistan or Afghan Stuff (AS) to that country through airports in Kerala.\n\nEight persons, including a woman, were arrested. Their mobile phone history and bank accounts had revealed that the some person, possibly in a jail in Kuwait, controlled the ring, he said. The police have taken a renewed interest in the case that had been considered closed.\n\nMost detainees were lured by offers of job visa, free air-tickets or hefty commission", 
    "section": "national", 
    "title": "Kerala forms special team to find source of narcotics smuggled to the Gulf", 
    "subsection": "general", 
    "date": "2016-03-28"
}