{
    "author": [
        "Soumya Das"
    ], 
    "text": "The Prime Minister mentioned the Narada News sting\n\nIn his maiden election speech in West Bengal, Prime Minister Narendra Modi took jibes at the Trinamool Congress about the Narada News sting, but was relatively subdued in his criticism of Chief Minister Mamata Banerjee.\n\nCompared with his aggressive stand against Ms. Banerjee in the run-up to the Lok Sabha elections in 2014, Mr. Modi did not refer to the investigation into the Saradha chit fund scam. He chose to explicitly underscore the achievements of the Bharatiya Janata Party over the past two years rather than launch a direct tirade against the ruling party and Ms. Banerjee.\n\nThe Prime Minister was speaking at Kharagpur in Paschim Medinipur district on Sunday.\n\n‘Saradha then,\n\nNarada now’\n\n“First there was Saradha [Ponzi scam] and now there is Narada [sting operation on Trinamool leaders]. The entire leadership was seen in front of the camera asking, ‘When will you give me my next bribe’,” Mr. Modi said. “The [currency] notes taken there [in the sting operation] are public money. We have been in power at the Centre for two years now and not a single allegation of corruption has been raised against us,” he said.\n\nThe Prime Minister’s criticism of the Trinamool supremo was limited to the “change in her nature, intention and action” after her party came to power. “From an Opposition leader, she started behaving like an empress who does not want paribartan (change),” he said.\n\nEven while comparing the 34-year Left Front rule with that of the Trinamool, Mr. Modi chose sectors such as power, health and education where West Bengal has done “marginally” better under the Mamata-led government.\n\nOn law and order and industry, the Prime Minister's criticism was relatively stronger. “While other industries are shutting down in Bengal, the only one flourishing is that of making crude bombs,” he said.\n\nMr. Modi’s attack on the Left-Congress tie-up was much more direct. Referring to the rivalry of the Left Front and Congress in the Kerala Assembly polls, he accused them of “doing dosti (friendship) in Bengal and kushti (wrestling) in Kerala. “\n\nIn his nearly 50-minute speech, Mr. Modi directly criticised the Chief Minister only twice. Referring to her meeting with Left leaders at the State Secretariat in 2014, he accused Ms. Banerjee of joining hands with the Left and the Congress to stop the BJP and of claiming Centre’s scheme of providing subsidised foodgrains to the poor as her own scheme. “Money is coming from the Centre, not the State,” Mr. Modi reminded the 20,000-strong crowd.\n\nReacting to Mr. Modi’s speech, CPI(M) State secretary Surjya Kanta Mishra said the “Central investigation agency” has “slowed” the investigation into the Saradha scam.", 
    "section": "national", 
    "title": "Kushti in Kerala, but dosti in Bengal: Modi on Left-Cong. tryst", 
    "subsection": "general", 
    "date": "2016-03-28"
}