{
    "author": [
        "Mike Mcphate"
    ], 
    "text": "After being pulled over while driving, James Meyers was told he had a 2002 arrest warrant against his name\n\nThe law caught up with a wanted man on the streets of North Carolina this week.\n\nThe man, James Meyers, was driving his 10-year-old daughter to school in Concord, North Carolina, northeast of Charlotte, when a police car pulled him over for a broken brake light.\n\nBut when the officer ran his license, he confronted him with an older crime, from 14 years ago. “Sir, I don’t know how to tell you this,” the officer began. Mr. Meyers had a 2002 warrant out for his arrest for failing to return a VHS movie rental of Freddy Got Fingered .\n\n“I just laughed,” Mr. Meyers recalled on Thursday.\n\nThe officer let Mr. Meyers go and told him to show up later at the police station, where officers took him to a magistrate’s office, patted him down and put him in handcuffs.\n\nThe story of Mr. Meyers’ ordeal has gained wide attention, spreading from a YouTube video he posted to a local broadcaster and, finally, ricocheting around the world on social media.\n\nFuelling the fascination are the quaint technology involved in the crime — a VHS tape, the bulky cassette that seems like such a distant memory in the age of Netflix — and the choice of movie. Of all the films to be handcuffed over, Freddy Got Fingered is arguably among the most awkward.\n\nStarring the gross-out comedian Tom Green at the height of his fame, the movie was viciously panned by critics. Some called it among the worst movies ever made. It has, nonetheless, garnered a cult following. In an interview, Mr. Green said he also laughed when he heard about Mr. Meyers’ case.\n\n‘Ridiculous all around’\n\n“It is just kind of ridiculous all around,” he said. “I think the fact that the movie was ‘Freddy Got Fingered’ just makes it funnier for some reason. I don’t know why.”\n\nMr. Meyers, a caterer who also performs as a dance music DJ under the name Mad Influence, said he had no idea what happened to the VHS tape, but he does remember watching it and laughing hysterically.\n\nLawyers say arrests for overdue rentals are rare, but cases have been reported in several states, among them Colorado, Wisconsin, Texas and South Carolina.\n\nIn 2012, a woman in New Mexico was arrested in front of her five children and accused of failing to return a Twilight DVD set and a library book. She later won a settlement of $7,500 because the city had failed to properly notify her about a summons, her lawyer, Eric Dixon, said on Thursday.\n\n“Arresting people for these petty issues” clogs up the criminal courts, Mr. Dixon said.\n\nSuch cases should be decriminalised and handled like traffic tickets in civil court, he said.\n\nMr. Meyers was ordered to appear in court on April 27 to answer the charge of “failure to return rental property,” a misdemeanour. He said it was unclear what would happen.\n\nThe video store, J&J’s Video in Salisbury, has since closed.\n\nMr. Meyers said he rewatched Freddy Got Fingered on Wednesday.\n\nAbout 1.30 a.m., his phone rang. On the other end was a voice re-enacting one of the most famous scenes from the movie, when Freddy ties sausages to his fingers and chants, “Daddy, would you like some sausage.”\n\n“I instantly knew who it was,” Mr. Meyers said. “I almost died.” Mr. Green, who is on a comedy tour in Australia, told Mr. Meyers he would help with any fees related to the case.\n\n( Susan Beachy contributed research. ) — New York Times News Service\n\nThe story has gained attention and led to calls for decriminalisation of such petty issues", 
    "section": "national", 
    "title": "Man arrested in U.S. for not returning VHS tape", 
    "subsection": "general", 
    "date": "2016-03-28"
}