{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Samajwadi Party activist Rahul Singh and his supporters showing their displeasure after he was denied ticket from East Lucknow Assembly constituency for the 2017 election in Lucknow on Sunday.— Photo Rajeev Bhatt\n\nIn the latest addition to Samajwadi Party chief Mulayam Singh’s ever expanding political family tree, his youngest daughter-in-law Aparna Yadav was on Sunday declared the party’s candidate from Lucknow for the 2017 Uttar Pradesh Assembly elections.\n\nMs. Yadav will fight from the prestigious seat of Lucknow (Cantontment), currently held by the Congress’ Rita Bahuguna Joshi. The SP has struggled on the seat in the past and in 2012 stood a dismal fourth.\n\nThe decision to introduce Ms. Yadav into politics was announced by Shivpal Singh Yadav, Cabinet Minister and brother of Mulayam Singh. A social worker, Ms. Yadav(26), is the wife of Prateek Yadav, Mulayam Singh’s second son and Chief Minister Akhilesh Yadav’s step-brother. She is the daughter of senior journalist Arvind Singh Bisht and has been actively involved in women empowerment campaigns through her NGO B-Aware.\n\nMs. Yadav has a Masters degree in International Affairs and Politics from Manchester University and has been vocal on political issues. She is also a trained singer.\n\nHowever, her activism on social media and political platforms have embarrassed the SP on a few occasions. Not only did she make headlines by expressing her admiration for Prime Minister Narendra Modi and praising the Swacch Bharat Abhiyan, in January she also attended a function in Lucknow, where Mr. Modi was chief guest.\n\nThe youngest ‘bahu’ of the Yadav patriarch joins several other family members who are politically active and hold positions. While Mr. Singh’s eldest daughter-in-law Dimple Yadav is an MP from Kannauj, his nephews Dharmendra Yadav, Tej Pratap and Akshay Pratap, are MPs from Baduan, Mainpuri and Firozabad. Shivpal Singh Yadav, the SP supremo’s brother is State PWD Minister while his cousin Ramgopal Yadav is a Rajya Sabha member. Recently, Mr. Mulayam Singh’s newphew Abhishek Yadav alias Anshul, niece Sandhya Yadav and another relative Vandana Yadav, were elected in the panchayat polls.", 
    "section": "national", 
    "title": "Mulayam’s daughter-in-law gets ticket from Lucknow", 
    "subsection": "general", 
    "date": "2016-03-28"
}