{
    "author": [], 
    "text": "Terming peaceful assembly a “crucial tool” of public participation, India has told the United Nations Human Rights Council (UNHRC) that while the right to peaceful protests cannot be taken away, no demonstration should be allowed to “paralyse” life.\n\n“The ability to protest peacefully is an essential enabler for other rights and freedoms,” India’s Permanent Representative to the U.N. in Geneva, Ajit Kumar, told the UNHRC.\n\n‘Crucial tool’\n\n“Peaceful assembly is a crucial tool of public participation,” he said in India’s Explanation of Vote at the adoption of a draft resolution on “Promotion and protection of human rights in the context of peaceful protests” on Thursday.\n\nHe said that as the largest democracy in the world, India was committed to the rule of law and the Indian Constitution guaranteed all fundamental rights — the freedom of speech and expression as well as freedom to peaceful assembly, including peaceful protests.\n\nNationalism debate\n\nThe Indian envoy’s comments at the Geneva-based U.N. human rights body came amid a heated debate back home on nationalism involving leading universities, over the right to peaceful protests and freedom of expression.\n\nAsserting that no person can be divested of these rights, which cannot be taken away or abridged, Mr. Kumar, however, stressed that every right has a corresponding duty, and in the name of legitimate exercise of one’s right to protest, the fundamental right of others could not be “scuttled”.\n\n“Enjoyment of rights always entails a degree of responsibility. Our Constitution clearly recognises these inherent, reasonable restrictions, clearly related to the purpose enshrined under the right.\n\n“In a democratic polity, the fundamental right of each citizen is sacrosanct. However, the collective cannot undermine the same. The persons or the organisations should always be cognisant that in the name of demonstration or protest, the life of a civilised society cannot be allowed to be paralysed,” he said. — PTI\n\nEnjoyment of rights entails a degree of responsibility always, says envoy at UNHRC", 
    "section": "national", 
    "title": "Protests okay, but must not paralyse life: India", 
    "subsection": "general", 
    "date": "2016-03-28"
}