{
    "author": [], 
    "text": "Here is Little Red Riding Hood, rifle slung over her shoulder, confidently striding through the forest. Now we see her granny, taking aim with a shotgun at the Big Bad Wolf.\n\nWhat’s that? You don’t recall your favorite Brothers Grimm characters packing heat?\n\nThen you must not have read the versions of classic fairy tales that have been reworked by the National Rifle Association, to help empower children by teaching them that well-armed citizens — even in the world of storybooks and make-believe — can protect themselves from those who would do them harm.\n\nThe powerful U.S. gun lobby has long made initiatives for children — the next generation of future gun owners — a key part of its outreach.\n\nThe NRA has taken its efforts a step further by reworking some of the classics from children's literature.\n\n“Most of us probably grew up having fairy tales read to us as we drifted off to sleep. But how many times have you thought back and realized just how, well, grim some of them are? Did any of them ever make your rest a little bit uneasy?” the NRA wrote on its website. “Have you ever wondered what those same fairy tales might sound like if the hapless Red Riding Hoods, Hansels and Gretels had been taught about gun safety and how to use firearms?”\n\nThe NRA enlisted writer Amelia Hamilton “to present her twist on those classic tales.”\n\nThe girl in the story stands little risk of being devoured by a wolf, armed with a firearm as she traverses the forest en route to her grandmother's house. “Red felt the reassuring weight of the rifle on her shoulder,” when she crosses paths with the wolf. “His wolfish smile disappeared for a moment when his eyes fell on her rifle,” however.\n\nWhen he tries to engage her in conversation, “she shifted her rifle so that it was in her hands and at the ready. The wolf became frightened and ran away.”\n\nThe girl’s grandmother finds that a gun affords protection not just in the deep dark forest, but at home too, when the wolf shows up there looking to make her his meal.\n\n“The wolf leaned in, jaws open wide, then stopped suddenly,” the story reads. “Those big eyes looked down and saw that grandma had a scattergun aimed right at him.\n\n“I don’t think I’ll be eaten today,” said Grandma, “and you won't be eating anyone again.” — AFP", 
    "section": "national", 
    "title": "Red Riding Hood packs heat in U.S. gun group’s reinvented fairytale", 
    "subsection": "general", 
    "date": "2016-03-28"
}