{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "We believe it is the people who are our face; it is the people who make history, says Dr Surjya Kanta Mishra\n\nAt an election rally in the Narayangarh Assembly segment in West Bengal’s Paschim Mednipur district, a group of women approach the car of the Leader of the Opposition, Surjya Kanta Mishra. After greeting the CPI(M) State secretary, they say, “We are here to tell you that we will fight your battle; you go across the State and campaign for other candidates.”\n\nThe 67-year-old leader, who is leading the Left Front campaign in the elections, however, does not consider himself the face of the Opposition or the Left Front in the State. “Somebody can be face of the people but we believe that it is the people who are our face ultimately. It is the people who make history,” Dr. Mishra said, quoting veteran Marxist leader and former Chief Minister Jyoti Basu.\n\nAmid the electoral frenzy, the CPI(M) leader, who has back-to-back political rallies scheduled across the State, is at ease in a small room at the party headquarters on Alimuddin Street.\n\nSpeaking about the larger alliance of the Opposition, including the tie-up with the Congress, he says it as a coming together of all secular democratic forces and a “people’s alliance.”\n\n“Leaders of different parties talking about candidates and seats is not enough; the battle must be fought at the booth level,” he said.\n\nReflecting on the experience of successfully managing an alliance in the 34 years of Left Front rule, the CPI(M) State secretary said this time, “it is the people who were ahead of the political parties,” which led the parties to come together. “We cannot teach people. We have to learn from them,” Dr. Mishra told The Hindu in an interview.\n\nDr. Mishra admits to certain hiccups with the Congress in a few districts, and says the latter has remained the main adversary in these districts. However, the urge of the people to remove the Trinamool government, has brought different parties together.\n\nHe also refers to the Narada News sting where a number of leaders of the Trinamool Congress are allegedly seen accepting money from agents of a fictitious company.\n\n“It is matter of shame. This vindicates our stand that the topmost level of the ruling party is neck-deep in corruption,” Dr. Mishra said.\n\nNarada sting vindicates our stand that the top rung of the Trinamool is neck-deep in corruption, says Mishra", 
    "section": "national", 
    "title": "We cannot teach people, we have to learn from them", 
    "subsection": "general", 
    "date": "2016-03-28"
}