{
    "author": [
        "Rahi Gaikwad"
    ], 
    "text": "Children play cricket as smoke emerges from the Deonar dumping ground in Mumbai on Sunday.— Photo: Vijay Bate\n\nFire in small pockets of the Deonar dumping ground continued on Sunday, a week after the blaze had started engulfing the area in a cloud of smoke. While fire fighting operations were underway, officials said with windy conditions aggravating small fires, it was difficult to estimate how long it would take to douse the flames completely.\n\n“Our efforts are on. There are small fires in pockets,” divisional fire officer P.B. Bhosale told The Hindu .\n\nFire officials said eight fire tenders and 10 tankers were still engaged in fire-fighting. The operation was getting compounded with windy conditions, which fanned small sparks.\n\nResidents of Deonar, Govandi, Chembur and Navi Mumbai areas have been battling with the hazardous effects of toxic smoke due to the fire since early this year. The protracted efforts to extinguish the fire have put them at risk of toxic fumes time and again.\n\nIt has been a week since the current fire started at the dumping ground on March 20, but the BMC still has not been able to put it out completely.\n\n“The fire seems to be back today. Though the flames were not seen, there was a lot of smoke. When I spoke to the BMC they said the fire was on since morning,” Deonar resident Vandana Trivedi told The Hindu .\n\nMeanwhile, politics over the dumping ground issue has been gathering momentum with the Aam Aadmi Party becoming the latest entrant in the political clamour.\n\nAt a rally held with the residents of Shivaji Nagar on Sunday, the party demanded that the BMC implement garbage segregation “on a war footing” .\n\nAAP accused the BMC of not acting against contractors who failed to deliver on recycling, disposing and clearing the dump yard and did not set up the promised technology despite charging thousands of crores. The party also called for action against alleged vehicle lobbies which prevented garbage segregation. While, local Samajwadi Party corporator Rais Sheikh has been mobilising slum residents on the dumping ground issue, the Congress and BJP have also been staging protests.", 
    "section": "national", 
    "title": "Wind fanning small fires at Mumbai dump", 
    "subsection": "general", 
    "date": "2016-03-28"
}