{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Susheel Kumar, ABVP leader in the University of Hyderabad, who was at the centre of a controversy over the death of Rohith Vemula, addressing the media on Thursday.— Photo: NAGARA GOPAL\n\nThe ABVP leader from the University of Hyderabad, N. Susheel Kumar, who has been accused of abetting the suicide of Dalit scholar Rohith Vemula, on Thursday demanded a fair inquiry into the reason for the death.\n\nAt a press conference here, Mr. Susheel Kumar said Rohith was not a weak person to have lost his heart at suspension, and said there could have been “personal and particular” reasons.\n\nHe questioned how Rohith’s fellow scholars failed to identify suicidal tendencies despite keeping him company for 15 days.\n\nReasserting his claim of having been attacked by Ambedkar Students’ Association (ASA) members, Mr. Susheel Kumar said he was forced by a mob of 40 students to write an apology and upload it on Facebook. It was in breach of his freedom of expression, he said.\n\n“After that, I deactivated my account, and called my brother to come and take me to hospital. Noticing that I had deactivated my account, about 40 people from the ASA tried to mob me again,” he said and charged them with abusing his mother and trying to attack her inside the Vice-Chancellor’s office.\n\nThe two-page hospital summary, of which he produced a page, spoke of “blunt trauma to abdomen” with appendicitis, and a contusion on the left shoulder, which he admitted to have sustained when ASA members forced him out of the university’s security vehicle. Though two guards were present at the scene controlling the mob, they could not notice him being beaten up, he said.\n\nMr. Susheel Kumar could still produce “eyewitnesses” before the Proctorial Board whose credentials he refused to mention except that they were not from the ABVP. While he produced the footage of his mother’s visit to the V-C’s office before the media, there was no evidence of any attack or abuse therein.\n\nThe ABVP demanded a CBI enquiry and analysis of the phone data of the other four students whose hand they suspected in the suicide, and “40 professors,” who allegedly instigated “anti-national” activities within the campus.\n\nProminently naming academics Kancha Ilaiah and G. Haragopal, apart from Vara Vara Rao from the Revolutionary Writers’ Association (ViRaSam), an ABVP spokesperson charged them with “misguiding” the students and “thrusting guns into their hands instead of pens”.\n\nMr. Susheel Kumar and the ABVP criticised the visits by Congress vice-president Rahul Gandhi, Delhi Chief Minister Arvind Kejriwal, and CPI(M) general secretary Sitaram Yechury as attempts to politicise an unfortunate death on the campus.\n\nThese leaders were using the opportunity in view of the elections in Assam and to the GHMC, the ABVP said.", 
    "section": "national", 
    "title": "ABVP leader seeks fair investigation", 
    "subsection": "general", 
    "date": "2016-01-22"
}