{
    "author": [], 
    "text": "In the village of Mawlynnong, bamboo dustbins stand at every corner and littering is sternly frowned upon. —File photo: AFP\n\nIn the tiny hamlet of Mawlynnong in the northeast, plastic is banned and spotless paths are lined with flowers — but its reputation as Asia’s cleanest village has proved a mixed blessing.\n\nUntil 2003 no tourists visited the remote community of 500 inhabitants high in the mountains of Meghalaya, which had no roads and was accessible only by foot.\n\nHome to the Khasi tribal people, Mawlynnong is famous for its exceptional cleanliness, far removed from the noise and dirt of other big cities.\n\nBamboo dustbins stand at every corner, volunteers sweep the streets at regular intervals and large signboards order visitors to throw away plastic packaging: littering is sternly frowned upon.\n\nAfter the village built its first road 12 years ago, a journalist from Discover India travel magazine wrote an article about the village.\n\nThe trickle of tourists became a flood, with visitors now reaching 250 a day in high season, swelling the village’s population by 50 per cent. But the accolades have brought several downsides.\n\n“Now there is noise pollution. I’ve talked to the village council which has written to the government to build a new parking lot further away.” said Rishot Khongthohrem, 51, a guesthouse owner.\n\n“There’s no more privacy. Social bond which binds the village together is disintegrating,” he said.Mawlynnong’s concern for hygiene emerged about 130 years ago when an outbreak of cholera struck.\n\nWith no medical facilities in the village, cleanliness was seen as vital to prevent the spread of disease.\n\nThe village has even been hailed by Prime Minister Narendra Modi in an autumn radio address imploring Indians to erase the poor national image of rubbish-strewn highways and monuments under his Clean India campaign. “I was amazed to know that there is such a village in remote northeast, Meghalaya, which is so passionately carrying the mission of cleanliness for years,” he said.\n\nWhile the pristine village is proud of its achievements, some believe it must limit visitor numbers to protect the well-being of its inhabitants.\n\n“They must learn to regulate the number of tourists and to say no at some point,” tourism expert Laloo said. — AFP\n\nMawlynnong in the northeast is famous for its exceptional cleanliness and has been hailed by PM", 
    "section": "national", 
    "title": "‘Asia’s cleanest village’ clings on to its serenity", 
    "subsection": "general", 
    "date": "2016-01-22"
}