{
    "author": [
        "Josy Joseph"
    ], 
    "text": "Court asks agency to give back to Delhi govt. documents not directly linked to case\n\nDid the CBI go overboard during the December 15 raid on IAS officer Rajendra Kumar, Principal Secretary to Delhi Chief Minister Arvind Kejriwal?\n\nThe Aam Aadmi Party has accused the Central government of unleashing the CBI to raid its Chief Minister’s Office, as well as using the agency to look for files related to allegations of corruption in the administration of cricket in the capital, of which Finance Minister Arun Jaitley has been an integral part. On Wednesday, a local CBI court told the agency that it “cannot be clothed with divine powers” to flout its own rules, ordering it to hand over documents not related to the case to the Delhi government.\n\nAccording to official documents accessed by The Hindu , the CBI may have misled the media on a few critical aspects in its investigation against Mr. Kumar, a winner of the Prime Minister’s Award for Excellence in Public Administration. Also, it may have filed a case under the Excise Act against Mr. Kumar, where none existed.\n\nThe CBI did not respond to a questionnaire sent by The Hindu on January 1. However, a senior official said their probe was unearthing more details about Mr. Kumar’s role in routing contracts to Endeavour Systems Private Limited, a private company they claim was a proxy for him.\n\nAccording to the Search List — it contains the details of property seized by the CBI — prepared on the December 15, the day of the raid: “The email ID and password of Sh Rajendra Kumar was also obtained and the password of email ID has been changed through Sh Sushil Kumar, Asst programmer, CBI, ACB Delhi.”\n\nThe statement went against the informal briefing to the media at the CBI headquarters on December 15, during which the agency claimed that Mr. Kumar was not parting with his email ID and password.\n\nThe List has been signed by Jayant Kashmiri, a Deputy SP of the CBI, and by other officers and independent witnesses, besides Mr. Kumar himself.\n\nThe second aspect of the raid that has further raised questions is the FIR filed on the day of the raid under the Delhi Excise Act against Mr. Kumar. The FIR is for allegedly possessing more liquor than legally allowed. The FIR said the CBI found 11.75 litres of sealed liquor bottles from the house, besides three unsealed bottles. The maximum liquor thus recovered was 14 litres.\n\nExcise inspector Rajesh Batra, who endorsed Deputy SP Kashmiri’s complaint to the SHO, said the maximum quantity of intoxicant that a person above 25 years old could possess in Delhi is: Indian and foreign liquor - nine litres; and wine, beer etc. – 18 litres.\n\n“The undersigned found that these (sic) were 2 (two) persons i.e., Rajender (sic) Kumar IAS and his wife Mrs. Kumar were present at the time of visit at the premises.” Meaning they could have legally possessed a maximum of 18 litres of hard liquor, and what was seized was within legal limits. The CBI also did not respond to the query on this.\n\nThese facts come even as the CBI on Wednesday faced tough questions and an adverse order from the local CBI court, which said: “The CBI cannot retain the documents in the garb of the argument that investigation is in progress without whispering the fact in what manner they are related to the present case,” Special CBI Judge Ajay Kumar Jain said. The CBI has now moved the High Court against the order, while a senior CBI official insisted that the court order pertained to just about 10 files. The CBI court wanted the agency spell out the specific findings, but “we took the stand that it is premature to reveal any specifics of the investigation,” he said.", 
    "section": "national", 
    "title": "CBI in a soup over raid on Kejriwal’s secretary", 
    "subsection": "general", 
    "date": "2016-01-22"
}