{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "The Supreme Court Collegium has made the first move to fill vacancies in the High Courts by recommending transfer and elevation of judges. After enactment of the National Judicial Appointments Commission law in early 2015, filling of the vacancies, which now stand at over 400, stalled.\n\nThe recommendation is the first major step taken by Chief Justice of India T.S. Thakur to fill judicial posts in the High Courts during 2016, a year he said was dedicated to clearing pending cases. The Chief Justice of the Orissa High Court, D.H. Waghela, is being shifted to the Bombay High Court. Justice Ajit Singh of the Rajasthan High Court is elevated as the Chief Justice of the Gauhati High Court, Justice Dinesh Maheswari of the Allahabad High Court as the Chief Justice of the Meghalaya High Court and Justice Vineet Saran of the Karnataka High Court as the Chief Justice of the Orissa High Court.\n\nJustice S.K. Mittal of the Punjab and Haryana High Court is being elevated as the Chief Justice of the Rajasthan High Court, Justice Hemant Gupta of the Punjab and Haryana High Court as the Acting Chief Justice of the Patna High Court and Justice R. Subhash Reddy of the Andhra Pradesh/Telangana High Court as the Chief Justice of the Gujarat High Court. The Acting Chief Justice of the Karnataka High Court, S. K. Mukherjee, has been recommended to be made the regular Chief Justice of the same court. The President is expected to make the appointments in a few days.\n\nFor fresh appointments, a Constitution Bench, led by Justice J.S. Khehar, has asked the Centre to come out with a fresh Memorandum of Procedure in consultation with the CJI. Law Minister Sadananda Gowda has written to the Chief Ministers and the Chief Justices of the High Courts to send suggestions to improve the Collegium system.\n\nThe body has recommended transfer and elevation of\n\nvarious judges", 
    "section": "national", 
    "title": "Collegium moves to fill vacancies in High Courts", 
    "subsection": "general", 
    "date": "2016-01-22"
}