{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "The prejudice against Dalits continues in various forms right from schools in the State\n\nIn November, the National Human Rights Commission sent a notice to the Tirunelveli District Collector seeking a response to reports that school students wear coloured wristbands which act like a marker of their caste.\n\nThe notice is a late reaction because the custom of wearing these bands has been around for years now in the socially charged environment of the southern districts of Tamil Nadu.\n\nThis practice is, perhaps, the most conspicuous example of how caste-based assertion has been informally institutionalised in schools and colleges, invariably targeting the Dalit community.\n\nThe decades-old prejudice against Dalits took a brazen turn in 2012 when the love affair between Ilavarasan, a Dalit, and Divya, a girl from the Vanniyar caste, which belongs to the Other Backward Classes, was converted into a caste clash in Dharmapuri. The State has witnessed growing intolerance to inter-caste marriages.\n\nThe Pattali Makkal Katchi (PMK), a political group that represents the Vanniyars of northern Tamil Nadu, sought to unite the OBC groups across the State against such weddings and even formed a new political platform to carry forward the agenda.\n\nAs a result of the PMK’s anti-Dalit activism, colleges became a campaign ground for OBC groups to spread the word against inter-caste weddings. The mobilisation soon morphed into a movement named ‘Campaign Against Inter-Caste Marriage Movement’,” which spread across the campuses of Namakkal district, distributing vitriolic pamphlets that ridiculed the Scheduled Caste community. Examples of segregation are aplenty. A few years ago, the remote village of Kurayur on the Madurai-Virudhunagar border delivered a shock when it was found that the government school had systematically kept Dalit students away. “We found through the RTI Act that segregation had been going on for four decades, though the State administration had failed to identify it. The Dalit students of the village studied at a missionary-run school,” says A. Kathir, founder of Evidence, an NGO working against caste discrimination.\n\nDalit writer and lecturer Stalin Rajangam says students now openly identify themselves with caste-based organisations and proudly wear symbols that are, more often than not, intimidating in nature.\n\n“Whether these are lockets they wear with faces of caste leaders or coloured wristbands, the trend on campuses now is to assert one’s caste identity in a form that intimidates the weaker groups,” he feels. Mr. Stalin says students group themselves on the basis of their social background. “Explicit untouchability does not exist on campuses these days. But caste has evolved and exhibits itself in subtle ways in terms of access to facilities and equation among students.”\n\nDalit literature\n\nFor example, Dalit literature has been a target for long. Colleges in the southern districts have quietly removed works of Dalits from the curriculum, bowing to pressure from OBC groups, says Mr. Stalin.\n\nThe smoldering rage between the communities divided along caste lines sometimes explodes into violence on campuses. On November 12, 2008, the Dr. Ambedkar Government Law College in Chennai turned into a war zone with students from the Dalit and Mukkulathor communities attacking each other with deadly weapons. A one-man commission of Justice P. Shanmugam pointed to caste-based organisations as the reason for the animosity. The whole issue flared up when OBC students excluded Dr. Ambedkar's name in posters while referring to the college.\n\nWriter and activist A. Marx, who was a Physics Professor, says teachers too group themselves on the basis of caste in many colleges across Tamil Nadu. He charges that the quota for SCs in teaching positions in universities is rarely filled.\n\n“In many cases, we have found that institutions use a policy loophole and fail to appoint Dalits. They cite unavailability of qualified people to fill the vacancy with others,” he alleges.\n\nCentral institutions such as IIT-Madras have courted controversy on caste. Last year, the Ambedkar Periyar Study Circle was derecognised following the intervention of the HRD Ministry based on an anonymous complaint that it was campaigning against Prime Minister Modi. A furore led to the reversal of the decision but students felt the whole episode exposed the intolerance towards ideas that question the mainstream.\n\nThe institution was also blamed by its own faculty members for failing to follow reservation in promotions, with the Madras High Court in 2013 ordering a CBI probe into all appointments between 1995 and 2000. This order was later stayed by a Division Bench after the institution appealed. “ The State has an important regulatory role. But despite ruling the State for 49 years, the Dravidian parties, which claim to stand for eradication of caste, have done little,” Mr. Marx says.", 
    "section": "national", 
    "title": "Grim shadow of caste over educational institutions in T.N.", 
    "subsection": "general", 
    "date": "2016-01-22"
}