{
    "author": [
        "Arun S", 
        "Vidya Krishnan"
    ], 
    "text": "With patients grappling with increasing drug prices, the government has expressed concern that India will no more be the “pharmacy of the world” if generic companies “gave up” the fight for access to affordable drugs.\n\nThe concern here is regarding the Voluntary Licence (VL) agreements signed between 11 Indian generic drug makers and Gilead Science to bring the blockbuster Hepatitis C drug Sovaldi (salt name sofosbuvir ) to Indian markets.\n\n“This (VL arrangement) is a concern. But it is part of a company’s business strategy, and the government cannot have a policy dictating what a company’s business strategy should be,” a senior official handling matters related to intellectual property rights said on the condition of anonymity. As part of the VL, the Indian companies pay a royalty to the innovator company (Gilead, in this case) and are allowed make copy-cat versions of blockbuster drug.\n\nHowever, under the VL agreement on Sovaldi, Indian made generic versions of the drug could not be exported to 50 middle-income, high burden countries, or any high income nations including much of Western Europe, and the U.S. According to a technical analysis by MSF, over 49 million Hepatitis C patients live in middle income countries excluded under the VL’s anti-diversion programme.\n\n“In 2005, when it was faced with the implementation of the WTO rules, India globally changed conceptions of policy approaches to managing ever-greening in the patent examination system on pharmaceuticals to continue with the production, registration and supply of generic medicines to millions of patients in India and other developing countries. But today generic manufacturers face major constraints to produce and supply generic versions of new patented medicines and the Indian government needs to once again step up and respond to the crisis in the industry. India is increasingly now reliant on imported expensive medicines and equally disturbing is the fact that India is shutting down as the pharmacy of the developing world,” Leena Menghaney, Head of South Asia, Access Campaign, Médecins Sans Frontières (MSF) said.\n\nAnother official said “these VL pacts are handy to avoid litigation and ensure fair competition between licensees. The government will be concerned if the VL arrangement hampers the growth of generics or prevents access to medicines or artificially jacks up the prices.”", 
    "section": "national", 
    "title": "India may cease to be ‘pharmacy of the world’", 
    "subsection": "general", 
    "date": "2016-01-22"
}