{
    "author": [
        "Mini Muringatheri"
    ], 
    "text": "Court slaps fine of Rs. 80 lakh, asks police to prosecute Mohammed Nisham's wife for perjury\n\nMohammed Nisham coming out of the Thrissur District Additional Sessions Court on Thursday after the sentencewas delivered. —Photo: K.K.Najeeb\n\nThe Thrissur District Additional Sessions Court on Thursday sentenced controversial businessman Mohammed Nisham, 38, to life term and an additional 24 years of imprisonment in the Chandrabose murder case.\n\nAdditional Sessions Judge K.P. Sudheer also slapped a fine of Rs. 80.30 lakh on him. From the fine, an amount of Rs. 50 lakh is to be paid to Chandrabose’s family as compensation.\n\nThe court asked the police to prosecute Amal, Nisham’s wife, under Section 164 of Cr.PC. for resiling from her statement. The court on Wednesday found Nisham guilty on nine counts under various Sections of the Indian Penal Code: 302 (murder); 326 (voluntarily causing grievous hurt by dangerous weapons or means); 506 (1) (criminal intimidation); 323 (voluntarily causing hurt); 324; 427(mischief causing damage to property) and 449 (criminal trespass).\n\nSpecial Public Prosecutor C.P. Udhayabhanu, during his arguments, urged the court to give the death penalty to Nisham as it was the ‘rarest of rare cases’. He also sought a compensation of Rs. 5 crore for the family of Chandrabose.\n\nMeanwhile, Nisham pleaded for leniency. He said he had a family, which was dependent on him.\n\nThe incident happened between 2.55 a.m. and 3.15 a.m. on January 29, 2015. Nisham, owner of the King Group of Companies, attacked Chandrabose, the security guard of the Sobha City Apartments Complex, Puzhakkal, near Thrissur, by hitting him with his jeep and thrashing him severely.\n\nThe businessman was reportedly angry over the guard’s delay in opening the gate for him.\n\nNisham dragged the seriously injured security guard into his jeep and took him to the parking ground. He thrashed the wounded Chandrabose again.\n\nAfter three weeks of treatment and a series of surgeries at Amala Medical College Hospital, Thrissur, Chandrabose succumbed to his injuries on February 16.\n\nAccording to the hospital records, there were 22 injuries on his body.", 
    "section": "national", 
    "title": "Life term for Kerala businessman", 
    "subsection": "general", 
    "date": "2016-01-22"
}