{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "He was an area secretary of the Maoists in south Bastar. She was a member of his team. While joining the Maoist organisation, both vowed to fight for “revolution” until their last breath, however, after a few years of guerrilla warfare, they fell in love with each other and started craving for a simpler life.\n\nKiran alias Kamlesh (28), the Malangir area secretary of the CPI(Maoist) and also a divisional committee member, decided to marry Zareena (24), a member of Malangir area committee. The couple asked for their party’s permission.\n\nAfter their senior leaders denied them permission, they planned to leave the party but could not come out of the forest together.\n\n“Senior Maoist leaders, who mostly come from Andhra Pradesh, denied them permission to marry. Therefore, Kiran surrendered before the police in May last year on the condition that the police shall emancipate Zareena from the Maoist organisation and conduct their marriage,” Bastar range Inspector General of Police SRP Kalluri said. However, after Kiran’s surrender senior Maoist leaders shifted Zareena to Burgam area.\n\nLater on, she was transferred to west Bastar region in the National Park committee, making it difficult for Kiran to approach her.\n\n“Kiran, along with other surrendered Maoist Badaru, continued to make serious efforts to reach out to Zareena and bring her to the mainstream but the Maoists were keeping a strict vigil on her,” Mr. Kalluri added.\n\nKiran made every effort to arrange for Zareena’s surrender in the last eight months but failed to reach her.\n\nThe love story of Kiran and Zareena met with a tragic end on Tuesday when Zareena was killed in an encounter with the police in Bijapur district of Bastar, leaving Kiran heartbroken.\n\n“Zereena joined the Maoists in 2005 as a member of National Park area committee. Later on, she was elevated as a Dalam commander and she accompanied senior Maoist leader Ramanna.\n\nAfter some time, she was shifted to the regional company no. 2 and 3.\n\nLater on, she was sent to Malangir area committee of Darbha, where she fell in love with Kiran.\n\n“Coward Maoist commanders from outside Chhattisgarh exploit woman Maoists of Chhattisgarh origin and they also use them as outer layers of their security cover,” said Mr. Kalluri reacting to Zareena’s death.", 
    "section": "national", 
    "title": "Love story of Bastar Maoists ends in a tragedy", 
    "subsection": "general", 
    "date": "2016-01-22"
}