{
    "author": [
        "Mahesh Langa"
    ], 
    "text": "The Padma Bhushan recipient was proficient in Bharatanatyam, Kathakali and Mohiniyattam\n\nThe Padma Bhushan recipient was one of the most celebrated classical dancers.\n\nVeteran dancer and Padma Bhushan recipient Mrinalini Sarabhai passed away at her residence in Ahmedabad on Thursday after a day’s hospitalisation. She was 97.\n\nHer daughter Mallika Sarabhai, dancer, actor and activist, announced the death on Facebook. “My mother Mrinalini Sarabhai has just left for her eternal dance.”\n\n“She was admitted to the hospital as she developed an infection and her systems gave way. She was brought to her home in Usmanpura where she passed away. My mother had a long, peaceful life,” said Kartikeya Sarabhai, her son and noted environmentalist and director of the Ahmedabad-based Centre for Environment Education (CEE).\n\nFondly called ‘Amma,’ Mrinalini was one of the most celebrated Indian classical dancers, proficient in Bharatanatyam, Kathakali and Mohiniyattam. She studied at Santiniketan under the guidance of Nobel laureate Rabindranath Tagore.\n\nBorn into the renowned Swaminathan family, Mrinalini married Dr. Vikram Sarabhai, father of India’s space programme and institution builder who belonged to an illustrious industrial family of Gujarat. Vikram’s father Ambalal Sarabhai was a leading textile baron and was one of the patrons of Mahatma Gandhi during the freedom struggle.\n\nMrinalini’s father was a freedom fighter, parliamentarian and social worker. Her mother Ammu Swaminathan was also a noted freedom fighter.\n\nAfter settling down in Ahmedabad after marriage, Mrinalini set up the Darpana Academy of Performing Arts, where more than 15,000 students trained.\n\nBesides being a celebrated classical dancer, she was a poet, writer and environmentalist and played a leading role on the social and art scene. She choreographed over 300 shows.\n\nShe is survived by a son and daughter, both based in Ahmedabad. Mallika is a leading dancer and activist.", 
    "section": "national", 
    "title": "Mrinalini Sarabhai passes away at 97", 
    "subsection": "general", 
    "date": "2016-01-22"
}