{
    "author": [
        "Rahi Gaikwad"
    ], 
    "text": "An internation team of scientists have described a new species of the thrush in northeastern India and adjacent parts of China. The species was distinguished by its musical song.\n\nThe Himalayan Forest Thrush (Zoothera salimalii ) is common in the eastern Himalaya range but was overlooked till now because of its similarity in appearance to the plain-backed thrush, now renamed as Alpine thrush.\n\n“This is the first Indian bird to be named after late Dr. Salim Ali, who was closely associated with Bombay Natural History Society as researcher, honorary secretary and president. The bird has been named after him in recognition of his huge contribution to the development of modern Indian ornithology and wildlife conservation,” a BNHS press note said.\n\n“New bird species are rarely discovered to science nowadays, when most natural habitats are shrinking. Since 2000, an average of five new species have been discovered globally every year, mostly from South America. The Himalayan Forest Thrush is only the fourth new bird species described from India by modern ornithologists since Independence,” the BNHS release said. Scientists from India, Sweden, China, U.S. and Russia worked on the project.\n\nScientists Per Alström and Shashank Dalvi first found the bird between May and June 2009, while studying the thrushes at high elevations in western Arunachal Pradesh. They realised that instead of a single species of plain-backed thrush ( Zoothera mollissima ), there were two different species in the eastern Himalayas.\n\n“What first caught the attention of the scientists was the fact that the ones found in forests (Himalayan forest thrush) had a rather musical song, whereas those found in the same region on bare rocky habitats above the tree-line (Alpine thrush) had a much harsher, scratchier and unmusical song,” the BNHS said.\n\nStudies of specimens in 15 museums across seven countries revealed consistent differences in plumage and structure. This confirmed that the Himalayan forest thrush, found to be breeding in the coniferous and mixed forests of the eastern Himalayas, had not been separately classified.\n\nA third species called Sichuan forest thrush is present in China, said scientists.", 
    "section": "national", 
    "title": "New thrush species found in eastern Himalayas", 
    "subsection": "general", 
    "date": "2016-01-22"
}