{
    "author": [
        "Kavita Upadhyay"
    ], 
    "text": "French scholar Christophe Jaffrelot and other panellists Reema Abbasi, Venkat Dhulipala and Sudhir Chaudhary at a discussion at the Diggi Palace, Jaipur, on Thursday.— PHOTO: ROHIT JAIN PARAS\n\nThe offshoots of the Rashtriya Swayamsevak Sangh (RSS) were a challenge for the ruling Bharatiya Janata Party (BJP), French scholar Christophe Jaffrelot said at the Zee Jaipur Literature Festival (JLF) here on Thursday.\n\nGiving examples of the RSS offshoots like the Bharatiya Kisan Sangh (BKS), which is the RSS’ farmers’ wing, and the Bharatiya Mazdoor Sangh (BMS), which is the RSS’ workers’ wing, Mr. Jaffrelot said “the ‘Shakha model’ was a simple one, [But], the way the Sangh Parivar has started to mirror society with so many offshoots representing so many sectors, when you have the BMS for the workers and the BKS for the farmers, and so many other organisations, how can you [the RSS] reconcile the interests of these groups?”\n\nWith the policies of the government going against the interests of these groups and with these groups voicing their dissent, it was a new challenge for the BJP, he said.\n\nIn a society like India, modernisation implied some borrowing from the west, and RSS was a good example of it, Mr, Jaffrelot said at a session ‘Navigating Modernity.’\n\n“The RSS borrows the idea of a nation from the West. Golwalkar himself, in his first book, quotes Western thinkers,” he said, adding that the Western thoughts were mixed with “the Hindu idea of ‘sanskar’ and ‘sanskritisation’ and the ‘guru shishya parampara’ practised in the Shakhas.”\n\nReferring to the recent suicide of Dalit research scholar Rohith Vemula, he said the majority in India continued to be divided along caste lines.", 
    "section": "national", 
    "title": "Offshoots of RSS a challenge to BJP: Jaffrelot", 
    "subsection": "general", 
    "date": "2016-01-22"
}