{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Investigators have found more evidence to establish that the terrorists involved in the Pathankot airbase attack were from Pakistan.\n\nThe National Investigation Agency (NIA) has recovered “made in Karachi” thermal wear that the terrorists had used, but identification labels from other garments were missing, a senior official said.\n\nWrappers of Pakistan-made chocolate bars have also been found at the airbase, the official said.\n\nEarlier, the investigators seized Pakistan-made shoes, syringes, medicines and phone numbers of Pakistani handlers from the terrorists.\n\n“We are making an inventory of all the evidence and clues that link the terrorists to Pakistan. We will share these with the neighbouring country and would expect them to identify the terrorists through the available clues,” said an official.\n\nEven though the mystery around the number of terrorists inside the airbase continues, it has been found that the four terrorists, whose bodies have been recovered, spent only 10 per cent of the ammunition they had on them.\n\nThe operation continued for more than 80 hours, but investigators are perplexed with the number of unspent AK-47 magazines and cartridges found on the bodies of the terrorists.\n\n“No doubt the operation continued for over 80 hours, but an analysis of the ammunition reveals that the terrorists were poorly trained and were killed before they could cause any damage. The four terrorists were killed within 12 hours of the operation, the other one or two terrorists who hid in the airmen’s billet that had to be blown up continued the attack for the remaining time,” said the official.\n\nThe NIA has also fished out date seeds from multiple locations in the airbase compound, helping them establish the ‘spots’ where the terrorists hid and stayed on.\n\nThe agency is waiting for the results of the polygraph test conducted on the Punjab Superintendent of Police Salwinder Singh, before deciding on his complicity in the attack.\n\nThe NIA officials said they had written to the Central Forensic Science Laboratory (CFSL), Chandigarh, to expedite the findings pertaining to the footprints recovered from the Bamiyal area from where the terrorists are suspected to have entered the airbase.\n\nThe forensic results of the lump of flesh recovered from the rubble of the airmen’s billet, to establish whether there was one or more terrorists inside the building, is also awaited by Tuesday next week.", 
    "section": "national", 
    "title": "Pak.-made goods found from airbase", 
    "subsection": "general", 
    "date": "2016-01-22"
}