{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Pathankot attack has raised questions on how terrorists could breach heavy security\n\nIn the aftermath of the terrorist attack on the Pathankot Air Force station, the government is setting up a committee to review security preparedness of important defence installations across the country, Defence Minister Manohar Parrikar said on Thursday.\n\nSix heavily armed terrorists from Pakistan stormed the airbase on January 2 and the ensuing encounter went on for four days before the terrorists were killed while seven soldiers lost their lives. This raised questions on how terrorists could breach such heavily guarded strategically located military bases.\n\n“A specific team is being made. Maybe in another week’s time it will be active. It will visit [the bases] and look into priorities like the risk factor, sensitivity and assets. It will also talk to the local commanders,” Mr. Parrikar told the media after visiting the Republic Day camp of the National Cadet Corps (NCC).\n\nIn addition, he said commanding officers of all military bases had been asked to conduct a thorough security assessment and plug loopholes.\n\nResponding to a question on his earlier comment of “losing patience,” Mr. Parrikar said security measures being taken could not be discussed in the open. “Losing patience does not mean that you react instinctively. It means we are increasing our pro-active strength. It cannot be discussed in public.”\n\nMr. Parrikar condemned the attack on Bacha Khan University in Charsadda, Pakistan. The attack on the university in the Khyber Pakhtunkhwa province on January 20 left at least 21 people dead and over 50 injured and was claimed by the Tehrik-e-Taliban Pakistan (TTP). “Any attack or violence on civilians should be condemned. To kill a human being in a violent way can never be justified. It is a sad thing,” he said.\n\nProduction of Tejas\n\nMr. Parrikar said full-scale production of the indigenously developed Light Combat Aircraft (LCA) Tejas would begin next year and several countries had expressed interest in the aircraft.\n\n“As per my primary report, it is appreciated by other countries who are interested ... By next year, we are starting full-scale production,” he said. The Defence Research Development Organisation, which developed the aircraft, is hoping to market the aircraft globally as Tejas made its international debut at the ongoing Bahrain International Airshow. The development of Tejas, a single engine, multi-role supersonic fighter, began in the 1980s to replace the MiG-21s in service but has been delayed due to a series of technological hurdles.", 
    "section": "national", 
    "title": "Panel to review security of military bases", 
    "subsection": "general", 
    "date": "2016-01-22"
}