{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "About 30 per cent of theCNG stock in Delhi is not being used, says Solicitor-General Ranjit Kumar\n\nIn contrast to the Delhi government's ready acceptance to comply with the Supreme Court’s suggestion to phase out its old diesel fleet to cut air pollution in the National Capital, the Centre remained non-committal on Thursday while blaming the common man’s reluctance to dump diesel for CNG fuel.\n\nReplying to a Bench led by Chief Justice of India T.S. Thakur, Solicitor-General Ranjit Kumar said 104 additional CNG stations will be in place in the Capital and NCR regions by March 31, 2016.\n\nBut then Mr. Kumar pointed out that already 32 per cent of total CNG stock in the Capital were not utilised by the public.\n\n“People are not really coming to CNG... there is even a discount of Rs. 1.50 during off-beat hours,” the top government law officer said.\n\nAmicus curiae and senior Harish Salve countered that the lack of interest may be due to the increased VAT charged, making diesel cheaper than CNG.\n\nThe Supreme Court had asked the government to increase the availability of CNG pursuant to its order on December 16, 2015 to convert NCR taxis from diesel to CNG.\n\nThe court is looking at various measures to solve roadblocks to implement a more effective and accessible public transport system in Delhi and the outskirts.\n\nOne of the problems that had come up for debate was the lack of parking space, preventing compliance of a July 27, 1998 order passed by the Supreme Court to increase the public bus fleet to 10,000 by April 1, 2001.\n\nIn the hearing, Mr. Kumar said there were seven parcels of land available for parking DTC buses. Three of them were handed over, while three were in litigation and the Delhi government had reservations about the location of the seventh one.\n\nHowever, he pointed out that the demand for more land was on when the Delhi Transport department was not able to utilise their existing parking space.\n\n“Each bus takes 70 sq. metre space. So 57 buses can be parked in an acre. 285 buses can be parked in five acres. However, only 100 buses are parked in a space which can hold 285,” Mr. Kumar submitted. The court has asked Environment Pollution Control Authority, a body mandated by the apex court, to look into the issue.\n\nMeanwhile, Mr. Kumar, on behalf of the Delhi Metro Rail Corporation, told the Bench that increasing the frequency of trains to accommodate more passengers would lead to heavy capital investments. Instead, the DMRC has suggested increasing the number of coaches per train.", 
    "section": "national", 
    "title": "Public reluctant to drop diesel for CNG: Centre", 
    "subsection": "general", 
    "date": "2016-01-22"
}