{
    "author": [
        "Rukmini S", 
        "Roli Srivastava"
    ], 
    "text": "Obesity and diabetes cases increase in urban areas; experts blame it on stress and faulty diet\n\nHigher stress levels in rural India and faulty diet in cities have thrown up two most disturbing health concerns in the National Family Health Survey (NFHS), the data for which was released on Wednesday. While obesity levels have shot up in the country since the last NFHS survey in 2005-06, the number of people suffering from hypertension in rural India is, in many cases, higher than in urban parts.\n\nThe NFHS on Wednesday released the data for 15 States and each State, with the exception of Puducherry, showed a sharp rise in obesity levels among both men and women.\n\nIn Andhra Pradesh, for instance, where over 10,000 households were surveyed, 45.6 per cent of the total women surveyed in urban areas were found to be overweight — the highest in the country. Obesity among rural women in AP was found to be 27.6 per cent, which may not appear alarming, but is still high compared to other rural parts.\n\nAmong women, obesity levels shot up from 13.92 per cent in 2005-06 to 19.56 per cent in 2015-16. For men, the rise from the last decade has been from 10.35 per cent to 18.04 per cent.\n\nWhile rural Bihar recorded the fewest number of women suffering from obesity among the 15 States, but more women in rural parts here were found to have hypertension compared to urban parts of Bihar — a trend seen in other parts of the country as well. In Andaman and Nicobar, more men and women in rural parts were found to be suffering from hypertension than in urban centres. This trend was found in Meghalaya too.\n\nAs for blood sugar levels, most States have maintained the traditional difference between urban and rural areas, with urban centres recording more cases of high blood sugar. The few exceptions have been recorded in Goa where the number of women in rural areas with high blood sugar was more than in urban Goa. The same trend was mapped in Puducherry. In Tripura and also in Haryana, more men in rural areas had high blood sugar than men in urban parts.\n\nHealth experts said the overall obesity in urban India and rising hypertension in rural India was indicative of the faulty diet of people and also of the stress levels of women in rural India.\n\n“High stress levels in rural areas are rooted in income, agriculture and high cost of healthcare. Also on the food front, there is lack of potassium-rich food like fruits and vegetables,” said health expert Veena Shatrugna, former deputy director of the National Institute of Nutrition, Hyderabad.", 
    "section": "national", 
    "title": "Rural India too battles hypertension", 
    "subsection": "general", 
    "date": "2016-01-22"
}