{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Even as the Congress top leadership is embroiled in a major controversy over it, the defunct newspaper The National Herald will be re-launched, its publishers said on Thursday. Its sister newspapers, the Quami Awaz (Urdu) and Navjeevan (Hindi), too would be revived, the shareholders of its publishers, the Associated Journals Ltd. (AJL), decided at a meeting here.\n\nThe AJL would be converted into a non-profit entity, a Section 8 company, announced Motilal Vora, Congress treasurer and managing director of the AJL, after an extraordinary general meeting of shareholders.\n\nMr. Vora said the resolutions passed were not in any way connected to The National Herald case. “All members of the company considered and approved the resolutions, which were taken in pursuance of the revival plans of the company since 2010. This decision of the EGM in essence formalises this larger purpose for which the company was founded in the first place,” Mr. Vora said.\n\nMr. Vora is one of the seven persons summoned by a Delhi court in the case.\n\nFive resolutions were passed at the meeting, which was attended by 32 members, after the company placed advertisements in newspapers last month.\n\nTelecom engineer Sam Pitroda and senior Congress leaders Ghulam Nabi Azad, Sheila Dikshit, Jitin Prasada and Oscar Fernandez were present.\n\nUnder the Companies Act, 2013, a Section-8 company is a venture established “for promoting commerce, art, science, sports, education, research, social welfare, religion, charity, and protection of environment or any such other object” and profits from such a company’s activities, as well as any other income earned by it, can be used only for promoting the objectives of the company.\n\nThe general secretary of the AJL Employees’ Union, Dilip Sinha, had given a call for disrupting the meeting as their demand of compensating the staff of the Lucknow unit at par with the New Delhi office was not met.\n\nFormer employees of the AJL have been on a relay hunger strike demanding compensation.\n\nAssociated\n\nJournals will be converted into a non-profit organisation", 
    "section": "national", 
    "title": "Shareholders’ nod for National Herald re-launch", 
    "subsection": "general", 
    "date": "2016-01-22"
}