{
    "author": [
        "Nick Bilton"
    ], 
    "text": "The junk drawer in my home used to look just like yours, filled with loose change, batteries and birthday candles. But over the past year, a new category of junk has started to accumulate there: wearable devices.\n\nThere’s my old Fitbit, a fitness tracker I used for a couple of weeks, forgot to charge and never wore again. It sits next to a dusty Jawbone UP, another tracker that once told me I had walked 3 miles while I sat on my couch eating popcorn and watching a movie. And then there’s the Apple Watch, the much-hyped device that was supposed to usher in a new era of mobile computing.\n\nInstead, these gadgets are ending up in drawers and closets as expensive reminders of how wearable gadgets are not ready for prime time — at least for the foreseeable future.\n\nTransforming lives\n\nLike others, I once believed that wearables were going to change the way we live. In much the way that smartphones put the Internet into our pockets, wearable devices were going to place information that much closer to our fingertips, and make us healthier and less dependent on our smartphones.\n\nI wasn’t alone in the belief that these technologies were going to transform our lives for the better. Many analysts predicted that wearables would become widely adopted, in one form or another. Two years ago, BI Intelligence, a research division of Business Insider, predicted that by 2018, Google Glass would be an $11 billion business. A report by ABI Research, a technology market research firm, said that by 2018, people would be buying almost half a billion wearables a year.\n\nAnd yet. ...\n\nNow I know there are some of you reading this who still love your wristbands. And sure, Apple has sold a few million watches, as have Samsung and Pebble. But for every success, there are dozens of failures. Notably, Google Glass, which flopped in the quest to attract consumers, and also raised a raft of privacy concerns. There are plenty of others, including Nike’s FuelBand, which disappeared off store shelves in 2014.\n\nFor those products still on store shelves, it’s been tough going. Fitbit has gone from a market capitalization of more than $10 billion in early 2015 to $3.7 billion today. And Jawbone, the maker of the UP wristband, has lost half its worth over the last year, falling from a $3 billion valuation in 2014 to $1.5 billion this month.\n\nSo why have all these gadgets failed to gain traction? First, almost all of them require a smartphone to be fully operational, so instead of replacing our mobile phone, a wearable becomes yet another gadget that we need to lug around.\n\nThere’s also the fact that most of these devices are quite ugly. While male nerds may not mind their design, women don’t seem as interested in wearing a fax machine on their wrist, even if it’s painted rose gold or comes with a fancy leather strap.\n\nNot ready yet?\n\nThen there’s the unpleasant fact that the technology just doesn’t seem ready.\n\nThe Apple Watch, for example, can feel sluggish when performing basic tasks like using Siri to look up a contact or replying to an email. Battery life is also an issue; people have to charge their watch every day or it becomes a fancy-looking bracelet. But the biggest issue of all may be price.\n\nUbrani of IDC said that consumers can’t justify buying a smartwatch that costs nearly as much as a smartphone.\n\n“A lot of consumers have tried out smartwatches, and they don’t see the need for them right now,” he said. “This is mainly because they only offer notifications for your smartphone. And more importantly, you’re paying the same price for a smartphone.” So for the next few years, I’m skipping new wearable devices that come on the market. I have no choice. I’m running out of room in my junk drawer. — New York Times News Service", 
    "section": "national", 
    "title": "Wearable technology: expensive, nerdish and ending up in the junk drawer", 
    "subsection": "general", 
    "date": "2016-01-22"
}