{
    "author": [
        "Special Correspondent"
    ], 
    "text": "His friends told police that they had been partying\n\nIn a tragic accident, a 25-year-old youth fell to his death from the second floor of a building in Nallurhalli in the wee hours of Friday.\n\nThe Whitefield police, under whose jurisdiction Nallurhalli falls, identified the victim as Shiva Krishna from Khammam in Telangana.\n\nHe was working at Mahadevapura as a lab technician in a pharmaceutical company.\n\nThe victim had partied with six friends to bring in the New Year before retiring to his apartment.\n\nAround 2 a.m., while his friends were asleep, Krishna stepped out of the apartment to talk to family and friends on his mobile phone.\n\nBased on statements from his friends, the police said suspect that Shiva lost his balance and toppled over the corridor railing.\n\nAn officer said, “There were no witnesses. We will question his friends and also go through call records to ascertain if it was an accident or he was a victim of foul play.”\n\nIncidentally, Krishna had announced his engagement three months ago.\n\nA neighbour raised the alarm on Friday morning when he saw Shiva lying near the gate in a pool of blood.\n\nHis body was shifted to a private hospital where he was declared dead on arrival.\n\nMan stabbed to death\n\nA 27-year-old cable TV operator was stabbed to death by three friends, who are in the same business, during a drunken brawl at a New Year party in Subramanyapura on Thursday night.The deceased, Santosh, (27), was from Sakleshpura. Three persons — Manoj, Deepak and Pawan — have been arrested on the charge of murder. They are also from Sakleshpura.\n\nA police officer said, “We are investigating the reason for the attack.”\n\n353 motorists booked for drunk driving\n\nIn the run-up to the New Year, the traffic police registered 353 cases against motorists and seized their vehicles for driving under the influence of alcohol. This was part of a special drive between Thursday night and Friday morning. “Every New Year, the traffic police used to take lenient view of drunk driving. But this time, we seized vehicles and booked cases to minimise accidents,” said M.A. Saleem, Additional Commissioner of Police (traffic).\n\nThe police also succeeded in preventing motorists from racing at night.\n\n24-year-old falls off railing\n\nA 24-year-old sustained injuries after falling from a railing on M.G. Road on Thursday night.\n\nThe victim, Vijay Kumar, had come to M.G. Road with his friends. He was dancing with them near Cauvery Junction. He climbed a railing but lost his balance.\n\nHis friends, with help from the police, rushed him to Bowring hospital.\n\nVehicles vandalised\n\nThree cars and six motorcycles parked outside houses in Ashwath Nagar were damaged by some vandals on Thursday night.\n\nAccording to the residents, the vandals were inebriated revellers who smashed windows and windshields, and damaged bikes.\n\nThe HAL police are checking CCTV footage from in and around the area to identify the culprits.\n\nThe police suspect that Shiva lost his balance and toppled over the corridor railing", 
    "section": "national", 
    "title": "25-year-old dies after fall from second floor", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}