{
    "author": [
        "Dennis S"
    ], 
    "text": "He sought documents on transfer of 122-acre govt land in October 2014\n\nThe Revenue Department and the Tamil Nadu Archives have been passing the buck for over 14 months now over granting access to certain files and documents dealing with transfer of about 122-acre government land to a private hospital at Porur in 1995.\n\nV. Gopalakrishnan, a Chennai-based activist, approached the Revenue Department and sought copies of files under the Right To Information (RTI) Act in October 2014. The department, however, directed him to approach the Archives Department saying files that were more than five years old would be maintained there. However, officials at the Archives informed Mr. Gopalakrishnan that two of the files were sent to the Revenue Department for reference in 2005 and they were never returned. “The Revenue Department, on its part, claimed that the ‘RDC’ Section under it which was supposed to have received the files never existed and hence it would not be able to provide copies of the files,” says the activist. Not satisfied with the answers, the applicant had filed two appeals in the Tamil Nadu Information Commission.\n\nThe Commission said the PIO, the Assistant Commissioner of the Tamil Nadu Archives and the PIO of the Revenue Department should together look for the files and hand over a copy of them to the RTI applicant.\n\n“I had sought the GOs and note files dealing with the issue. Any transfer of government land to private parties has to be kept carefully by the government. The 122-acre land spread across five villages are said to have been transferred to a private trust and when I seek the documents, the officials are not able to locate the documents except for one letter from Commissioner of Land Administration to Revenue Department,” said Mr. Gopalakrishnan.\n\nIncidentally, in this letter sent in December 2014 the Commissioner had recommended that the purchase of a piece of land by a private trust in 1985 (in Porur) has to be considered “bogus” and “improper transactions in poromboke (tank bed) lands.”\n\n“Naturally, therefore, the Trust will have to pay the costs of this poromboke land to the government. I recommend that the government may take a decision to fix this amount in relation to the local competitive market value of the land in question and also to determine the number of times of this value (two or four) to be levied and collected from the trust,” the Commissioner had added.\n\nIn this backdrop it is crucial for the Revenue Department to furnish the other related files, feels Mr. Gopalakrishnan adding that “any GO is a public document that should made accessible to the people.”\n\nBoth the Revenue and Archives Departments pass the buck over the ‘missing documents’", 
    "section": "national", 
    "title": "Access to files eludes RTI activist for 14 months", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}