{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Activists and environmentalists are deeply concerned about the condition of lakes\n\nResidents feel that restoring waterbodies is key to mitigating flooding. A view of the overflowing Rajakilpakkam Lake in November. —Photo: G. Krishnaswamy\n\nThe recent floods have stirred up residents’ struggle in several areas in city to restore smaller lakes in the neighbourhood. Activists and environmentalists are deeply concerned about the condition of lakes.\n\nSave Chitlapakkam Lake, a residents’ group formed in 2002, has managed to save one-third of the lake. After the floods inundated hundreds of houses, the group has revived the movement to extend the existing water channel along Velachery Main Road and connect it to another channel at the junction of Mahalakshmi Nagar to prevent flooding in Chitlapakkam.\n\nP. Viswanathan, convenor of Chitlapakkam Residents Coordination Committee, recalled that residents’ movement helped in forming a lake bund in one portion. “The entire Chitlapakkam would have been submerged after the floods if not for the lake. It has been more than 13 years since the lake was desilted and bunds were strengthened.\n\nHad this been done, the capacity of the lake would have increased and volume of surplus water released would have been reduced,” he added.\n\nFollowing allegations that Porur lake is being usurped by private institutions, residents of over 23 associations formed a lake protection committee. Maduravoyal MLA G. Bheem Rao who heads the committee, said: “We need to rope in youth to protect the lake through a movement similar to friends of police. We urge the government to form a group with residents.”\n\nMany other groups too want panels to be formed to restore water bodies and thereby mitigate flooding. Activist V. Ramarao said: “The State government should form a ‘Lake Authority of Tamil Nadu’ to protect the lakes.”\n\nResidents of Ramapuram have been fighting to restore Ramapuram lake and free it from encroachments for seven years now. The Federation of Ramapuram Welfare Associations plans to intensify its movement to desilt the lake and surplus courses.\n\nIn Ambattur too, there are plans to mobilise support for the cause . B.R. Prasad, general secretary of Vijayalakshmipuram residents’ welfare association, said houses were submerged as Thangal lake was not desilted.", 
    "section": "national", 
    "title": "After deluge, lake warriors gear up for sustained struggle", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}