{
    "author": [
        "Staff Reporter"
    ], 
    "text": "B. Rohini Ramdas, Additional Collector and Project Directorof District Rural Development Agency, presenting awards to students from the SEED PLAN in Madurai on Saturday.— Photo: R. Ashok\n\nAdditional Collector and Project Director of District Rural Development Agency (Madurai) B. Rohini Ramdas on Saturday urged the children not to feel inferior for being economically poor and instead approach life with confidence to become what they aspire for.\n\nSpeaking at the 16{+t}{+h}annual day celebration of the SEED PLAN, an NGO working with underprivileged children, Ms. Rohini recollected how she, hailing from a village in Maharashtra and studying till Class 10 in a government school, managed to become an IAS officer.\n\n“Don’t feel inferior that you cannot wear stylish uniforms or study in expensive schools. You are as talented as those studying in expensive schools. All that matters is perseverance and self-confidence,” she said.\n\nFondly remembering the perseverance shown by the children of the SEED PLAN in inviting her for the function, Ms. Rohini asked the students to retain the same perseverance in their life.\n\nShe asked the children that they need not look at life as a competition with others but instead cooperate with others so that there was growth for everyone.\n\nSpeaking about the Police Boys and Girls Club in Karumbalai, of which many of the SEED PLAN children are members, the Assistant Commissioner of Police (Law and Order) of Anna Nagar Range B. Sakthivel said that he was overwhelmed to see the talent shown by the club children in various spheres.\n\nDr. Venkatraman, retired professor of the Madurai Kamaraj University and secretary of the SEED PLAN Society, recollected how the organisation was started in late nineties amidst great difficulties by late Ted Adams, who had immigrated from the United States.\n\nMs Rohini presented awards to the children who performed well in studies and other activities.", 
    "section": "national", 
    "title": "“Approach life with confidence”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}