{
    "author": [
        "S Ganesan"
    ], 
    "text": "With the festival season round the corner, there has been marginal rise in the prices of banana at the Tiruchi wholesale market which has witnessed a glut in the last few weeks.— PHOTO: A. MURALITHARAN\n\nIn many villages, the price of poovan variety banana has fallen to as low as Rs. 20 to Rs. 30 a bunch, an unprecedented fall.\n\nfter a steep fall over the past couple of months, banana prices have gradually started looking up in the Tiruchi market, a major wholesale market for the fruit in the State, according to traders.\n\nHowever, growers say that increase has been only marginal and they were incurring heavy losses. Prices of the fruit slipped because of a glut in the market and poor demand since November. The rain and flood triggered a fall in demand. At the same time, farmers had to harvest the fruit as they started ripening. They had to dump the produce at whatever prices.\n\n“Banana growers in the district have suffered heavy losses. In many villages, the price of poovan variety banana has fallen to as low as Rs. 20 to Rs. 30 a bunch, an unprecedented fall. The price of nendran variety too has fallen sharply. Farmers had invested about Rs.2 lakh an acre to raise the crop,” said A. Nagarajan, State president of the Farmers wing of the Tamil Mannila Congress. Traders at the Vazhakkai Mandi at the Gandhi Market, one of the largest auctioning centres in the State where a large number of farmers sell their produce every day, reported that the prices of different varieties of banana has been gradually appreciating at the wholesale market over the past few days.\n\nThey concede that the prices of the fruit had slumped almost to an all-time low over the past couple of months. “It was true that there has been a slump in prices. But things are looking up over the past few days ahead of the Pongal festival. We expect the price to go up as demand picks up and this should bring some good tidings for farmers,” said K.P. Palanivel, president, Plantain Traders Association of Gandhi Market.\n\nTiruchi and Karur are major banana growing districts. About 15,000 to 25,000 bunches of different varieties of banana are brought to the market and sold at the open auction.\n\nThe volume of trade goes up during festival season. Major temples such as Sri Dhandayuthapaniswamy Temple in Palani and Guruvayur Sri Krishnan temple make their bulk purchases here for panchamirtham and other requirements.\n\nOn Saturday, good quality Poovan variety was being sold between Rs. 150 to Rs. 350 a bunch and rasthali between Rs. 100 to Rs. 400, karpooravali between Rs. 50 and Rs. 400 and Monthan between Rs. 100 and Rs. 350 a bunch, according to Mr. Palanivel. However, medium and poor quality bunches were being sold in the range of Rs. 30 to Rs. 50 a bunch.\n\nHowever, Mr. Nagarajan said appreciation in the prices of banana varieties has been only marginal. “The increase is just about 10 per cent over the prices that had prevailed over the past two months. Good quality normally fetches about Rs. 400 a bunch. Farmers are still selling the produce at a loss,” he said.\n\nMr. Nagarajan said the government should promote industries producing value added products from banana in the Tiruchi region to protect farmers from price fluctuation. He demanded the setting up of a cold storage at the Gandhi Market for the benefit of farmers.\n\nIn many villages, the price of poovan variety banana has fallen to as low as Rs. 20 to Rs. 30 a bunch, an unprecedented fall.\n\nNOT A ROSY PICTURE\n\nThe picture has been gloomy for the growers since last November\n\nPoovan variety prices had collapsed to Rs. 30 to Rs. 40 a bunch a few weeks ago\n\nIn the last auction, the price of good quality poovan touched Rs. 350 to Rs. 450 a bunch\n\nFarmers say they had invested about Rs 2 lakh per acre and are suffering heavy losses", 
    "section": "national", 
    "title": "Banana growers on slippery ground", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}