{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Efforts on to modify thermal plants to comply with environmental norms\n\nS. Gopinath, Executive Director, BHEL, Tiruchi, addressing the employees at the BHEL Day celebrations in Tiruchi on Saturday.\n\nThe challenging business environment that prevailed in the power sector over the last two years has started showing improvement with inflow of new orders, both from domestic and international customers, said S. Gopinath, Executive Director, Bharat Heavy Electricals Limited, Tiruchi, on Saturday.\n\nAddressing employees here on the occasion of BHEL Day, Mr. Gopinath said BHEL had commissioned or synchronised power projects of 7,000 MW in utility sector and 500 MW in industrial sector against the target of 10,650 MW in utility sector and 1,400 MW in industrial sector, according to a BHEL release.\n\nReferring to the environmental norms on coal-based power plants, Mr. Gopinath said efforts were under way to modify the existing thermal power plants with required equipment to fulfil the environmental regulations.\n\nOn diversification, he said BHEL had been taking steps to harness potential business areas, including renewable. Recently, BHEL had secured a single largest order for 200 MW solar power plant.\n\nHe expressed confidence that with state-of-the-art manufacturing facilities and a huge skilled manpower, BHEL would be able to face all challenges.\n\nThe foremost responsibility of employees lies in meeting the ever increasing expectations of customers in terms of quality products, reduction in cost, productivity and faster delivery, he said.\n\nReiterating the importance of safety in industrial as well as personal environment, Mr. Gopinath called for strict observance of safety regulations.\n\nPresiding over the function, M. Jayakumaran, General Manager, Human Resources, BHEL, Tiruchi, underlined the need to sustain the process improvement initiatives to stabilise the growth of the organisation.\n\nEarlier, Mr. Gopinath hoisted the BHEL flag and administered the BHEL Day pledge to the employees.\n\nA.S. Samad, Additional General Manager, Human Resources, and K. Murali, Additional General Manager, Administration, spoke.\n\nSix employees of BHEL, Tiruchi, who had donated eyes of their family members in 2015, were honoured by Mr. Gopinath.\n\nPrizes were distributed to the winners of various competitions held earlier in connection with BHEL Day celebrations.", 
    "section": "national", 
    "title": "BHEL sees uptick in order flow", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}