{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Many streets in Saidapet, Kotturpuram, Ashok Nagar and Virugambakkam are among those severely damaged in recent floods\n\nThe Chennai Corporation will be carrying out major repair works of damaged streets and roads across the city at a cost of Rs. 110 crore. A resolution was passed to this effect in the Corporation Council meeting on Friday.\n\nMany streets at Saidapet, Kotturpuram, Ashok Nagar and Virugambakkam were among those severely damaged due to the flooding. As waters receded, many roads had gaping potholes. In Zone 4-Tondiarpet, which includes Kodungaiyur, Perambur and Chief Minister Jayalalithaa’s constituency Dr. Radhakrishnan Nagar, works amounting to Rs. 40 crore have been sanctioned. In Zone 7-Ambattur, repair work amounting to nearly Rs. 25 crore have been sanctioned.\n\nThe councillors appealed to Mayor Saidai Duraisamy to carry out complete road-laying work in streets that had been extensively damaged in the floods, instead of carrying out temporary patchwork.\n\nIntegrated drain system\n\nThrough the Tamil Nadu Sustainable Urban Development Project, an Integrated stormwater drainage system will be constructed at a cost of Rs.23.43 crore at Arumbakkam and Virugambakkam. The project will be implemented on the Cooum basin in the catchment areas at Virugambakkam and Arumbakkam, the Mayor announced.\n\nDuring the meeting, A. Ezhilarasi, councillor of ward 1, said the residents of S.V.M. Nagar and Thalankuppam were put to hardship during the rains and that those areas also needed stormwater drains since there was no other way to drain out the stagnant rainwater.\n\nMr. Duraisamy said the construction under the integrated stormwater drainage system had already been approved and that the work would start at the earliest.\n\nIntegrated stormwater drainage\n\nsystem will be constructed", 
    "section": "national", 
    "title": "Chennai to spend Rs. 110 cr on road repairs", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}