{
    "author": [
        "D Madhavan"
    ], 
    "text": "After a week-long stir, which included a sit-in dharna at police station, residents ‘save’ playground\n\nResidents and sports enthusiasts oppose move to hold exhibition at a five-decades-old playground on CTH Road in Ambattur —Photo: M. Vedhan\n\nFor a week, a playground on the Chennai-Tiruvallur High (CTH) Road was the focus of attention.\n\nLocated opposite the police station in Ambattur, the playground was central to a massive and persistent agitation staged by residents and sports enthusiasts from the neighbourhood. They were opposing an attempt by an individual — Shakuntala from Vedaranyam in Nagapattinam district — to organise an exhibition at the playground.\n\nOn Saturday, the week-long agitation reached a head as the residents resorted to a sit-in dharna inside the Ambattur police station and asked the police to remove the loads of equipment lodged at the playground to set up the exhibition.\n\nOn Wednesday, when news that an exhibition was going to be organised reached them, a large number of residents blocked the CTH Road demanding that the police immediately remove the equipment, including giant wheels meant for the exhibition. However, police arrested nine residents on charges of organising an illegal road blockade.\n\nAfter much pressure from the residents and local sports enthusiasts, the police got a written statement from Ms. Shakuntala on Saturday that she would clear the playground immediately.\n\n“The playground has been a boon for residents of several neighbourhoods for more than five decades now. We will not allow any kind of encroachment on it,” said A. Moses Davidraj of All-India Sports Players Welfare Association.\n\nResidents blamed the officials of the Zone-7 (Ambattur) of Chennai Corporation, including its chairman Joseph Samuel and the Ambattur police, for remaining mute spectators to a blatant attempt by an individual to encroach upon a playground.\n\nOn their part, Ambattur zonal officials, including its chairman, said that Ms. Shakutala had applied for health certificate with the zone office on Thursday to organise the exhibition at the playground for 30 days for a nominal fee.\n\nAs this was the first time such a permission had been sought from a local body, the Corporation officials had asked for health certificates issued by Avadi and Poonamallee municipalities where such exhibitions had been organised by Ms. Shakutala earlier.\n\n“We have sent the application to Ripon Buildings because such permission should be certified by the Chief Health Officer of the civic body,” said Mr. Samuel.\n\nSpread over seven acres of prime land, the playground is mired in a legal dispute between the Dunlop management and the employees’ union of the company. For this reason, the playground is allowed to be used for only public activities, especially sports activities. Tournaments for residents in the neighbourhood are conducted here.\n\nIn fact, local sports enthusiasts and residents’ welfare associations have been vigilant about checking any encroachments, including illegal parking in the playground, as this would restrict sports activities.\n\nWith many open grounds in the neighbourhood having been converted into housing plots, residents in the locality and also from adjoining areas like Vannagaram, Annanoor, Thirumullavoyal, Padi, Korattur and Nolambur use the playground.\n\nThey asked police to ensure the equipment to set up the exhibition was removed", 
    "section": "national", 
    "title": "Dogged fight by residents bears fruit", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}