{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Duck meat consumption is picking up in Erode district.— PHOTO: M. GOVARTHAN\n\nDuck rearing is becoming visible on the city’s peripheries and rural pockets of the district.\n\nThe rearers, usually, belong to far-off places and take the duck along to harvested fields where fallen grains and insects are eaten by the birds.\n\nEggs of ducks are considered nutritious and rich source of protein.\n\nRearers create small ponds for the flock of birds that are obtained as chicks from Andhra Pradesh and grown here.\n\nThe rearers sell the live birds for Rs. 180 to Rs. 200 per kg. to meat sellers, who, in turn, make a margin of 30 to 40 per cent in the selling cost. Still, it is affordable for people The trend of eating duck meat is picking up among the people. Cooked duck meat is also sold on the city outskirts.\n\nAt the retail point, ducks are sold alongside chicken. A normal-size duck is sold for Rs. 250, sellers say.\n\nSpreading trend\n\nAccording to Animal Husbandry Department sources, the trend of duck meat consumption has gradually spread to Erode from neighbouring Karur district.\n\nUnlike in the case of poultry, ducks do not require housing.\n\nThe wet fields close to water bodies are the ideal spots for their rearing.\n\nAccording to farmers, fish ponds are specifically created in some fields for rearing ducks.\n\nAlongside providing essential nutrients to increase biomass of natural food organisms, the duck droppings serve as fish feed resulting in high yield.\n\nDisturbance caused to the surface of the pond facilitates aeration.\n\nAs in the case of poultry, ducks also need to be immunised against duck plague.\n\nRearers are following the schedule of vaccinating ducks once every year, Joint Director of Animal Husbandry Department P. Ravichandran said.", 
    "section": "national", 
    "title": "Duck-rearing proves lucrative in Erode", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}