{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Directorate of Vigilance and Anti-Corruption has informed the Madras High Court Bench here of a recommendation made by it to initiate departmental action against Tenkasi Municipality Commissioner Senthilvel and four other officials for violating departmental instructions on laying roads and constructing storm water drains.\n\nJustice M. Venugopal was apprised of the fact that the Municipal Council had passed a resolution to construct storm water drain to a length of 2,790 metres and lay a road to a length of 910 metres at a cost of Rs. 98 lakh in Rail Nagar but the officials had constructed a drain to a length of 455.45 metres and laid a road for 1,772 metres without prior permission.\n\nThe submissions were made during the hearing of a petition filed by the husband of a ward member seeking a direction to the DVAC to register a case against the Municipality Chairperson S. Banu, Commissioner and other officials for having flouted the norms. Replying to it, the DVAC said that the issue required only departmental action and not criminal proceedings.\n\nAccording to a preliminary enquiry conducted by sleuths attached to the Directorate, the Municipal Council had granted permission for constructing 2,790 metres of drain at a cost of Rs.56 lakh and laying 910 metres of road at a cost of Rs.42 lakh but the officials had built 455.45 metres of drain at a cost of Rs.14.45 lakh laid 1,772 metres of road at a cost of Rs.83.58 lakh.\n\nPointing out that the deviation in the nature of work had been approved by the council through another resolution passed on March 27, the investigating agency gave a clean chit to the chairperson and said that the officials also were guilty only of deviation without prior permission from the Chief Engineer, Municipal Administration department, and not of misappropriation.\n\nAfter recording the submissions, Mr. Justice Venugopal directed the DVAC to submit by Monday a report on the quality of the storm water drain and the road laid in Rail Nagar.", 
    "section": "national", 
    "title": "DVAC for action against municipal commissioner", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}