{
    "author": [
        "R Sivaraman"
    ], 
    "text": "First step towards preparation for Assembly polls\n\nSandeep Saxena (second from left), Deputy Election Commissioner, addresses the Electoral Registration Officers and District Collectors meeting held at the Chief Secretariat in Puducherry on Saturday.- Photo: S.S. Kumar\n\nAs first step ahead of Assembly polls, the Election Commission of India (ECI) seems to have determined to ensure “error free” electoral rolls published shortly. The Deputy Election Commissioner Sandeep Saxena came down from New Delhi and held elaborate discussions with officials here on the electoral roll revision.\n\nMr. Saxena had discussions with all Electoral Registration Officers and District Collectors regarding the ongoing special Summary Revision. Chief Electoral Officer V.Candavelou, Secretary of Personnel, S.Sundaravadivelu and District Collectors- E.Vallavan and D.Manikandan were present during deliberation.\n\nThe Deputy Election Commissioner told the officials that the ECI wants that the electoral rolls should be free from error and should be having all parameters which are prescribed by ECI.\n\nLater talking to media persons here, Mr. Saxena said the meeting was conducted to ensure the quality of electoral rolls which will be published on January 11.\n\n“We had discussion about the preparedness of Puducherry administration is having for the ensuring polls. The endeavour of commission is that electoral roll should be free from error and every eligible voter should find his name in the electoral rolls,” Mr. Saxena said while adding the electoral roll revision work is in good shape.\n\nHe said all the errors have been addressed properly and after due verification, all those who have given their applications for addition, inclusion or change were duly disposed.\n\nAsked to whether the Commission has taken steps to tackle problem of dual entry of voters in the border areas of Tamil Nadu and Puducherry, Mr. Saxena said already those things have been looked into and the Tamil Nadu and Puducherry electoral rolls would be compared in time to come.\n\nHe added that the full commission will be visiting soon to take stock of the situation before the announcement of poll schedule.\n\nDeputy Inspector General of Police Kannan Jagadesan and other police officials also apprised of preparedness.\n\nAs per final electoral rolls which were released last January, there were 9,08,821 voters - 4,34,098 males and 4,74,683 females. The draft electoral rolls released in last September stated the Union Territory comprising Puducherry, Karaikal, Mahe and Yanam regions has 7,50,711 voters including 3,91,555 women and 3,59,115 men and 41 other voters.\n\nAs per directions of the ECI with January 1, 2016 as the qualifying date, a special summary revision campaign was conducted in the UT from October 15 to November 10 last year.", 
    "section": "national", 
    "title": "EC to publish poll rolls free of errors", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}