{
    "author": [], 
    "text": "SALEM\n\nSri Sai Satsangam: Maharudra yagnam and Shiva Parvathi Kalyanam, Kalasarchana, panchamrta Abhishekam, Deiveegam marriage hall, 7 a.m.; purnahuthi, 8 a.m.; Shiva-Parvathi Kalyanam, 9 a.m.; Mahamangala arathi, 11.30 a.m.\n\nSri Prasanna Varadaraja Perumal Devasthanam: Margazhi Tiruppavai Upanyasa Mahotsavam, B. M. Sathya Ram Acharya delivers upanyasam, Vasantha mandapam, Chinnakadai street, 6.45 a.m.\n\nTiruvembavai Peruvizha Kazhagam Trust: Tiruvembavai peruvizha, Tiruvembavai parayanam, Arulmigu Sugavaneswara Swamy Temple, 5.15 a.m.\n\nSri Ayyappan Bajanai Mandali, Sri Dharmasastha Ashram: Sri Radha Kalyana urchavam, Sri rudra jabam, Mahanyasa poorvaga abishekam, sastha vilakku poojai, Sri rudra homam, maha deeparadanai, Town Railway Station road, 6 a.m.; upanyasam by Ganapathiraman Sastrigal, 6 p.m.; saxophone music concert by Kadiri Gopalnath, violin by Selvi Kanyakumari, thavil T. R. Govindarajan, 7.15 p.m.\n\nMargazhi Peruvizha Committee: Margazhi festival, E. Jayaraj from Sri Lanka, delivers relay discourse on ‘Mahabaratham’, Ammapettai Sengunthar marriage hall, 7 p.m.\n\nPaalam The Book Meet Book Stall: Readers meet and introduction of book, S. Easwaran introduces the book ‘Jananayagam’, book stall premises, Adwaitha Ashram street, 11 a.m.\n\nNoorul Islam Jamath and Noorul Islam Maqtab Madrasa: Exhibition of flood damage and rescue operations, near Daarus Salam Matriculation School, Junction, 9 a.m. to 9 p.m.\n\nNagaichuvai Manram: Special seminar, P. Arumugam speaks on ‘Silappathikaram’ and C.Mahalingam speaks on ‘Saivasidantham’, R. Srinivasagupta presides, Shanmuga Hospital hall, 10 a.m.\n\nKnowledge Institute of Technology: Workshop on ‘Plus Two Mathematics’, V. Vijayakumar, state president, Tamil Nadu Maths PG Teachers Association, chief guest, P. S. S. Srinivasan, Principal, presides, 10 a.m.\n\nBharathi Vidyalaya Higher Secondary School Old Boys Association: Executive committee meeting, school premises, 11 a.m.\n\nLivewire: Core job oriented training programme for engineering / arts and science students, near New Bus Stand, 10 a.m.\n\nNational Book Trust and New Century Book House: National Book Festival book exhibition, Bose Maidan, 9.30 a.m. and 9.30 p.m.\n\nNAMAKKAL\n\nDepartment of Handlooms and Textiles: Pongal Festival handloom exhibition, Sri Namagiriamman Thirumana Mandapam, Kulakarai, 10 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}