{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Farm scientists, and agriculture experts stressed the importance of adopting innovating technologies to increase the productivity of farm produce, and increase profits.\n\nThey were speaking at the ‘Jai Kisan Jai Vigyan’ Day celebrations held at Krishi Vigyan Kendra (KVK) at Sandhiyur, near here, recently. The event was organised jointly by the Directorate of Extension Education, Tamil Nadu Agricultural University (TNAU), and the KVK Sandhiyur.\n\nC. Rajendran, Joint Director of Agriculture (in-charge), explained the importance of quality seed production, soil health management, farm mechanisation, integrated pest and diseases management, and post harvest technologies for improving the productivity and profitability of farmers as envisaged by Vision 2023 agriculture plan.\n\nN. Sriram, Programme Coordinator, KVK Sandhiyur, explained importance of the day, and how farmers, scientists, and extension workers worked together and achieved significant growth in the field of agriculture.\n\nThe celebration was being organised keeping in view the immense contribution made by scientific community and extension workers for promoting use of science for the welfare of farmers, he said.\n\nA. Ponnusamy, Vice-Chairman, Panamarathupatti Panchayat Union, explained how he implemented innovative agriculture technologies on his field with the support of scientists and extension workers.\n\nScientific presentation on biogas for sustainable farming by the scientists from Department of Bio-energy, TNAU, formed part of the event.\n\nAdvance models of biogas plant, latest technologies on biogas, and innovative usages of biogas were presented during the programme.\n\nMechanisation\n\nThe final year students from Agricultural Engineering College and Research Institute, Tiruchi, presented a complete farm mechanisation solution for paddy cultivation to solve labour problems during critical field operation.\n\nFarm mechanisation for pre-ploughing, bund forming, plastering, driverless power tiller, paddy transplanter, motorised weeder, combined harvester, and paddy straw baler were presented as video module for the benefit of the farming community.\n\nIn the seminar that followed, progressive and innovative farmers shared their experiences.\n\nSugavanam of Kammalapatti, shared his experience on hi-density guava cultivation techniques, mulching practices for weed management, and watermelon success stories.\n\nNagaran from Navapatti, explained his successful experience in castor cultivation.\n\nHe shared his innovative marketing experiences especially on castor and maize marketing for the benefit of the fellow farmers.\n\nRajan from Edapaddi spoke on his experience in tenai cultivation techniques.\n\nHe explained how he achieved and harvested 800 kg of tenai minor millet from 0.75 acres by using organic and innovative agriculture technologies.\n\nDasrathan of Yercaud spoke on samai minor millet cultivation techniques.\n\nThe chairman of Salem Kanjamalai Millets and Pulses Producers Company Limited Madheswaran shared his experience on formation of farmers producers company, and how it is going to help the farmers in future agriculture and marketing of agriculture produces.", 
    "section": "national", 
    "title": "Farmers share success stories; inspire youth", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}