{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here has refused to quash a case registered against an Inspector and Sub Inspector of Police on charges of demanding and accepting a bribe of Rs.20,000 for letting off an accused from an assault case and decamping with the money when Directorate of Vigilance and Anti Corruption (DVAC) sleuths laid a trap to catch them red handed.\n\nJustice M. Venugopal dismissed the quash petitions filed by the Inspector, A. Thanga Nadan, and the Special Sub Inspector (SSI), C. Deva Kumaradhas, both attached to the Nithiravilai police station in Kanyakumari district, after observing that prima facie materials were available against them and hence it would not be appropriate to interfere with the trial pending before the Chief Judicial Magistrate in Nagercoil.\n\nAccording to the prosecution, the two had demanded Rs.20,000 from M. Suresh Kumar in April last for dropping his name while filing a charge sheet in an assault case. Acting on a complaint lodged by the latter, the DVAC decided to lay a trap and asked the complainant to hand over the money to the two officers near a hotel at Puthukadai on April 25.\n\nAs instructed, the money was given to the Inspector, who, in turn, handed it over to the SSI riding pillion on a motorcycle. However, when the DVAC sleuths emerged from their hideout and attempted to catch the two officers, the SSI decamped with the money and remained absconding for long. Therefore, the police could subject only the Inspector to phenolphthalein test, which turned out to be positive.\n\nAfter recording the facts of the case, the judge said that “there is a distinction between a case where there is no legal evidence which is clearly inconsistent with the accusations made and a case where there is legal evidence which on appreciation may or may not support the accusations. Therefore, the High Court cannot assume the role of trial court and embark upon an inquiry into reliability of evidence.”", 
    "section": "national", 
    "title": "HC refuses to quash case against police officers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}