{
    "author": [], 
    "text": "RELIGION\n\nRamakrishna Math: Discourse on ‘Bhagvan Sri Ramarin Vaazhvum Vaakum’ by Kalarani Rangaswami, 5.45 p.m., Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nGita Bhavanam: 68{+t}{+h}anniversary, 45-day yagna, Kamarajar Salai, 7.30 a.m.\n\nPaneeru Thirumurai Mandram: Pannisai by S.S. Mohanram, Adi Street 7 a.m., Discourse on ‘Periapuranam’ by N.S. Sundararaman, No. 26 Pandian Street, Sundar Nagar, Tirunagar, 5 p.m.\n\nUniversal Peace Sanchiary: Free meditation class by Sathguru Sundaramoorthi Sachidananda, Mariamman Teppakulam, 7 p.m.\n\nYoung Men’s Brahmins’ Association: Sri Vishnu Sahasranama Parayanam and puja, No. 21, Sambandamoorthy Street, 6 p.m.\n\nSri Madanagopalaswami Temple: Discourse on Sri Valmiki Ramayanam by Sri U.Ve. Ananthapadmanabachariar Swami, West Masi Street, 6.30 p.m.\n\nSreemath Bhagavath Geetha Siravana Samajam: 85{+t}{+h}year Sreemath Gita Siravana, Gita upanyasam, Govinda Dasa Seva Samajam, Mahal 6{+t}{+h}street, 6 p.m.\n\nTirupavai Tiruvembavai Isaipalli: Devotional songs 6 a.m., Paavai songs and devotional songs, Adi Street 6 p.m.\n\nGita Natanagopala Nayaki Mandir: 173{+r}{+d}jayanthi celebrations, No. 3 Mariamman Teppakulam West Street, 6 p.m.\n\nBhajanasramam: Ekadina Laksharchana for Swami Sri Ayyappa, No. 27 Nehru Nagar Fourth Street, 7 a.m.\n\nMadurai Hindu Nadar Bakta Sabai: Discourse by Illampirai Manimaran, VAP Community Hall, Mottai Vinayagar Mahal, East Masi Street, 6.30 p.m.\n\nChurch of Christ: Sunday service, Bro. Devamanickam speaks, Viswasapuri, Gnanaolivupuram, 10 a.m. and 6 p.m.\n\nCULTURE\n\nBharatanatyam Arangetram: Sridevi alias Swetha’s bharatanatyam arangetram, Hudson auditorium, Tamil Nadu Chamber of Commerce and Industry, Kamarajar Salai, 6 p.m.\n\nGandhi Memorial Museum: Special class for Bharatiya Vidya Bhavan I level Sanskrit exam, 10.30 a.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nArsha Parampara: Mundakopanishad 7 a.m., Bhagavad Gita, Yagasalai, Andalpuram, 6.30 p.m., Lalitha Sahasranamam and spiritual heritage classes by Swamini Vidyananda Saraswathi, Old Kalyana Mandapam, Meenakshi Temple, 10 a.m.\n\nSri Aurobindo Study Forum: Sath sang on Sri Aurobindo’s ‘Life divine’ by Prof. Subramony, Nithyatha, Aurolab, Veerapanchan, 10 a.m.\n\nBhumi Art Centre: Free winter camp for yoga, Bharati Ula Road, 10 a.m.\n\nGENERAL\n\nVivekananda College: Student development programme on spoken Hindi, valedictory function address by B. Sivakumar Branch in-charge, DB Hindi Prachar Sabha, Prayer Hall, 5 p.m.\n\nS. Vellaichamy Nadar College: Golden jubilee celebration of Department of Economics, A. P. Selvarajan, president, Dr. Perrys Mahendravel, vice-president, address, college campus, 10 a.m. onwards.\n\nInner Wheel Club of Madurai City: District conference – ‘Harmony’ Inner Wheel Clubs national president Ms. Mamta Agarwal chief guest, Ms. Dhanalakshmi Asokan presides, Rajbala Thirumana Mahal, NO. 161 Kamarajar Salai, 8.30 a.m.\n\nMadurai District Photo Studio Association: 46{+t}{+h}general body meeting, Madurai Nadar Uravinmurai Subburaj Nadar Krishnammal Mandram, Teppakulam, 10 a.m.\n\nRotary Club of Madurai Northwest: Meeting on ‘Vazhum Kalai’ by Manimegalai Palaniappan, Hotel Sarada Rajan, 9.45 a.m.\n\nYadava Cultural Centre: Release of New Year calendar, R.P. Dharmalingam, general secretary, Tamil Nadu Yadava Mahasabai, Chennai, releases, G. Vijayakumar, former DSP, receives first copy, 120-ft road, Surveyor Colony-Maatuthavani Road, 10 a.m.\n\nJanata Dal: Veerapandia Kattabomman’s 257{+t}{+h}birth anniversary, garlanding statue, K. John Moses, State general secretary, participates, Periyar bus stand, 10 a.m.\n\nTamil Nadu Kungfu Association: Free camp for Kungfu, all age group, behind A.R. Hospital, KK Nagar, 10 a.m.\n\nTamil Nadu Construction Workers’ Welfare Board: Awareness meet on ‘Problems faced by migrating workers’ and Pongal celebration, district president A. Venkatesan presides, near Kappalur bus stop, 9 a.m.\n\nVidiyal: Pongal sports meet, St. Mary’s School ground, 9 a.m.\n\nAlcoholics Anonymous: Ninth year anniversary and public awareness meeting, Principal District Judge C. Raghavan chief guest, T. Paneerselvam, secretary, Legal Services Authority, presides, Justice Krishna Iyer Hall, 9 a.m.\n\nAlcoholics Anonymous: Meeting, Justice Krishna Iyer Hall, 7 p.m., Alfred Noble Mat. School, Tirunagar 11 a.m.\n\nMELUR\n\nAlcoholics Anonymous: Meeting, Freedom group, R.C. School, near State Bank, 6.30 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}