{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "Piyush Goyal, Minister of State (independent charge) – Power, Coal, New and Renewable Energy, at the Mahindra World City near Chennai on Saturday.— Photo: G.Krishnaswamy\n\nThe $16.9-billion Mahindra Group’s vehicles at Mahindra World City, near Chennai, will be powered by Bio-CNG generated at a plant on its premises, which was inaugurated by Piyush Goyal, Minister of State (independent charge) – Power, Coal, New and Renewable Energy.\n\nThe plant which involves an investment of Rs 1.6 crore is a joint CSR initiative between Mahindra Research Valley (MRV) and Mahindra World City Developers Limited (MWCDL).\n\nThis plant will convert 8 tons of food and kitchen waste generated every day at the MWC into 1,000 cubic meter of raw biogas. Further, the raw bio gas can yield 400 kg per day of purified CNG-grade fuel which is equivalent to a 200 kW power plant. As a by-product, four tons of organic fertilizer will be produced per day.\n\nAfter testing a tractor that runs on Bio-CNG inside the MWC, Mr. Goyal suggested that this venture could be scaled up rapidly and he also requested the group to bring down the price of this equipment. “Our government will support any initiative that can provide cost-effective solutions toward making India greener and cleaner,” he said.\n\n“There are nearly 6,000 towns in India with above 30,000 population. Together we should attempt to see if we can have at least one unit of this bio-gas plant in all these villages,” Mr. Goyal said.\n\nPawan Goenka, Executive Director, Mahindra & Mahindra Ltd., said, “This may not be a large commercial venture, but it’s a large venture in terms of sustainability. In MWC, the biogas will be used for generating power and fuelling CNG buses and tractors. Further, the power generated will be used for street lighting, buses for free shuttle service and tractor for cultivation.”\n\nThe green energy (bio CNG) can be used to replace CNG as automotive fuel and LPG for cooking purposes as well as to power streetlights at MWC. The organic fertilizer will be used by farmers to enhance soil fertility.\n\nFor this project, the Mahindra Group has partnered with MWC for waste collection, Khadi and Village Industries Commission , IIT Delhi for technology development and Naandi Foundation to reach out to the farmers.\n\nIt will convert\n\n8 tons of waste into 1,000 cubic meter of raw biogas", 
    "section": "national", 
    "title": "Mahindra City gets bio-CNG plant", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}