{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "Twenty-six-year old M. Haripriya had to take a break from her career soon after child birth as the company she worked for did not let her take leave beyond three months.\n\n“Twelve weeks is just not enough for mothers. Is not raising a child a social responsibility? Do people in power even think about our support systems? Women sacrifice a lot after child birth,” she says.\n\nWith reports that the Centre had agreed to increase maternity leave for women in private sector from the present 12 weeks to 26 weeks, there has been plenty of talk about it, with women overwhelmingly welcoming the move.\n\nLess support for women from families\n\nSenior Lawyer Geeta Ramaseshan says mothers today have less have support systems as extended families are no longer as supportive as they used to be in the past. She notes that in some European countries, for instance, the maternity leave is spread over a long time and such initiatives improve the productivity of employees. She says this is a welfare legislation and cannot be seen as interference in their autonomy by private companies.\n\n“Labour laws cannot be seen as interference, the State has the obligation to bring in such legislation to address the needs of employees,” she says.\n\nK. Purushothaman of NASSCOM says they have been conducting programmes to talk about maternity benefits.\n\n“Most software companies have a large workforce, hence the extension of leave will not be seen as creating a negative impact on the firm,” he added.\n\nIf a woman is not able to get the said period of leave, where can she go to redress the problem?\n\nMs. Ramaseshan says there should be regulatory body which should act as a redressal forum in case a person is denied six months of paid leave or removed from her work.\n\n“There should be a mechanism to bring in the unorganised sector too into the framework so that women in all spheres can benefit from the legislation,” she added.\n\nBut Ms. Haripriya says, “We have policies on paper. Even if we are granted the said period’s leave, the employee suffers in several indirect ways like losing out on issues like seniority and promotion. Do we have a mechanism to sort that problem?” K. Pichammal of All India Democratic Women’s Association (AIDWA) says that while on the one hand we encourage breastfeeding, if mothers do not get additional paid leave up to six months, it will be unfair.\n\nWomen overwhelmingly welcome the move to increase maternity leave", 
    "section": "national", 
    "title": "Maternity leave in pvt. sector to be 26 weeks", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}