{
    "author": [
        "M K"
    ], 
    "text": "There is commendable drop in the number of crime cases registered by the Coimbatore District Police in 2015, compared to such cases registered in 2014.\n\nStatistics from the District Crime Records Bureau (DCRB) shows that 700 cases such as murder, dacoity, robbery, burglary and theft were reported in rural Coimbatore in 2014 and it came down to 518 in 2015.\n\nBurglary at night has come down from 136 in 2014 to 87 in 2015, number of burglaries during the day time increased from 51 to 52.\n\nContrarily, the number of murders has gone up to 53 in 2015 from 43 in the previous year. The police said that they are watching over gangs for any possible retaliation - such as the triple murders on Palakkad Bypass Road in 2015.\n\nAccidents\n\nWhile lives lost in accidents in the city has come down by more than 20, the number of fatal accidents (accidents that claimed one or more lives) in Coimbatore Rural increased by 34 to 683 in 2015. The number of non-fatal accidents in Rural Coimbatore also increased from 1,692 in 2014 to 1,846 in 2015.\n\nThe district police said that over speeding of vehicles on national and state highways was reason behind more persons getting injured or killed in Coimbatore District (excluding the city). Police are planning to map the accident prone spots and come out with initiatives to save more lives.\n\nAs many as 26,043 cases were booked against two-wheeler riders for not wearing helmets. Though this is more than 10 fold the 2,449 such cases booked in 2014. Compliance to wearing helmets is very less in rural Coimbatore.\n\nGoondas Act\n\nThere was a marginal increase in the number of detentions under Goondas Act and it was attributed as one of the reasons for drop in the number of thefts, burglaries and robberies. Cases of persons who went missing have gone up to 296 in 2015 from 246 in 2014. A marginal drop was witnessed in the number of suicides from 1,150 to 1,100.\n\nThe number of murders has gone up to 53 in 2015 from 43 in the previous year", 
    "section": "national", 
    "title": "Murders, accidents up in rural Coimbatore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}