{
    "author": [
        "R Rajaram"
    ], 
    "text": "Only export cargo from Tiruchi international airport is on upswing since the commissioning of the international freight complex.\n\nxport cargo from Tiruchi international airport is on upswing since the commissioning of the international freight complex while the scenario on the import side is not so bright.\n\nImport of cargo in Tiruchi, a fast growing airport, has remained negligible over the years notwithstanding steady rise in the number of foreign airlines operating services to select overseas destinations in South and South East Asian region and West Asia.\n\nWhile export cargo handled at the airport per month is around 550 metric tonnes, imports have been negligible at three tonnes every month with human bodies accounting for the bulk of import cargo.\n\nStakeholders and industry circles here attribute a host of reasons for imports remaining negligible despite rise in overseas flight services from Tiruchi.\n\nThe nature of industry in Tiruchi and nearby areas does not require import of goods through air. Most of the materials required for the industries in Tiruchi are available in Mumbai and other cities which could be brought through road, says industrialist K.G. Muralidharan. So, the need for import is substantially reduced.\n\nConsidered the fabrication hub of the country, Tiruchi has witnessed a scenario wherein the fabrication industry has taken a severe beating over the past few years. The presence of export-oriented units in Tiruchi which could avail schemes and privileges under the Customs Act for import is very negligible, say stakeholders.\n\nWhat arrives as import cargo to Tiruchi airport through foreign carriers are mainly human bodies. In addition, uniforms, boarding passes, labels and stickers are brought in by a particular foreign airline, say airport sources. Although textile hub of Karur is at arm’s length to Tiruchi airport, the export of finished products and imports of samples are primarily routed through the sea due to the cost factor and the advantage of dispatch in bulk which cannot be done through flights. Further, the destination for the textile goods is Europe and other Western countries which are not directly connected to Tiruchi airport.\n\nLack of dedicated air cargo freighters, non-operation of wide-bodied aircrafts due to runway restriction, absence of Electronic Data Interchange in Tiruchi Airport Customs and absence of domestic air connectivity to Mumbai despite demands are attributed to negligible import scenario.\n\nThe existing overseas flights being operated from Tiruchi airport are of medium sized such as A-320 which has a floor limitation. Airlines usually do not permit goods which are beyond weight of 100 kilograms of a single piece, say airport sources. Stakeholders strongly feel that absence of huge corporate set ups as yet another reason for lack of imports. A robust industrial development in Tiruchi with launch of big electronic industry in this part of the region could spur import cargo in the longer run, feels Mr. Muralidharan.\n\nSources say few consignees and exporters of Tiruchi region were using the gateway ports for their import requirements. It is felt that they could make use of the bonded trucking facility from the gateway ports for their import cargo for ultimate customs clearance in Tiruchi airport without waiting for cargo freighters or runway expansion or operation of wide-bodied jets. Such a move would increase the import tally in Tiruchi airport besides augmenting revenue to all stake holders, add the sources.\n\nThe nature of industry in Tiruchi and nearby areas\n\ndoes not require import\n\nof goods through air.", 
    "section": "national", 
    "title": "Negligible imports in Tiruchi airport", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}