{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Old mortuary building is being renovated at the hospital\n\nThe new building under construction at the Rajiv Gandhi Government General Hospital —Photo: B. Jothi Ramalingam\n\nRajiv Gandhi Government General Hospital will soon get a building exclusively for comprehensive master health check-ups: the old mortuary building near the entrance is being renovated for this, hospital authorities said.\n\nMaster health check-ups are being performed at the hospital at present, but as per the Chief Minister’s announcement in the Tamil Nadu Assembly earlier this year, the check-ups will be expanded to include more tests and screening procedures and high-end investigations, said medical superintendent G. Sheelarani.\n\n“Renovation of the building has already begun. We are hoping for it to be completed by January 15,” she said. Dean R. Vimala said the cost of the project was around Rs. 10 crore and included new, state-of-the-art equipment for the building.\n\nThe tests that will be performed include those for renal function, liver function, blood grouping, ECGs, echocardiograms, tests for hearing loss, chest X-rays, thyroid tests, HbA1c tests and blood sugar tests.\n\nMaster health check-up\n\nThis apart, a full body master health check-up for women will include tests to check for cervical cancer, mammograms, bone density tests, tests to check for calcium and phosphorous levels and a parathyroid test.\n\nA sum of Rs. 250 is charged for the current master health check-up but the fee for the new one has not yet been fixed, said Dr. Sheelarani.\n\nAt present, around 1,500 patients go in for the master health check-up at the hospital, but doctors are hoping for more patients for the new service.\n\n“We are also planning to let companies know about the availability of this full-body master health check-up, so that they can send their employees here,” said Dr. Sheelarani.", 
    "section": "national", 
    "title": "New block for master health check-ups at GH", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}