{
    "author": [], 
    "text": "The student could not produce community certificate\n\nNoting that the professional knowledge and skill acquired by an engineer cannot be wasted as it might be used for public purpose, the Madras High Court has directed the National Institute of Technology (NIT), Tiruchi to issue degree certificate to a student admitted under reservation quota who could not produce his community certificate.\n\nIn 2011, the petitioner G. Gopinath, who cleared the All India Engineering Entrance Examination (AIEE), was allotted a B.Tech course in the NIT, Tiruchi under the Scheduled Tribe quota.\n\nHowever, he could not produce his community certificate at the time of admission.\n\nLater, with the aid of an interim order and a final order dated February 4, 2013, Gopinath was allowed to pursue the course without the certificate.\n\nSubsequently, the petitioner completed the course in June 2015.\n\nCourt approached again\n\nAs the institution refused to issue the degree certificate, the petitioner once again approached the High Court.\n\nThe petitioner submitted that his father’s sister holds a Scheduled Tribe community certificate issued by the Revenue Divisional Officer, Dharmapuri in June 6, 1996. He claimed that the document is still pending verification before the State level scrutiny committee.\n\n'Applied for certificate'\n\nGopinath further stated that he has applied for a community certificate only based on his aunt’s certificate and as the verification on her certificate is still pending his application could not be processed.\n\nCounter affidavit\n\nThe State Level Scrutiny Committee in its counter affidavit submitted that the Vigilance Cell has been directed to conduct an enquiry and submit a report by January 13 and based on the report appropriate orders would be passed on the petitioner’s application.\n\nDirective to college\n\nWhen the petition came up for hearing before the Division Bench of Justice Satish K. Agnihotri and Justice P. Devadass, based on the submission of the Scrutiny Committee the Bench directed the college to issue the certificates with a condition that in the event of the petitioner failing to obtain the scheduled tribe community certificate, he shall not claim any reservation and benefit on the basis of the benefit of reservation in any service or elsewhere.\n\nBench said in the event of petitioner failing to obtain the certificate, he shall not claim quota", 
    "section": "national", 
    "title": "NIT told to issue degree certificate to student", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}