{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Rules out rail connectivity to Dhanushkodi\n\nSouthern Railway General Manager Vashishta Johri inspected the railway station here and the manual operation of Scherzer’s span at the century-old Pamban rail bridge.\n\nMr. Johri said that since the Rameswaram railway station was one of the important stations that served a large number of tourists and pilgrims, it required regular inspection by higher officials. The railways had to keep on monitoring whether the passenger amenities were good, further improvements needed and the requirements were met.\n\nAccompanied by Sunil Kumar Garg, Divisional Railway Manager (Madurai) and senior officials, Mr. Johri inspected the running room, pit line and the recently inaugurated bio-toilet laboratory at the railway station.\n\nLater, he inspected the Pamban rail bridge and the operation of the Scherzer’s span from the road bridge.\n\nAnswering a question, Mr. Johri said that the Rail Vikas Nigam Limited (RVNL), a subsidiary of the railways, had been entrusted with the task to fabricate and build a new span to replace the ageing Scherzer’s span at a cost of Rs. 25 crore.\n\nThe RVNL would take up the re-girdering work at the span in the coming months, he said. “Since corrosion was extensive in this location, the corroded girders are replaced time and again,” he said.\n\nThe railways had replaced 28 girders last year and has taken up replacement of 16 more girders.\n\nMr. Johri ruled out rail connectivity to Dhanushkodi, which was devastated in the 1964 cyclonic storm, or the possibility of reviving the Boat Mail. “I don’t think there is any proposal,” he said.\n\nCutting in, Mr. Garg said that the railway line between Rameswaram and Dhanushkodi was washed away in the cyclone more than 50 years ago and the Indian Railway has not given even a thought to it (restoring the lines). Earlier, Mr. Johri, accompanied by family members, offered worship at Sri Ramanathaswamy Temple.\n\nThe railways had replaced 28 girders last year and has taken up replacement of 16 more", 
    "section": "national", 
    "title": "Official inspects railway station, Pamban bridge", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}