{
    "author": [
        "R Arivanantham"
    ], 
    "text": "The existing five tanks are filled with garbage and sullage: INTACH coordinator for Nagercoil chapter\n\nIndian National Trust for Arts and Cultural Heritage (INTACH) has urged the authorities to protect the few tanks left in Nagercoil, a town once blessed with a large number of waterbodies.\n\nIts coordinator for Nagercoil chapter, R.S. Lal Mohan, told The Hindu here on Wednesday that the importance of proper maintenance of waterbodies was felt after the recent deluge in Chennai, Kanchipuram and Tiruvallur districts. There were 60 tanks in Nagercoil in the 50’s. Except for five, all tanks had either vanished or had been encroached upon by influential people. Even the existing five tanks were filled with garbage and sullage.\n\nCare taken\n\nThe erstwhile Travancore Samasthanam took great care to protect the waterbodies as Nagercoil was its summer capital.\n\nIf the authorities failed to protect the existing tanks, even a few centimetres of rain would cause a Chennai-like catastrophe in Nagercoil. The five existing tanks in the town were Subbayarkulam in Krishnankoil, Chemmankulam, Poochathattankulam, Chettikulam and Peruvilaikulam.\n\nSubbayarkulam, dug by P.D. Devasahayam between 1802 and1865, was being fed by Pechiparai dam. Now, drainage water from the municipality was drained into it, and garbage was dumped into it. Aquatic plants, now spread over three-fourths of the tank, were slowly choking it to death. A dysfunctional boat jetty, constructed by the district administration 15 years ago, still remained on the shore of the tank measuring 40 acres, Dr. Lal Mohan said.\n\nHe said that Chemmankulam, also known as ‘Umaibankaneri’ and fed by Pechiparai dam through Anandanar canal and Krishnankoil canal, was also dying. Sewage water from Krishnankoil canal drained into the tank before entering Pazhayar river.\n\nEfforts taken by INTACH and another international organisation to put up a barbed wire fence around Chemmankulam did not materialise owing to non-cooperation of municipal and Public Works Department authorities, he added.\n\n“Efforts taken to fence Chemmankulam did not materialise owing to non-cooperation of authorities”", 
    "section": "national", 
    "title": "Plea to protect tanks in Nagercoil", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}