{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Rasipuram Residents have urged the district administration to commission the completed stretch of Phase I of the Rasipuram bypass road project immediately to ease traffic congestion in the town.\n\nThe Rasipuram bypass road project was planned by the State Highways Department a few years ago to solve the ever increasing traffic congestion problems in Rasipuram town, and in the town panchayats of Pillainallur, Seerapalli and Namagiripettai.\n\nThe project was planned in three phases. The Phase I was planned from office of the Revenue Divisional Officer on the national highways to Appanayakkanpatti via Chandrasekarapuram village at Rs. 18 crore. The Highways Department acquired adequate land for this purpose.\n\nThe Phase II was from Appanayakkanpatti to Thanneerpandalkadu via Seerappalli.\n\nAlmost the entire bypass road laying work in Phase I was completed a few years ago. Only the tar topping on 700-m stretch was pending. Even this work was resumed recently and is in progress at present.\n\nAll the major thoroughfares and the lanes and sub-lanes were dug by the Rasipuram Municipality for the execution of underground drainage works. They have not been re-laid after the completion of the works.\n\nThe poor condition of the roads leads to frequent traffic jams causing much hardship to vehicle users and pedestrians.\n\nThe Rasipuram Makkal Koottamaippu in a petition presented to Collector V. Dakshinamoorthy recently pleaded for steps to throw open the completed stretch of the Phase I.\n\nWith the opening of the bypass road, buses proceeding to other cities such as Chennai and the large number of buses transporting students studying in the self-financing engineering and arts and science colleges and schools in Rasipuram town and surrounding areas could be diverted on this road. This will ease the traffic congestion in Rasipuram town in a big way.\n\nThe petition handed over by Pachal A. Srinivasan, president of the Rasipuram Makkal Koottamaippu, and Nalvinai Viswaraj, also pleaded for steps to start the Phase II without delay.\n\nThe Collector promised to take steps to open the new road for traffic, said A. Mohanraj, advisor of the Koottamaippu.", 
    "section": "national", 
    "title": "Plea to commission completed stretch of bypass project", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}