{
    "author": [
        "M K"
    ], 
    "text": "With more than four months left for the famous annual flower show as part of the summer festival in Udhagamandalam, work has begun from the eve of New Year.\n\nThe preparations are underway at the Italian Garden, New Garden, Lower Garden, Japanese Garden, and Top Garden.\n\nWhile the number of flowers for display is the same (5 lakh) as last year, 194 varieties of flowers will be on display this season. This is 19 more than 175 varieties displayed for the festival in 2015.\n\nAmong them are 6,000 bulbs of tulips (imported from The Netherlands) in six colours which would be on display for the first time during the summer festival. Joint Director of Horticulture N. Mani told The Hindu that tulip blooms only in the winter, and attempts were being made to make it bloom during early summer season.\n\n“These flowers will bloom by the end of March and it will be a pre summer season feast for the visitors for a couple of weeks till early April,” he said. Among the other newer attractions this year are oriental lilly, lobelia and 35 more colours of dalia – more than the number of colours displayed last year.\n\nMr. Mani said that preparation for the flower show begins three to five month ahead of the flower show – which is usually organised in the third week of May. “It depends on the time taken for formation of buds and blooming. Close to 150 garden labourers have started preparations for the show by preparing 15,000 flower pots and planting on flowerbeds,” he added.\n\nPlanting that has already commenced is for varieties such as delphinium, penstemon, hollyhock, and salvia so that it will bloom during the summer season. The planting is expected to be completed in the first week of February.\n\nLast year 8.90 lakh tourists visited the Botanical Garden and witnessed the Flower Show in April and May. This is more than 8.38 lakh tourists who witnessed the flower show in the same period in 2014.\n\nWhile more varieties of flowers are expected to pull a better crowd this summer, date for assembly election could be a deciding factor on the tourist flow for the flower show.", 
    "section": "national", 
    "title": "Preparations begin for annual flower show", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}