{
    "author": [
        "M K"
    ], 
    "text": "Measures such as increasing night patrol and vehicle checking has resulted in a 20 per cent drop in the total value of property loss such as cash, jewellery and vehicles stolen in 2015 compared to 2014. Numbers of robbery and house breaking had also come down last year.\n\nBut, there was a drastic increase in number of thefts from 350 in 2014 to 483 in 2015. The number of property related crimes had increased to 749 in 2015 from 648 in 2014. But, the number of cases that were detected in 2015 was only 553, compared to 573 in 2014.\n\nStolen property recovered by the police last year include Rs. 43.21 lakh , 2,140 sovereigns gold jewellery, 114 two-wheelers and 12 four-wheelers.\n\nWhile 47 persons were detained for their repeated involvement in various offences in 2014, 66 persons were detained in 2015.\n\nCity Police Commissioner A. Amalraj said that the recovery rate will increase when cases reported in the last few weeks of 2015 are detected in the days to come. “Focus will be given to detect undetected crimes without delay,” he added.\n\nThere was a marginal increase in the number of murders from 20 in 2014 to 24 in 2015. Two of these murders including the murder of a temple priest at his house at Singanallur in December are yet to be cracked. The measures taken by the city police in enforcing the High Court order to make wearing helmets mandatory has resulted in a drop in the number of lives lost in road accidents to 265 in 2015 from 286 in the previous year. Persons injured in road accidents also came down from 1,404 in 2014 to 1,372 last year.\n\nThe number of rape and kidnapping cases and cruelty to women by their husbands or in-laws dropped in 2015, compared to the previous year. City Police personnel launched a crack down on sale of drugs, sale of lottery tickets and flesh trade as a total of 199 more cases were registered under this heads compared to the 266 such cases registered in 2014.", 
    "section": "national", 
    "title": "Property offences drop", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}