{
    "author": [
        "J Praveen Paul Joseph"
    ], 
    "text": "Manufacturers seek subsidy and excise duty exemption to tide over the difficult situation\n\nFall in market prices has added to the woes of match industry in Tuticorin district. -Photo: N. Rajesh\n\nRise in costs of raw materials used for producing safety matches and fall in market prices caused concern among manufacturers.\n\nOwing to the increase in raw material costs, production cost rose up by 10 per cent, making the market for safety matches not conducive, M. Paramasivam, president, National Small Match Manufacturers Association, Kovilpatti, told The Hindu on Thursday.\n\nSince several fully mechanised units were established in north India, market potential of traditional matches in Tamil Nadu, especially in the southern region, was dwindling. Wooden splints, cardboard and potassium chlorate are the key raw materials used for match box production. Mr. Paramasivam said that the cost of one kilogram of wooden splints had increased to Rs. 45 from Rs. 40; the cost of one tonne of cardboard jumped to Rs. 37,000 from Rs. 34,000; and the cost of one tonne of potassium chlorate shot up to Rs. 90,000 from Rs. 42,000 when 27 companies were producing potassium chlorate in Tamil Nadu.\n\nSince the number of companies producing potassium chlorate had come down to two, the manufacturers had to import the raw material from China. Normally, 20,000 tonnes of potassium was required for production in a year.\n\nWhile four lakh bundles, each comprising 600 match boxes, were produced last year, only 2,40,000 bundles were produced this year, he said.\n\nLast month’s rainfall also cost the manufacturers dearly as wooden splints and cardboard turned wet. These materials could withstand moisture up to five per cent, but the consistent rains increased their moisture content to 15 per cent, he said.\n\nThough a common facility centre had been set up in Kovilpatti only the building was available and machinery was yet to be installed. It had been proposed to provide two inner box pasting machines here.\n\nEven if such facilities were made available at the centre, it would not be sufficient, he noted.\n\nKey raw materials should be provided to manufacturers at subsidised rate and excise duty for semi-mechanised production units should be scrapped for the revival of the industry, he also added.", 
    "section": "national", 
    "title": "Raw material cost hits match industry", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}