{
    "author": [
        "Gayathree Ganesan", 
        "Anjana Shekar"
    ], 
    "text": "Kotturpuram police appreciated for their selfless efforts during floods\n\n“People usually come to us when they have a problem, but today, we were overwhelmed with surprise as more than 200 people walked into the station,” said M. Anbhazhagan, a police officer attached to the Kotturpuram police station.\n\nResidents of Kotturpuram, Besant Nagar and other nearby places; volunteers from AID India and over 40 students and teachers from the Corporation schools in the locality thronged the station on Saturday evening to thank the Kotturpuram police on their selfless efforts towards relief and rescue during the recent floods in Chennai.\n\n“This is the first of its kind in Chennai and we have been greatly honoured by this act of appreciation by the public,” Mr. Abhazhagan said.\n\n“Volunteers were greatly appreciated for the relief work they undertook during the Chennai floods, but not many came forward to thank the Chennai police. Over the past few weeks, we had been receiving requests from the residents to help them organise a surprise event to show their appreciation for the police,” says P. Sakthivel, founder of 6.in, surprise party planners.\n\n“We held a music event for about an hour at the police station, cut and distributed a 7-kg cake that was sponsored by Cake Square and presented a shield of honour to the Kotturpuram police. The students presented poetry and also gifted an artwork to them,” he added.\n\n“Our respect for the Chennai police has reached a greater height since the Chennai floods. The videos of rescue operations conducted near the Kotturpuram signal had gone viral in social media and this is our way of repaying them for the selfless service during the floods,” said a resident.", 
    "section": "national", 
    "title": "Residents walk into station, throw a thanksgiving party", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}