{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "The Southern Railway is considering a proposal to change the route of Sethu and Rameswaram express trains in the Rameswaram-Chennai sector following suggestions that the timings were inconvenient to the passengers, Southern Railway General Manager Vashishta Johri has said.\n\nTalking to reporters after inspecting the Railway station and the century-old Pamban rail bridge here on Saturday, he said the Madurai division has given this proposal.\n\n“The proposal is under examination as the routes are getting revised and the timings are also revised accordingly,” Mr. Johri said, adding the change of routes of the two trains might be good for one group of passengers but should not adversely affect the other group of passengers.\n\nPointing out that the two trains reached the pilgrim island at odd hours, causing inconvenience to pilgrims and general public, local MP A Anwhar Raajhaa has appealed to the Railway Minister to change the routes of the two trains and ensure they reached the island at convenient timings.\n\nAdditional train\n\nMr. Johri said he was not sure of introducing additional trains in the sector when asked whether the Railways would fulfil former President A.P.J. Abdul Kalam’s desire for an additional train with a refrigerator coach for transporting fish from the island and name it as ‘Pamban Express.’\n\n“Introduction of new trains is not within the purview of the zone and a new train can be introduced only with the permission of the Railway Board,” he said. It has to be discussed at the inter-Railway time table committee meeting, “for which the proposal has already been given by the division and it will be discussed at the board,” he said.\n\nDepending on regular requirements during festivals and seasons, special trains were operated in this sector and “we will keep on running the specials,” he added. On canteens remaining closed in Rameswaram and other Railway stations for more than five months, he said tenders would be finalised by this month end and they would be opened during February-March.", 
    "section": "national", 
    "title": "S. Railway considering change of timings of Sethu Express: GM", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}