{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Safety match manufacturers are looking forward to the introduction of goods and service tax (GST) bill, which will bring them the much-awaited relief.\n\nIn April last year, Prime Minister Narendra Modi made the announcement on passing the GST bill during the winter session in parliament in 2015. But days had passed by and stakeholders of this industry were still keeping their fingers crossed, according to J. Devadoss, secretary, South India Match Manufacturers Association, Kovilpatti.\n\nOnce the bill was introduced, the match producers, who had been facing a downtrend in the market, would heave a big sigh of relief. The introduction of GST would certainly minimise the expenditure burden and more importantly evasion of duty and tax would also come down significantly, he told The Hindu on Friday.\n\nCurrently, the manufacturers were liable for excise duty, sales tax, service tax and also tax deduction at source. If the GST was implemented, the manufacturers need not have to pay such duty and taxes to market matches.\n\nIn the present scenario, the manufacturers had to pay six per cent excise duty on total goods manufactured through semi mechanised units, 12 per cent duty for matches manufactured by fully mechanised units and incur a five percent sales tax. Besides, service tax was also levied based on utility of logistics. Not only was the domestic market, the export trend also not enterprising as stakeholders could hardly compete in the international market. Moreover, Mr. Devadoss said the match manufacturing industry was at its peak during 1996 when match boxes were consumed heavily. But with the advent of lighters and automatic strikers in gas stoves, its consumption reduced considerably after 1996. Much to the dislike of manufacturers, this waning industry was removed from the small scale sector and included in the large scale sector this year, he said.", 
    "section": "national", 
    "title": "Safety match producers look forward to introduction of GST", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}