{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Corporation has issued temporary no-objection certificate to a private company\n\nThirty automated traffic signals with uninterrupted power supply or solar lights will be installed at various points in Salem city.— PHOTO: E. LAKSHMI NARAYANAN\n\nWith automated traffic signals powered by conventional electricity supply becoming non-operative during power cuts, the city police will soon have 30 automated traffic signals with uninterrupted power supply or solar lights installed at various places in the city.\n\nA private company has sought permission from the District Collector for installing the signals at 30 places in the city and in turn place advertisement boards in the signals.\n\nThe Collector has forwarded the application to the Corporation for issuing no-objection certificate.\n\nJunctions\n\nThe automated traffic signals with UPS facility will come up at junctions in Thiruvakavundanur, AVR Roundtana, Steel Plant Road, Meyyanur – ARRS Theatre Road, Redipatti, Kuranguchavadi, Five Road, Mamangam, Three Road, New Road, Fairlands Police Station, Cherry Road Railway Gate, Mulvadi Gate, Old Bus Stand – Tiruvalluvar Statue, Ramakrishna Road, Collectorate, Sundar Lodge, Hasthampatti Roundtana and Corporation Central Office Junction.\n\nThe Corporation has issued temporary no-objection certificate after laying down the following conditions. The company should obtain permission from Traffic Wing, National Highways Authority of India, State Highways and other government departments for installing the advertisement boards and should not encroach upon the road space.\n\nAlso, the structural design of the proposal signals along with pillar size should be submitted for approval from the Corporation, the advertisement boards should not violate any law and should not carry objectionable materials and should not disturb the traffic flow.\n\nCost\n\nThe cost of installing advertisement materials should be borne by the company and the permission is granted for three years. Maintenance of signals and electricity bills should be borne by the company and the Corporation has the right to cancel the NOC when needed.\n\nPower backup\n\nPolice officials said that having back up facility for signals would help regulate vehicles as traffic personnel were under tremendous stress during power failures.\n\nCurrently, there are 36 automated traffic signals with only five signals having power backup facility.\n\nThe company should obtain permission from various government departments for installing the ad boards", 
    "section": "national", 
    "title": "Salem to have 30 automated traffic signals with power backup", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}