{
    "author": [
        "S Senthalir"
    ], 
    "text": "(Clockwise) Srilata Raman, associate professor, University of Toronto holds Vallalar’s statue, inside the Romain Rolland Library; Christoph Emmrich, associate professor, of the same varsity and a view of French Institute of Pondicherry.— Photos: T. Singaravelou and S.S. Kumar\n\nInternationally renowned research institutes make it a treasure trove of knowledge\n\nThis costal town is a treasure trove of knowledge. Research Institutes like the French Institute of Pondicherry has been a hub of multi-disciplinary research, attracting many scholars working especially on Indian studies.\n\nSeveral scholars from across the world come down to Puducherry to avail themselves of the resources here.\n\nNot many know that Puducherry houses internationally renowned research institutes like the French Institute of Pondicherry (IFP) and École française d'Extrême-Orient (EFEO) dedicated to Indian studies. Not just that, there is Romain Rolland Library, Pondicherry University and Pondicherry Institute of Linguistics and Culture (PILC) and also the Auroville library.\n\nUnlike the metropolitan cities, Puducherry provides for easy accessibility to resources and the calm environment the scholars desire to carry out their research.\n\nSrilata Raman, associate professor, Department for the Study of Religion and Centre of Diaspora and Transnational Studies at University of Toronto in Canada, is spending her sabbatical period in Puducherry.\n\nShe says: “In Chennai, there are many libraries. But you need to have a lot of energy to get around. But, the marvellous aspect of being here in Puducherry is that everything is available within a compact space. It is not far from Chennai, if need be we can always do a day trip or shorter several day trips. This is the perfect reason to be here.”\n\nShe is completing her book on Ramalinga Swamigal (Vallalar). This book is also about how Vallalar, particularly in the latter phase of his life, availed himself of different traditions of Tamil Saivism. “Though I have completed the research work and in the final stages of writing the book, it is a lovely discovery to see how Vallalar is important in Puducherry. I found some fascinating aspects here — The Vallalar Salai, Vallalar Narpani Mandram and I also got a gollu statute of Vallalar,” she said.\n\nShe intends to work with the Contemporary Studies Programme in the Indology Department of the French Institute of Pondicherry on a new project.\n\n“I have received funding for a new project called Hunger, Religion and Calamity in Colonial South India. I am thinking about brining a book on the collection of translation of texts which will deal with this subject. This is an ideal situation, I will be here and we will plan the book in the next six months,” she said.\n\nChristoph Emmrich, associate professor, Department for the Study of Religion, University of Toronto, whose areas of interest ranges from Buddhism to Jainism in South and Southeast Asia, is also here on a sabbatical. He is now actively engaged in studying Tamil Jain tradition. It is extremely important for him to be here as the Jain sites are in the vicinity of Puducherry. “I am working on Jainism in Tamil Nadu and I am particularly interested in the Tamil Jain tradition that goes back several centuries. I found that people here who are engaged in this field are active conversation partners and mainly, the people at the French Institute of Pondicherry. There are also local people who are not connected to international situations but who have their own networks within Puducherry and Villipuram district,” he said.\n\nHe added that when he had stayed in Chennai for a short duration, he had to take his daughter to the malls for a walk.\n\n“There was no space for the children to walk. But, in Puducherry it is much better. She has the space to play and walk,” he says.\n\nHe explains that the time in Puducherry this year was the most productive.\n\nKamini Mahadevan, editor of Penguin Books, finds the reason for attraction is the research institutes and the scholars here.\n\n“French Institute has certain expertise like the Indology and Ecology departments. Scholars with specific interest in this field are drawn towards the institute for research work. These are some of the islands of good work in Puducherry. Navayana publication was also started in Puducherry, which has now moved to Delhi,” she says.\n\nPenguin Publishers in collaboration with the French Institute of Pondicherry brought out a book on the contemporary Tamil writing in Sri Lanka – ‘Time Will Write A Song for You.’", 
    "section": "national", 
    "title": "Scholars too flock to Puducherry", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}