{
    "author": [
        "Mohammed Imranullah"
    ], 
    "text": "In its earlier circular, HR & CE only asked temples to follow their customary practices\n\nThe HR and CE Department’s stand is that the dress code prescribed by the judge was not in consonance with the Tamil Nadu Temple Entry Authorisation Act, 1947. A scene outside Sri Parthasarathy Swamy Temple in Chennai on New Year day.— Photo: K.V. Srinivasan\n\nThe Hindu Religious and Charitable Endowments (HR and CE) Department has decided to file a writ appeal before the Madras High Court Bench here challenging a single judge’s order to implement a dress code prescribed by him for devotees and other visitors to various temples in the State.\n\nThe single judge had issued the direction to the Tourism, Culture and Religious Endowments Department Secretary on November 26 while disposing of a writ petition seeking permission for cultural programmes known as ‘Gramiya aadal padal vizha’ in a small temple in Tiruchi district on November 23.\n\nThe judge had specified that from January 1 men should wear “dhoti or pyjama with upper cloth or formal pants and shirts” and women “sari or half sari or churidhar with upper cloth,” and children should come in “any fully-covered dress.”\n\nThe HR and CE Department’s stand is that the dress code prescribed by the judge was not in consonance with the Tamil Nadu Temple Entry Authorisation Act, 1947, which permits individual temples to frame rules relating to attire as per their customs and traditions.\n\nCircular\n\nSources in the HR and CE Department here said that they had issued a circular last month directing all temples under its control to enforce their individual rules on attire only because of a delay in receiving a certified copy of the single judge’s order and consequential delay in filing the appeal.\n\n“The circular does not instruct temples to implement the dress code prescribed by the judge. It only asks them to follow their customary practices. Even in our appeal, we have questioned only the correctness of restricting the attire to the list prescribed by the judge,” an officer said.", 
    "section": "national", 
    "title": "State to oppose dress code order in court", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}