{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A section of activists, who talk about human rights, have stopped thinking about the duties of each of the persons concerned, said Madras High Court Judge N. Kirubakaran.\n\nDelivering the presidential lecture at the presentation ceremony of Justice V. R. Krishna Iyer Award on Saturday, Justice Kirubakaran said just five to ten percent of human-rights activists legitimately work towards realising their goals, and strike a balance between rights and duties.\n\n“A large number of people misused the statutory provisions pertaining to human rights. So, an order preventing misuse of such statutory provisions was passed. This reduced the misuse, but also inadvertently affected some genuine crusaders for human rights and social justice. I feel sorry for those affected activists,” said Justice Kirubakaran.\n\n“Many government employees have also stopped thinking about duties, failing to offer services to citizens. This has severely affected the nation. As a result, taxpayers’ money is getting wasted,” said Justice Kirubakaran.\n\nStressing on the need for more awareness on all aspects of human rights in Tamil Nadu, National Human Rights Commission member Justice D. Murugesan said that of the one lakh human rights cases, only 4,000 were from Tamil Nadu.\n\nAs many as 37 awardees including former Supreme Court Justice S. Rathinavel Pandian, former Madras High Court Judge K. P. Sivasubramaniam, senior advocate R. Vaigai, Frontline Editor R. Vijaya Sankar, member secretary of Transplant Authority of Tamil Nadu J. Amalorpavanathan, former Additional Chief Secretary R. Christodos Gandhi, advocate Ravi Paul, The Hindu Tamil Editor K. Asokan and PUCL National Secretary V. Suresh received the Justice V. R. Krishna Iyer Award for their role in the promotion of human rights and social justice.", 
    "section": "national", 
    "title": "‘Strike balance between rights and duties, activists urged", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}