{
    "author": [], 
    "text": "The Tamil Nadu Generation and Distribution Corporation (Tangedco) will hold consumer grievances meetings at the following circle offices in the district as per the following schedule this month: January 5 – Thuraiyur; January 8 – Srirangam; January 12 – Lalgudi and January 19 – Tiruchi Metro. Consumers can appear in person to represent their grievances at the meetings, S. Sekkizhar, superintending engineer, Tangedco, Tiruchi Metro Circle, said in a release.\n\nBereaved families\n\ngiven compensation\n\nThe families of four persons who died in the recent building collapse at West Uthira Street in Srirangam were handed over Rs.1 lakh each from the Chief Minister’s Public Relief Fund on Saturday.\n\nThe families of six persons who sustained grievous injuries were given Rs. 50,000 each. Khadi and Village Industries Minister T.P. Poonachi handed over the cheques to the families in the presence of R.Manoharan, Chief Whip, K.S.Palanisamy, Collector, T. Rathinavel and P. Kumar, MPs. The families of the four persons who died have been given a compensation of Rs.1.02 lakh each from the Uzhavar Padukappu Thittam, an official release said.\n\nRecruitment for\n\nTerritorial Army\n\nThe 117 Infantry Battalion (Territorial Army) would conduct a recruitment rally at the Army Training Area at Mannarpuram in the city from February 23 to 27. The recruitment will be for soldier (general duty), soldier (tailor), soldier (hair dresser). Candidates in the age group of 18 to 42 are eligible. Territorial Army is a voluntary organisation and essentially a part-time job. Eligible candidates volunteering to join the Territorial Army should report for screening at 5 a.m. at the venue on February 23, according to an official release.\n\nFarmers plan fast\n\nA group of farmers associations has called for a one-day fast in Tiruchi on January 10 demanding the waiver of all crop loans sanctioned by the nationalised banks and cooperative societies in the state. The group claiming the support of 74 farmers organisations from across the state demanded steps to remunerative prices for farm produce.\n\nSpeaking to reporters here on Saturday, P.K. Deivasigamani, coordinator of the associations, said the government should take steps to ensure that farmers got at least 50 per cent profit for their produce and the Union and State governments should change their policies towards achieving this end. He also demanded priority for inter-linking of rivers and removal of encroachments of water bodies. Farmers should be compensated for damages caused to crops by wild animals and all farmers awaiting farm power connections should be given connections immediately. All farmers and farm workers who have attained the age of 58 should be given a monthly pension of Rs. 15,000, he demanded.", 
    "section": "national", 
    "title": "Tangedco grievance redress meet", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}