{
    "author": [
        "M Darathy", 
        "S Deepak"
    ], 
    "text": "Those who feel anxious when they do not have a mobile phone with them can undergo anxiety management techniques.—File Photo: M. Periasamy\n\nV. Vignesh, a law student, recharges the internet pack on his mobile phone thrice a month. To him, it is essential to stay connected with his friends on the social media and he does so using his mobile phone. He says his day is not the same if he misplaces his mobile phone or is unable to check into the social media sites every two hours.\n\nMember\n\nFor first year computer science student S. Deepthi, the mobile phone is essential. She not only stays connected but also gets assignments on her mobile. She is a member of more than 15 WhatsApp groups and even when she sits in front of the television, it is the mobile phone that she is browsing through.\n\nAccording to the TCS Youth Survey (TCS GenZ Survey 2015-2016) in Coimbatore, which covered 750 students aged between 12 and 18 years, the smart phone was the most preferred gadget for 76 per cent of them.\n\nOver 40 per cent of the respondents had Twitter accounts and 69 per cent used WhatsApp for instant messaging. More than 75 per cent of the students were online an hour every day.\n\nD. Srinivasan, consultant - Psychological Medicine at Kovai Medical Centre and Hospital, says there is no problem if a person uses a gadget for a specific function. However, when the individual becomes dependent on the gadget, the issue needs to be addressed.\n\nFor instance, if a person is at work, the mobile phone will be less used because he or she must cope with workplace demands. Similar self-discipline should be followed at home.\n\nPeople who feel anxious when they do not have a mobile phone with them can undergo anxiety management techniques (exercising, taking deep breathe, having adequate sleep, well-balanced diet, etc) to step out of that attitude, he said.\n\nA post-graduate student in journalism, C. Sabharish says he feels he is disabled without a mobile phone. He has wi-fi connectivity at home and ensures he does not miss any update.\n\nHe feels upset if he does not have access to his phone.\n\n“When we were children, there were more outdoor games. Now, every one wants to be with a phone,” he says.", 
    "section": "national", 
    "title": "The anxiety while not having a mobile phone", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}