{
    "author": [
        "B Kolappan"
    ], 
    "text": "The renaissance of culture and music during the Maratha regime in Thanjavur gave rebirth to an instrument that had disappeared completely from the concert scene. Chitraveena or Gottuvadhyam owes its existence to Sakharama Rao, a Maharashtrian who lived in Thiruvidaimarudur, a temple town near Kumbakonam, between 1903 and 1959.\n\n“Even though the instrument has found a reference in Bharatha’s Natya Shastra, it found no takers for almost 150 years till Sakharama Rao arrived at the scene. He re-invented and re-designed the instrument and introduced it to concert platforms,” said Chitraveena exponent N. Ravikiranan.\n\nSakharama Rao called the slide for playing the instrument “gottu” and it became Gottuvadhyam. Earlier, slides made of the horns of bisons were used. Now teflon slides have replaced them.\n\nBefore Sakharama Rao, his father Srinivasa Rao, used the tambura to play music. “Placing the tambura like a veena, Srinivasa Rao used a small tumbler as a sledge to produce music. Sakharama Rao went many steps further and created an instrument,” said Mr. Ravikiran, whose grandfather Narayana Iyengar was the disciple of Sakharama Rao. Narayana Iyengar gave a full-fledged Gottuvadhyam performance at the first music festival of the Music Academy.\n\nTiruvidaimarudhur, an ancient town and abode of lord Siva known as Mahalingaswamy, is known for its broad and beautiful streets. In the world of music, the place became synonymous with Sakharama Rao. Prominent among his disciples was the late Semmangudi Srinivasa Iyer.\n\nWith his long hair flowing down to his nape and his big moustache, Sakharama Rao fit the image of a non-conformist in this traditional sphere. His younger brother Hari Rao was a violinist.\n\nMr. Ravikiran said it was his grandfather who increased the strings of the instrument to 21, including synthetic ones used in the Sitar to make it sound like a human voice, while his contemporary Budalur Krishnamurthy Shastry played it like a veena.\n\nRavikiran’s father, N. Narasimhan, learnt both from Budalur Krishnamurthy Shastry and his father.\n\nProminent among Sakharama Rao’s disciples was the late Semmangudi Srinivasa Iyer", 
    "section": "national", 
    "title": "The Maharashtrian who revived Chitraveena", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}