{
    "author": [
        "K Lakshmi"
    ], 
    "text": "They are adopting a variety of strategies including attractive EMI options to bring customers\n\nith crowds beginning to mill around T. Nagar for Pongal shopping, billing counters at most showrooms, especially textile showrooms, are seeing long queues once again. For traders whose experienced a lull in their businesses two weeks ago, this is a welcome sight.\n\nS. M. Anwer Hussain, managing director of Madharsha Group, said the situation was improving in Purasawalkam.\n\n“We expect a boom in the textile business as the wedding season is round the corner.”\n\nS. Ramesh, managing director, Pothys, said that sales had been almost normal for the past one week. “Business was a total washout after the floods. But the situation has improved. However, we cannot expect it to be as good as in other years,” he said.\n\nMany shopkeepers want to make the most of the improving situation and ensure good business that would make up for the poor sales that marked most of December.\n\nBusinessmen adopt a variety of approaches. In Purasawalkam, several traders have brought in new stock to attract customers.\n\nWith Pongal heralding an auspicious month, jewellery showrooms are offering several offers like discount per gram or less wastage cost. Jewellers said though the price of gold had been low for several days now, many showrooms had a dip in sale.\n\nOn Saturday, one gram of 22-carat gold was priced at Rs.2,373. Consumer durable showrooms too were offering incentives.\n\nS. Jayaprakash of Jeyam & Co., said prices now were attractive compared to those in November.\n\nTamil Nadu Vanigar Sangangalin Peravai president T. Vellaiyan said nearly one lakh traders were affected in the recent floods. Several of them had taken loans to ensure brisk business during the festive season.\n\n“We are also taking a survey of their losses to seek flood relief assistance from the government and also trying to arrange loans from banks.”\n\nSome traders have taken loans to ensure brisk business during the festive season", 
    "section": "national", 
    "title": "This Pongal, traders seek a fresh start", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}