{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Ministry for promoting ‘multi-skill development’ through cluster approach\n\nUnion MSME Minister Kalraj Mishra looks at value-added knitted apparels brought out by the students of NIFT-TEA Knitwear Institute in Tirupur on Saturday.— Photo: R. VIMAL KUMAR\n\nUnion Minister of Micro, Small and Medium Enterprises (MSME) Kalraj Mishra has said that the Ministry would immediately take steps to set up a “design studio” as a “common facility centre” (CFC) in Tirupur knitwear cluster so that large number of units could utilise it to give value-addition to apparels.\n\nThe announcement was made during his visit to Tirupur on Saturday in response to a proposal put forward by NIFT-TEA Knitwear Institute and Laghu Udyog Bharathi, which is the country’s largest MSME network.\n\n“Apart from the design studio, the Ministry will take steps to ensure speedy clearance to the proposals already made to the State government for setting up two other common facility centres for apparel production and knitting in Tirupur cluster,” he said.\n\nStating that multi-skill development is the buzzword for future of MSME clusters like Tirupur, Mr. Mishra said that the Ministry had now issued guidelines for the development of multi-skills through a cluster-based approach.\n\n“In Tirupur, it will be tried out considering every segment of the apparel production as a cluster,” he said.\n\nB2B ventures\n\nMr. Mishra told The Hindu that the Ministry had taken significant steps in recent times to make sure that ventures of MSMEs did not lag due to the proliferation of online platforms for sale by offering them portal spaces.\n\nEarlier in the day, Mr. Mishra visited NIFT-TEA Knitwear Institute, Eastern Common Effluent Treatment Plant and inaugurated a centre for skill training in Tirupur.\n\nHe also held interactions with representatives of various industrial associations and declared open the 2015-edition of ‘Resilient Tirupur,’ an initiative launched by NIFT-TEA Knitwear Institute and few other stakeholders to catapult the Tirupur cluster to greater heights in terms of profitability and exports.\n\n‘Steps taken to ensure MSMEs\n\ndo not suffer\n\nowing to online platforms’", 
    "section": "national", 
    "title": "Tirupur to get design studio soon", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}