{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Two men were arrested by the Madurai city police on Friday for allegedly demanding Rs.20 lakh from a businessman after threatening him over phone.\n\nAccording to police sources, R. Giridhar (54), running a wholesale pharmaceuticals business in Simmakkal area, received a phone call on Monday. The stranger on the phone used the name of an infamous rowdy in the city and demanded Rs.20 lakh money for accomplishing an important task of the particular man, the sources said, adding that the stranger also threatened to kill Giridhar and his family, if he informed the police. On Giridhar’s complaint, a case was registered at the SS Colony police station and preliminary investigation revealed that the stranger had called from a STD booth. Further investigation revealed that the call was made by R. Venkatesh Kumar from Balarenganathapuram near Palanganatham, who was an employee of the pharmaceutical shop.\n\nThe police sources said that Venkatesh acted along with his relative M. Jeyakumar (26), an auto driver from Jaihindpuram. The police said that Venkatesh was aware that around Rs.40 lakh in cash was kept at the pharmaceutical shop of Giridhar as the money collected from retailers could not be deposited in the bank due to Christmas holidays.\n\nThe police added that Venkatesh and Jeyakumar wanted to exploit the situation as they assumed that Giridhar would get scared if they threatened him using the name of a rowdy. Both were arrested and sent for judicial custody after presenting them before a magistrate.\n\nCommissioner of Police Shailesh Kumar Yadav warned of stern action against people, who indulged in such crimes as the discreet police investigations would lead to arrest. The police have registered cases of threat, demanding ransom and to kill a person against the two accused.", 
    "section": "national", 
    "title": "Two held for demanding money", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}