{
    "author": [
        "Staff Reporter"
    ], 
    "text": "People using the George Road in Tuticorin Town have been enduring pain as the busy road remains a dangerous stretch. The busy George road had been battered giving a tough time for vehicle users. This road had been neglected by the Corporation authorities for a long time now.\n\nThis poorly maintained road has now turned into an accident-prone area as many people had met with accidents and sustained injuries, Mariappan, a road user said. Adding to the agony, the road was partially dug up last year to lay pipelines for the never-ending underground drainage project, and not filled up properly to make it even. It was a scary ride for two-wheeler users as small stones on this road get them to skid. Since the road was uneven, cars suffered damages, R. Pradeep, a road user said.\n\nDue to poor road condition, TNSTC buses have stopped plying through this George road for the last 10 days, Selvaraj, Chairman, East Zone of Tuticorin Corporation. The situation was worse during rainy days. The absence of street light only added to the woes of the road users.\n\n“In public interest, a light was made functional from my shop till 11.30 p.m.,” Ravi, a shopkeeper on George road said. Clouds of dustgot kicked up after passage of every vehicle irking not only vehicle users, but also shop keepers who were exposed to a serious health hazard. Often, people including shop keepers had to cover their faces with cloth to save themselves from smoke and dust.\n\nGurumurthy of George road said it was certainly a shame on the corporation, which could not even maintain a single road in this small town. Despite paying taxes to the corporation, people were being put to such hardships, he said. With schools being reopened after holidays, school goers were also destined to bear the brunt of this poorly kept road, he said.\n\nReliable sources from TNSTC said buses could hardly access George road and services would resume once the road was repaired. Commissioner of Corporation R. Poongodi Arumaikan told The Hindu that works would be taken up soon to revamp the George Road.", 
    "section": "national", 
    "title": "Vehicle users taken for a bumpy ride", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}