{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "The damaged road at Chinnakumarapalayam. (right) The one-km road from Chinnakumarapalayam has been re-laid.— Photos: Special arrangement\n\nFor the residents of Chinnakumarapalayam, located nearly 20 km from Mettupalayam town in the district, going to work, high school, or to a grocery shop, means travelling to the nearest town which is nearly seven km away.\n\nThe one-km road, which connects Chinnakumarapalayam to Periyakumarapalayam, was re-laid at a cost of Rs. 42 lakh recently. However, it was only after several petitions and protests by the residents. The road was damaged and not re-laid for more than two decades. Even basic maintenance work was not taken up, say the villagers.\n\nFor the last two years, the public and the Village Development Organisation of Chinnakumarapalayam have been submitting petitions to elected representatives, local body and the district administration.\n\nWith no action taken to re-lay the stretch, they celebrated silver jubilee for the road and organised special pujas (an yagam) for it in June this year.\n\n“There are just two buses that ply to Chinnakumarapalayam and these come seven times a day. The village has a school with classes up to standard V. Be it going to work or school or transporting agricultural produce, there was just one road for the residents of the village and it was badly damaged. On some rainy days, the buses would not come to the village in the evening hours,” says V. Sivaelango of the Village Development Organisation.\n\nResidents continuously made efforts to improve the road and organised the pujas and celebrations in June. After that, officials visited the village and steps were taken. Now, the 12-foot-wide road has been re-laid by the Panchayat Union.\n\n“It has been re-laid for one km from Chinnakumarapalayam to Periyakumarapalayam,” says S. Rajammal, the Periyakumarapalayam panchayat head.\n\nMr. Sivaelango says relaying this road benefits not only the residents of Chinnakumarapalayam but eight other villages located nearby, he adds.", 
    "section": "national", 
    "title": "Village gets better road after two decades", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}