{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "‘When Siruvani supply drops, Corpn. will augment it with supply from Pilloor Reservoir’\n\nThis is perhaps the first time in the last five years that water level in the Siruvani Reservoir has not touched the full reservoir level both during the South-West Monsoon and North-East Monsoon period.\n\nThis has become a cause for concern, because water from the reservoir feeds residents in 23 of the 100 wards in the city, besides some wayside habitations as well. Water from River Bhavani, Pilloor Reservoir and River Aliyar take care of the needs of the residents in rest of the wards.\n\nWater managers in the Coimbatore Corporation say that if both the monsoons are bountiful the water level crosses the full reservoir level – 49.54 feet – during both the seasons. The South-West Monsoon season is from June to September and the North-East from October to December.\n\nFirst time\n\nOr, the water level touches the full reservoir level at least during one of the two monsoon seasons. But this is the first time in the last few years that the water level is well below the full level. With this water level (34.44 feet as of December 29, 2015), the Corporation will have to manage supply at least till June 10, 2016 when the South-West Monsoon starts impacting the water level in Siruvani.\n\nThis is a tightrope walk that they are used to, say the city’s water managers. In the next few weeks the Corporation with help from the Tamil Nadu Water Supply and Drainage Board, which manages the scheme for the civic body, will start reducing the quantity of water drawn to ensure supply till the onset of the SW Monsoon.\n\nAt present, the Corporation gets around 78 million litres a day (mld) and supplies the water once in four days to the residents.\n\nThey say that when the Siruvani supply drops, the Corporation will augment it with supply from the Pilloor Reservoir, from where it draws 125 mld and can divert some.\n\nThe Corporation diverting Pilloor water will also hold good for areas that get River Bhavani water – Kavundampalayam and Vadavalli – and River Aliyar water – South Zone (Kurichi and Kuniamuthur).\n\nThe water managers add that this is not an unprecedented situation that warrants emergency measures. To assuage fears, they point out that the North-East Monsoon has offset the fall in water level in Siruvani due to daily withdrawal and added a metre.\n\nOn September 29, 2015, the water level was 31.10 feet and on December 29, 2015, it was 34.40 feet – meaning, it has gone up. There is no reason whatsoever to worry, they reiterate.", 
    "section": "national", 
    "title": "Water managers confident of tiding over Summer 2016", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}