{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Conference emphasises on conservationto mitigate effects of natural disasters\n\n(From left) P. Sathyanarayanan, chairman, Pudhiya Thalamurai ; actor Suriya, founder, Agaram Foundation; water conservationist Rajendra Singh, N. Ram, chairman, Kasturi & Sons Limited and V.S. Ramasubramanian, judge, Madras High Court at a photo exhibition during ‘Yadhum Oore’ conference in Chennai on Saturday —Photo: S.R. Raghunathan\n\nEnvironmental conservation and the protection of water resources came in the spotlight at the ‘Yadhum Oore’ conference organised by Agaram Foundation, The Hindu and Puthiya Thalamurai.\n\nActor Surya, founder of Agaram Foundation, introduced the ‘Yaadhum Oore’ conference and said there was an immediate need for society to become environmentally conscious.\n\n“While this is the first conference here, we are hoping to take it to more places and engage more volunteers who will take this cause forward,” he said.\n\nSpeaking about the large gap in the State between the number of water sources such as lakes and tanks and the actual numbers which were being protected, Justice V.S. Ramasubramanian said that a lot had to be done despite large amounts of money being spent towards conservation.\n\n“There was a popular joke in a film that spoke about wells missing from villages. While that was once considered impossible and ridiculous, the present reality of water tanks having disappeared due to development says otherwise. A joint public initiative with active participation from the stakeholders is needed if we need to make headway in conservation of natural resources,” he said, at the inauguration of the two-day conference.\n\nN. Ram, Chairman of Kasturi & Sons Limited, said that the link between climate change and disasters of the magnitude of the Chennai floods had to be observed closely.\n\n“The focus now should be on what can be done to mitigate the effects of a disaster like this, which can occur again in the future, by studying models adopted across the world,” he said.\n\nHe also quoted the examples of the conservation of the Hudson river, U.S., in the past as well as the efforts taken by Siruthuli, a Coimbatore-based NGO.\n\nIn his special address, water conservationist Rajendra Singh, known as the ‘water man’ of the country, spoke about the need for identification, demarcation and notification of various water sources in the State.\n\n“After the identification, we should appeal to the government to take the lead for conservation. A united front by people from the State is needed in bringing about effective solutions,” Mr. Singh said.", 
    "section": "national", 
    "title": "Yadhum Oore begins", 
    "subsection": "tamilnadu", 
    "date": "2016-01-03"
}