{
    "author": [
        "Maria Akram"
    ], 
    "text": "Municipal Corporation sanitation workers’ strike enters day five\n\nAAP workers clearing garbage dumped at Patparganj as the strike by MCD workers entered the fifth day, in the National Capital on Sunday.— Photo: V. Sudershan\n\nMinisters and Aam Aadmi Party MLAs along with party men armed with brooms cleaned the streets on Sunday even as the Municipal Corporation of Delhi (MCD) sanitation workers’ strike entered day five. A sanitation drive was launched in all the AAP constituencies and garbage was removed.\n\nThe sanitation workers on their part continued with their strike and the vociferous protestors warned the AAP government that if their demands, which include clearing their dues and regularisation, were not looked into, the garbage situation in the city was likely to ‘deteriorate’ in the coming days.\n\nDeputy Chief Minister Manish Sisodia, who also carried out the cleaning drive in his constituency, Patparganj, said “we have already disbursed all the funds to municipal corporations for paying the salaries of their staff. We cannot let people live amid garbage. Hence, we have undertaken the cleanliness drive.”\n\nMore than 2,000 Delhi Jal Board workers have teamed up with the PWD workers for the cleanliness drive and 123 machines including auto tippers, maintenance vans and JCB, were deployed on Sunday.\n\nThe protesting safai karamcharis clashed with the PWD teams, who had been pressed into cleaning the roads. The PWD officials said at some places, like Laxmi Nagar, Uttam Nagar, attempts were made to stall the cleaning work. “But after reporting these incidents to the police, cleaning work started,” said a government spokesperson.\n\nThe Delhi government last week announced auditing of the corporations’ accounts but the BJP-led civic agencies turned down the proposal. “They don’t want the Delhi government to audit the accounts. They have clearly said that only the Home Ministry can audit their accounts. But they aren’t asking for grant from the Centre,” said Mr. Sisodia.\n\nBut this isn’t the first time that AAP MLAs took up the cleaning work after sanitation workers went on strike. Last year in March, June and October, the safai karamcharis dumped garbage on the roads as a mark of protest. Then also the AAP MLAs cleaned the streets.", 
    "section": "national", 
    "title": "AAP brooms sweep Delhi garbage", 
    "subsection": "general", 
    "date": "2016-02-01"
}