{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Aam Aadmi Party (AAP) alleged large scale irregularities, corruption and tender-fixing during implementation of solar power drinking water projects in Ganjam, the home district of Odisha Chief Minister.\n\nSpeaking to newsmen in Berhampur on Sunday, leaders of AAP came up with these allegations. They claimed that they had made sample survey of some solar power drinking water projects taken up by Berhampur division of Rural Water Supply and Sanitation (RWSS) department and compared them with the information procured regarding them by social activist S. Mohanty through RTI Act.\n\nRural pockets\n\nLeader of AAP, Prabhat Kumar Mohanty said it was found that 39 solar power drinking water projects have been established in remote rural pockets by Berhampur RWSS division. For each of these projects 4,76,000 rupees was spent.\n\n“Although digging of a borewell is included in the project cost of each solar drnking water project at several laces it was found that the solar powered pump sets had been attached to existing old tubewells in the area. At Metusahi, a 20 year old tubewell was linked to the project,” said Mr Mohanty.\n\nThe AAP fact finding team allegedly found one solar power drinking water project defunct since six months at Sindurabada and another project non-functional since two months at Nuasaru village. On such defunct project was identified by them at Siddheswar village. At Jayantipur, the project has been inaugurated but the overhead tank is yet to be connected by pipeline. Similar is the situation at Patrapur, AAP activists alleged.\n\nTender fixing\n\nAAP also came up with grave allegation that there was rampant tender fixing during implementation of these solar power drinking water projects. Mr Mohanty said several tenders had been issued in the name of wives of class IV employees of the department.", 
    "section": "national", 
    "title": "AAP smells a rat in solar power drinking water projects in Odisha", 
    "subsection": "general", 
    "date": "2016-02-01"
}