{
    "author": [
        "Murali Sankar", 
        "K N"
    ], 
    "text": "The community is demanding that it be included in the list of Backward Classes\n\nThe Kapu Aikya Garjana, public meeting conducted by former Andhra Pradesh Minister Mudragada Padmanabham, demanding the inclusion of Kapus in the list of Backward Classes, turned violent with the agitators setting the Ratnachal Express and the Tuni police station on fire on Sunday.\n\nThousands of people belonging to the Kapu community reached V. Kotthuru village by afternoon to attend the meeting. With Mr. Padmanabham calling upon the participants to launch an agitation, people formed into groups and staged rasta roko and rail roko protests in Tuni town.\n\nFirst, they stopped the Ratnachal Express at the Tuni station by squatting on the tracks. Even as they were raising slogans, police arrived on the scene to disperse the mob. All of a sudden, agitators started pelting the train with stones. Initially, the engine was targeted.\n\nPassengers panicked and got down from the train. Immediately, the mob set the coaches ablaze. Five coaches were destroyed by the time fire tenders were pressed into service.\n\nShouting slogans against the State government and demanding immediate action with regard to the inclusion of Kapus in the BC list, the mob joined the agitation launched by another group on the national highway, bringing traffic to a standstill.\n\nSitting on the highway with banners and flags, the agitators prevented the movement of buses, trucks, cars and even two-wheelers. Subsequently, a procession was taken out to the Tuni rural police station in protest against the caning of the agitators.\n\nHundreds of agitators entered the police station and ransacked it. Flames engulfed one of the police vehicles parked on the premises. Within a few minutes, eight police vehicles were torched.\n\nHelpless police sought the deployment of additional forces. Since the roads leading to Visakhapatnam, Rajahmundry and Kakinada were blocked by the agitators, it took a long time for additional forces to reach the town.\n\nFollowing the torching of coaches of the Ratnachal Express, railway officials stopped the Janmabhoomi Express at Samalkot and the Visakha Express and the Godavari Express at Visakhapatnam. The Konark Express was stopped at Kovvuru, and the Rajahmundry and Kakinada passenger trains from Visakhapatnam were cancelled.\n\nInclusion of the Kapu community in the BC list was one of the poll promises of the ruling Telugu Desam Party. The community forms over 27 per cent of the population.\n\nThe State government, on its part, has formed the Kapu Commission to facilitate the process.\n\nThe community says it was forced to take to the streets due to the delay in meeting its demand.\n\nThey torch Ratnachal Express, hold up traffic on NH", 
    "section": "national", 
    "title": "Agitating Kapus torch police station, train", 
    "subsection": "general", 
    "date": "2016-02-01"
}