{
    "author": [
        "Special Correspondent"
    ], 
    "text": "New Mumbai Police Chief says organised crime, women's safety, economic and cyber crimes big challenges\n\nDattatray Padsalgikar, a 1982 batch IPS officer, officially took charge as the Commissioner of Police, Mumbai on Sunday afternoon. The top cop said that anti-terror measures will be his first priority.\n\n“Policing a megapolis like Mumbai comes with a lot of challenges. Any incident that occurs here gets publicised quickly, and even incidents that occur outside impact the city. We have serious challenges before us like organised crime, cyber crime and economic offences, due to which the common man suffers a lot. Safety of women and senior citizens will also be focused upon. But of course, the priority will be terror. The Anti-Terrorism Squad and the Mumbai Police will work in tandem to counter the challenge and help will also be taken from central agencies,” said Mr Padsalgikar.\n\nThe veteran officer has served two stints with the Intelligence Bureau and has worked in Mumbai, Delhi and Nagaland, and was on a three-year deputation to Washington DC.\n\nSpeaking about the threat the Islamic State (IS) poses to the country, Mr Padsalgikar said, “The IS is in a position to attract youngsters and offer them what they were not even aware of earlier. This is what has been observed during inquires made with those youngsters who were intending to leave the country but did not.\n\n“It is also important in such a scenario that people like parents, family members and teachers also exert adequate pressure to discourage youngster from falling prey to the IS.”\n\nTrue to his reputation of putting his subordinates before himself, Mr Padsalgikar said, “The main job is done by the constables and officers of the force. Their job is more important than that of the superiors, whose roles are limited to supervision and guidance.”\n\nThe Twitter handles that were set up by former Mumbai police chief Ahmad Javed will continue to operate, Mr Padsalgikar said.\n\nShortly after taking charge, he tweeted from the Mumbai Police Commissioner’s official Twitter account saying, “Have taken charge as Commissioner of Police, Mumbai. Wish to work with you, for you, to the best of my ability.”", 
    "section": "national", 
    "title": "‘Anti-terror measures top priority’", 
    "subsection": "general", 
    "date": "2016-02-01"
}