{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "A West Bengal Pradesh Congress Committee (WBPCC) delegation will meet party vice-president Rahul Gandhi on Monday and underscore the benefits of an alliance with the Left Front in the coming Assembly polls.\n\nThe team, led by PCC president Adhir Ranjan Chowdhury, reached New Delhi on Sunday and held a meeting at Rajya Sabha member Pradip Bhattacharya’s house to present a watertight argument for a “Bihar-style” grand alliance to defeat the ruling Trinamool Congress.\n\nThe team members told The Hindu that they were “unanimous” about having an alliance with the Communists.\n\nHowever, the Congress high command is yet to declare itself in favour of a grand alliance in the State. In fact, the party’s studied silence is increasingly annoying its own leadership in the State and that of the Left Front.\n\nThe State leadership of the Left Front and the Congress came out in favour of an alliance earlier in January. But in the last few weeks, some Left Front leaders have expressed their disappointment with the Congress for delaying an announcement.\n\nMeanwhile, the WBPCC has been repeatedly appealing to the high command to finalise an alliance at the earliest.\n\nWhile Mr. Chowdhury has said he is against any alliance with the Trinamool, general secretary Omprakash Mishra has sent two letters, with the consent of the State leadership, to president Sonia Gandhi.\n\nIn one of the letters, Mr. Mishra explained that in case of an electoral adjustment with the Left Front, the grand alliance will get more than 160 of the 294 seats.\n\nAnd the combined vote of the Congress and the Left Front will be around the Trinamool Congress’s (40 per cent), provided both manage to stop desertion.\n\nMoreover, the alliance will also get 40 per cent of the BJP’s share in the 2014 Lok Sabha elections as there is “no Modi wave anymore,” Mr. Mishra argued.\n\nThe anti-TMC votes that went to the BJP in the Lok Sabha elections are also likely to return to the Congress and the Left Front, he suggested.\n\nHe refused to accept the argument that the traditional Congress voters, especially in central Bengal, who lost their land in the land distribution policy of the Left Front government in the 1970s, would never vote for an alliance with the communists.\n\n“Circumstances have changed and both of us are in the Opposition with a common rival, the Trinamool Congress, and thus our cadre is hugely in favour of an alliance. All independent surveys at the grassroots indicate an upsurge in favour of the alliance,” he said, before leaving for Delhi on Sunday.\n\nThe Congress leaders will go into the efficacy of the alliance, its importance for the Congress and how it may weaken the TMC, benefiting the Congress in the 2019 Lok Sabha elections.\n\n“The TMC is and will be an uncertain ally. Strengthening such an ally will not help the Congress in the 2019 Lok Sabha election, but if it weakens in the State it will only help the Congress. The grand alliance will only weaken the TMC,” Mr. Mishra said.\n\nHowever, the key concern of the Congress high command is that the Left-Congress alliance may “unwittingly push” the TMC to the BJP.\n\n“Mamata Banerjee is not against the Congress at the national level and the compulsion of Bengal’s politics would always keep her away from the BJP. But a Left-Congress alliance may unwittingly push her towards the BJP, which we need to avoid,” a senior Congress leader said a month ago.", 
    "section": "national", 
    "title": "Bengal Cong. to push Rahul for Left alliance", 
    "subsection": "general", 
    "date": "2016-02-01"
}