{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "For us, Rohith Vemula was a son of Mother India: BJP\n\nA day after External Affairs Minister Sushma Swaraj said that Rohith Vemula — the Hyderabad University student who allegedly committed suicide — was “not a Dalit,” BJP spokesperson Shahnawaz Hussain saw the political controversy around his death as a bid “to make a non-Dalit a Dalit.”\n\n“We are not doing any politics on it, but people are showing a non-Dalit as a Dalit. We are just responding to the political propaganda,” Mr. Hussain told The Hindu . “For us, as the Prime Minister said, Rohith Vemula was a son of Mother India.”\n\nPolitical parties are generally not keen to take a line contrary to the dominant public discourse on an issue seen as related to Dalit sensitivities, and the hardening of the BJP’s line is surprising observers. Some Dalit leaders within the BJP had also been uneasy with the party’s bid to brazen it out after Mr. Vemula’s death.\n\nThe party defended Labour Minister Bandaru Dattatreya’s letter to Human Resource Development Minister Smriti Irani and the HRD Ministry’s missives to the Hyderabad University as routine official letters on complaints.\n\nBJP insiders explain that the party sees the controversy as part of a sustained attempt to malign the government by painting it as either anti-minority or anti-Dalit. “There is a conspiracy to malign the government on issues that have nothing to do with the Centre,” BJP secretary Shrikant Sharma told The Hindu . “From the fake campaign around Church attacks, to the returning of awards, to the death of this student, there is a conspiracy to allege a BJP design in everything wrong. While we are saddened by the student’s death, we strongly disapprove of attempts to politicise it.”", 
    "section": "national", 
    "title": "‘Bid to make non-Dalit a Dalit’", 
    "subsection": "general", 
    "date": "2016-02-01"
}