{
    "author": [
        "Mithosh Joseph"
    ], 
    "text": "A study says 17 mangrove areas in five districts in the region are on the verge of extinction. —Photo: S. Ramesh Kurup\n\nIn spite of the frequent alerts by various environmental organisations and results of field studies conducted by approved government agencies on the threat being faced by the major wetlands in north Kerala, the situation remains the same with no concrete measures on the part of the local bodies or the government to address the concerns that mainly include the illegal land reclamation activities and dumping of solid and non-degradable waste in the wetland area.\n\nAs per a previous field study conducted by the scientists of the Centre for Water Resources Development and Management (CWRDM), the existence of over 100 small and big wetlands in the north Kerala region faced threat with rampant human encroachment and land conversion attempts.\n\nThe study report, which cited the impact of the trend on nature, still remains ignored by the government and local bodies with no specific measures for field-level interventions.\n\nOf the 100 wetlands, 17 important areas identified in Kozhikode, Kannur, Wayanad, Kasaragod and Malappuram districts are on the verge of extinction with unregulated spatial development and disposal of domestic sewage and industrial effluents. Unscientific channelising of water flow too has been found to be destroying the rich and luxuriant mangrove forests.\n\nThe report prepared by the CWRDM a few years ago had mentioned about all these 17 wetlands located in Kavvayi, Chempallikkundu, Pulathuruthpandy, Elathuruthpandy, Kottappally, Aavala, Cherandathur, Kandanchira, Agalappuzha, Govindhankettu, Erangikkal, Kottuli, Mavoor, Olavanna, Kadalundi, Thattanchuttythuruth and Purathur.\n\nIssues that were explained in detail in the report for conservation measures evoked no response from the authorities.\n\nEnvironmentalists point out that there are even attempts on the part of the government to set up sewerage treatment projects in wetland areas. According to them, the Kottuli wetland is one of such over-exploited areas in Kozhikode district, where conservation measures are a total failure. “We have serious concerns about the sewerage project as it will cause serious pollution in the area. All environmental forums are also in support of our views and fight against the project,” said N.V. Bhaskaran a resident of the area.", 
    "section": "national", 
    "title": "Conservation of Malabar wetlands remains a far cry", 
    "subsection": "general", 
    "date": "2016-02-01"
}