{
    "author": [
        "Gautam S Mengle"
    ], 
    "text": "Mehrunissa Sheikh (55) is surviving only on medicines for the past few days, her thoughts revolving around grandson Farhan, who she raised since he was a year-and-a-half old, and who is now a terror accused.\n\nFarhan Mohammed Rafiq Sheikh (21), a resident of Dost Apartment in Kausa, Mumbra, was arrested by the National Investigation Agency on Friday after being deported from the United Arab Emirates along with two other Indians. The trio are alleged to have been planning terrorist attacks for the Islamic State (IS) and their involvement was allegedly revealed in the interrogation of the other suspects picked up by the NIA last week. Farhan is the second Mumbra resident after Mudabbir Sheikh, who was said to be a top recruiter for the IS in India, to be arrested for links to Islamic State.\n\nFarhan lost his mother in an accident when he was one-and-a-half years old, and his father disappeared shortly thereafter. Mehrunissa, the sister of Farhan’s maternal grandmother, raised him like her own child, and he even refers to her as ammi . She strongly refuted allegations of terror links that have been levelled against him. “The boy grew up in front of my eyes. Are they now telling me that he is a terrorist?” she said.\n\nFarhan has been working in Dubai as a hardware engineer for three years.\n\n“He did a course in computers and went to Dubai, where my own sons stay, so that he could find a job. He found a job and was working well over there. Around three months ago, I had gone to stay with my sons in Dubai for a few days. When I returned one evening after a shopping trip, I saw several members of the house crying. When I asked them what was wrong, they told me that Farhan had been detained by the police in UAE a few days ago, and that they had refrained from telling me as I have several stress related health problems,” Mehrunissa said.\n\nShe returned to Mumbra a few days later, and Farhan would keep calling her every week. “He would say that he is fine and would come home soon. On Saturday, officials from the Mumbra police came to my house and informed me that he had been arrested by the NIA. They asked me a lot of questions about him. Next, I got a call from some officer from Delhi, who again told me that he is fine and that I should not worry. All I keep hearing is that he is fine. But will I ever see him again?” asked Mehrunissa.", 
    "section": "national", 
    "title": "Farhan not a terrorist: grandmother", 
    "subsection": "general", 
    "date": "2016-02-01"
}