{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Centre yet to respond to 15 queries posed by Madras High Court six months ago\n\nThe Centre is yet to respond to 15 queries on legitimising homosexuality posed by Justice Kirubakaran of the Madras High Court over six months ago. File photo of participants at Chennai Rainbow Parade.\n\nThe Tamil Nadu Rainbow Coalition, an informal network of groups and individuals working for the welfare of the alternate gender, is hoping that the Constitution Bench of the Supreme Court would reverse its verdict on the plea to decriminalise same sex liaisons in the country. The apex court is set to hear a curative petition on Tuesday. Meanwhile, the Central government is yet to respond to 15 queries on legitimising homosexuality posed by Justice Kirubakaran of the Madras High Court over six months ago.\n\nAt a press conference here, Vikram Sundarraman of ‘Nirangal’, a voluntary outfit, said that the 2013 Supreme Court order setting aside a Delhi High Court verdict of 2009 striking down Section 377 of the IPC (which criminalises homosexuality) had denied the third gender their right to liberty, dignity and equality. “The honourable Supreme Court has said that it is only a miniscule minority that will be affected by Section 377 of the IPC and that it was for Parliament to deal with it. No matter how miniscule we are, our fundamental rights are the same as for the others and we want them to be respected,” said Vikram.\n\nNamithaa, also of the Coalition, said the 2009 Delhi High Court judgment in Naz Foundation versus Union of India that read down Section 377 was appreciated for its clarity and depth of reasoning. “It said that the Section did not apply to consenting adults and had resulted in a change in the attitudes of society towards the third gender and sexuality people. We would like that order to be upheld,” she said. The press conference was followed by a candle light vigil. Meanwhile, activists recalled that as early as June last, the Madras High Court had raised a set of questions on the issue, which was yet to be answered.\n\nWhile dealing with two divorce cases, in which one of the spouses in both cases had different sexual orientation, Justice Kirubakaran said similar trends were observed in several family matters. “When a section of the society’s sexually or sexual orientation is different from normal human beings, is it not obligatory on the part of the Central Government to recognise their sex orientation as a separate group and safeguard their rights including right of privacy as guaranteed under Article 21 of the Constitution of India for a dignified life,” he had asked.\n\nImpleading authorities in Health and Family Welfare, Law and Law Commission, the judge asked why the Centre has not decriminalised homosexuality when 30 countries have legalised gay marriages.\n\n“When heterosexual sexual orientation exhibited by majority persons is accepted by all, why not the sexual orientation of a section of people, LGBT (Lesbians, Gays, Bisexuals, Transgenders), be recognised as they are born with different expression of human sexuality,” he asked.\n\nJustice Kirubakaran directed the authorities to produce if any survey of scientific study was carried out by the Centre to identify the men and women with same-sex orientation.", 
    "section": "national", 
    "title": "LGBT group hopes for Sec 377 abolition", 
    "subsection": "general", 
    "date": "2016-02-01"
}