{
    "author": [
        "Rahi Gaikwad"
    ], 
    "text": "The smoke from the Deonar dump has pushed Mumbai pollution levels closer to that of Delhi's.— Photo: Prashant Nakwe\n\nThe city has seen a steady worsening of its air quality over the last few days since the start of the fire at the Deonar dumping ground. Pollution levels remained at ‘very poor’ level with Friday being the worst. Moreover, against the expectations of experts of seeing an improvement, pollutions levels are likely to remain the same.\n\n“We were thinking the air quality will improve fast, and recover from the effect of the smog. On Saturday, it was slightly better, but still remained in the ‘very poor’ category. Winds have stopped since yesterday, so the dispersion of the particulate matter has not been as fast as what we expected,” Gufran Beig, scientist and project director at System of Air Quality and Weather Forecasting And Research (SAFAR), Pune, told The Hindu .\n\nAccording to SAFAR’s forecast for Monday and the next three days, the air quality index (AQI) for PM2.5 (fine particulate matter which is the lead pollutant) is likely to be in the ‘very poor’ category and for PM10 it is likely to be moderate.\n\nThe smog has specifically affected the air around Deonar, which is close to Chembur, where the pollution levels inched towards ‘severe’ on Friday.\n\n“This area, which has seen the effect of the dumping ground fire, almost reached ‘severe’ levels on Friday and it remained that high for about 24 hours,” Mr. Beig said.\n\nThe Deonar situation nearly pushed Mumbai to Delhi’s infamous pollution levels last week, making the two cities the pollution capitals of India of sorts.\n\nLocal hospitals in the Navi Mumbai area have also started seeing patients with aggravated respiratory problems.\n\nHealth complaints rise\n\nVashi-based pulmonologist Prashant Chhajed has seen an increase of about 25 per cent in the number of patients coming to OPD.\n\n“Patients who are suffering from bronchitis, asthma and allergic rhinitis have come back with aggravated symptoms such as increased cough, breathlessness, runny nose and burning of the eyes. This is because the particulate matter is not rising up. It is important for these patients to not skip their medicine and not delay seeing a doctor. They should also avoid morning walks as the temperature is cooler,” Dr Chhajed said.\n\nThe BMC-run Shatabdi Hospital in Govandi, near Chembur, has also been seeing patients with similar complaints for the past two days, said chief medical officer Rajashree Jadhav.", 
    "section": "national", 
    "title": "Mumbai gasps with no respite from dump fire smoke", 
    "subsection": "general", 
    "date": "2016-02-01"
}