{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "For the first time India is part of Spaceward Bound programme, which funds expeditions to places with extreme climate conditions\n\nEven as India prepares for a second mission to Mars, a team of scientists from the National Aeronautics and Space Administration (NASA), the Mars Society Australia and the Birbal Sahni Institute of Palaeobotany, Lucknow, will mount an expedition to Ladakh this August to study the similarities of certain parts of the region’s topography and microbial life to Martian surroundings.\n\nIndia’s second mission to Mars — scheduled to be in 2020 — will involve collaboration with France and may include a lander or rover — remote controlled vehicles — which can ostensibly better analyse a planet’s surface.\n\n“This is the first time that India is part of the Spaceward Bound programme,” said Siddharth Pandey, who is among the coordinators of the expedition “and we hope to have the Indian Space Research Organisation (ISRO) closely involved.” The Spaceward Bound is a NASA project that educates future space explorers and funds expeditions to places with extreme climate conditions.\n\nBefore Ladakh, there have been expeditions to the deserts such in Atacama, Chile; Mojave, California; Arkaroola, Australia as well as the Arctic and Antarctica, organised since 2006.\n\nLow-cost Mars mission\n\nThe success of India’s low-cost mission to Mars, in 2014, has led to heightened international interest in collaborating with India’s upcoming space missions. India now has an orbiter that's still circling Mars and taking pictures — with five instruments on board — in hopes of finding methane, carbon dioxide and the effect of solar winds on its surface. “Ladakh has been studied before but this time we’re going to be looking at some very specific experiments,” said Mr. Pandey — an engineer from India and who’s previously worked at the NASA. “We will be testing a rover that will collect samples and analyse some of the high altitude springs etc.”\n\nAccording to the programme’s website, Ladakh offers a “high UV (ultra-violet) exposed, dry ecosystem with Mars analogue topological features that tell us heaps about the origin and evolution of our planet’s topological features…”\n\nBefore its Mars Mission, the ISRO has Chandrayaan 2 planned to the moon, in 2017, that too hopes to set a lander on the surface of the moon.\n\nThe Birbal Sahni Institute of Palaeobotany, which has expertise in studying ancient climate and life, will be coordinating the travel of scientists and researchers from several countries who will be part of the 10-day expedition.\n\nAlong with research experiments, the group would also meet school students and organise sessions on how astrobiology missions work, the evolution of life on earth as well as on how space missions work, Mr. Pandey added.", 
    "section": "national", 
    "title": "NASA, India join hands for astrobiology mission", 
    "subsection": "general", 
    "date": "2016-02-01"
}