{
    "author": [
        "K A"
    ], 
    "text": "In a move that could usher in a new chapter in ensuring world class industrial infrastructure in the Palakkad region, the Union government’s Department of Industrial Policy and Promotion (DIPP) has approved the proposal of the Kerala Industrial Infrastructure Development Corporation (Kinfra) to set up India’s first Defence Industrial Park at Ottappalam near here.\n\nTalking to The Hindu here, Kinfra managing director G.C. Gopala Pillai said the park would be ready in one year with construction activities beginning in February.\n\nThe foundation stone laying ceremony would be held during the first week of February. Tenders would be invited in two weeks for choosing the construction agency. The Rs. 231-crore park will be established with the help of Central and State governments.\n\nThe Union government will invest Rs. 50 crore while the rest of the amount would be met by the State government.\n\nThe park to be established as part of ‘Make in India, Make in Kerala’ project will have modern common infrastructure facilities aimed at attracting component manufacturers in the defence industry.\n\nIn the initial phase, the park would focus on manufacturers of night vision equipment, parachute, flying suit, diving suit, tents, telecommunication devices and electronic appliances. The Union government has agreed to bring the park under the Modified Industrial Infrastructure Upgradation Scheme (MIIUS).\n\nIt will come up in 60 acres of land. It is estimated that the defence components manufacturing sector has demand estimated at $700 million a year from India and other countries having friendly relationship with it.\n\nIn India, there is a 15 per cent gap between demand and supply. The Defence park can bridge the gap apart from providing the country an opportunity in defence-related export of products from small- and medium-sized enterprises, said Mr. Pillai.\n\n“Defence-related production in the private sector still remains a novel idea in the country. We hope the park can attract a number of investors, being an early bird in the sector,” he said.\n\nHe said Ottappalam was selected for the Defence Park keeping in view its strategic location as far as connectivity was concerned. Apart from common facilities such as dedicated power and water supply, the park would have a research and development centre.", 
    "section": "national", 
    "title": "Nod for Defence Park at Ottappalam", 
    "subsection": "general", 
    "date": "2016-02-01"
}