{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "While the Peoples Democratic Party on Sunday once again made its issues with coalition partner BJP public, including “trust deficit” and “poor headway on the joint agenda”, the outcome of the PDP’s legislative party meet on Monday will be a make-or-break point for the 10-month-old coalition in Jammu & Kashmir. All eyes are on PDP’s legislative party meeting, scheduled for 2.p.m where a final call on the government formation is likely.\n\nIf there is a consensus on the coalition, the meet may see the nomination of PDP president Mehbooba Mufti, also an MP, as head of the legislative party, a prerequisite for taking over as Chief Minister of J&K, which has been under Governor’s rule since January 9 in the wake of the demise of the then sitting Chief Minister and PDP patron Mufti Muhammad Sayeed.\n\nThe PDP saw the first formal talk on government formation at Sunday’s meet of senior party leaders, including zonal and district-level leaders, where Ms. Mufti lamented the poor coordination from the BJP.\n\n“Mufti sahib took a courageous, although unpopular, decision of aligning with the BJP with the hope that the Central government headed by Narendra Modi will take decisive measures to address the core political and economic issues concerning J&K and its people,” Ms. Mufti told the meeting.\n\n“Unfortunately, instead of partnering with and implementing Sayeed’s vision of bringing peace, stability and prosperity to J&K, certain quarters, both within J&K and in New Delhi, started overtly and covertly triggering frequent controversies over avoidable contentious issues resulting in wastage of the State government’s energies in fire-fighting and propitiation,” she alleged.\n\nHardening her position, Ms. Mufti said in such “violative circumstances”, her party “has to reassess whether it can absorb the shocks that Mufti had to do frequently in his effort to forge reconciliation between the regions and the people of the State.”\n\nShe said the Government of India shall have to take substantive measures towards implementation of the PDP-BJP “Agenda of Alliance” in the interest of peace and stability in J&K and “for this the PDP needs a set timeframe to be worked out.” “The PDP will have to reassess whether the Centre is ready to trust the people of J&K and carry out the implementation with sincerity of purpose,” she said.", 
    "section": "national", 
    "title": "PDP, BJP alliance reaches make-or-break point", 
    "subsection": "general", 
    "date": "2016-02-01"
}