{
    "author": [
        "Nistula Hebbar", 
        "Yuthika Bhargava"
    ], 
    "text": "Congress vice-president Rahul Gandhi on Sunday alleged that the Modi-government was delaying framing of policy on the controversial issue of Net neutrality under the “pretext of repeated discussions,” while also slamming it for “looking the other way” when operators introduced price differential through zero-rating plans. Mr. Gandhi said in a statement that Prime Minister Narendra Modi’s ‘Digital India’ scheme could not become a “euphemism for an Internet controlled by large remote corporations.”\n\nAsserting that the Congress always stood for ‘Freedom of the Internet’ and ‘Net Neutrality’, he said the service providers and the government should treat all data equally. “Internet users should be free to connect to any website or service that they want, enabling a level playing field on the ‘world wide web.’ We recognise the danger of privileging a private platform over a public Internet introducing a new digital divide,” he added.\n\n“Telecom Regulatory Authority of India [TRAI] has issued consultation papers on the issue twice over, covering similar questions for consumers to answer on Net Neutrality, free basics and data price differentiation,” he said.\n\nMr. Gandhi said that despite industry body Nasscom, over 500 start-up entrepreneurs and the young in India demanding Net neutrality, the government had been delaying a clear-cut policy on this.\n\n“Digital India should mean Internet connectivity as a public utility, open-ended and generative. With Digital India, people would get more access to the Internet — the whole internet — and not primarily a filter on the web,” he said. Mr. Gandhi’s statement is an attempt to recast the Opposition vs. government face-off in terms of the multinational “haves” versus the Open Source “have-nots.”\n\nThe Congress\n\nvice-president says the party always stood for freedom of the Internet", 
    "section": "national", 
    "title": "Rahul bats for Net neutrality", 
    "subsection": "general", 
    "date": "2016-02-01"
}