{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "On Tuesday, the Supreme Court will take a final call on whether Section 377 of the Indian Penal Code (IPC), which criminalises consensual sexual acts of Lesbian, Gay, Bi-sexual and Transgender (LGBT) adults in private, amounts to denial of their rights to privacy and dignity and results in gross miscarriage of justice.\n\nA Bench of the three senior-most judges — Chief Justice of India T.S. Thakur and Justices Anil R. Dave and J.S. Khehar — will hear a batch of eight curative petitions filed by parents, civil society, scientific and LGBT rights organisations against a January 28, 2014 judgment by the Supreme Court dismissing their review petitions on the ground that Section 377 is constitutional and applies to sexual acts irrespective of age or consent of the parties.\n\nThe Review Bench in January 2014 had agreed with its original appeal judgment on December 11, 2013, setting aside the historic and globally accepted verdict of the Delhi High Court. The High Court had declared Section 377 unconstitutional, and said it was in violation of the fundamental rights enshrined in Articles 14, 15 and 21 of the Constitution.\n\nThe High Court, led by its then Chief Justice A.P. Shah, had read down Section 377 to apply only to non-consensual, penile, non-vaginal sex, and sexual acts by adults with minors.\n\nThe hearing on Tuesday is a rare remedy afforded to the petitioners, who have waged an almost two-year battle since the filing of their curative petitions in March 2014 for an open-court hearing. They have contended that the review judgment, if not corrected, may result in “immense public injury”.\n\nThe petitioners demand what was the “compelling State interest” to deny the LGBT community privacy and dignity by criminalising consensual sexual acts in private. One of the eight petitions now listed for Tuesday is by 13 senior psychiatrists, psychologists, counsellors and mental health professionals, including an editor of the influential Lancet Series on Global Health. They have argued that homosexuality was not a mental disorder, but a normal and natural variant of human sexuality. Even the International Classification of Diseases (ICD-10) of the World Health Organisation (WHO) and the Diagnostic and Statistical Manual (DSM IV) of the American Psychiatric Association (APA), the globally accepted standards for classification of mental health, no longer considered non-peno-vaginal sex between consenting adults as mental disorders or illness. Their expert opinion to the court included that “homosexuals had no choice in their attraction to persons of the same sex and criminalisation of LGBT persons adversely affected their mental health.”\n\nThe petitions argue that the Supreme Court, in the past two verdicts, had reached no clear consensus on the very purpose of continuing with the colonial-era Section 377. They argue that the court committed a “patent error of law” in concluding that there have been only 200 prosecutions in over 150 years under Section 377. “In so doing, the impugned judgement [January 2014] introduces a numerical requirement for the protections of Chapter III (Fundamental Rights) of the Constitution, whereas it is long settled that fundamental rights of miniscule minorities, even minorities of one, are entitled to full protection,” they contend.\n\nThey further contend that the Supreme Court went wrong in concluding that Section 377 only identifies certain acts as offences and does not criminalise LGBT people themselves.\n\n“By penalising the only form of sexual intercourse available to LGBT persons — that is, non-peno vaginal — Section 377 entirely denies sexual intercourse to the class of LGBT persons,” the petitioners contend.\n\nThey argue that the restrrain shown by Parliament in not discussing Section 377 during the debates on rape law in the Criminal Law (Amendment) Act, 2013, was misconstrued by the court as a legislative “endorsement of the unconstitutional provision.”", 
    "section": "national", 
    "title": "SC to take a call on LGBT rights tomorrow", 
    "subsection": "general", 
    "date": "2016-02-01"
}