{
    "author": [], 
    "text": "Movie bags grand jury prize and audience award; Weiner fetches documentary grand jury prize\n\nNate Parker, the star, director and producer of The Birth of a Nation , accepts the U.S. Dramatic Audience Award at the Sundance Film Festival in Utah on Saturday.— PHOTO: AP\n\nThe Birth of a Nation , a drama about a 19th century slave revolt in Virginia, swept top prizes at the Sundance Film Festival on Saturday.\n\nThe movie, acquired earlier this week by Fox Searchlight for a record-shattering $17.5 million, won the grand jury prize and the audience award at the prestigious festival held in Park City, Utah.\n\nThe dual awards mark a major victory for filmmaker Nate Parker, who wrote and directed the movie about Nat Turner, who led a slave rebellion in 1831.\n\nIt also comes at a time when Hollywood is under fire for its lack of diversity in the list of actors and filmmakers nominated for Oscars this year.\n\n“Thank you, Sundance, for creating a platform for us to grow, in spite of what the rest of Hollywood is doing,” Mr. Parker, who is black, said as he accepted the grand jury prize for his film already being touted for a 2017 Oscar.\n\nThe U.S. documentary grand jury prize was awarded to Weiner , a behind-the-scenes portrait of disgraced U.S. politician Anthony Weiner as he attempts a comeback by running for mayor of New York.\n\nThe audience award in that category went to Jim: The James Foley Story , a documentary about the US journalist slain by the Islamic State group in 2014.\n\nWorld cinema\n\nIn the world cinema category, the grand jury prize for a drama went to Sand Storm , an Israeli film that follows the struggle of women in a Bedouin village, while the audience award went to Between Sea and Land , a Colombian movie about a man afflicted with an illness that confines him to his bed, and his mother who cares for him. Both the audience and grand jury prizes for foreign documentary went to Sonita , about an 18-year-old Afghan refugee illegally living in Tehran and who dreams of becoming the next Rihanna.\n\n— AFP", 
    "section": "national", 
    "title": "Sundance celebrates Birth of a Nation", 
    "subsection": "general", 
    "date": "2016-02-01"
}