{
    "author": [
        "Dennis Barker"
    ], 
    "text": "Terry Wogan was a hugely popular radio and TV broadcaster loved for his wry sense of humour\n\nWith his ready self-deprecation and an ability to mock inoffensively, Terry Wogan, who has died aged 77 after suffering from cancer, was for several decades one of the most popular personalities on both radio and television in Britain — in his words, a jobbing broadcaster.\n\nWhen he was in charge of the television game show Blankety Blank for four years from 1973, audiences exceeded 20 million. His weekday breakfast programme on Radio 2 (1972-84 and 1993-2009) reached 8 million listeners. And quite certainly some of the many millions who watched the Eurovision Song Contest, which he covered on radio and then TV from the early 1970s to 2008, did so more for his facetious commentaries than for the music.\n\nWogan began his broadcasting career in his native Ireland, but secured his status as a British audience-magnet with his eponymous television chat show, which ran for up to three times a week for a decade from 1982. His many guests included Rock Hudson, Dolly Parton, Raquel Welch, Lee Marvin, Mel Brooks and Anne Bancroft appeared.\n\nAll his shows, from playing music to radio listeners at breakfast time to television in the evening, were exploitations of a personality that managed to be reassuring and yet also sharp—witted. With Wogan there was banter, but it was not always bland. And he was no pushover to those in power. When in 1975 BBC officials told him to tone down his quips at the expense of the director general, he immediately inflated them with even more surreal splendour: “I have the ultimate sanction. I can walk out.” Born in Limerick, Ireland, Terry was the son of Rose and Michael, who worked in a branch of the grocers Leverett and Frye. He grew up with the BBC radio Light Programme and its comedy programmes.\n\nAt five he went to Ferrybank prep school, which was run by nuns, but after about 10 minutes walked home, and soon decided he was an atheist. At nine he went to Crescent College, Limerick, which was “not really nightmarish but the end of innocence”, where he was taught by Jesuits. At 15, as a result of his father’s promotion, the family moved to Dublin, where Terry attended Belvedere College, alma mater of James Joyce.\n\nAs a child Terry tended to withdraw from any group after a certain time, and admitted to being rather the same as an adult. During the various runs of the Wogan television chat show he later declared that, for him, the high point of the evening was dinner at home with his wife, Helen (nee Joyce).\n\nHe was appointed OBE in 1997 and KBE in 2005. Dual citizenship made it possible for him to use the title Sir.\n\nHe is survived by Helen, whom he married in 1965, two sons and a daughter. Another daughter died in infancy. — © Guardian Newspapers Limited, 2016", 
    "section": "national", 
    "title": "U.K.’s most popular TV personality no more", 
    "subsection": "general", 
    "date": "2016-02-01"
}