{
    "author": [], 
    "text": "Shiv Shankar Menon says the re-hyphenation of the India-Pakistan equation is not in India's interest.\n\nSeven years after the State Department was restructured to ‘de-hyphenate’ U.S. relations with India and with Pakistan, it is considering a reversal of the move.\n\nDe-hyphenating refers to a policy started by the U.S. government under President Bush, but sealed by the Obama administration, of dealing with India and Pakistan in different silos, without referring to their bilateral relations. It enabled the U.S. to build closer military and strategic ties with India without factoring in the reaction from Pakistan, and to continue its own strategy in Afghanistan with the help of the Pakistan military without referring back to India.\n\n‘Active’ consideration\n\nA proposal to re-merge the office of the Special Representative for Afghanistan and Pakistan (SRAP) back with the Bureau of South and Central Asia (SCA) that handles India, the rest of the subcontinent and Central Asian republics is under “active” consideration, senior-level sources told The Hindu.\n\nThe re-merger proposal is ostensibly timed with the international troops pullout from Afghanistan.\n\nMinistry of External Affairs officials would not confirm whether they had been informed of the move they described as an “internal” matter of the U.S. government. However, asked about the possible impact of bringing India and Pakistan under one bureau again, the former National Security Adviser, Shiv Shankar Menon, said: “It looks like a re-hyphenation of the India-Pakistan equation that is not in our interest. Our relationship has grown because it stood on its own, as it is important that bilateral relations with India won’t be overshadowed by its relations with the region.”\n\nThe de-hyphenation policy of the U.S. was crystallised when the SRAP was set up in 2009 soon after President Barack Obama had taken over, with the appointment of Richard Holbrooke.\n\nAt the time, Mr. Holbrooke had hoped to include India in his mandate, and even to discuss the resolution of Kashmir as a means to extract greater cooperation from Pakistan. India had strongly opposed the move.\n\nAccording to a diplomatic cable published by the whistle-blower website WikiLeaks which was accessed by The Hindu, the then External Affairs Minister, Pranab Mukherjee, had objected to this when U.S. Ambassador David Mulford paid a farewell call on him.\n\n“He expressed his deep concern about a special envoy with a broad regional mandate that could be interpreted to include Kashmir, and shared his hope that the U.S.-India relationship not be viewed through the lens of regional crises,” Mr. Mulford recorded of Mr. Mukherjee’s message. (http://bit.ly/1QAu279).\n\nSubsequently, Mr. Holbrooke remained only engaged with NATO and Af-Pak affairs until his death some years later, and was followed by subsequent SRAPs. “Even when U.S. officials wanted to discuss the situation in Afghanistan or Pakistan with us, we would insist they didn’t travel to us via Islamabad,” a senior MEA official working on the Americas desk in those years told The Hindu.\n\nMr. Menon, who was Foreign Secretary at the time, had also repeated the message of de-hyphenating the ties in his talks with the then Secretary of State, Hillary Clinton, other cables from WikiLeaks record. “We didn’t want to be party to U.S. actions in Afghanistan at the time,” explained Mr. Menon.\n\n“We don’t believe in talking to the Taliban, for example, so how would we manage that conversation.”\n\nThird party\n\nOther officials objected to U.S. involvement as a “third party” in talks with Pakistan, which would become the case if special representatives would travel between Delhi and Islamabad regularly.\n\n“We also saw that many of the officials including Mr. Holbrooke saw regional solutions through the ‘Pakistan prism’, which is why our relations really improved only after the two desks were separated,” a former official said.\n\nThere are indications, however, that even as the U.S. is planning to bring the desks back together, India may not object as strenuously as it did in 2009.\n\nTo begin with, India has dropped its objections to talks with the Taliban in the past few months, instead asking to be “kept in the loop” on developments in the U.S. talks on Af-Pak.\n\nIn a major shift in December, India decided to supply 4 Mi35 attack helicopters to Afghan security forces, the first such transfer of lethal military hardware, and a move that would have required U.S. approval.\n\nIndian officials also point out that Prime Minister Narendra Modi and his government are being consulted more often by the U.S. government on matters relating to Afghanistan, and 2015 saw the first visits by two U.S. Generals in combat to India, as well as visits by SRAP Richard Olson (who was then US Ambassador to Pakistan) and Cameron Munter (former US Ambassador to Pakistan). In December 2015, the visit of the Deputy Assistant Secretary Blinken to Delhi, just before his visit to Islamabad was another key indicator of the shift in New Delhi’s position on the ‘re-hyphenation’ of US visits to India and Pakistan.\n\nAsked about the State Department’s possible move to bring together the officials and desks handling both, a senior official told The Hindu: “It would be good for us,” adding that the merger “would introduce a balance between the two” when it came to advocating India’s point of view.\n\nWhen contacted by The Hindu, the U.S. embassy in Delhi, and the State Department refused to comment on the possible move, calling the reports “rumours” at present.\n\nCorrections & Clarifications:\n\nThis article has been edited for a factual error.", 
    "section": "national", 
    "title": "U.S. considers re-merger of India, Pakistan desks", 
    "subsection": "general", 
    "date": "2016-02-01"
}