{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Two Delhi-based think tanks — Dr. Syama Prasad Mookerjee Research Foundation and Vivekananda International Foundation (VIF) — have been ranked among the “best think tanks with political party affiliation” globally. The “2015 Global Go To Think Tank Index” of the University of Pennsylvania ranked them in the category at 33 and 40 respectively.\n\nVIF has been ranked at 137 among the top think tanks worldwide (Non-U.S.) and finds a spot in the category “Think Tank to Watch” at number 20 among 100.\n\nVIF is considered closely associated with the BJP and has been on an upswing since the NDA government came to power in 2014. Many of its key members are holding important posts in the government, starting with National Security Adviser Ajit Doval.\n\nHowever, researchers at the institute denied any political affiliations. Commenting on the report a senior fellow at VIF said: “That is incorrect. VIF has no affiliation with any political party.”\n\nThe report released last week has ranked Brookings Institution of the U.S. as the top think tank worldwide for 2015. In the global list, the Centre for Civil Society at 79 is the only Indian institute in the top 100 think tanks.Concern over quality\n\nThere has been an explosion of think tanks in India in the recent past. Based on post-Kargil committee review recommendations, the three Services had set up service specific think tanks in addition to joint ones to develop original thought on strategic issues. However, experts have expressed concern over the lack of quality, with only a handful of institutions having adequate funds and maintaining quality. “There is hardly any original research. We mostly manage and coordinate seminars and other events,” a researcher with a Delhi-based think tank said.\n\nDr. Monika Chansoria, senior fellow at the Centre for Land Warfare Studies said the output of any think tank, be it Indian or global, is directly related to the aptitude of skilled and acclaimed academics and researchers on its in-house faculty page.\n\n“It’s time to realise that there are no ‘quick fix remedies’ to produce original and quality research work,” she added.\n\nEffective strategies\n\nThe Hindu Centre for Politics and Public Policy found mention in the report as a think tank innovation case study.\n\nThe report stated that a large amount of resources are required to start and sustain a successful think tank and an even a larger amount is needed in a country with underdeveloped infrastructure. “This dynamic makes The Hindu Centre for Politics and Public Policy all the more interesting,” the report said. Consequently, The Hindu Centre demonstrates effective strategies for circumventing obstacles for younger, under-funded think tanks, the report added.", 
    "section": "national", 
    "title": "VIF among top think tanks with political affiliation", 
    "subsection": "general", 
    "date": "2016-02-01"
}