{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "After Prime Minister Narendra Modi’s announcement in December that all Japanese citizens would get “visas on arrival”, the government has decided to extend it only to the business community for now.\n\nThe government is actively considering including South Korea in this category. Officials in the know say this was being done keeping in mind the “Make in India” policy of the government and to make India an attractive destination for investors from the two countries.\n\nJapan and South Korea are already on the list of 113 countries whose citizens can arrive in India through an electronic tourist visa on arrival (e-TV) platform. In December, during Japanese Prime Minister Shinzo Abe’s visit to India, Mr. Modi announced a liberalised visa regime for all Japanese citizens. Mr. Modi said that Japan had earmarked a $11-12-billion fund for “Make in India”. At least three Japanese firms were given the go-ahead in 2015 to set up shop in India.\n\nA senior official said the government was in the process of rolling out the facility that will be available at designated airports from March 1. “Not all categories of visa would be included in the scheme immediately. We have decided that to make the country investor-friendly, we will first extend the facility to business and conference visa seekers. Other categories like research and medical are not being included as of now,” a senior government official said.\n\nIntelligence nod\n\nAfter Mr. Modi made the announcement, the proposal was sent to intelligence agencies for their comments. The agencies are said to be on board for the proposal for Japanese citizens, though a screening would be done once they arrive here.\n\n“We are working on the modalities where a Japanese citizen could apply for a visa online and would be sent a travel authorisation document through e-mail. This document, on the lines of e-TV, would be enough for coming to India through 16 designated airports,” the official said.\n\nThough an official announcement had not been made, an official said the facility would be extended to South Korea in the next few days.\n\n“A visa on arrival facility means that an applicant would not have to wait for days to travel to India. It will cut red tape and an applicant would be informed within three days through e-mail whether he or she can travel to a destination in India. The Indian Embassy has its own data and it will scan for suspicious travellers,” the official said.", 
    "section": "national", 
    "title": "‘Visa on arrival’ to attract Japan, Korea investors", 
    "subsection": "general", 
    "date": "2016-02-01"
}