{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Show of solidarity:Bihar Chief Minister Nitish Kumar and RJD chief Lalu Prasad at a function at Mohanpur in Vaishali district on Sunday.— PHOTO: RANJEET KUMAR\n\nIn an attempt to halt the constant attacks by Opposition leaders against Rashtriya Janata Dal (RJD) chief Lalu Prasad Yadav’s “interventions” in the functioning of the government, Bihar Chief Minister Nitish Kumar on Sunday asked his detractors if there was anything wrong with Mr. Prasad’s actions.\n\nHe was speaking at a function to launch the work on a 10-km-long bridge from Kachchidargah to Bidupur across the Ganga, said to be India’s largest six-lane bridge, in the Raghopur Diyara (riverine) area in Vaishali district.\n\nThe Chief Minister said, “These days when Lalu ji goes somewhere or calls up government officials, they [Opposition leaders] raise a hue and cry over it. What’s wrong in it [Mr. Prasad’s action]? Lalu ji is the leader of our Mahagathbandhan [the Grand Alliance], which is in power, and why shouldn’t he call up officials if someone approaches him with their problem?”\n\n“Don’t your local representatives call up local officials when you go to them with your problems,” Mr. Kumar asked, in defence of Mr. Prasad, who was present on the dais. Mr. Yadav’s sons — Deputy Chief Minister Tejaswi Yadav and Health Minister Tej Pratap — were among those present.\n\nThe alliance partners slammed the Opposition BJP for “playing politics” over the construction of the river bridge, saying “they believe in publicity but we believe in work”.\n\n“This river bridge will be completed by 2020 and it will herald the development of the riverine area. Let the BJP thump their chest but we’ll do what we have promised you all,” Mr. Kumar said.\n\nEarlier, in connection with the appearance of the RJD chief’s name in a newspaper advertisement for the proposed mega bridge, State BJP leader Sushil Kumar Modi had asked the government, “In what capacity does Lalu Prasad’s name figure in government advertisements?”\n\n“He [Mr. Prasad] was convicted in a corruption case, and also he is neither an MP nor an MLA. He does not even hold a constitutional post,” Mr. Modi said.\n\nOf late, Opposition leaders in Bihar have been describing Mr. Prasad as the “super CM of Bihar who has actually been running the government from behind the curtain”.\n\nHowever, his sons as well as leaders of both the ruling parties — JD(U) and RJD — have been defending Mr. Prasad’s as “the leader of the coalition government”.\n\nSignificantly, Mr. Kumar laid the foundation stone for the proposed river bridge last year.\n\nThe estimated construction cost is Rs. 5,000 crore, out of which Rs. 3,000 crore will come from the Asian Development Bank and the remainder financed by the State government.", 
    "section": "national", 
    "title": "What’s wrong if Lalu calls up officials: Nitish", 
    "subsection": "general", 
    "date": "2016-02-01"
}