{
    "author": [
        "T V"
    ], 
    "text": "Asks Centre not to blame Congress for delay\n\nLeader of the Congress in the Lok Sabha M. Mallikarjun Kharge on Sunday said that the party was firm in its stand on three amendments to the Goods and Services Tax (GST) Bill and the Centre which had not agreed to bring these changes could not expect his party’s support for passing the Bill in the Rajya Sabha.\n\nTalking to presspersons here on Sunday, Mr. Kharge said that just because the GST Bill was introduced by the UPA government it did not mean that there should be no changes to it and moreover, the BJP had made many changes to the original Act.\n\n‘Stop blaming Congress’\n\nThe BJP should stop blaming the Congress for the delay in passing the Bill and must bring about the changes in the Bill to ensure its smooth passage.\n\n“The Congress was demanding the changes in the Bill in the interest of the consumers and in the national interest.”\n\n‘Mere rhetoric’\n\nReferring to the statement of Finance Minister Arun Jaitley on Saturday, Mr. Kharge said the claims of Mr. Jaitley and other Ministers that they were in touch with the Congress on the issue was just rhetoric and the government had not shown any interest in passing the Bill.\n\nThey were interested only in creating an impression among the people that the Congress was not cooperating with the government in passing the Bill, Mr. Kharge claimed.\n\nThe Congress wants the States to be allowed to charge 1 per cent tax over and above the GST for the goods originating from their State, a dispute settlement mechanism and 18 per cent cap on the GST.\n\nBudget session\n\nOn Parliamentary Affairs Minister Venkaiah Naidu’s remark that the Congress should not disrupt the Budget session on the Rohith Vemula suicide and Arunachal Pradesh issue and the government was ready for discussion on both issues, Mr. Kharge said the Congress only wanted the government to provide full opportunity to the Opposition to discuss and find a concrete solution to the issues.", 
    "section": "national", 
    "title": "Will back GST Bill only if demands are met: Kharge", 
    "subsection": "general", 
    "date": "2016-02-01"
}