{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "The fishermen who were released from Iran being received by family members at Indira Nagar Muthupettai in Ramanathapuram district on Thursday.— Photo: L. Balachandar\n\nEleven of the 49 Indian fishermen, who were arrested by Iran Coast Guard on a charge of poaching and released by the Iranian government on Wednesday, returned home to an emotional family reunion here on Thursday evening.\n\nThe 11 fishermen, hailing from different villages in Kilakarai taluk in the district, were brought in a van arranged by the State government after they landed at Anna International Airport in Chennai on Thursday morning. Emotional scenes were witnessed when the fishermen arrived at Muthupet Indira Nagar near here as their family members received them with tears of joybefore they were taken to their respective hamlets by the fisheries department.\n\nRamesh, Sub-Inspector from the office of Assistant Director of Fisheries, Ramanathapuram (South), who accompanied the fishermen from Chennai, dropped them at their villages.\n\nThe fishermen were among the 44 from the State who had gone to Dubai on contract fishing and were arrested by Iran Coast Guard along with five fishermen from Gujarat on a charge of poaching on December 1, 2015 when they were fishing on the high seas.\n\nThey were detained in the five trawlers confiscated by the navy and asked to take care of by themselves, V. Arumugam, a fisherman from Marivalasai in Kilakarai said. Their employer in Dubai sent them food items and they cooked food, thanks to the facilities available in the trawlers. They could, however, have only one meal a day. With police escort, they moved in the island and bought things. “We faced no harassment but there was a lot of anxiety about the release,” he told The Hindu . The fishermen appealed to the Central and State governments to get back their passports held by the Dubai employer.\n\n44 reach Kanyakumari\n\nThirty-one out of 44 fishermen from Tamil Nadu reached Kanyakumari on Thursday night. They were received by Minister for Information and Special Programme Implementation K.T. Rajenthra Bhalaji .The fishermen were given Rs. 5 lakh each as solatium by the Minister.The fishermen landed in Chennai at 4.40 a.m. on Thursday and were received by Commissioner of Fisheries Beela Rajesh at the airport. The State issued a set of clothes to the fishermen on arrival at Chennai airport and made transport arrangements for taking them to Nagercoil by road.\n\nThey were part of the 44 from the State who had gone to Dubai on contract fishing", 
    "section": "national", 
    "title": "11 fishermen return home", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}