{
    "author": [
        "Special Correspondent"
    ], 
    "text": "To campaign for the general election to Assembly\n\nCommissioner of Police Shailesh Kumar Yadav addressing an all-party meeting on conduct of public meetings for poll campaign in Madurai on Friday.— Photo: G. Moorthy\n\nThe city police have identified 67 locations for conduct of public meetings by political parties during the campaign for the general election to Tamil Nadu Assembly.\n\nDuring an all-party meeting organised by the city police, the Commissioner of Police, Shailesh Kumar Yadav, said that four places – Obulapadithurai, Palanganatham roundabout (near Jeyam Theatre), 50 Feet Road at Sellur and the road near Ambika Theatre – would be the meeting places for star campaigners.\n\nMr. Yadav said that election meetings should not be conducted on roads posing hindrance to traffic, near schools, colleges and places of worship. He said that no-objection certificates for all the venues for conducting public meetings would be given to the political parties according to the seniority of applications made to the police. The details of all the designated venues of political meetings would be hosted in the Madurai City police website, he said.\n\nHe also urged the political parties to give their suggestions to the city police.\n\nAll Deputy Commissioners of Police, Bandi Gangadhar (Law and Order), A.G. Babu (Traffic), R. Jeyanthi (Crime) and M. Rajarajan (Headquarters), Assistant Commissioners and Inspectors of Police were present in the meeting.\n\nAmong the representatives of political parties who took part in the meeting are advocates Ramesh and Sethuraman (AIADMK), G. Thalapathi and P. Kulandaivelu (DMK), M. Saravanan (CPI), Vijayarajan (CPI-M), M. Boominathan and Mehaboob John (MDMK), M. Mohammed Najimmudin (DMDK).", 
    "section": "national", 
    "title": "67 locations spotted for public meetings by political parties", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}