{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Inter-medical collegiate fest on at Mahatma Gandhi Medical College and Research Institute\n\nA volley-ball match in progress at SPECTRA 2K16, an inter-medical collegiate fest of Mahatma Gandhi Medical College and Research Institute in Puducherry on Friday.— Photo: Special Arrangement\n\nThe campus of the Mahatma Gandhi Medical College and Research Institute (MGMCRI) is abuzz with sporting and cultural events with SPECTRA 2K16, an inter-medical collegiate fest, getting underway here.\n\nThe event has attracted participants from medical colleges in and around Puducherry such as Jipmer, PIMS and IGMCRI.\n\nOn day one, medicos were out to prove they were no push-over when it came to sports and games.\n\nThe cricket teams from MGMCRI, Shri Sathya Sai Medical College, Sri Manakula Vinayagar Medical College were selected for the next round in the Super Six cricket match.\n\nIn the prelims of throw ball match, the teams from Mahatma Gandhi Medical College and Pondicherry Institute of Medical Sciences were judged winners. Vinayaka Missions Medical College, Karaikal, won the preliminary round of the football match.\n\nIf they missed out in sports, the PIMS contingent made a strong showing in the Fine Arts section, bagging the first two spots in sketching. The hosts went one better bagging all the three prizes in painting, nail art and wealth out of waste contests.\n\nIt is not all sports and cultural though with quiz contests to pick brains and an ex-tempore oratory contest where participants have to think on their feet.\n\nIn the Literature and Debate segment, the quizzers from PIMS trumped the competition in the medical quiz with MGMCRI settling for runners up and Jipmer finishing in third spot.\n\nA high point after the solo singing and solo dance in the evening was the live music show by the ‘Nenjukkulle’ sensation Shakthisree Gopalan and Sathya Prakash, play back singer.\n\nAccording to the organisers, the various events have attracted more than 3,500 footfalls.\n\nAn equally action-packed day awaits participants on the concluding day on Saturday with the final rounds of Futsal, Throw ball, Volley ball, Table tennis and Tattoo art, Eat – A – Thon, Fish out of water and Cine Quiz.", 
    "section": "national", 
    "title": "A spectrum of talents on display", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}