{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Scribes arranged for differently abled students\n\nwith utmost concentration:Students at an examination centre in Vellore on Friday.- Photo: C. Venkatachalapathy\n\nA total of 42,748 students (20,000 boys and 22,748 girls) are appearing for the class XII board examinations in Vellore district this year.\n\nOfficials of the Education Department said 290 students were absent for the first examination – Language Paper-I – on Friday. The exams, which will go on till April 1, are being held in 145 centres across the district.\n\nPrivate candidates\n\nApart from regular students, 702 private candidates will be appearing for the exam. On the first day 106 private candidates were absent. The department has arranged for scribes to enable 31 differently abled students (who are unable to write on their own) to take up the examination. “While scribes have been arranged for those who are unable to write on their own, additional one hour is given to those who want to write on their own,” R. Bhoopathy, Chief Educational Officer (CEO), Vellore said.\n\nAs many as 3,025 hall invigilators have been involved in the examinations, and security arrangements have been put in place at all centres.\n\nFlying squads\n\nFive flying squads will check on malpractices during the examinations. The squads are headed by the project director of Rashtriya Madhyamik Shiksha Abhiyan, CEO, Vellore, two district educational officers of Vellore and Tirupattur and district elementary educational officer.\n\n“In addition, we have standing squads in all exam centres. One person has been posted for 10 exam halls,” he added.\n\nCustodian centres\n\nTwelve custodian centres in Vellore educational district and 10 custodian centres in Tirupattur have been established for safe keeping of question papers. The question papers will be taken to all centres by 37 route officers. They will collect the answer scripts after the exam and take it to the collection centres in vehicles with armed police security.\n\nCollector R. Nanthagopal inspected the centres at E.V.R. Nagammai Government Girls Higher Secondary School and Voorhees Higher Secondary School.", 
    "section": "national", 
    "title": "Class XII board examinations begin", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}