{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Distinguished alumni awards and young alumni achiever awards distributed\n\nE.S.L.Narasimhan, Governor of Andhra Pradesh and Telangana, distributing Distinguished Alumni Awards and Young Alumni Achiever Awards at National Institute of Technology in Tiruchi on Friday, S.Sundarrajan, Director, NIT-T, (third from left), looks on.— Photo: B.Velankanni Raj\n\nStating that cyber terrorism is one of the major threats of the country, E.S.L. Narasimhan, Governor, Andhra Pradesh and Telangana, on Friday asked scientists, technologists and technocrats to come out with effective solutions to tackle the threat.\n\nSpeaking at a function held at National Institute of Technology-Tiruchi after distributing the distinguished alumni awards and young alumni achiever awards, he said that though information technology had benefited the humanity to a great extent, it had to be noted that it had a number of ill-effects, some of them were detrimental to the national security on various aspects. The question is whether the stakeholders were capable enough to counter the threats posed by cyber terrorists and criminals.\n\nMr. Narasimhan said social media had been carrying unlimited, uncontrolled and boundless information about various issues and day-to-day affairs. Many of them could be harmful. But, the absence of a real and effective mechanism to manage the information was a cause of concern. So, a comprehensive framework had to be found out on managing the flow of information through social media.\n\nOn energy security, he said it was important for the country to make full use of various avenues to tap the resources of attaining energy security. The country had abundant resources to tap solar energy. It had started tapping the resources to an extent.\n\nStressing the importance of producing cost effective solar panels, Mr. Narasimhan said that it could be achieved with dedicated research. The scientific community had a big role to play in finding the cost effective technologies to tap solar energy. If a solution was found on this, it would be one of the game changers in the development of the country. Similarly, the scientific community should work for achieving food, environment, power, health and energy securities of the country.\n\nRecollecting the institution of young alumni achiever award recently, Kumud N. Srinivasan, Chairperson, Board of Governors, NIT-T, said the awards would not only motivate the alumni to achieve more in their career but also cement their relationship with the institute.\n\nS. Sundarrajan, Director, said the NIT-T had more than 26,000 alumni holding important positions.\n\nRajan Narayanan, president, Alumni Association and Rajath, Students’ representative spoke.", 
    "section": "national", 
    "title": "Cyber terrorism a major threat, says AP Governor", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}