{
    "author": [], 
    "text": "TIRUNELVELI\n\nSadakkathullah Appa College: L.K.S. Mohamed Meeran Mohideen Trust lecture by Justice G.M. Akbar Ali, formerly Judge, Madras High Court, 11 a.m.\n\nTamil Nadu Progressive Writers’ Artists Association: ‘Koozhaankarkal’ book release function, Umakanthi Rathnavel releases book and writer Arshiya and Rabiya receive, Hotel Janagiram, Tirunelveli Junction, 5 p.m.\n\nEinstein College of Engineering: Department of Electronics and Communication Engineering, technical symposium, D. Rajakumar,\n\nVice-President (Operations), Tessolve Semiconductor, Bengaluru, chief guest, 10 a.m.\n\nAlcoholics Anonymous and Al-Anon: Meeting, St. Xavier’s Cathedral Silver Jubilee Library Hall, 7 p.m.\n\nAMBASAMUDRAM\n\nAmbai Thamizh Ilakkiya Peravai: Meet, Velsamy Marriage Hall, 5 p.m.\n\nTHOOTHUKUDI\n\nAll India Chamber of Commerce and Industries: Discussion on Union Budget, Gopal Krishna Raju, Member, Southern India Regional Council, The Institute of Chartered Accountants of India, speaks, Chamber Hall, 7.30 p.m.\n\nIndian Chamber of Commerce and Industry: Awareness programme on e-c Sales Tax –Total Solution Project, R. Thiagarajan, Advocate, Sales Tax Consultant, Madurai, speaks, Chamber Jubilee Hall, 6 p.m.\n\nTIRUCHENDUR\n\nDr. Sivanthi Aditanar College of Engineering: 16th national-level technical symposium, SACOESIUM’ 16, J. Selwin Rajadurai, Zonal Officer, Zone 16, Anna University, Chennai, delivers inaugural address, Auditorium, 9.45 a.m.\n\nSAWYERPURAM\n\nPope’s College: Graduation ceremony, James Pandian, Director-Medical, SRM University, Chennai, delivers graduation address and distributes diplomas, Rev. D. Jesu Sahayam, CSI- Moderator’s Commissary, Thoothukudi- Nazareth Diocese, participates, 10 a.m.\n\nKOVILPATTI\n\nNational Engineering College: Alumni induction programme, K.R. Arunachalam, managing committee member, presides, C.S. Balaji, president, R. Muthiah, secretary, participate, Auditorium, 10 a.m.\n\nKEEZHA ERAL\n\nDon Bosco College: Department of English, State-level seminar on ‘Emerging trends and methods in English language teaching,’ 9.30 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}