{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Each given Rs. 5 lakh as solatium\n\nThirty-one out of 44 fishermen from Tamil Nadu arrested by Iran Coast Guard reached Kanyakumari on Thursday night. They were received by Minister for Information and Special Programme Implementation K.T. Rajenthra Bhalaji .\n\nThe fishermen were given Rs. 5 lakh each as solatium by the Minister in the presence of Collector Sajjansingh R. Chavan and former Minister N. Thalavai Sundaram at the Collectorate.\n\nThe fishermen landed in Chennai at 4.40 a.m. on Thursday. The state government issued a set of clothes to the fishermen each on arrival at Chennai International Airport and made transport arrangements for taking them to Nagercoil by road. An official from the fisheries department was deputed to take care of the fishermen from Chennai to Nagercoil.\n\nFr. Churchil, general secretary, South Asian Fishermen Fraternity (SAFF), said that the Indian fishermen released by the Iran Coast Guard without any fine were received by officials from the Indian Embassy in Tehran. The Indian Embassy arranged their safe return to India by air. The fishermen reached Dubai on Wednesday evening and they were brought to Chennai by a regular Air India flight.\n\nDeputy Director of Fisheries S. Rubert Jothi and other officials were also present.\n\nMeanwhile, in a press release issued here on Thursday, Union Minister of State for Road Transport, Highways and Shipping Pon. Radhakrishnan said that the Union government took measures for the release of fishermen and met the entire expenses for their safe return to India.\n\nThoothukudi\n\nTourism Minister S.P. Shunmuganathan handed over a cheque for Rs. 5 lakh as solatium to each of the two fishermen – J. Xavier (29) and C. Mamallan (30) – from Periyathalai, who were arrested by Iran Coast Guard, in the presence of Collector M. Ravikumar at Thoothukudi Fishing Harbour on Friday.", 
    "section": "national", 
    "title": "Fishermen reach home", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}