{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Collector T.N. Hariharan inspecting an examination hall in Dindigul on Friday.— PHOTO: G. Karthikeyan\n\nA total of 23,193 students, including 22,159 regular students and 1,034 private students in Dindigul and 14,902 students including 604 private students in Theni district appeared for the Plus Two exams that commenced here on Friday.\n\nIn Dindigul, 66 centres for regular students and five centres for private students had been set up to conduct the exams.\n\nSecurity was tightened on 17 routes to bring back answer sheets to the strong room.\n\nA total of 166 flying squads, 66 principal invigilators, 66 department officials, 32 question paper controllers, eight supervisory officials and 1,250 room supervisors were deputed to conduct the examination.\n\nCollector T.N. Hariharan inspected an exam centre in Dindigul this morning.\n\nTheni\n\nForty three centres were set up in the district to enable students write the Plus Two exams.\n\nBesides, 43 supervisors, eight monitoring officers, 130 flying squads, 780 room supervisors were deputed for this purpose.\n\nAll arrangements had been made and basic amenities were provided in all examination centres, said Collector N. Venkatachalam, after inspecting an examination centre in Theni.\n\nVirudhunagar\n\nPlus Two examinations began at 75 centres in Virudhunagar district on Friday.\n\nA total of 24, 135 students, including 13, 261 girls, are appearing for this year’s examinations in the district, which is hoping to retain its top slot in overall performance in the State.\n\nThe Collector, V. Rajaraman, inspected the arrangements in two schools in Virudhunagar.\n\nAmong the candidates are 31 physically challenged students, of whom 15 appeared for Friday’s examination with scribes.\n\nTwenty four flying squads have been formed to prevent any malpractice in the examinations, according to an official press release.", 
    "section": "national", 
    "title": "Flying squads deputed to prevent malpractice in Plus Two exams", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}