{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In what could be construed as a sign of breaking the ice between the judiciary and over 43 lawyers suspended from practice last year for indulging in large-scale protests, the Madras High Court Bench here on Thursday directed the Bar Council of India (BCI) to revoke the suspension of M. Thirunavukkarasu, president of Madurai Bench High Court Advocates Association.\n\nRelief\n\nDisposing of a writ petition filed by him challenging the order of suspension passed by BCI on September 22, a Division Bench of Justices V. Ramasubramanian and N. Kirubakaran granted the relief after accepting a written assurance from the advocate that he “would not indulge in any act which the court may consider as inappropriate and improper…besides refraining from any Bar activity in future.”\n\nThe judges also recorded the submission of Senior Counsel M. Ajmal Khan, appearing for the petitioner, that his client did not do anything out of ill will or out of disrespect to the system of administration of justice.\n\nSince the petitioner had undertaken to cooperate with the disciplinary proceedings pending before the BCI, the judges made it clear that they were not interfering with the proceedings.\n\nClarifying that the direction given by them to the BCI would be applicable only to the writ petitioner and not to any of the other lawyers under suspension, the judges said they had considered the case of the petitioner too on the sole ground that his prolonged suspension due to the delay in concluding the disciplinary proceedings, for over five months, had offended his right to livelihood.\n\nProlonged suspension\n\nThough the petitioner had claimed that prolonged suspension of a lawyer was rigorous compared to suspension of a government employee, who is provided with subsistence allowance, the judges said: “We certainly realise that the suspension of a professional is much harsher than the suspension of a person in employment. But, unfortunately, the conduct that is expected of a professional is also of a higher order.\n\n“The worker of a factory or the last grade government servant guilty of a particular type of misconduct (other than corrupt practices) may receive a lesser penalty than a person holding a high office.\n\nTherefore, the comparison sought to be made cannot stop only with the suffering but has to extend to conduct also.”\n\nDirection does not apply to other lawyers under suspension", 
    "section": "national", 
    "title": "HC orders BCI to revoke suspension of Bar president", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}