{
    "author": [
        "K Raju"
    ], 
    "text": "Commissioned at a cost of Rs.3.78 lakh, the solar station has the capacity to supply power for the next five years\n\nSouth Zone IG S. Murugan (third from right) inaugurating the mini-grid solar power station at Moongilpallam on Kodaikanal hill in Dindigul district on Thursday.— Photo G. Karthikeyan\n\nWith the installation of micro-grid solar power station, first of its kind in the State, at Moongilpallam village, a remote village on the Tamil Nadu-Kerala border on Kodaikanal hill, decades-old dream of tribals have been fulfilled.\n\nCommissioned at a cost of Rs.3.78 lakh by Selco India with financial support from Canara Bank, the solar station has the capacity to supply power for the next five years. Two LED lamps and a mobile charger facility have been provided to each house.\n\nInitially, 23 houses have been provided the facilities and five more houses would get them in a few days. Even as the station has the capacity to provide power supply for eight hours, interrupted supply was restricted to four hours.\n\nOnly individual solar lights were offered to every household in other parts of villages in the State so far, said technical team head S. Nambirajan.\n\nThe technical team completed the entire process in two months, but commissioning became a daunting task owing to lack of road connectivity.\n\nBig solar panels, interconnectors, four batteries each weighing 70 kg, controllers, poles and cables reached Mannavanur from Bangalore in truck. Materials had to be transported throw a hilly terrain.\n\nCooperation of tribal people helped in completion of the project. A 10-member team carried materials on head load and covered the six-km long terrain in 48 hours. Officials showered the tribals with government schemes to keep them away from anti-social elements as the area was close to Kerala.\n\nMoongilpallam and other villages have been under surveillance after the encounter death of Maoist Naveen Prasad in 2008. With Naxal attack in Kerala last year, importance is being given to all remote tribal villages in Theni and Dindigul districts.", 
    "section": "national", 
    "title": "In a first, tribal village taps solar power", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}