{
    "author": [
        "Special Correspondent", 
        "V S"
    ], 
    "text": "CULTURE\n\nIsha Yoga Centre: Yaksha – A celestial event of music, dance and spirit, Malladi Brothers – Carnatic – Vocal Duo, Vellingiri Foot Hills, 6.45 p.m.\n\nGENERAL\n\nKarpagam University: 8{+t}{+h}Annual Day, Sekkizhar Auditorium, 10.30 a.m.\n\nLadies Wing of Malayalee Suhruthi Sangham : International Women’s Day, ND Hall, COINDIA, 2{+n}{+d}Floor, SIEMA Building, Race Course – Opp to Thomas Park, 4.30 p.m.\n\nAvinashilingam University: National Science Day, Thiruchitrambalam Auditorium, 10.30 a.m.\n\nSree Sakthi Engineering College: Scientia 16, SSEC Seminar Hall, 9.30 a.m.\n\nPSG STEP: Headstart Startup Saturday, PSG Tech, 3 p.m.\n\nNehru Arts and Science College: Annual Day and Adieu, PK Das Auditorium, Nehru Gardens, TM Palayam, 10 a.m.\n\nDr.SNS Rajalakshmi College of Arts and Science: Zenith 16 – HR Conclave, 10 a.m.\n\nSNS Academy – CBSE School: Hilarity 16, Thudiyalur – Saravanampatti Road, 4 p.m.\n\nCMS College of Science and Commerce: 28{+t}{+h}Annual Sports Day, Arjuna Awardee and four time Olympian Shiny Wilson takes part, 9.30 a.m.\n\nKumaraguru College of Technology: KCT Mini DIRT Bike 2016 race, near West Gate, Saravanampatty, 9.30 a.m.\n\nDhanalakshmi Srinivasan College of Engineering: Technical Seminar, 9.30 a.m.\n\nKPR Institute of Engineering and Technology: International Conference, Tanam Hall, 9 a.m.\n\nInstitute of Cost Accountants of India: International Women’s Day, SFI Apartment – 3{+r}{+d}Floor, Sathyamoorthy Road, Ram Nagar, 6 p.m.\n\nInfo Institute of Engineering: Workshop, Sathy Road, Kovilpalayam, 9 a.m.\n\nHindusthan Institute of Technology: Inauguration of Students Forum, Seminar Hall, 11 a.m.\n\nPOLLACHI\n\nMahatma Gandhi Ashram and Inner Wheel Club – Coimbatore West: Dedication of houses constructed for tribal people, Sethumadai, 11 a.m.\n\nSATHYAMANGALAM\n\nBannari Amman Institute of Technology: Inauguration of Salzer – BIT Innovation Centre, Inauguration of Aquasub – BIT Research Centre, BIT Achiever Award Function and Farewell to Final year students, Institute premises, 10.30 a.m.", 
    "section": "national", 
    "title": "In Coimbatore Today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}