{
    "author": [
        "T K Rohit R Krishnamoorthy"
    ], 
    "text": "The Madras High Court has taken cognisance of the allegations against a Sub-Judge in Sathyamangalam who had issued a memo to an office assistant for refusing to wash his clothes, the Chief Justice of the Madras High Court said.\n\nWith the issue snowballing into a controversy and copies of the memo and the reply by the assistant going viral on social media, the High Court has asked for a report on the matter.\n\n“We have taken cognisance of the matter and we will look into all the issues. A report on this will be ready in about two to three days after which we will see what needs to be done,” Justice Sanjay Kishan Kaul, Chief Justice of the Madras High Court, told The Hindu .\n\nA highly placed source at the High Court also said there were manuals that provided for employing assistants for certain types of work. “There are some manuals. But sometimes, some judges seem to get carried away. There are so many people in the system that it is difficult to monitor everyone,” the person, who declined to be named, said.\n\nA circular issued in 1990 permits judicial officers to utilise the service of office assistants for domestic work. Meanwhile, the Sub-Judge D. Selvam declined to comment on the issue. When contacted, he said he was not supposed to talk to the media.\n\nEarlier in the day, the Tamil Nadu Judicial Employees’ Association sought a departmental enquiry against the Sub-Judge over his issuing the memo. Members of the Association held a demonstration at Sathyamangalam criticising the judge. The association’s State president, T. Senthil Kumar expressed hope that the Madras High Court will ensure that employees are not compelled to do domestic work in future.\n\nSathyamangalam Bar Association president Ajithkumar said the issue that had been settled a month ago has been blown out of proportion.", 
    "section": "national", 
    "title": "Judge’s memo to office assistant: court to look into the case", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}