{
    "author": [
        "S Poorvaja"
    ], 
    "text": "They feature Rajnikanth in his titular avatar, along with Radhika Apte, Attakathi Dinesh and Kalaiarasan\n\nEven as anticipation mounts for Superstar Rajnikanth’s next venture, Kabali , a few stills of the movie that were released on Thursday have gone viral, sending fans into frenzy.\n\nThe stills feature Rajnikanth in his titular avatar, actress Radhika Apte who plays his wife in the movie as well as actors Attakathi Dinesh and Kalaiarasan.\n\nAnother still, which features actress Dhansika, who is rumoured to be playing the role of Kabali’s daughter, has generated interest as she is seen pointing a gun at Kabali’s head.\n\nActor Dinesh too has been keeping the interest alive in the movie by posting two stills from the sets of the film — one of him and Rajnikanth and another with him and actors Kalaiarasan and John Vijay who play supporting roles in the film.\n\nThe crime-drama directed by Pa. Ranjith, has music scored by Santhosh Narayanan.\n\nA tweet from the film’s editor a few days ago about the movie has also led to speculation among fans that with the editing work on, they can expect a trailer release before the end of March as the movie is expected to release only after the elections are over.\n\nA tale of friendship\n\nAs its name suggests, ‘Natpadigaram 79’ will be a tale about friendship.\n\nThe film, which is director Ravichandran’s next, is expected to depict contemporary friendship. It is treatment of the subject of friendship will be different from the director’s previous film, ‘Kannethirey Thondrinal’.\n\nThe movie will feature Raj Bharath, Reshmi Menon, Amzath and Tejasvi in the lead roles.\n\n“It is more of a feel good family drama and the audience will have an instant connect with the movie. This is my third movie after ‘555’ and ‘Onaiyum Aatukuttiyum’ where I played villain,” said Raj Bharath, son of veteran director Malliyam Rajagopal who made movies like ‘Savaale Samali’.\n\n“I want to prove my mettle as a performer and am open to any role that comes my way,” said Raj Bharath who also assisted director Ravichandran in the movie. After many years, fans of choreographer Raju Sundaram can see him on screen performing for a song sung by music director Deva.\n\nWhen asked about the quirky title, he said that as the plot revolved around friendship, the title was chosen from Thirukkural’s chapter 79 which dwells on friendship. The film is expected to hit the screens on March 11.\n\n(Reporting by S. Poorvaja and K. Lakshmi)", 
    "section": "national", 
    "title": "Kabali stills go viral, send fans into a frenzy", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}