{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Dasavatara Tattuvam’ by M. Vijayaraman, Railway Colony, 7.30 p.m.\n\nPanniru Tirumurai Mandram: Tiruppugazh Study Circle meeting; discourse by N. S. Sundararaman, Dhandayuthapaniswamy Temple, Iravathanallur, 5 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Kanchipuranam’ by A. Arumugam, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Sundarar Tiruppattu’ by R. Umarani, Sakthi Velammal Nagar, S, S, Colony, 5 p.m.\n\nRamakrishna Mutt: Discourse on ‘Mahabharatham’ by A. Ganesan, 5.45 p.m.; aarathi, New Natham Road, 6.30 p.m.\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Amarnath Lingam darshan, Victoria Edward Hall, West Veli Street, 7 a.m.; Kedarnath Lingam darshan, 408 North Masi Street, 7 a.m. and 4 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Fre rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nThiagarajar College: NSS camp, P. Silaiman, 9 a.m.\n\nFatima College: Legal and medical camp, Thanichiyam, 10 a.m.\n\nSourashtra College: Faculty development programme on ‘Redefined role of teachers,’ MBA Smart Room, 9.30 a.m.\n\nCSI College of Arts and Science for Women: NSS camp, M. Joseph, CSI Bishop, delivers valedictory address, Chettikulam, 10 a.m.\n\nVickram College of Engineering: National seminar on ‘Recent trends in wireless and mobile technologies,’ Enathi, 10 a.m.\n\nDirectorate of Industrial Safety and Health: P. Bose, Director, Industrial Safety and Health, inaugurates Safety Week celebration; S. Rajamuthu, Joint Director, addresses, Madura Coats, 2.45 p.m.\n\nTamil Nadu Progressive Writers and Artists’ Association: Seminar on ‘Right to expression;’ S. Venkatesan, State secretary, and Madukkoor Ramalingam, vice-president, address; K. Ilangovan presides, Jaihindpuram, 5.30 p.m.\n\nMadurai Roman Catholic Archdiocese: Homage to George Joseph, freedom fighter, on his death anniversary; J. Jeyaraj, Vicar General, and M. Joseph, CSI Bishop, address, St. Mary’s Cathedral, East Veli Street, 9.15 a.m.\n\nTamil Nadu Chamber of Commerce and Industry: Meeting on Union Budget 2016; G. Ramasamy, V. Alagappan and S. Jaikumar, chartered accountants, address, Kamarajar Salai, 5.30 p.m.\n\nYadava College: S. Dhanasekaran, Principal (in charge), inaugurates blood screening camp, Nagendran Auditorium, 10 a.m.\n\nFatima Michael College of Engineering and Technology: N. Kulasekharan of Fiat Chrysler Automobiles inaugurates ‘Impulse ’16,’ national-level technical symposium; M. Stalin Arockiaraj, chairman, St. Michael Group of Institutions, presides, Sivaganga Road, 10 a.m.\n\nFEDCROT: M. Subburam flags off voter awareness rally, Kalavasal, 9 a.m.; Women’s Day celebration, Jayasakthi Mahal, Bypass Road, 10 a.m.\n\nLions Club of Madurai City: M. Nagarajan and P. Raghuvaran address, Hotel Poppy’s, Ring Road, 7 p.m.\n\nAlcoholics Anonymous: Meeting; Quality Care Hospital, Ellis Nagar; 14 Vaidyanatha Iyer Street, Shenoy Nagar, and RC School, Palanganatham, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}