{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "India’s most-celebrated tennis star made her second visit to this part of the region on Thursday evening. But this time around she did not carry the tennis baggage with her as she was out as a special guest for the second edition of the My India Marathon 2016 held at the Codissia grounds here on Friday.\n\nThe marathon run, organised by Varnam Foundation and Miracle Media, was held for men, women, schoolboys and girls and covered a distance ranging between 4.1km to 12.1km. One expected the ‘Mirza magic’ to work on the 500-odd participants who had lined up early in the day but they were in for some disappointment as they were told that Sania would be present only for the prize distribution function.\n\nFor some, it did not matter. They had come with the aim of winning. A few others ran for awareness sake and the rest of the bunch had fun all the way.\n\nThe athletes began their run from the Codissia grounds and went through Thaneer Pandhal, Cheran Ma Nagar and Saravanampatti before culminating at the starting point.\n\nLater, Sania spoke on the importance of running a marathon and about fitness too. “Health is important. One should not do a marathon once a year but regularly.”\n\nShe also told the women to believe in themselves. “You are as good as anybody. I will be very happy if you do well or for that matter even better the men.”\n\n“Sports can be tough but it helps you to succeed. Winning or losing does not matter. Even if you lose, think there is always a next time,” she said.\n\nSania was happy that she was in the best phase of her career. “If I am winning it is because I keep myself fit and, running a marathon is very important for one.”\n\nAfter a brief talk, she gave away the prizes to the marathon winners and went ahead fulfilling her commitments at various colleges scheduled for the rest of the day.\n\nThe schedule was quite heavy with a media briefing at the Naturals Sports Spa on Lakshmi Mills Colony followed by an acrylic synthetic tennis court inauguration at the Sri Shakthi Institute of Engineering and Technology and opening of a free tennis coaching Academy at the Park Institutions.\n\nChaos\n\nChaos and confusion prevailed from the start to the finish of the My India marathon 2016 at the Codissia grounds here on Friday.\n\nSania Mirza was roped in as the special guest for the event, which was aimed at creating awareness for 100 per cent vote polling. But it turned out to be the other way round with the celebrity star speaking nothing about it.\n\nAt the Sri Shakthi Institute of Engineering and Technology, the management, staff and students waited eagerly for over two hours under the scorching sun only to find Sania spending just a few minutes.", 
    "section": "national", 
    "title": "Marathons are important: Sania", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}