{
    "author": [
        "P V Srividya"
    ], 
    "text": "The conservancy workers, who clean up our streets, remain invisible heroes, silently labouring their way through the garbage. So, it was a gesture of humanity and gratitude, when the People’ Society of Hosur (PSH), a civil society group, came together to applaud each of the unknown conservancy worker for their back-wrenching labour for the clean-up of Chennai devastated by floods.\n\nFor the 140 conservancy workers, who took part in the sanitation drive, the People’s Society of Hosur- organised event to honour them, with a delicious meal, gift kits and a forum to voice their needs and aspirations, was an expression of gratitude from society they serve.\n\nM. Prasad, president of The People’s Society of Hosur, called it a socially relevant initiative to honour the “warriors of Hosur”. The event was marked by a grand lunch for 500 persons, that included conservancy workers and their families; and gift kits with casseroles, mats, LED lights, travel bags, soaps, towels, plates and many more goodies as a token of gratitude.\n\nAnd yes, beyond the felicitation and gratitude, the occasion lent a platform to raise pertinent questions to ponder and act upon. The common thread was the treatment of the workers as second class citizens, and their rising workload without any addition to workforce.\n\nThe ratio is one conservancy worker to clean up the garbage left by 1,465 persons. There has been an exponential growth in population and township expansion. But the workforce has remained the same.\n\n“The workers have a dream that their wards do not have to take up the same occupation as them, and there should be soon a time, when we do not need another human to pick up our garbage,” says Mr.Prasad.\n\nThe event was made possible through the collective contribution of the People’s Society of Hosur and philanthropists, who lent their support for the gift kits and food.", 
    "section": "national", 
    "title": "Noble gesture to honour conservancy workers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}