{
    "author": [
        "Sruthisagar Yamunan", 
        "B Kolappan"
    ], 
    "text": "The over two-month gap between the announcement of Assembly polls and the actual date of polling in Tamil Nadu has provided a breather to many political parties that are struggling to forge electoral alliances.\n\nPolitical leaders feel the gap would provide them time to cover more areas and facilitate intensive campaigning. However, a section of leaders said this would increase electioneering cost.\n\nPeter Alphonse, senior vice-president of the TMC, felt the lengthy schedule provided a level-playing field and prevented the ruling AIADMK from going on a spree announcing new schemes with an eye on the polls.\n\n“No one is going to have an undue advantage over the other. In fact, party leaderships will have ample time to settle any bickering that could arise out of allocation of seats and ensure unity in their camp,” Mr. Alphonse argued.\n\nThe long gap has another advantage. As the elections will be held at the peak of summer, leaders and candidates who would otherwise find it tedious to tour constituencies could split their campaigns. VCK general secretary D. Ravikumar said parties that financially stronger would gain in a stretched out campaign.\n\n“Electioneering these days is not just about going door-to-door. Rallies are becoming more technology-driven and massive and you also have elements like the social media. For smaller parties, this would be very difficult to sustain,” he said.\n\nMr. Ravikumar felt by providing such a timeframe, the Election Commission was negating the limits it had set on candidate expenditure.\n\nDMK spokesperson T.K.S. Elangovan, however, points out that political parties need not worry so long as the gap between the day of polling and counting is kept at minimum.\n\n“The possibility of meddling with EVMs is high if the gap between the polling and counting of votes is long. But, the long duration between the date of announcement and the day of election will help political parties penetrate their campaign into every constituency,” he said.\n\nPMK leader Anbumani Ramadoss said, “Physically, it may be exhausting. But I can make use of the period and travel across the State.”\n\nCPI (M) State secretary G. Ramakrishnan was of the view that conducting free and fair election was vital. “In Tamil Nadu, booth capturing does not take place as it happens elsewhere. But distribution of money to voters is a major concern. The Election Commission should prevent the practice,” he said.\n\nA DMDK MLA apprehended the long duration would provide space for wider distribution of cash and gifts to the voters. “Now that they have announced such a schedule, the Election Commission should increase the monitoring mechanism manifold,” the leader said, admitting that the crucial time provided would help them to meet with voters twice and convince them.\n\nBJP Tamil Nadu vice president S.R. Sekar said apart from the aspect of funding, such a long time gap would take a toll on health of candidates and leaders.\n\n“This period will coincide with peak summer. As things stand today, we may be campaigning a full extra month,” he said.\n\nBigger parties welcome it, smaller ones say electioneering would be tedious and costly", 
    "section": "national", 
    "title": "Opinion divided on gap between announcement and poll date", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}