{
    "author": [
        "S Prasad"
    ], 
    "text": "(Left) Chief Electoral Officer V. Candavelou, addresses the media. Chief Minister N. Rangasamy, comes out from the Puducherry Legislative Assembly after announcing of the election dates on Friday. — Photos: S.S. Kumar\n\n(Left) Chief Electoral Officer V. Candavelou, addresses the media. Chief Minister N. Rangasamy, comes out from the Puducherry Legislative Assembly after announcing of the election dates on Friday.— Photo: S.S. Kumar\n\nThis includes deaths, multiple entries, double entries, says CEO V. Candavelou\n\nThe Election Commission of India (ECI) has deleted the names of around 9,291 voters in the Union Territory during the recent purification of electoral rolls, said Chief Electoral Officer V. Candavelou.\n\nThe deleted names include those who have died and the ones having double entries.\n\nTalking to reporters here on Friday, he said that with the announcement of elections in Puducherry on May 16, the Model Code of Conduct has come into force. The elections department has initiated the process of removal of hoardings and banners displaying political advertisements in public places.\n\nGraffiti not permissible\n\nAccording to Section 4 of the Puducherry Open Places (Prevention of disfigurement) Act, 2000, graffiti on places open to public view with ink, chalk, paint or any other material is not permissible.\n\nAction will be initiated against violators on the basis of complaint from owners.\n\nThe Union Territory has a total of 9,27,128 voters in the list as per final electoral rolls including 4,41,531 male and 4,86,060 female voters. Applications for inclusion that are received 10 days before the last date for nomination of candidates will be included in the second supplement containing new inclusion.\n\nHowever, applications will continue to be accepted till last date of nominations, which will be taken up for process after completion of the election process.\n\nA search facility has also been provided in the websitehttp://ceopuducherry.py.\n\ngov.into facilitate the electors to verify whether their names in included in the electoral rolls.\n\nMr. Candavelou said that a total of 930 polling stations including 17 auxiliary polling stations have been notified after rationalisation with the approval of the ECI. For the first time, disabled friendly polling stations will be established by mapping the differently abled to their respective polling stations.\n\nServices such as wheel chairs and adjustable tables will be provided for the physically challenged voters while trained volunteers will be stationed for visual and hearing impaired voters at select booths. The administration has identified about 144 areas as “sensitive”. This would be constantly monitored by periodically reviewing the ground level situation, he said.\n\nFor complaints\n\nPeople can dial 1950 for election related complaints. District level control rooms will be established by the respective District Election Officers while web based online complaints can be registered onhttp://ceopuducherry.py.\n\ngov.in\n\nA separate dedicated Whatsapp number 8903331950 has been assigned to enable public to lodge complaints. The details of complainants would be kept confidential. A solar powered polling station on wheels will tour around the UT for creating awareness among the voters.\n\nMr. Candavelou said that heads of departments had been sensitised on MCC and warned against participating in any political activity. He said that disciplinary action would be initiated against erring officials under Service Rules. Criminal action would also be initiated under Section 188 of IPC.", 
    "section": "national", 
    "title": "Over 9,000 names deleted during roll purification", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}