{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Students writing Plus Two examination in Tirunelveli and Thoothukudi (right) on Friday.— Photos: A. Shaikmohideen and N. Rajesh\n\nStudents writing Plus Two examination in Tirunelveli and Thoothukudi (right) on Friday.— Photos: A. Shaikmohideen and N. Rajesh\n\nA total of 35,896 students — 15,481 boys and 20,415 girls — took the Plus Two examinations that commenced here on Friday in 107 centres, including a centre for private candidates.\n\nCollector M. Karunakaran visited the centre at St. John’s Higher Secondary School, Palayamkottai. Apart from 1,059 private candidates, 38 physically challenged students also appeared for the exam with the assistance of scribes. A total of 107 chief superintendents, 93 additional chief superintendents, 107 officers and four additional officers from the Department of Education, 1,996 invigilators, 217 static force personnel, 24 flying squads are involved in the exercise to ensure smooth conduct of the examination and prevent malpractices. Police protection has been given to all examination centres.\n\nThe number of students who appeared for the examination on the first day are as follows:\n\nCheranmahadevi Educational District: boys - 4,582; girls - 6,289; total -10,871; examination centres - 39.\n\nTenkasi Educational District: boys - 4,988; girls - 6,646; total – 11,634; examination centres - 33.\n\nTirunelveli Educational District: boys - 5,911; girls - 7,480; total - 13,391; examination centres - 35.\n\nThoothukudi\n\nAs many as 20,105 students - 8,961 boys and 11,144 girls - from 177 schools in Thoothukudi district sat for the examination in 65 centres on the first day.\n\nAs many as 13,332 boys and girls took the exam in Thoothukudi educational district and 6,773 candidates wrote the exam in Kovilpatti educational district.\n\nAs many as 554 private candidates also took the exam. Fourteen differently abled students wrote the exam in 10 centres. Collector M. Ravikumar inspected Subbiah Vidyalayam Girls Higher Secondary School in Thoothukudi, one of the centres.\n\nA total of 1,096 invigilators and flying squads of 135 teachers are on the job to prevent malpractices inside exam halls. Seventeen route officers have been deployed to transport answer scripts to 10 custodian points in the district.\n\nNagercoil\n\nAs many as 24,606 students – 11, 288 boys and 13,318 girls – from 221 schools appeared for the examination in 83 centres in Kanyakumari district.\n\nTwenty visually challenged students(two in Nagercoil educational district, 10 in Kuzhithurai educational district and 10 in Thuckalay educational district), with the help of scribes, wrote the examination.\n\nCollector Sajjansingh R. Chavan inspected S.L.B. Government Higher Secondary School, one of the examination centres, in Nagercoil. Chief Education Officer V. Jayakumar and other officials accompanied the Collector.", 
    "section": "national", 
    "title": "Plus Two examinations begin", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}