{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "With the announcement of Assembly election, the District Election Office has kick-started the election work immediately. A control room has been set up and Returning Officers for all the seven Assembly constituencies have been appointed.\n\nTalking to press persons here on Friday evening, Collector T.N. Hariharan said that model conduct of conduct has come into force with immediate effect.\n\nA total of 2,039 polling stations were kept ready in 1,150 places in the district. Security would be beefed up in sensitive polling stations. Special transport facility would be arranged to carry poll materials to remote polling stations in Vellakavi, Manjampatti, Chinnur and Periyur on Kodaikanal hill.\n\nAs per direction of EC, wheel chairs would be provided at polling stations to enable differently-abled persons to cast their votes. About 375 wheel chairs would be purchased, besides using existing wheel chairs with the District Rehabilitation Welfare Office. All woman polling stations would also be set in all the seven constituencies, he added. Inclusion of names in the voter list would continue. Corrections could also be made. Sub-Collector Vinith is appointed the Returning Officer for Palani Assembly constituency, Assistant Commissioner for Central Excise V.S. Kumar RO for Oddanchatram, Special Deputy Collector S. Geetha, RO for Athoor, Backward Class Welfare Officer Senthil Kumar for Nialkottai, Adidravida Welfare Officer Santha Devi for Natham, Revenue Divisional Officer Mohan for Dindigul and District Supply Officer N. Johnson for Vedasandur Assembly constituency. Tahsildars of respective taluks would act as Assistant Returning Officers. A control room would function at the Collectorate to pass information or complaints if any. Public may contact through telephone number: 0451-2461930.\n\nTheni\n\nNo public grievance day, mass contact programme and agriculture grievances day would be held, said Collector N. Venkatachalam. Defacing the walls of government buildings and complexes was an offence. People representatives should hand over the government vehicles to the Collectorate immediately. Control room would function round-the-clock at the Collectorate. Flying squad for expenditure and standing committee had been set up to monitor the election, he added.\n\nVirudhunagar\n\nThe Collector, V. Rajaraman, on Friday asked the election officials to ensure that public walls, places of worship and public transport vehicles were not used for election graffiti.\n\nAddressing a meeting of officials here on the implementation of the model code of conduct that came into force following the announcement of schedule for the Assembly election, Mr. Rajaraman said no election hoarding should be allowed to hinder flow of traffic. According to an official press release, he asked the officials to take appropriate action against those who violated the model code of conduct. Those who attended the meeting included Aravindan, Superintendent of Police, and C. Muthukumaran, District Revenue Officer.", 
    "section": "national", 
    "title": "Poll work begins: control room set up, ROs appointed", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}