{
    "author": [
        "K Raju"
    ], 
    "text": "Mini-grid solar power station was commissioned at Moongilpallam\n\nLIGHT IN THE HORIZON:South Zone IG S. Murugan (third from right) inaugurating mini-grid solar power station at Moongilpallam on Kodaikanal hill in Dindigul district on Thursday. Superintendent of Police A. Saravanan (second from right) looks on.— PHOTO: G. Karthikeyan\n\nFor the first time in the State, a mini-grid solar power station was commissioned at Moongilpallam, one of most remote villages in Dindigul district, to provide lighting facility to all houses, fulfilling their decades-old-dream.\n\nCommissioned at a cost of Rs. 3.78 lakh by Selco India, the solar station has sufficient capacity to ensure supply to them for the next five years. Two LED lamps – one inside and another outside the house – and a mobile charger facility have been fitted to each house. Initially, 23 houses have been provided lighting and remaining five houses will be hooked to the solar station in a few days.\n\nAll houses had been connected by power cables to the station in order to ensure uninterrupted power supply for four hours a day. Even though the system had the capacity to provide supply for eight hours, the officials restricted it to four hours to ensure uninterrupted power supply, said technical team head S. Nambirajan.\n\nInaugurating the station at the village, South Zone IG S. Murugan said that the facility would throw new light in the lives of tribal people. They should educate their wards for economic development.\n\nKodaikanal Revenue Divisional Officer N. Suresh said that a radio set had been given to all households, as a first step to connect them with the outer world. He distributed ration cards and old age pension to them at the function.\n\nLead Bank Manager N. John Nelson said that funds were granted for installation of solar lighting in 28 houses. Divisional Manager G. Murugesan said that the Canara Bank had contributed Rs. 2.11 lakh under its corporate social responsibility initiative for the project.\n\nPeople of Moongilpallam have to walk at least eight kilometres on hilly terrain to reach the nearest school and 35 km to reach a hospital in Udumalpet or climb nine kilometres using two bamboo ladders to cross a steep rocky terrain to reach a private hospital at Mannavanur. With no roads, a small walking path in dense reserve forests is their only way to reach Maraiyur for work.\n\nSpecial Anti-Naxal Squad identified this most backward village to offer basic facilities to tribals.\n\nLater, SP A. Saravanan interacted with bank and revenue officials to make the project a reality.", 
    "section": "national", 
    "title": "Remote Kodaikanal village gets solar lighting facility", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}