{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Works on the construction of flyover at Five Roads Junction in Salem city commencedrecently.— Photo: E. Lakshmi Narayanan\n\nThe Salem city will get three new flyovers at an outlay of Rs. 137.81 crore.\n\nThe flyovers will come up at Tiruvakavundanur roundabout, AVR roundabout – Koranguchavadi junction, and at the Salem Steel Plant Junction, all on the Karur – Salem – Bengaluru national highway.\n\nThe bhoomi pooja for the new flyovers was held in the presence of S. Soundappan, Mayor, and G. Venkatachalam, MLA.\n\nTraffic congestion\n\nTraffic bottlenecks are a perennial menace on all the main thoroughfares in Salem city. In particular, the stretch of the Salem – Bengaluru national highways from Tiruvakavundanur roundabout to Koranguchavadi witnesses severe traffic congestion round the clock.\n\nThe traffic congestion becomes severe during the peak hours every day and also during the weekends, when a large of number of tourists from the neighbouring Karnataka, Kerala and Andhra Pradesh visit the hill stations of Yercaud and Kolli hills.\n\nFund\n\nPeople have been demanding the construction of flyovers at all the three points to ensure the free flow of traffic. The government sanctioned three flyovers and earmarked a sum of Rs. 26.77 crore for the construction of flyover at Tiruvakavundanur roundabout, and another Rs. 111.04 crore for the two flyovers at AVR roundabout up to Koranguchavadi and at the Salem Steel Plant road junction.\n\nChief Minister Jayalalithaa laid the foundation stone for the three flyover projects through video conferencing.\n\nFollowing the laying of foundation stone, the State Highways Department conducted the boomi pooja at two spots - AVR roundabout and Tiruvavakavundanur roundabout - for launching the construction works instantly.\n\nDivisional Engineers of the State Highways Department Ashok Kumar (Edapadi), Arunmozhi (quality control, Salem), Selvaraj, Assistant Divisional Engineer, and other officials were present on the occasion.\n\nIt may be mentioned here that the boomi pooja for the construction of a two-tier flyover at an outlay of Rs. 320 crore at the Five Roads Junction in the heart of the city was held on February 28.", 
    "section": "national", 
    "title": "Salem city to get three new flyovers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}