{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Adani Green Energy (Tamil Nadu) Limited, which is setting up a 648 MW solar power plant on an outlay of Rs. 4,536 crore at Sengapadai in Kamudhi taluck in this district, has begun generating power in one of the three 72 MW units and commenced power transmission to the grid.\n\nThe company, after signing an agreement with Tamil Nadu government for setting up the mega solar power park in June 2015, started purchasing lands in July and began establishing three units of 72 MW capacity each and two units of 216 MW capacity each.\n\nAfter completing purchase of more than 2,500 acres of land, the company, launched the preliminary works in August last year. After erecting the solar panels, it started generating power in the first 72 MW unit early in February this year.\n\nThe company transmitted 44 MW of power to the grid on February 8 through the existing 110 Kv transmission line to Kavanur substation, sources in Tamil Nadu Generation and Distribution Corporation (Tangedco) told The Hindu .\n\nThough the company generated power in the first unit to its full capacity in the beginning, the generation fell short because of dust formation on the solar panels due to continued work at the site.\n\nThe company was expected to generate power in the 216 MW unit in the next couple of weeks, the sources said, adding a 230 Kv transmission line was being erected to transmit power from the Solar Park to Kavanur substation.\n\nBesides, Tangedco was establishing an exclusive 400/230/110 kv substation on the Park premises, the sources said.\n\nThe company had given about 60 acres of land free of cost for establishing the substation and Tangedco had engaged Mumbai- based Shreem Electric Limited to set up the facility. About 40 per cent of the works had so far been completed, sources added.", 
    "section": "national", 
    "title": "Solar power: Adani group starts transmitting to grid", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}