{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Brick manufacturers do not receive notable orders from engineers and house builders\n\nThough the construction activities are set to pick up momentum in the weeks to come, there has been a steep fall in demand for bricks in the market causing concern among country brick manufacturers in Tiruchi and its adjoining areas.\n\nOut of 12 months in a year, construction activities would become peak for three months from March as summer season is considered conducive for building works. Engineers, flat promoters and individual house owners would source materials such as sand and bricks in the second or third week of February so as to start building work in March.\n\nKondayampettai, Ponnurangapuram, Thiruvalarcholai, Panayapuram, Melur and Lalgudi in Tiruchi district, where a large number of country made brick kiln are functioning, would become active in the summer period with the arrival of brick kiln workers from other parts of the State.\n\nHowever, industry sources said that the brick manufacturers had not received notable orders from the engineers and individual house builders for the last few weeks. There was no sign of rejuvenation in the near future too.\n\n“This is a busy period for us for manufacturing bricks. But, there are hardly any orders,” says K. Kanniah, who owns a brick kiln at Ayyampalayam near Musiri.\n\nHe said that he had produced about 30,000 bricks in the second week of January. They should have been sold within one or two weeks from manufacturing.\n\nHowever, nearly one third of the bricks were yet to be sold till now. Hence, he had decided to wait for the market to produce more bricks.\n\nIt is said that the current market price for brick kiln had not enthused the manufacturers.\n\nThe rate of brick is hovering around Rs.3.5 per piece at the manufacturing point, which is said to be low price for the manufacturers.\n\nThe buyers will have to bear the transportation cost. “We spend Rs.3.50 per brick for production. It will be meaningful if we sell it for Rs.4. If there is a demand, the price will go up. But, there is no demand for bricks as of now,” Mr. Kannaiah said.", 
    "section": "national", 
    "title": "Steep fall in demand for bricks", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}