{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Kamalavalli Nachiyar Temple, Woraiyur : Theppam festival, Thayar purappadu from sanctum sanctorum, 5.30 p.m.; theerthavari, 6 p.m.; thirumanjanam, 6.30 p.m.; purappadu from the theppam mandapam in pallakku, 8.45 p.m.; reaching sanctum sanctorum, 10.15 p.m.\n\nSri Srinivasa Perumal Temple, BHEL Township : Brahmotsavam, pallakku, Sri Krishnar thirukolam, 6 a.m.; Sesha vaganam, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Parayana goshti procession, South Gate, Srirangam, 5.30 a.m.; Sahasranama parayanam, Sri Sudarsan Garden, Melur Road, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, Sri Perumal Temple, Indira Nagar, 6 p.m.\n\nCULTURE\n\nShenbaga Tamil Arangu : International Women’s Day celebration, V.Pazhanya speaks, R.Poonguzhali, secretary, Annai Ashram, presides, 102, Gandhi Salai, Srirangam, 6 p.m.\n\nGENERAL\n\nNational Institute of Technology Department of Civil Engineering : Moments – symposium, 9 a.m.\n\nBharathidasan University School of Computer Science Engineering and Applications : Kshaktriya – technical symposium, Khajamalai campus, 10 a.m.\n\nThe Booksellers and Publishers Association of South India : Book fair, Corporation grounds, Anna Nagar, Thennur, 11 am. To 9 p.m.\n\nSeethalakshmi Ramaswami College Department of Chemistry: Lecture workshop on recent trends in chemistry, 9.45 a.m.\n\nShrimathi Indira Gandhi College, Department of Fashion Technology and Costume Designing : Fireless cooking competition, 10.30 a.m.; CSI Women Students Branch and Departments of Computer Science, MCA and IT Applications: Lecture on Opinion Mining by A.Nisha Jebaseeli, Head, Department of Computer Science, Bharathidasan University College, Lalgudi, 2 p.m.\n\nSri Sivananda Balalaya: Bala Vigyan Utsav, students presentation on ‘Various fields of science in the development of nation,’ D.Gopalakrishnan, assistant professor, Bishop Heber College, speaks on Special theory of relativity, Adavathur campus, 10.30 a.m.\n\nNehru Memorial College, Puthanampatti : Science Academies lecture workshop on New frontiers in plant sciences and bio technology, 10 a.m.\n\nEntrepreneurship Development Institute of India, Periyar E.V.R.College and Tiruchi District Tiny and Small Scale Industries Association : Entrepreneurship awareness camp, 9.30 a.m.\n\nCARE School of Business Management : ‘Shameless networking start up Trichy,’ Pravin Shekar, speaks, 5 p.m.\n\nJamal Mohamed College, Department of Tamil: M.Samsudeen endowment lecture by P.Venkatesan, associate professor, Periyar E.V.R.College, 9.30 a.m.; Anti Dowry Association (Women): Release of magazine, ‘Ethiroli,’ S.Sumayaa, principal, Thassim Beevi Abdul Kader College for Women, chief guest, 3 p.m.\n\nM.A.M. College of Engineering and Technology Department of Electrical and Electronics Engineering: Workshop on Industrial automation, M.Akshou, technical coordinator, Zenith Industrial Automation Training Centre, resource person, 9.30 a.m.; Department of Computer Science and Engineering: Inter department symposium, 10 a.m.\n\nShri Angalamman College of Engineering and Technology National Service Scheme: Blood donation camp, 9.30 a.m.\n\nM.A.M.B. School : Lecture on Logistics Management by Mercy Jenita Vincent, assistant professor, 2 p.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti : National level conference on Electrical power and energy systems, 10 a.m.\n\nLakshmi Nursery and Primary School : Annual day, R.Jayalakshmi, Assistant Elementary Education Officer, chief guest, Ariyamangalam, 2 p.m.\n\nJamal Mohamed College : National seminar on Frontiers in bio sciences, M.Loganathan, Director (incharge), Indian Institute of Crop Processing Technology, inaugurates, 9.30 a.m.\n\nHallmark Business School: Analysis of Union Budget, 11.30 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}