{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Residents, members pool in funds to celebrate the event\n\nall set for celebrations:Established in 1966, the Sathuvachari Branch Library has been enjoying steady patronage. -Photo: C. Venkatachalapathy\n\nThe Branch Library at Sathuvachari is all set to celebrate its 50 years of existence this Sunday. Members of the library and residents of Sathuvachari had pooled in funds to give a facelift for the library. The library, which is located off RTO Road in Sathuvachari, has a total of 4,167 members, mostly students and women.\n\n“The library began with just 500 books on March 6, 1966, on a rented building in Palla Street, Sathuvachari. It was later shifted to another rented place close by. It moved to the current location 17 years ago. Presently, it has 40,000 books across a wide range of disciplines,” said C. Ramesh, the librarian.\n\nEnglish and Tamil books on various subjects adorn the racks of the library. Novels in both the languages are a key attraction. The subjects covered include history, politics, law, economics, philosophy, agriculture, computer and mathematics. Reference books, especially for examinations conducted by the Tamil Nadu Public Service Commission, and other competitive exams are available here.\n\n“In fact, we have old editions of historical novels that many people like to read here,” Mr. Ramesh said.\n\nThe first floor of the library building comprises the newspaper and magazines sections. This section has good patronage especially among retired persons .\n\nIn 2012, the branch library got an additional building with funds from the Member of Legislative Assembly Constituency Development Scheme. This building, with an area of 500 square feet, currently houses reference books, such as for competitive examinations, he said.\n\n“A steady flow of visitors is a speciality of the place —nearly 200 - 250 persons visit it everyday. It is frequented by students after 5 p.m..,” Mr. Ramesh said.\n\nTo become a member of the library, one has to pay Rs. 20 as deposit fee and Rs. 10 as annual fee. This allows them to borrow just one book. For three books the deposit fee is Rs. 50 in addition to the annual fee of Rs. 10, he added.\n\nThe place is gearing up for the golden jubilee celebrations. It has been spruced up with a dab of fresh paint in bright colours. There is a new cement flooring at the entrance. Display boards have been put up at vantage points and the highlight is a Golden Jubilee arch.\n\n“Members of the library, retired persons and residents of Sathuvachari have contributed funds for the sprucing up and other celebrations,” he added.\n\nThe Readers’ Circle of the library along with public contribution has provided new furniture – 45 chairs, six racks and one table.\n\nAs part of the celebrations, the library has organised essay writing and poetry competitions for students. On Saturday, it is conducting a drawing competition for students.\n\nA five-day book exhibition-cum-sale has also been opened on RTO road. At least 15 stalls have been set up here, he said.", 
    "section": "national", 
    "title": "Vellore library turns 50", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}