{
    "author": [], 
    "text": "Police have two reasons to believe this theory, writes S. Sundar\n\nWith the city police having launched a manhunt for two robbers who were involved in a daylight robbery at Balarengapuram on Wednesday, the police suspect that someone familiar to the family members could have indulged in or master-minded the crime.\n\nThe police have two reasons to believe this theory. For, the two robbers had masked themselves after having entered the house. “They should have deliberately done it to hide their identity from the elderly victim,” a police source said.\n\nBesides, they had spoken to the woman R. Vasantha (67) in Hindi while threatening her at knifepoint to part with her jewellery. However, later they had conversed between themselves in Tamil. “Why should the robbers speak in Hindi when they were fluent in Tamil? We suspect that they knew that the woman based in Madurai had good knowledge in Hindi. If this is true, how come they knew this fact on the woman’s knowledge in Hindi,” a police officer asked.\n\nHer husband K.K. Rama Brahmma said that the woman learnt Hindi as they lived in Mumbai for sometime in the past when they were running textile business in the metropolis.\n\nThe Teppakulam police have been enquiring some of the local people who can speak Hindi and some of the employees of the textile shop the family runs.\n\nThe police suspect that the robbers had clear idea about the movements of the family members and had struck the house when Vasantha’s husband had gone out.\n\nThey barged into the house on A.A. Road easily, as the doors were kept open ajar. After entering the house and masking their faces, they locked the door from inside.\n\nThe robbers had not harmed the woman when she bit the hand of one of them who tried to gag her mouth. The accused had broken open the almirah to lay their hands on the valuables.\n\nWhen her sister Rathinam came to her house she had violently shaken the doors after her repeated knocks did not get any response.\n\nThe robbers pulled her inside the house and managed to walk away casually even as a few weavers were involved in drying of yarn on the road. Had the women raised an alarm, it would have been difficult for the robbers to have escaped from the scene, said the police officer.", 
    "section": "national", 
    "title": "Were robbers familiar to elderly couple?", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}