{
    "author": [
        "T Madhavan"
    ], 
    "text": "While the first day was reserved for the grand inauguration of a mega annual event ‘Milan’16’ at SRM University, Kattankulathur, the second day's programmes kept students a little more busy. The campus was abuzz with activity on day 2 of ‘Milan’ with every inch and corner teeming with people. Students charged with competitive fervour tried to participate in as many events as possible.\n\nThe morning started on a musical note with professional level event, Battle of Bands, not much different from the professional concerts. Where the Eastern bands captivated the audience with their rich musical flair, the Western bands gave the spectators an astounding time. The Eastern band winner was Athwa , while Vertigo bagged the championship among Western bands.\n\nIt was a grand evening for ‘Madarassi Lassi’ and ‘Pyros’ teams, who enthralled the audience with their rollicking performance on stage. Vertigo from Chennai, an Indian rock band, upped the audience's excitement levels and the crowd burst into a loud cheer when the rock band took stage.\n\nAero-space engineering students relived their childhood dreams along with Michael, an experienced operator of toy helicopter and airplanes in Austria. A DJ Night, starring Ireland’s top female DJ Kaila Troy was another landmark event for the day.\n\nNarrating the tale of events that were part of the Milan’16, the media convenor, Upasana Patnaik, says the Battle of Bands for college bands was well received by student-admirers. Environment awareness programmes such as Green Avengers gave the students an opportunity to present their thoughts in bringing a change in global environment. In the evening slot, Evam's Stand up Tamasha ensured laugh riots on campus.\n\n“Presidential campaign by students, street play on themes of universal importance, fashion show, Aero Modelling Championship, QR Hunt, were the other events, that shook the auditorium,” says Anindya Ojha, media convenor of the events.\n\nStudents' British Parliament saw a strong but worthy debate on the rocking issue of ‘Refugee issues in Europe’, where students imitated some of the world leaders presenting their views.\n\nIntroducing his movie ‘Aagam’, a movie based on job scam market, director Vijay Anand Sriram said this was the result of an 8-year long research in the field of human resource development. With Irfan, Deekshita, Jayaprakash and Riyaz Khan in the lead roles, the film will hit the screens on March 18.\n\nFrom rock music to eco awareness programmes, the campus was abuzz with activity", 
    "section": "national", 
    "title": "Youngsters exhibit their talent at Milan ‘16", 
    "subsection": "tamilnadu", 
    "date": "2016-03-05"
}