{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The High Court suggested to the Railways to form a separate team to look into accidents and provide first aid at the earliest.\n\nThe Railways on Monday told the Bombay High Court that 3,304 people died and 3,349 suffered accident injuries in 2015 while commuting in local trains. Advocate Suresh Kumar, appearing for the railways, submitted a copy of steps taken to reduce the number of deaths and accidents due to overcrowding.\n\nThe court was hearing a public interest litigation filed by Samir Zaveri, who lost his legs in a railway accident, to seek medical facilities for accident victims. The Railways report highlighted that the major reason for suburban railway deaths and accidents was overcrowding, and that the Government Railway Police is taking all steps to check accidents. A division bench of Justices VM Kanade Revati Mohite-Dere was informed that recently a young girl was rushed from one hospital to another after she fell off the train and eventually died.\n\nThe court asked why even simple painkillers are not provided to victims. Mr Kumar said that each Central Railway station has one first aid box with around 10 essential items and a bigger medicine box with 60 items. He also said that ambulances are parked outside railway stations to immediately rush the victim to a hospital and give them treatment.\n\nHowever, the advocate appearing for the petitioner said these ambulances are given on rent, and that an RTI query had revealed they had made a profit of Rs 1,500 crore in the Mumbai region. Reading out from the report, Mr Kumar said several steps were afoot to manage crowds better such as metro train-like coaches, restricted number of tickets for each train among others. Mr Kumar said it won’t be possible to try this experiment on Western Railways, but on Central Railway, there is a suggestion to issue 100 coupons to the first 100 travellers to prevent more people from entering.\n\nThe court suggested forming a separate team to look into accidents and provide first aid at the earliest.", 
    "section": "national", 
    "title": "3,304 deaths on Mumbai locals in 2015", 
    "subsection": "general", 
    "date": "2016-01-27"
}