{
    "author": [
        "Vikas Dhoot"
    ], 
    "text": "The government could soon launch a first of its kind annual employment survey, with the ability to generate quarterly reports on job market trends in certain segments like urban India.\n\nThe plan is to release such employment data soon after the surveys, unlike other official data, by using modern technology so as to enable policy makers to react faster to labour market movements and track job creation goals. An estimated million people are joining India’s workforce every month thanks to its demographic dividend of a high number of youth in the population.\n\nAs of now, the only employment data in India is available through quinquennial (once every five years) surveys by the National Sample Survey Organisation (NSSO), a limited ad-hoc survey of employment in a few sectors that was initiated by the Labour Bureau after the global financial crisis in 2008 and the Annual Survey of Industries (which only captures the employees of the registered factories).\n\nBy contrast, developed markets have quarterly official data on employment, if not monthly reports, that help them assess the state of the economy better.\n\nThe NSSO has readied the design, modalities and mechanisms for conducting the survey and could start as soon as the nod comes for the formal proposal of the Statistics Ministry. “We are planning to move to a more regular survey – conducted annually, with some reports coming out on a quarterly basis,” said TCA Anant, Secretary, Ministry of Statistics.\n\n“A survey requires resources – both finance and people. We have worked out many things… there are procedures to be followed before we can commit when we can start and in what form, as they interact with each other. A proposal has been finalised for competent approval,” Mr Anant told The Hindu, stressing that though the ministry is hopeful of starting the survey, it is still under ‘administrative examination.’\n\nWhile NSS surveys are usually spread over a whole financial year, the design plan for the employment survey includes a regular annual survey with certain systems for urban areas that will enable generation of quarterly estimates, he explained.\n\n“The Annual Survey of Industries (ASI) work is now done through a web portal. Our consumer price index (CPI) collection is much more robust as all the data is gathered through an IT network developed by the Department of Posts, which we are piggybacking on to get data transmitted,” Mr Anant said, adding a similar approach will be used for capturing employment numbers.\n\nNational Statistics Commission had first called for a periodic labour force survey in 2009 and a pilot survey was undertaken in 2012-13.", 
    "section": "national", 
    "title": "Annual, quarterly job reports to replace once-in-5-year surveys", 
    "subsection": "general", 
    "date": "2016-01-27"
}