{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Wakf Tribunal here has directed the counsels for the Aga Khan Trust for Culture (AKTC) and Mohammed Jaferuddin to discuss and form a proposal to find suitable persons for the High Powered Supervisory Committee to oversee the ongoing works at the Qutub Shahi Tombs.\n\nJustice Bande Ali, Chairman of the Wakf Tribunal, orally passed the order on Monday after the AKTC’s counsel Shafeeq Mohajir argued that there was no reason for two lawyers to be on the committee, as they lacked expertise on architectural conservation.\n\nIn his argument, which lasted for over two hours, Mr. Mohajir pointed out that it would be better to have experts on the committee, like the AKTC’s CEO Ratish Nanda, under whose supervision works were ongoing at the site currently. In a previous order, the tribunal had ordered that the committee be constituted including counsel for both sides — namely Jaferuddin’s counsel Mohammed Ilyas and counsel for the Department of Archaeology.\n\nThe case was filed in 2007 by Jaferuddin at the tribunal, seeking to declare the agreement dated May 16, 1977 between Mukarram Jah and the then Governor of Andhra Pradesh, giving custody of the Qutb Shahi Tombs to the State government as illegal, null and void.\n\nMr. Jaferuddin also asked the tribunal to re-deliver the management of the site to the A. P. Minority Welfare Department, A. P. Wakf Board or any other private agency comprising any prominent person from Hyderabad having knowledge of Wakf. In this case, the defendants are the State of A. P., Govt. of A. P. Minority Welfare, Quli Qutb Shah Urban Development Authority, Archaeology Department, the secretary Awqaf committee, representing the Nizam and the State Wakf Board. Mr. Jaferuddin sought that the tribunal declare all acts of construction in the tombs illegal.", 
    "section": "national", 
    "title": "Appoint experts for Qutub Shahi Tombs conservation, Waqf tribunal urged", 
    "subsection": "general", 
    "date": "2016-01-27"
}