{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "The political turmoil in Arunachal Pradesh is set to deepen inside Parliament with the Congress determined to stall the ratification of President’s Rule in the State.\n\nTop party sources said here on Tuesday that a meeting was held between senior leaders of the party and Chief Minister Nabam Tuki at the residence of former Union Minister Kapil Sibal and both legal and political options to fight the imposition of President’s Rule were discussed.\n\n“A proclamation of President's Rule needs to be ratified in both Houses of Parliament within two months of notification or whenever the next session of Parliament is held. In this case, the budget session. The party will oppose it tooth and nail and try and build opposition unity around the issue,” said a top source in the party.\n\nOn Tuesday evening, the Janata Dal (U) also issued a statement in support of the Congress, appealing to all non-BJP parties to unite in raising the issue in Parliament.\n\n“This decision of the NDA-led Central government is an attempt to sabotage the Constitutional mandate, which is a threat to democracy. This act also shows the BJP’s mindset towards cooperative federalism. The JD(U) calls upon all non-BJP parties including NDA partners Telugu Desam Party, People’s Democratic Party, Shiv Sena and Akali Dal to stand together in the hour of need and raise the issue in the upcoming budget session,” the statement read. The opposition enjoys comfort in numbers in the Rajya Sabha and the imposition of President’s Rule in an Opposition-run state has set the stage for a stormy Budget Session.\n\nBihar Chief Minister Nitish Kumar said the imposition of President’s rule was a “disaster” in the making. Delhi Chief Minister Arvind Kejriwal likened the situation to the Emergency. “President’s rule in Arunachal. Advaniji was right in saying that there are Emergency-like conditions in the country,” he said.\n\nArunachal Pradesh plunged into a political crisis in June last year after a section of tCongress MLAs (14 of them) was suspended by Speaker Nabam Rebia, along with two Ministers. The Congress retained its majority, but very soon Deputy Speaker T.N. Thongdok cleared an impeachment motion against the Speaker “owing to his personal relationship with Chief Minister Nabam Tuki”.", 
    "section": "national", 
    "title": "Arunachal crisis will echo in Parliament", 
    "subsection": "general", 
    "date": "2016-01-27"
}