{
    "author": [], 
    "text": "23 out of the 25 award winners were driven around in a jeep\n\nBravery award winners taking part in the Republic Day celebrations in New Delhion Tuesday.— Photo: R. V. Moorthy\n\nNational Bravery Award-winning boys and girls on Tuesday drew applause from the audience at the Republic Day parade here for saving human lives in dangerous situations.\n\nAs 23 out of the 25 award winners were driven in a jeep at the parade, the spectators clapped and cheered them for their courageous feats.\n\nPrime Minister Narendra Modi had presented the awards to the proud winners on Sunday.\n\nFrom a 16-year-old who fought off a tiger to a 13-year-old who lost his life while trying to save his friend from drowning, three girls and 22 boys showed incredible bravery in the face of dangerous situations.\n\nTwo of them have been decorated with the award posthumously.\n\nLast week, the winners were also felicitated by President Pranab Mukherjee, Union Minister Maneka Gandhi, Lieutenant Governor of Delhi Najeeb Jung and Army Chief General Dalbir Singh Suhag.\n\nBharat Award, the highest of the National Bravery Awards, has been posthumously awarded to Gaurav Kawduji Sahastrabuddhe from Maharashtra who sacrificed his life during an attempt to save four of his friends.\n\nShivansh Singh, who lost his life while undertaking a valiant effort to save his friend from drowning in Sarayu river was also awarded posthumously.\n\nThe prestigious Geeta Chopra award has been given to eight-year-old Shivampet Ruchitha of Telangana who displayed exemplary valour in saving two lives when a train hit her school bus.\n\nSixteen-year-old Arjun Singh was honoured with Sanjay Chopra Award for displaying outstanding bravery in fighting off a tiger to save his mother.\n\nRamdinthara (15) of Mizoram, who saved two persons from electrocution, was awarded Bapu Gaidhani Award, along with Rakeshbhai Shanabhai Patel (13) of Gujarat and Aromal SM (12) from Kerala.\n\nWhile Rakeshbhai saved a boy who accidentally fell into a deep well, Aromal rescued two women from drowning.\n\nOther recipients of the bravery awards are Kashish Dhanani (Gujarat), Maurice Yengkhom and Chongtham Kuber Meitei from Manipur, Angelica Tynsong (Meghalaya), Sai Krishna Akhil Kilambi (Telangana), Joena Chakbraborty and Sarwanand Saha (Chhattisgarh) and Dishant Mehndiratta (Haryana).\n\nBeedhovan, Nithin Philip Mathew, Abhijit KV, Anandu Dillep, Muhammad Shamnad (all from Kerala), Mohit Mahdenrda Dalvi, Nilesh Revaram Bhil, Vaibhav Ramesh Ghangare (all from Maharashtra), Abinash Mishra (Odisha) and Bhimsen from Uttar Pradesh were also given the award.\n\nThe National Bravery Award Scheme was initiated by the Indian Council for Child Welfare to give due recognition to children who distinguish themselves by performing outstanding deeds of bravery and meritorious service. — PTI", 
    "section": "national", 
    "title": "Bravery award winners draw applause at R-Day parade", 
    "subsection": "general", 
    "date": "2016-01-27"
}