{
    "author": [
        "Mohit M"
    ], 
    "text": "Researchers analyse genotype data of 367 individuals from 20 ethnic populations\n\nThe twisting strands of DNA tell tales, not just of the strengths and weaknesses that make us human, but of the consolidation of the caste system.\n\nA study by researchers from the National Institute of BioMedical Genomics (NIBMG) in West Bengal has looked at the genes of various communities to answer questions that have often been suggested in history books: when did caste become the dominant norm for ethnic communities of the region.\n\nFor most upper-caste communities, endogamy (that is marrying within one’s caste) started nearly 70 generations ago, or around the time of the Hindu Gupta period around 1,500 years ago, says the study published in the latest issue of the journal PNAS (Proceedings of the National Academy of Sciences of the United States of America).\n\n“A lot of social transformation took place during the Gupta period. Notable among these was the enforcement of social strictures against marriage between castes, as enshrined in the Dharmasastra . This reveals that some social norms leave imprints on the DNA, which can be reconstructed by careful genetic studies,” says Partha P. Majumder, Director, NIBMG, who, along with Analabha Basu and Neeta Sarkar Roy, authored the study.\n\nBy looking at the block lengths of ancestral genes, the team could pinpoint the era when mixing of castes ended. In the case of West Bengal Brahmins, marriages with the northeastern communities continued until the arrival of the 8th century Pala dynasty which cut off these regions.\n\nFor the Marathas, it was during Chalukyas and Rashtrakutas (nearly 1,100 years ago) when warriors (Kshatriyas) were drawn from the peasantry class and eventually, the mixing of the population with tribes and Dravidian communities halted.\n\nUnsurprisingly, it was mixing between tribes of various ancestries that ended the last.\n\nHowever, the researchers have noted that “mixing” of genetic populations continued in an “asymmetric” trickle after this. Upper caste populations continued to give genetic inputs to lower caste and tribal populations — but not vice-versa.\n\nThis is “consistent with elite dominance and patriarchy” of the upper caste, notes the study.\n\n“Male members of upper caste communities have had off-spring with other communities, but the reverse is not seen. This is possible by an elite group [sharing the similar genes] dominating non-elite groups,” says Partha P. Majumder, Director, NIBMG, who, along with Analabha Basu and Neeta Sarkar Roy, authored the study.\n\nResearchers analysed “high quality” genotype data of 367 individuals drawn from 20 ethnic populations.\n\nThe samples ranged in caste, linguistic as well as geographic variations: from “upper caste” — Gujarati, Manipuri, West Bengal Brahmins and Marathas — to Dravidian communities — Pallan, Irula, among others — to Central and Eastern Indian tribes — Ho, Santhal, Birhor.\n\nFrom Andaman and Nicobar islands, the Jarawa and Onge tribes were chosen for the study — and these tribes were found to have ancestries closer to the Pacific Islanders than those in mainland India.\n\nApart from the historical linkages shown, the study also shows the complex ancestries that now make up the Indian population.\n\nWhile a previous study published in Nature in 2009 by Harvard geneticist David Reich and his team, showed that most Indians could trace their roots in Ancestral North Indians (ANI) and Ancestral South Indians (ASI) genes; the NIBMG team shows a significant presence of the Ancestral Tibeto-Burman (ATB) genes in communities in the North-East as well as Ancestral Austro-Asiatic (AAA) genes among the tribal populations of east and central India.", 
    "section": "national", 
    "title": "Caste system has left imprints on genes: study", 
    "subsection": "general", 
    "date": "2016-01-27"
}