{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "In an attempt to regain the lost vote share in Rajasthan, the Congress is adopting an aggressive strategy of street protests and agitations.\n\nSpeaking to The Hindu, Congress leader Sachin Pilot, who recently completed his second year as the president of the party unit in the State, said that padyatras, street protests, agitations against rising electricity tariffs and faulty allocation of coal mines had put the Vasundhara Raje-led government on the defensive.\n\n“We really put the pressure on the government and within six weeks, we got those allocations cancelled,” Mr.Pilot said.\n\nRajasthan is one of the States where the Congress faced a serious electoral decline in the Lok Sabha polls, failing to win even a single seat.\n\nOptimism after bypolls\n\nA wave of optimism in the party started with the by-polls in the State. In a jolt to the Raje government, the Congress wrested the three Assembly seats of Weir, Nasirabad and Surajgarh from the BJP, leaving the latter with just the Kota seat.\n\n“In the local body polls, the Congress vote share was 45% against the BJP’s 47%, so there is just a 2% gap, which will be filled very soon,” said Mr.Pilot, adding that the party was gaining in the vote share in urban areas as well.\n\nThe most significant political victory for the Congress in the State was defeating the BJP candidate in the municipal elections in Jahanabad, which is the legislative Assembly constituency of Chief Minister Vasundhara Raje.\n\n“Apart from that, our student wing, NSUI, has won almost all the university elections,” said Mr.Pilot. “I think young people are coming back to the Congress.”\n\nMr.Pilot said the Congress high command had decided to remain steadfast in its “attacking mode” and the party would keep raising issues that mattered to the people. “We have adopted a proactive push strategy,” he said. “We are reaching out to the people now. We are forming local alliances with bar associations, NGOs, trade unions and these are the contacts we had never made before.”", 
    "section": "national", 
    "title": "Cong. on comeback trail in Rajasthan, says Sachin Pilot", 
    "subsection": "general", 
    "date": "2016-01-27"
}