{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The impasse between the Joint Action Committee (JAC) of students and the University of Hyderabad (UoH) administration continued on Tuesday as the varsity entered its ninth day of academic suspension.\n\nAmid calls for him to step down, Vice-Chancellor in-charge Prof. Vipin Srivastava appealed to help the administration ‘restore normality at the earliest’.\n\nHowever, protests by the students continued, with the JAC forming an All India JAC for Social Justice and raising a call for an all-India university strike on Wednesday.\n\nArpita, a JAC member, said student organisations from various universities across the country had expressed solidarity with them.\n\nProf. Srivastava told The Hindu : “We had an internal meeting with faculty members and discussed the issue. The impact (of the academic suspension) will be very bad, even for our final-year students when it comes to their employment.” When asked how bad the resignations of faculty members from administrative positions have been, he said they have been asked to retract the resignations.\n\nWhen contacted, Dean of Students Welfare Prof. Prakash Babu, who was among those who had resigned a few days ago, confirmed this, saying he had been asked to continue in his post given the current situation.\n\nChief Medical Officer of UoH Capt. Ravindra Kumar also said he was asked to continue in his post until other arrangements were made. The JAC also said it would screen the documentary Muzaffarnagar Baaqi Hain at 10 p.m. in the campus even as its maker, Nakul Singh Sawney, would meet the students. Others like writer Meena Kandasamy and intellectual Prof. G. Haragopal (retd) had also come to the university supporting the students.\n\nFaints during strike\n\nAn M.A. student, Mubashir, who was part of a hunger strike that started three days ago in the university, along with six others, was shifted to the campus Health Centre after he fainted around 3.30 p.m. on Tuesday.\n\nDr. Ravindra Kumar, who has been periodically checking the students staging the hunger strike, said Mubashir’s health had deteriorated after his blood sugar level dropped.\n\nCounter-affidavit released\n\nThe JAC on Tuesday released copies of a counter-affidavit filed in the High Court last October by M. K. Singh, Inspector General of Police (Law & Order), Telangana, in response to a petition filed by the mother of ABVP member Susheel Kumar who had alleged that he was attacked by members of the Ambedkar Students Association (ASA) in his hostel room.\n\nIn the affidavit, Mr. Singh stated that Susheel’s appendicitis operation conducted at Archana Hospital had nothing to do with the incident that had taken place in the intervening night of August 3 and 4.\n\nHis affidavit also mentioned that the injuries Susheel sustained were “simple” in nature.\n\nStudents detained\n\nIn a separate incident, the Gopalpuram police detained 18 students of Osmania University who were taking out a rally ‘Wall For Rohit’ on Necklace Road here.", 
    "section": "national", 
    "title": "Deadlock continues on campus", 
    "subsection": "general", 
    "date": "2016-01-27"
}