{
    "author": [
        "Damini Nath"
    ], 
    "text": "A senior civil servant in Delhi touched the feet of Lieutenant-Governor Najeeb Jung on Monday after receiving a special award from him on the occasion of the sixth National Voters’ Day.\n\nVishwa Mohan, a 1993 batch officer of DANICS, is currently posted as Officer on Special Duty (OSD) to the Delhi Development Authority Vice-Chairperson.\n\nWhile the officer maintained that it was a mark of respect, the gesture comes at a time the Aam Aadmi Party government is at loggerheads with civil servants.\n\nOn Monday, the Office of the Chief Electoral Officer (CEO) of Delhi held an event to award best electoral practices and Mr. Vishwa Mohan was among the three people selected for “special awards”. A total of 25 officials, departments and journalists received the awards.\n\nMr. Vishwa Mohan touched Mr. Jung’s feet after accepting the award. “It is a matter of respecting elders. I would have done the same if it was anyone else in his place,” Mr. Vishwa Mohan said later in response to a question on his gesture.\n\nOn December 31, members of the DANICS Officers Association and the AGMUT (Arunachal Pradesh-Goa-Mizoram-Union Territories) Cadre IAS Association had gone on mass leave to protest against the Delhi government’s suspension of two of its members, calling the action “illegal”. Chief Minister Arvind Kejriwal had responded by calling the DANICS and IAS associations the “B team of the BJP”, accusing them of taking orders from Prime Minister Narendra Modi and Mr.Jung.\n\nMeanwhile, speaking at the National Voters’ Day event, that was attended by officials concerned with elections, Mr. Jung recalled his own experience as a young returning officer during the 1977 polls in Madhya Pradesh. “But, now there is more desperation to win. The passions are higher today. So, I congratulate you [election officials] of making the recent elections a success,” said Mr. Jung.\n\nDelhi CEO Chandra Bhushan Kumar said the election office’s motto will be “no voter left behind” as it aims to expand enrolment as well as “inclusive and qualitative participation”.", 
    "section": "national", 
    "title": "Delhi officer touches L-G’s feet at event, triggers controversy", 
    "subsection": "general", 
    "date": "2016-01-27"
}