{
    "author": [], 
    "text": "In a stern order, the Central Information Commission (CIC) has said schools and Education Department should not disclose information about children under the RTI Act without consulting their parents.\n\nThe commission admonished the principal of RD Public School and the Central Public Information Officer (CPIO) of the Directorate of Education (DoE) of the Delhi government for disclosing information about a student to his relatives who had a dispute with the student’s family.\n\nInformation Commissioner Sridhar Acharyulu said the principal of the school himself had told the DoE that his school did not come under the RTI Act and the applicant was involved in a dispute with the student’s family.\n\n“There are several incidents reported that rivals of the parents or quarrelling spouses take the child from the school. Revealing the details of the child might lead to kidnap or murder etc. During the stay of the child in school, the principal and teachers have a duty of guardian and any negligence on their part might harm the student,” Mr. Acharyulu said.\n\nThe principal feared disclosure would cause damage to the boy but still gave documents related to the student, he noted.\n\n“The school should not have furnished the copies of the CBSE certificate of the child. Another letter from the CBSE given to the school granting direct admission to 10 students including the boy was also furnished to the appellant,” Mr. Achayulu said.\n\nThe Information Commissioner said the Central Public Information Officer of the DoE gave all this information to the RTI applicant Lalit Kapur without applying his mind, and not thinking about the security issues that might arise for the boy.\n\n“The commission directs the CPIO and the principal not to disclose personal information of the students to any person, much less to his so-called relatives, without following the procedures under Section 11 of the RTI Act,” he said.\n\nHe said it was revealed that the CPIO did not follow the mandatory process in Section 11 of the RTI Act to seek the opinion of the parents of the child, the third party.\n\n“The request for information is certainly personal in nature and third party information of a minor student and its disclosure may not enhance the welfare of the child.\n\n“It is interrogative in nature and he is fishing to find a basis to embarrass the child or his family not with a good motive and for some unspecified purpose, which is certainly not ‘public purpose’,” Mr.Acharyulu said.\n\nThe commissioner said that irrespective of the opinion given by a third party, the CPIO would have to decide based on his discretion to fulfil the objectives of the RTI Act.\n\nShow cause notice\n\nIssuing a show cause notice to the principal and the CPIO, Mr.Acharyulu asked why maximum penalty should not be imposed on both of them and disciplinary action initiated for not complying with the provisions of Section 11 of the RTI Act and causing breach of the privacy of the child and his parents.\n\nIn a warning to the RTI applicant, Mr.Acharyulu said, “The Commission records its admonition against the appellant for misuse of the RTI against the school child and warns him against such misuse in future. His second appeal is an extension of abuse and hence rejected. The commission records its contempt against him and imposes a penalty of Rs10 to be paid to the principal of the school.” — PTI", 
    "section": "national", 
    "title": "Do not disclose details of minors without parents’ consent: CIC", 
    "subsection": "general", 
    "date": "2016-01-27"
}