{
    "author": [
        "S Poorvaja"
    ], 
    "text": "No solution yet for students who will be in Class X next year\n\nBy directing the State government to grant for over 7,000 Class 10 students the exemption they sought from writing the Tamil language paper in 2015-16 academic year, the Madras High Court has provided temporary relief to students who are pursuing education in languages other than Tamil.\n\nHowever, the interim order will provide relief only to those who have applied for exemption to the competent authority appointed by the government.\n\nIn 2006, by enacting the Tamil Nadu Tamil Learning Act, the State government made it mandatory that Tamil is taught as a subject in standards I to X in all the schools in the State. Certain schools run by the Central government like Navodaya Vidyalaya, Sainik schools and Kendriya Vidyalayas were given exemption.\n\nThough the Act was enacted, the government showed little interest in framing Rules to implement the Act. Six years after the enactment came into force, in 2012 the government framed the Rules in a bid to implement the law.\n\nIn late November, the Madras High Court asked the Tamil Nadu government to be liberal with students who had sought exemption. However, after the appeal of students from linguistic minority schools was rejected in December, the High Court on Monday passed an interim order directing the State government to allow applications moved by over students seeking exemption from writing the exam.\n\nAmong the 7,000-odd students were more than 4,000-odd from 350 minority educational institutions, including Muslim educational institutions across Chennai, Vellore, Erode, Salem and South Arcot, said P.K. Shabbir Ahmed, from the Organisation of Muslim Educational Institution and Associations of Tamil Nadu.\n\n“When we requested teachers to teach Tamil in minority government schools when the Act came into force, only part-time teachers were given to us. That is insufficient,” he said. Arguing that it would be unfair to pit students who had just started learning the language against those who have been learning Tamil from kindergarten and/or against those for whom the language is a mother tongue, Mr. Shabbir said that the association had been asking for a partial exemption for the students. “The students can have a paper for Tamil at the basic level and then be allowed to write a language paper in their mother tongue,” he stated.\n\nThe parent of a student in a linguistic minority school in Chennai voiced his relief at his daughter being granted an exemption. “She will now take up the Language paper in her mother tongue which she has been learning from school,” he said.", 
    "section": "national", 
    "title": "HC relief for students seeking exemption from Tamil exam", 
    "subsection": "general", 
    "date": "2016-01-27"
}