{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Amid shutdown in the Valley and stringent security arrangements, Governor N.N. Vohra in his Republic Day message in Jammu on Tuesday expressed hope to see elected government in the State soon.\n\n“I hope the elected government will soon assume office in the State,” said Mr Vohra, who paid tributes to late Mufti Muhammad Sayeed, who passed away as sitting Chief Minister of the State on January 7.\n\n“India remains committed to maintaining friendly relations with all its neighbours and our Prime Minister has launched fresh initiatives for securing peaceful relations with Pakistan,” he added.\n\nThe passing away of Mr. Mufti on January 7 slipped the State into the Governor’s rule.\n\nMufti’s daughter Mehbooba Mufti, Peoples Democratic president and MP, attended the R-Day function in Srinagar.\n\nBesides, National Conference (NC) working president and former chief minister Omar Abdullah was present at the Bakshi Stadium, the venue of R-Day function.\n\nShutdown in Valley\n\nThough the Republic Day functions passed off peacefully in J&K on Tuesday, normal life remained disturbed in the Valley due to a separatists’ shutdown call.\n\nThe authorities snapped the internet services in the Valley in the morning and unbarred it in the afternoon.\n\nA shutdown call issued by separatist leaders — Syed Ali Geelani, Mirwaiz Umar Farooq and Yasin Malik — impacted the normal life. While thin traffic was observed on the roads, all major business centres and markets remained closed. Most separatists were placed under house arrest and many protesters detained on the occasion.\n\n“The shutdown is a referendum against the rulers,” said Mr. Geelani.\n\nFirebrand legislator Engineer Rashid accused the authorities of disallowing him to attend the R-Day function despite an invite.\n\nMilitant killed\n\nIn south Kashmir’s Anantnag district, a militant was shot dead in a brief encounter. An official said the militant was spotted around 4 a.m. in Kokernag area. An AK-47 was recovered from the spot, said the police.\n\nThe killing sparked protests in Khanabal area, where hundreds of locals participated in the funeral of the Hizbul Mujahideen, terrorist Mushtaq Ahmad Haroo.\n\nParts of the old city too witnessed stone-pelting in the evening.", 
    "section": "national", 
    "title": "Hope to see elected govt. soon, says J&K Governor", 
    "subsection": "general", 
    "date": "2016-01-27"
}