{
    "author": [
        "R Prasad"
    ], 
    "text": "The cost of the test will see a further drop if the government waives the customs duty of 31 per cent levied on Xpert machine and reagents. File photo shows the CB NAAT unit at Bowring Lady and Curzon Hospital in Bengaluru.\n\nThere is a bright spot in an otherwise gloomy TB scenario in India. Of the 12 high-burden countries where the private sector is a major player in providing health care, the Indian private sector offers the cheapest price for the WHO-approved Xpert MTB/RIF, a molecular test for diagnosing TB. India also has the highest number of private labs offering the test, with 113 labs offering it at a subsidised rate.\n\nWhile it costs only Rs. 2,000 in the 113 labs (with 5,200 collection centres) which are part of a novel initiative — Improving Access to Affordable & Quality TB Tests (IPAQT) — that was launched in India in March 2013, the charges are anywhere between Rs. 3,500 and Rs. 5,000 in labs that are not part of the IPAQT initiative. (The ipaqt.org site provides the details of other labs in the country that offer the WHO-approved subsidised tests.)\n\nThe mean price of the highly accurate TB test in Bangladesh is nearly $75, while it is $50 in the case of Afghanistan. It is as high as $155.5 in Philippines. Xpert is not commercially available in the private sector in six other high-burden countries.\n\nThese are some of the results of a study published on Tuesday (January 26) in the journal The Lancet Global Health .\n\nThe cost of the test will see a further drop if the Indian government waives off customs duty of 31 per cent levied on Xpert machine and reagents. “Nothing is preventing the government from waiving off the duty. There is a provision to waive import duties for life saving drugs and products, and HIV kits, for example, are duty-waived. Something similar is necessary for the WHO-endorsed TB tests,” Dr. Madhukar Pai, Associate Professor at McGill University, Canada, and one of the Governing Council Members of IPAQT and a co-author of the paper, said in an email to The Hindu .\n\nAs a result of the subsidised pricing agreement with the manufacturer, there has been an increase in the number of people in India accessing the highly accurate diagnostic test since 2013. From 15,190 people who availed themselves of the test between March and December 2013, it has gone up to 1,31,440 tests in 2015. The total number of tests done since March 2013 stands at 2,08,550.\n\n“With a lot of effort, we have managed to keep the price manageable via IPAQT in India, and have shown that volumes can greatly increase. In other privatised countries, patients pay a lot, and have limited access to good tests,” said Dr. Pai.\n\nAccess to accurate tests at subsidised price is very important in India as nearly 80 per cent of the population in India first seek the private sector. If one out of every four TB patients in the world is an Indian, one in eight TB patients in the world is a privately treated Indian patient.\n\nThough the price is internationally set at $9.98 per cartridge, and the agreement allows for a 10 per cent variation in the exchange rate, the cost of the test has not been increased since January 2014 despite the rupee depreciating against the dollar in recent times. But the price may be revised if the rupee continues to depreciate, warns Dr. Pai.\n\nSerological test\n\nBesides increasing the access to the highly reliable and sensitive test, all labs that become a member of the Initiative abide to ban the unreliable serological test. India banned serological test for TB in June 2012. Also, TB notification by the member labs has improved dramatically as IPAQT helps them with the process of notifying all TB cases.\n\nWhile the sensitivity of smear microscopy is about 50 per cent, Xpert has 90 per cent sensitivity (in smear positive cases) and 98 per cent specificity. It can also indicate resistance to rifampicin — a first-line TB drug.\n\nThanks to low price, there is a\n\nrise in the number\n\nof people undergoing test", 
    "section": "national", 
    "title": "India sets an example in subsidised TB diagnosis", 
    "subsection": "general", 
    "date": "2016-01-27"
}