{
    "author": [], 
    "text": "A U.K.-based Indian-origin man who had travelled to the U.S. from London on a business trip has alleged that he was held for 13 hours by the immigration officials and was deported because of his skin colour.\n\nAmreet Surana, who works for a U.K. security company, was held in Detroit while trying to catch a connecting flight to the firm’s branch in Arizona.\n\nThe 24-year-old said that he had the relevant Electronic System for Travel Authorisation (ESTA) form, which allows citizens of 38 countries, including most of Europe, to travel to the U.S. without a visa. “I believe I was profiled because of my appearance,” Mr. Surana told the BBC.\n\nThe U.S. Customs and Border Protection (CBP) has not specified the reason for Mr. Surana’s deportation but say that the ESTA did not guarantee a traveller would pass U.S. border checks.\n\nMr. Surana, from Leicestershire in the Midlands region of England, said that he was stopped when he landed at Detroit Airport from Heathrow on January 17 and then sent to be interviewed by immigration officials. He told them he worked as an international business manager for Nottingham-based Octavian and was visiting its U.S. branch in Phoenix.\n\n“In the space of 20 minutes they concluded that I was an illegal immigrant working in America, denying a U.S. citizen a job,” Mr. Surana claimed. “The whole experience was traumatic, frightening, embarrassing, stressing and haunting for me and my family. I have never had a criminal record. I have an education and an international executive job. I wish this on nobody,” he said.\n\nIn a statement, CBP said that it “firmly denies any claims that a traveller can be subject to an admissibility interview because of racial profiling. CBP is charged with inspecting all travellers regardless of nationality, race, sex, religion, faith or spiritual beliefs.” — PTI\n\n‘I have never had a criminal record. I was profiled owing to my appearance,’ says Amreet Surana", 
    "section": "national", 
    "title": "Indian-origin Briton deported from U.S.", 
    "subsection": "general", 
    "date": "2016-01-27"
}