{
    "author": [], 
    "text": "Angela Merkel inaugurates show at the German Historical Museum\n\nNelly Toll was eight years old when she and her mother went into hiding in 1943 in Poland to escape the Nazis’ death camps. The Jewish girl spent long hours in her tiny hideaway at a Christian family’s home writing stories, keeping a diary and creating paintings of a lost world.\n\nToday, her art is on display in Berlin at a special exhibition of Art from the Holocaust that opened at the German Historical Museum on Monday.\n\n“I hope that generations to come will look at this and know what atrocities made me do this,” Ms. Toll said. The exhibition includes work by Jewish artists in hiding, in concentration and labour camps, and in ghettos. Of the 50 artists featured, 24 were killed by the Nazis. Alongside the mostly unknown names are acclaimed artists such as Felix Nussbaum and Ludwig Meidner.\n\nMs. Toll is the only artist represented in the show who is still alive. “I made 60 paintings while in hiding and all of them express happiness,” said Ms. Toll, who lost her father and brother in the Holocaust. She emigrated to the United States with her mother after the war.\n\nPainting was a way for Ms. Toll to break free and escape from the Holocaust’s harsh reality to imaginary places of beauty and happiness.\n\n“I would have conversations with the characters in my paintings for hours,” Toll remembered. Not all the works show an escape into a happy imagination. Some artworks are shocking in their depiction of life in the ghetto, daily discrimination and fear of being killed by the Nazis.\n\nLeo Haas’ “Transport from Vienna” shows the arrival of a train full of elderly Jews at the Theresienstadt ghetto in 1942. The show’s curator, Yad Vashem’s Eliad Moreh-Rosenberg, called the creation of art during the Holocaust an “uncompromising act of resistance” by artists in mortal danger.\n\nIt was very difficult for the artists to get painting supplies, but despite that and their appalling living conditions they managed to portray life during the Shoah, fighting their dehumanisation by the Nazis and leaving behind painted witness accounts, Ms. Moreh-Rosenberg said.\n\nChancellor Angela Merkel, who was to officially inaugurate the show on Monday night, said on her weekly podcast released over the weekend that such exhibitions are still critical for educating younger Germans about the Holocaust. — AP", 
    "section": "national", 
    "title": "Jewish art from the Holocaust on display", 
    "subsection": "general", 
    "date": "2016-01-27"
}