{
    "author": [], 
    "text": "A newly discovered story written more than a century ago by the cherished British children’s author Beatrix Potter will be published in September, Penguin Random House announced on Tuesday.\n\nThe Tale of Kitty-In-Boots , a story about a black cat that leads a double life, was found two years ago by Penguin Random House publisher Jo Hanks.\n\nMs. Potter is best known for The Tale of Peter Rabbit , which has sold 45 million copies and been translated into 36 languages. The publication of the newly-uncovered tale forms part of this year’s celebrations marking the 150th anniversary of her birth.\n\nMs. Hanks found a reference to the story in an out-of-print literary history of the author. Ms. Hanks then delved into the Potter archives held at the Victoria and Albert Museum in London and discovered the 1914 manuscript.\n\n“Potter fully intended to publish it. She’d written it twice, rewritten it, polished the manuscript and then had it typeset and started to lay it out in a proof dummy,” Ms. Hanks told BBC radio.\n\n“Then World War I began, she got married and she was very intent on building her farming business. Those interruptions took over and meant she never went back to the tale,” said Ms. Hanks.\n\n“I think it’s the best of Beatrix Potter. There’s humour, there’s rebellious characters. During the story we meet a couple of interesting villains,” she said.\n\nOlder Peter Rabbit\n\nAn older Peter Rabbit makes an appearance, while old favourite Mrs. Tiggywinkle the hedgehog also turns up. “Once upon a time there was a serious, well-behaved young black cat,” the story begins. “It belonged to a kind old lady who assured me that no other cat could compare with Kitty.”\n\nThe book will be illustrated by Quentin Blake, best known for his work on Roald Dahl’s children’s books.\n\nMr. Blake said: “It seemed almost incredible when, early in 2015, I was sent the manuscript of a story by Beatrix Potter, one which had lain unpublished for a hundred years and which, with the exception of a single drawing, she had never illustrated.” — AFP", 
    "section": "national", 
    "title": "Lost Beatrix Potter children’s story uncovered a century on", 
    "subsection": "general", 
    "date": "2016-01-27"
}