{
    "author": [
        "Vikas Dhoot"
    ], 
    "text": "Nearly 117 institutions are not registered with the EPFO\n\nAlmost half of India’s private dental colleges are not paying Employees Provident Fund dues, a probe by the provident fund office has found.\n\nAccording to the Dental Council of India, there are 276 private dental colleges in India. Contributions to the Employees’ Provident Fund (EPF) are mandatory for those earning up to Rs. 15,000 a month in all organisations with 20 or more employees.\n\n“As per the Council’s regulations, each dental college is required to have a minimum number of employees, including teaching and non-teaching staff, which is above the threshold of 20 employees under the EPF law,” the intelligence unit in the Employees’ Provident Fund Organisation (EPFO) said in a memo sent to senior PF commissioners last week.\n\nOf the 276 private dental colleges, nearly 117 have not yet registered themselves with the EPFO, while 17 have defaulted on employees’ PF contributions after their enrolment.\n\n“The Dental Council of India carries out periodic inspections of dental colleges and has definite information on their manpower,” the memo pointed out.\n\n“All offices are requested to verify the level of compliance by dental colleges in their jurisdiction and take action against those who have failed to comply with the law,” the memo said, calling for an action-taken report from PF offices by the first week of February.\n\nTN colleges\n\nAs per the data compiled by the central analysis and intelligence unit, Karnataka, Maharashtra, Uttar Pradesh, Rajasthan and Tamil Nadu have the highest number of colleges evading PF dues.\n\nThese States account for 75 of the 134 colleges that have not registered themselves with the EPFO or defaulted on payments. In other States, however, the proportion of colleges not paying PF dues is higher than the total number of colleges.\n\nIn Gujarat, for instance, eight of 12 dental colleges don’t pay PF dues. Eight colleges each in Madhya Pradesh and Punjab don’t give PF benefits, of a total of 13 and 14 colleges in these States.\n\nAs per the EPF Act, 1952, employers are required to credit 12 per cent of an employee’s salary every month into their PF accounts to build a retirement corpus. An additional 12 per cent of salary is deducted as employees’ contribution.", 
    "section": "national", 
    "title": "Many dental colleges default on PF", 
    "subsection": "general", 
    "date": "2016-01-27"
}