{
    "author": [], 
    "text": "The video at Amit Shah’s swearing-in showedVijay Pal Tomar and not me, says Gen. V.K. Singh.\n\nA video that purportedly showed a man touching the feet of Amit Shah while felicitating him after he was re-elected BJP president on Sunday was doing the rounds on social media, purportedly linking it to former Army Chief Gen (Retd) V. K. Singh, who hit out saying it was a case of “mischief by presstitutes”.\n\nGen. Singh, a Minister of State in the Narendra Modi government, said on Tuesday the video was of Vijay Pal Tomar and not him as being linked, requesting people to counter the “mischief.”\n\n“Video of Shri Vijay Pal Tomar during felicitation of Shri Amit Shah has been floated to say it is me. A case of mischief by presstitutes !!!!,” he tweeted from his official twitter account.\n\nIn another tweet, Gen. Singh, said: “Friends Reference my take on video floated. It is also being floated on SM like whatsApp. Request counter this mischief (sic).”\n\nThe video has been taken out of Mr. Shah’s felicitation function after he was elected unopposed as the BJP chief for a full three-year term.\n\nGen. Singh had earlier used the word “presstitutes” to label the media, triggering a massive outrage.\n\nThe controversy began when Gen.. Singh said last April that visiting the Pakistan High Commission was “more exciting” than evacuating Indians from Yemen. The comment was tagged as insensitive by media outlets and social media, kick-starting a controversy. Mr. Singh seemingly took offence to the outrage in the media, labelling it “presstitutes” in a tweet.\n\n“Friends what do you expect from presstitutes...,” he had said.\n\nLater, he tried to downplay the controversy, saying the word “presstitute” was meant for a biased section of the media. — PTI", 
    "section": "national", 
    "title": "Mischief by media again, says V.K. Singh", 
    "subsection": "general", 
    "date": "2016-01-27"
}