{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Officials say inter-governmental pact was incomplete, pending resolution of financial issues\n\nThe acquisition of 36 Rafale fighter jets in flyaway condition for the Indian Air Force has been hanging fire since the Prime Minister’s visit to France last April.\n\nA day after Prime Minister Narendra Modi spoke of concluding the Inter-Governmental Agreement (IGA) with France for purchase of Rafale fighter jets, officials on Tuesday clarified that only a memorandum of understanding (MoU) was signed and the financial issues could not be resolved in a “couple of days” as stated by French President Francois Hollande.\n\nOfficials said that as the IGA was incomplete pending financial issues to be resolved, both sides signed the Memorandum of Understanding (MoU) for the purchase of 36 Rafale fighter jets in flyaway condition.\n\n“We did not want to give an impression that nothing has happened since the PM made the announcement in Paris last year. The MoU recorded that we have made progress,” highly placed sources told The Hindu .\n\nA senior French official clarified that when Mr. Hollande said financial issues would be sorted out in a “couple of days,” what he meant was the team which had been here would pick up negotiations in the next few days.\n\nThere was an interchange of terms between MoU and IGA on Monday after the joint press conference by the two leaders. While initially it was read out that an MoU was signed on Rafale, Mr. Modi in his address stated that they had concluded the Inter-Governmental Agreement pending “some financial issues” to be resolved soon. And the joint statement issued by the government mentioned the same.\n\n“The two leaders welcomed the conclusion of the Inter-Governmental Agreement [IGA] on the acquisition of 36 Rafale fighter aircraft in flyaway condition, except for some financial issues … ,” the statement said. However, briefing the media later Foreign Secretary S. Jaishankar clarified that it was an MoU.\n\nIt has been learnt that except for the pricing, other issues such as the schedule, supply and maintenance issues have been frozen but French officials were quick to point out that any additional changes would mean renegotiating the deal afresh causing further delay.\n\n“We are not talking about a standard configuration; we are talking about an India-specific aircraft. Given that the speed is at a remarkable pace,” another senior official said.\n\nAs reported by The Hindu earlier, the pricing of the aircraft has been a sticking point even as the issue of offsets has been sorted out. Officials had said that the cost per aircraft is over € 100 million or about Rs. 740 crore and efforts are on to reduce the price.\n\nIn addition, the Indian Air Force has asked for customisation on the aircraft as per its requirements, which, France said, would delay deliveries.", 
    "section": "national", 
    "title": "Only MoU signed, not agreement", 
    "subsection": "general", 
    "date": "2016-01-27"
}