{
    "author": [], 
    "text": "“We are planning to move to a more regular survey, conducted annually, with some reports coming out on a quarterly basis,” said TCA Anant, Secretary, Ministry of Statistics.\n\n“A survey requires resources — both finance and people. We have worked out many things… there are procedures to be followed before we can commit when we can start and in what form, as they interact with each other. A proposal has been finalised for competent approval,” Mr. Anant told The Hindu , stressing that though the Ministry is hopeful of starting the survey, it is still under ‘administrative examination.’\n\nWhile NSSO surveys are usually spread over a whole financial year, the design plan for the employment survey includes a regular annual survey with certain systems for urban areas that will enable generation of quarterly estimates, he explained.\n\n“For the employment survey, we want to shift to a modern technology platform so that we can speed up the process of capture of data from the field,” he said, pointing to similar, recent deployments of technology to improve data collection for the consumer price index (CPI) and the Annual Survey of Industries (ASI).\n\n“The ASI work is now done through a web portal. Our CPI collection is much more robust as all the data is gathered through an IT network developed by the Department of Posts, which we are piggybacking on to get data transmitted,” Mr. Anant said, adding a similar approach will be used for capturing employment numbers.\n\nThe National Statistics Commission had first called for a periodic labour force survey in 2009 and a pilot survey was undertaken in 2012-13.\n\nThe design of the new annual employment survey has been finalised on the basis of a peer and stakeholder review of the pilot survey’s outcomes.\n\n“We want to shift to a modern technology platform to speed up capture of data”", 
    "section": "national", 
    "title": "Soon, annual and quarterly employment surveys", 
    "subsection": "general", 
    "date": "2016-01-27"
}