{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "When Cottalango Leon steps up to receive the Technical Achievement Award of the Academy of Motion Picture Arts and Sciences this year, all of India will be cheering, and Coimbatore will be the loudest.\n\nMr. Leon will take home the recognition with J Robert Ray and Sam Richards for the “design, engineering and continuous development of Sony Pictures Imageworks Itview”. “The award was not totally unexpected for me since we were confident about our product,” 45-year-old Mr. Leon told The Hindu over phone from Los Angeles on Monday.\n\n“It is a tool used only within Sony Imageworks. So, it feels good to be recognised by the Academy and the wider industry”, he said.\n\nMr. Leon was born in Thoothukudi. He grew up in Coimbatore and visits the place every alternate year. He studied in the Government High School at Kallappalayam here till Class VII and in Kadri Mills Higher Secondary School from Class VIII to XII. His mother, Rajam (72), lives here with his brother Cafasa.\n\nMr. Leon went on to do his B.E. at PSG College of Technology during 1988 to 1992 and later worked in Delhi for two years.\n\n“At that time, there was a digital revolution happening in computer graphics and entertainment technology and movie-makers were starting to make use of it to create stunning visuals in popular movies. Since I was attracted to both arts and science, this intersection pushed me towards this field. Hence, for my Master’s degree at Arizona State University, I chose computer graphics as my specialisation and pursued jobs in that field after graduating in 1996,” he said in an e-mail. When Mr. Leon started working at Imageworks, there was a similar product that was hard to use and hence he was asked to create something better.\n\nOn Monday, some of the teachers of the schools in which he studied visited his brother’s house and felicitated Mr. Leon’s mother.\n\n“We never expected the award. The entire family is in joy and ecstasy,” says Dr. Cafasa.", 
    "section": "national", 
    "title": "Techie, born in T.N., wins Academy Award", 
    "subsection": "general", 
    "date": "2016-01-27"
}