{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Clockwise from top: President Pranab Mukherjee with French President Francois Hollande and Prime Minister Narandra Modi during the ‘At Home’ ceremony at the Rashtrapati Bhavan; Union Finance Minister Arun Jaitley with Congress President Sonia Gandhi at the reception; and an illuminated Parliament building and North Block.— Photos: Shanker Chakravarty & PTI\n\nIn a first, this Republic Day parade featured a tableau by ex-servicemen instead of the usual practice of a marching contingent. This comes in the backdrop of protests by veterans over the issue of one rank, one pension (OROP) and their call for boycott of the celebrations.\n\n“For the first time, the parade will also see an ex-servicemen tableau, where Army veterans with their eye-catching float will pass the saluting dais, wherein pioneering role of ex-servicemen in nation-building will be displayed,” Defence Ministry had said in a statement ahead of Republic Day.\n\nVeterans have been protesting at Jantar Mantar for implementation of OROP in its “rightful form” and had boycotted the 1965 war commemorative celebrations last year. They also announced a boycott of all government functions till the issue was resolved.\n\n“We want the OROP after removing the seven shortcomings. Till such time we will continue with the agitation. We will boycott January 26 (celebration) and we will also make a request to the marching contingent not to take part (in the parade),” said Maj Gen Satbir Singh (retd), Chairman of Indian Ex-Servicemen Movement (IESM) had announced at a rally in May Last year.\n\nResponding to the development, Group Captain VK Gandhi, General Secretary of the IESM, said it was a wrong decision by the government of not having a marching contingent that had been happening for the past several years.\n\n“We had given a boycott call of all government functions, so it could have probably been done to avoid embarrassment,” he said.\n\nHowever, a senior defence official said it was done to adhere to a truncated time line of the parade. However, he did not say how a tableau in place of contingent reduced time.", 
    "section": "national", 
    "title": "Veterans send tableau, but do not march", 
    "subsection": "general", 
    "date": "2016-01-27"
}