{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "Ranragini Bhumata Brigade’s attempt to enter the prohibited inner sanctum of Shani Shingnapur temple on Republic Day failed as police detained the activists at Supa village, 70 km from the temple town in Maharashtra’s Ahmednagar district.\n\nOn Tuesday afternoon, more than 500 women from across the State, led by Brigade president Trupti Desai (26), set out in buses to defy a 400-year-old tradition that debars women from worshipping the stone idol of Lord Shani, on account of “harmful vibrations” believed to be emanating from the deity.\n\nThe odds were stacked against the RBB activists as they faced a formidable security barrier both outside the village of Shani Shingnapur and inside the temple town itself with over 600 police personnel deployed to prevent any untoward incident.\n\nHigh drama\n\nHigh drama was witnessed after the buses were halted by security personnel near Supa.\n\n“This is a black day for democracy. We are stopped unconstitutionally on the occasion of Republic Day. We have not resorted to any violence to achieve our goal. Why is Chief Minister Devendra Fadnavis permitting this?” asked Ms. Desai.\n\nFollowing a half-hour stalemate in which the police refused to yield, the agitators led by Ms. Desai resorted to a sit-down strike, singing bhajans and kirtans , proclaiming their resolution to remain there until the police permitted them to pass.\n\nInside the temple’s inner sanctum, meanwhile, steel barricades cordoning off the platform were put in place early in the morning while thousands of villagers from Shani Shingnapur, opposing the RBB’s campaign, formed a ‘counter-campaign pandal ’ announcing their intent to uphold the temple tradition.\n\nThe locals were joined by activists of right-wing groups represented by the women’s wing of the ruling Shiv Sena and various other outfits belonging to the fringe-right, represented by the Sanatan Sanstha, the Hindu Janjagruti Samiti and its women’s wing Ranragini Shakha. Earlier, after the Pune Collector denied permission for a helicopter flight, the RBB president jettisoned her plan of rappelling down to enter inner sanctum.", 
    "section": "national", 
    "title": "Women marching to Shani temple stopped", 
    "subsection": "general", 
    "date": "2016-01-27"
}