{
    "author": [
        "Special Correspondent"
    ], 
    "text": "BJP dismisses the charge that the incident was triggered by a local issue\n\nThe police search for country bombs and weapons in tension-hit Aroli in Kannur, where RSS worker P.V. Sujith was murdered late on Monday.\n\nSix CPI(M) workers were arrested on Wednesday night in connection with the murder of Rashtriya Swayamsevak Sangh worker P.V. Sujith on February 15. Those arrested are Srijayan, Joy Joseph, Prasanth, Prabesh, Libin and Akash, all hailing from the district.\n\nThe police team investigating the murder said preliminary probe has confirmed that the murder of the 27-year-old youth by a group of alleged CPI (M) workers was motivated by political rivalry. The probe is continuing, the police said.\n\nThe Bharatiya Janata Party leadership here, meanwhile, is all set to launch a campaign to counter the CPI(M)’s dismissal of the killing as an incident over a local issue.\n\nThe BJP’s bid to use the latest murder to reiterate its campaign that the CPI (M) is targeting its political rivals in the district was made clear by the party’s national executive member P.K. Krishnadas at a press conference here on Wednesday.\n\nHe said that the BJP would launch a State-wide campaign against what it called “CPI (M)-sponsored” violence by highlighting the latest murder of the RSS worker.\n\n‘Unleashing violence’\n\nThe BJP leader said that the CPI (M) was unleashing violence to cover up its embarrassment over the custody of party district secretary P. Jayarajan in the Manoj murder case.\n\nThe BJP was not ready to play the game of murder politics with the CPI (M), he said, adding that the claim that Sujith’s murder was over an issue involving the harassment of a girl was baseless.\n\nHe said that the local CPI (M) leadership had been targeting Sujith ever since he became actively involved in the local body election at Aroli.\n\nSangh Parivar office attacked\n\nCountry-made bombs were hurled at the office of the Sangh Parivar-run Seva Kendra and the house of a BJP worker at Thalassery in the early hours of Wednesday.\n\nThe police said the Jagannatha Mandiram Seva Kenda at Temple Gate in Thalassery and the house of a BJP worker at nearby Illathuthazhe came under bomb attack after midnight.\n\nBJP leaders alleged that CPI(M) workers were behind the attacks.\n\nThe Seva Kendra office was targeted because its ambulance was used for taking the body of RSS worker P.V. Sujith murdered on February 15, they said. No one was injured.", 
    "section": "national", 
    "title": "6 CPI(M) workers arrested in connection with Sujith’s killing", 
    "subsection": "general", 
    "date": "2016-02-18"
}