{
    "author": [
        "Namrata Joshi"
    ], 
    "text": "Paani Foundation will invest in people, Bollywood actor Aamir Khan said during its launch in Mumbai on Wednesday.— Photo: PTI\n\nThe cause is water and the star involvement is unique. Actor Aamir Khan and his wife Kiran Rao have started Paani Foundation, a not-for-profit company whose main objective will be to communicate, impart knowledge and bring about a change in the outlook at the grass roots about water conservation and watershed management. It will work in association with the Maharashtra government towards solving the water crisis in the state. Chief Minister M Devendra Fadnavis and the actor came together to make this announcement at a press conference in Mumbai on Wednesday.\n\nJalyukt Shivar Abhiyan is one of Maharashtra government’s flagship schemes to make the State drought free by 2019. “We felt the need to scale it up and make the government scheme into a civil society movement at our end,” said the actor.\n\nAs he told The Hindu earlier, it has been something he has been working on for almost a year. In fact, May 1, Maharashtra Day, last year was when the first crucial step towards it was taken at a meeting with the CM. “We were involved with various social issues for five years through the three seasons of Satyamev Jayate. We then decided to focus on one problem in Maharashtra which is my janmabhoomi and karmabhoomi,” said Aamir.\n\n“He is not being a brand ambassador but working on ground,” said Mr. Fadnavis.\n\nThe idea, for the star, is to also encourage his colleagues and friends to join him in the water movement. “People want a positive change and there’s no problem that can’t be solved by coming together,” he said.\n\nThere are many NGOs working in the field. How would Paani’s work differ? “Other NGOs are investing in structures while we will invest in people,” said Aamir. So to start off, there’s the “Satyamev Jayate Water Cup”, the first step of Paani Foundation in its journey of solving the water crisis. The whole idea is that a competition will bring out the best and will make the villages put their best foot forward.\n\nThe focus will be on three talukas in three different districts—Koregaon in Satara, Warud in Amravati and Ambajogai in Beed. The gram panchayats will be invited to participate in a contest. It will be publicised in the media.\n\nAamir alone won’t be the face of the movement. He wants celebrities to join in, travel to the villages and become water mentors.\n\nAn earlier version of this article wrongly stated that Jalyukt Shivar Abhiyan is a scheme to make Maharashtra drought-free by 2012. The programme aims at a drought-free state by 2019. The error is regretted.", 
    "section": "national", 
    "title": "Aamir’s initiative to educate people on water conservation", 
    "subsection": "general", 
    "date": "2016-02-18"
}