{
    "author": [
        "National Bureau"
    ], 
    "text": "Four members of the banned Students Islamic Movement of India (SIMI) who had escaped from Khandwa jail in Madhya Pradesh in 2013 were arrested from Rourkela in Odisha after a three-hour operation involving an exchange of fire on Tuesday night.\n\nThe mother of one of the SIMI operatives was also arrested from the house they were staying.\n\nThe four men had been on the radar of the agencies for their role in at least 17 incidents of blasts and robberies across the country. They are suspected to be involved in the Bengaluru-Guwahati train blast at the Chennai Central station that killed a young software engineer, on May 1, 2014, the July 10, 2014 explosion near Faraskhana and Vishrambag police stations in Pune, explosions in Roorkee in Uttarakhand and in Bijnor in Uttar Pradesh.\n\nThose who were arrested have been identified as Mohammad Aijajudden, Amjad Khan, Zakir Hussein and Mahboob Guddu and Najma Bee (Mahboob’s mother).\n\nThe SIMI members, wanted by the National Investigation Agency (NIA), were arrested from a house in the steel city after a special operation launched on the basis of intelligence inputs provided by Telangana police, a senior government official said. “In the past seven-eight months, a team of Telangana Police camped in each and every town and city of Orissa to track these men. These men were not using any mobile phone or Internet. They were sustaining themselves on the proceeds of their robberies,” said a senior home ministry official.\n\nThe three-hour-long operation involving an exchange of fire was conducted jointly by the tactical unit of Odisha's Special Operation Group (SOG) and Telangana Police at Mala Road, he said.\n\nThe operatives of the banned outfit had escaped from a jail in M.P.'s Khandwa district in 2013 and police teams of multiple States had been looking for them since them.\n\nSeven SIMI cadre had escaped from the jail. While one had surrendered the next day of the jail break, another was caught from M.P. the same year and the rest five had been at large since then. While four were arrested on Tuesday, the fifth one was killed in an encounter with Telangana Police.", 
    "section": "national", 
    "title": "Four SIMI fugitives nabbed", 
    "subsection": "general", 
    "date": "2016-02-18"
}