{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Arun Jaitley says that the media has an unhindered right to report.\n\nUnion Minister for Information and Broadcasting Arun Jaitley on Wednesday condemned the attack on mediapersons at the Patiala House court premises, both on Monday and Wednesday when it was reporting on the sedition case of Jawaharlal Nehru University Students’ Union (JNUSU) president Kanhaiya Kumar, even as members of the Union Cabinet continued to raise the pitch on the JNU issue.\n\n“The media has an unhindered right to report. Attack on mediapersons is highly improper and condemnable”, he tweeted, even as mediapersons were attacked by lawyers within the Patiala House court complex for a second day.\n\nClosure of varsity demanded\n\nBut even as Mr. Jaitley expressed some solidarity with the media, one of his colleagues in the Union Council of Ministers, Minister for Small and Medium Enterprises, Giriraj Singh, demanded the closure of the university.\n\n“The supporters of traitors are the agents of (JuD chief ) Hafiz Saeed. I feel ashamed of Rahul Gandhi and Jawaharlal Nehru University (JNU) should be shut down,” he said. Minister of State for Minority Affairs Mukhtar Abbas Naqvi participated in a protest on the JNU issue, saying, “The anti-national events in JNU are a fight between Break India and Build India.”\n\nHe asked, “Whether supporting anti-national activities and anti-national elements is not sedition? Whether demanding ‘freedom’ of Kashmir, which is an integral part of India, is not sedition? Whether raising slogans such as “ Bharat ki barbadi tak jang rahegi jari ” is not sedition? Are these activities not anti-national?”\n\nMinister for Communications Ravi Shankar Prasad referred to JNU as a premier institute that had produced many eminent thinkers, civil servants and leaders. “We all think that there is also a very eloquent, powerful and constructive alternative voice in the JNU. The country is equally eager to hear that voice,” he said.\n\nThe issue of the JNU campus as an ideological battle ground for the government and the BJP, therefore, remains.", 
    "section": "national", 
    "title": "Jaitley condemns attack on media", 
    "subsection": "general", 
    "date": "2016-02-18"
}