{
    "author": [
        "Sonam Saigal"
    ], 
    "text": "The supplementary charge sheet filed by CBI in the Sheen Bora murder case also includes a statement by theatre personality Alyque Padamsee on December 3, 2015, who told the CBI that he had played no role in marriage of the couple.\n\nIn his statement to CBI, he said he met Indrani and her former husband Sanjeev Khanna in 2000 at CCFC club Kolkata through a common friend. Mr Padamsee said that she told him that she was running a recruiting firm in Kolkata. He later learnt that she had shifted to Mumbai in 2001 to expand her business.\n\nRecounting his meeting with Indrani in Mumbai, Mr Padamsee said, after reaching Mumbai, she contacted him over the phone and expressed her willingness to meet him. Padamsee further said that he agreed to meet her and asked her to join him at Library Bar, at President Hotel in Colaba.\n\n“When we reached, Peter Mukerjea was sitting along with his friends in the said bar and seeing us, he offered me to share his table as we were in queue as there was too much rush in the said bar. Then we went near the table of Peter Mukerjea and I introduced Indrani to Peter and also requested Peter to help her in her business. After that, I decided to go to Oberoi Hotel due to non-availability of separate table. On this Indrani told me that she would not go to Oberoi Hotel and expressed her desire to continue with Peter in the said bar,” reads the statements.\n\nMr Padamsee further said that after the said meeting, he came to know one month after that Peter and Indrani were living together and planning to marry each other. “I did not play any role in her divorce from Sanjeev Khanna. I never went along with her to Kolkata from Mumbai. I also never stayed with her at Kolkata in Grand Oberoi Hotel. No role was played by me in her marriage with Peter. Even I was not invited by them for participating in their marriage held in November 2002. I do not know much about her character and business activity. She never shared details about her past life,” declared Mr Padamsee to the CBI.\n\nSays Indrani contacted him after coming to Mumbai and expressed her willingness to\n\nmeet him", 
    "section": "national", 
    "title": "No role in their marriage: Padamsee", 
    "subsection": "general", 
    "date": "2016-02-18"
}