{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "India and Nepal hope to begin repairing ties as Prime Minister K.P. Sharma Oli makes his first official visit to India on Friday. But as Mr.Oli lands in Delhi on the six-day visit, the two sides are unlikely to dwell too much on the past few months of strain, choosing instead to focus on the earthquake reconstruction effort, Indian power projects in the pipeline and future cooperation.\n\n“Some misunderstandings have emerged in Indo-Nepal relations. My visit will focus on removing them completely and build afresh based on mutual benefit and respect,” Mr.Oli told parliamentarians ahead of the visit, adding, “This visit is to strengthen Indo-Nepal friendship. Not to look back and blame, but to develop trust and understanding”.\n\nIn accordance with tradition, Mr.Oli is making India his first destination abroad after becoming Prime Minister in October 2015.\n\nHe will meet his Indian counterpart Narendra Modi and other leaders in Delhi besides visiting two of India’s worst earthquake-hit areas, looking at the hydropower station built in Tehri, Uttarakhand, and reconstruction projects in Bhuj, Gujarat.\n\n“We want to show how we have been building the hydropower station and how reconstruction work has been carried out in Gujarat,” India’s Ambassador to Nepal Ranjit Rae told the news agency IANS.\n\nEqually clear is the desire on both sides to put events since August 2015 behind them, when India and Nepal fought a public and blistering battle over the new Constitution. India refused to welcome the Nepal Constitution passed in September 2015, as the statute ignored the concerns of groups in the southern Madhes region of Nepal that borders India, and demanded four amendments to be made: on reservations, constituency delimitation, demarcation of provinces and citizenship rights. Nepal’s government, first headed by Sushil Koirala, and then by Mr.Oli, refused to accept amendments under pressure, accusing India of enforcing an economic blockade that crippled the country, and taking the issue to the U.N.", 
    "section": "national", 
    "title": "Oli visit may help repair bilateral ties", 
    "subsection": "general", 
    "date": "2016-02-18"
}