{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Officially throwing open the contest for fighter aircraft once again, Defence Minister Manohar Parrikar said that by the year-end, India would select one or more fighter aircraft which will be manufactured locally by a private company under the Make in India initiative.\n\nThis is in addition to the Light Combat Aircraft (LCA), the production of which is being scaled up.\n\nIndia and France are in advanced stage of talks to conclude an inter-governmental agreement for the direct purchase of 36 Rafale fighter jets. This fighter aircraft will likely be other than the Rafale.\n\n“Under the Make in India process, we may have one or two more jet fighter plants in India by the private sector,” Mr. Parrikar said on Tuesday on the sidelines of a job creation summit organised by the Wadhwani Foundation.\n\nHe said several proposals were under consideration and “through proper process we may select them to make in India.”\n\nMr. Parrikar said this did not mean increasing the defence budget to cater to the purchases. This could be done by reducing defence expenditure in other areas, he said.\n\nAccording to him, his Ministry was in an advanced stage of giving approval to Hindustan Aeronautics Limited for setting up a second assembly line for the LCA to increase the production rate from eight to 16 aircraft per year. The Air Force is expected to induct over 100 of the improved LCAs which will feature an Advanced Electronically Scanned Array radar, mid-air refuelling and improved electronic warfare suite in addition to other minor improvements.\n\nEven as the Rafale talks are on, Mr. Parrikar had on several occasions in the past stated that it was not a replacement for the much smaller MiGs in service which are now being phased out.\n\nWith this companies who lost out in the Medium Multi-Role Combat Aircraft contest (MMRCA) have been pitching their aircraft in anticipation of a comeback into the race.", 
    "section": "national", 
    "title": "Private sector to build fighter jets: Parrikar", 
    "subsection": "general", 
    "date": "2016-02-18"
}