{
    "author": [
        "Aditya Bharadwaj", 
        "K V"
    ], 
    "text": "Wednesday’s arrest is seen as a breakthrough that can help investigators piece together the terror trail and the conspiracy in the low-intensity blast on Bengaluru’s Church Street seen here after the incident.— File Photo\n\nThe SIMI’s Khandwa module busted on Tuesday night in Rourkela, Odisha, is expected to shed more light on the conspiracy behind the December 28, 2014 Church Street blast here, the probe into which, till recently, was believed to have reached a dead end.\n\nWhile Wednesday’s arrest is being tipped as a major breakthrough that can help investigators piece together the terror trail and the conspiracy that culminated in the low-intensity blast in Church Street, which claimed a woman’s life, it follows the recent arrest of a SIMI activist, Alam Jeb Afridi, from the Parappana Agrahara locality in Bengaluru by Telangana ATS.\n\nThough Afridi’s arrest was made more than a year after the blast, his role, investigators said, was only to plant the bomb. The NIA had then claimed that Afridi was working on the instructions of a “handler”, who they suspect is part of the SIMI module busted in Rourkela.\n\nAfridi, suspected to be involved in the 2008 Ahmedabad blast also, was hiding in Bengaluru under the alias Rafeeq and working as an AC mechanic.\n\nAfridi is accused of participating in the December 2007 terror training camp at Vagamon in Kerala. A key member of the now-busted Khandwa module, Sheikh Mehboob alias Guddu is also an accused in the Vagamon terror camp case. Abu Faisal, the leader of the Khandwa module, who escaped from prison in October 2013 but was nabbed in December 2013, had also allegedly participated in the camp.\n\n“Not just that, Afridi is a known associate of Abdul Subhan Qureshi alias Tauqeer, a SIMI leader and one of the organisers of the Vagamon camp. Intelligence reports have recorded a meeting between Abu Faisal, the now-jailed leader of Khandwa module and Tauqeer in 2011. Afridi is either one of the two verticals working for Tauqeer (the other one is suspected to be the Khandwa module) or he may have been directly working for the Khandwa module,” a senior NIA official said.", 
    "section": "national", 
    "title": "Probe may shed more light on Bengaluru blast", 
    "subsection": "general", 
    "date": "2016-02-18"
}