{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "Court to peruse judicial, Assembly records on disqualification of 14 MLAs; hearing to resume today\n\nThe Supreme Court on Wednesday ordered status quo in Arunachal Pradesh till it examined judicial and Assembly records on the disqualification of 14 rebel Congress MLAs by former Speaker Nabam Rebia hours after the Union Cabinet recommended the withdrawal of President’s rule in the border State.\n\nThe decision by a Constitution Bench led by Justice J.S. Khehar came on a plea by Arunachal Congress party leaders, represented by senior advocates Kapil Sibal and Fali S. Nariman, who said Governor J.P. Rajkhowa should be restrained from swearing in a new government till the court decided the constitutionality of the President’s rule imposed on January 26.\n\nThe Bench had, on Tuesday, refused to pass any order on the Congress plea even as the Centre gave a strong indication that it wanted withdrawal of the President’s rule to swear in a new government under the dissident Congress leader Kalikho Pul, who claims to have a majority of 32 MLAs, including the Congress rebels.\n\nThe Bench on Wednesday directed the Secretary General of the Arunachal Pradesh Assembly and the Gauhati High Court Registry to furnish records on the disqualification of the MLAs, preferably by Thursday.\n\n“We are of the view that it is essential to peruse the original record pertaining to the disqualification of the 14 MLAs. The record pertaining to the proceedings conducted by the Speaker Nabam Rebia, under the Tenth Schedule of the Constitution pertaining to disqualification of the 14 MLAs, held on December 14 and 15, 2015, be produced in this court in a sealed cover at the earliest, preferably by 10.30 a.m. on February 18, 2016”, the Bench ordered.\n\nThe Centre said that a constitutional vacuum and a state of “dormancy” could not prevail in Arunachal Pradesh because the Supreme Court was testing the legality of the emergency declared on January 26.\n\nAttorney-General Mukul Rohatgi had assured the Bench that even if a new government was formed, the Supreme Court could later on “annul everything” if it struck down the proclamation of emergency as unconstitutional. Mr. Sibal had countered that when President’s rule is withdrawn, the government earlier in power automatically revives. The hearing will continue on Thursday.\n\nPTI reports:\n\nWhen the apex court resumed the proceeding after lunch, Mr.Nariman and Mr.Sibal mentioned that Union Cabinet had, earlier in the day, recommended revocation of President’s Rule in the State.\n\nThey requested the Bench to consider their plea for interim relief, saying they apprehend that by Thursday morning, a new Chief Minister would be sworn in.\n\nMr. Nariman said the Governor had dismissed the Chief Minister and his Council of Ministers even when the Assembly was in suspended animation.\n\nHe said the Gauhati High Court should not have stayed the disqualification of the 14 MLAs as the chief whip of the party was not impleaded in the case.\n\nCounsel Rakesh Dwivedi, appearing for some rebel Congress MLAs, opposed the plea and said that the petition was not maintainable.", 
    "section": "national", 
    "title": "SC orders status quo in Arunachal", 
    "subsection": "general", 
    "date": "2016-02-18"
}