{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "More than 300 scientists and academics from a range of institutions, including from the Indian Institutes of Technology, Indian Institute of Science and the Indian Institutes of Management, have signed a petition condemning the arrest of Jawaharlal Nehru University Students’ Union president Kanhaiya Kumar and the lack of initiative by the varsity administration in defending its students.\n\nThe academics held the university responsible for failing to protect its students against attacks and charges and urged JNU to take “corrective steps.”\n\nThe petition, which is addressed to Prof. M. Jagadesh Kumar, Vice-Chancellor, JNU, states: “It is ironic that this attempt to suppress dissent occurred at one of the country’s leading universities…. Senior members of the government have aggressively targeted your students. The JNU administration should have protected its students against these attacks and charges that have also vitiated the police investigation. We are deeply disappointed that you have failed to carry out this responsibility.”\n\nUrging the university authorities to protect freedom of speech, the statement says: “We hope that you will take urgent corrective steps to ensure that the police release the arrested students, and also ensure that they drop the unsubstantiated charges against them. We also hope that, in the future, you will take steps to protect freedom of speech on the JNU campus.”\n\nThe petition has been signed by 379 senior academics and scientists, including Jean Dreze of Ranchi University, Speta Wadia and Shiraz Minwalla of the Tata Institute of Fundamental Research, Debasis Sengupta of the Indian Institute of Science and Madhusudhan Venkadesan of Yale University.\n\n“It is ironic that this attempt to suppress dissent occurred at one of the top varsities”", 
    "section": "national", 
    "title": "Scientists, academics protest JNU student leader’s arrest", 
    "subsection": "general", 
    "date": "2016-02-18"
}