{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "senior Home Ministry official indicated on Wednesday that the Delhi Police may have to drop the sedition charges against Jawaharlal Nehru University Students’ Union president Kanhaiya Kumar because they did not have evidence to back their claim that he was shouting anti-national slogans.\n\nThough Delhi Police Commissioner B.S Bassi claimed they did have enough evidence, the Home Ministry official said the Delhi Police had once again written to television channels seeking raw footage of the event on February 9.\n\n“There is some video footage available with the police, but the audio component is missing. It is not clear whether Kanhaiya actually shouted anti-national slogans. If there is no evidence, then the Delhi Police will have to drop the sedition charge when the charge sheet is filed,” the official said.\n\nAccording to officials, the video footage of the event was made available to news channels by certain students.\n\nOnly a couple of TV channels were present at the event.\n\nThe FIR filed by the Delhi Police says a police team was present when two groups of students were leading a march at the JNU. According to the standard operating procedure, it is mandatory for the police to record any protest or gathering where they perceive trouble.\n\nThe official said the metropolitan magistrate did not have the power to grant bail in cases of sedition. If Kanhaiya wants to apply for bail, his lawyer would have to approach the sessions court.\n\nJadavpur varsity incident\n\nUnion Home Secretary Rajiv Mehrishi said on Wednesday that a report had been sought from the West Bengal government after a similar incident was reported at Jadavpur University in Kolkata.\n\nOn Wednesday’s violence at the Patiala House Courts, Mr. Mehrishi said action would be taken against anyone violating the law.\n\n“I have spoken to the Delhi Police Commissioner and asked him to send a detailed report today itself,” he said.\n\nAs for the attack on media persons on Monday, Mr. Mehrishi said an investigation was on and two FIRs had been registered.", 
    "section": "national", 
    "title": "Sedition charge against Kanhaiya may be dropped", 
    "subsection": "general", 
    "date": "2016-02-18"
}