{
    "author": [
        "Baradwaj Rangan"
    ], 
    "text": "Brief notes from the Berlinale film festival on the intricate themes of24 Weeks, Being 17, Death in Sarajevo and... The End\n\nWhen Astrid (Julia Jentsch) learns she’s going to have a child with Down’s syndrome, she storms out of the doctor’s office. Luckily, her boyfriend Markus (Bjarne Mädel) is a good, strong man. “I’m getting two pieces of Danish. One for you, and one for... you,” he smiles. “And then we will sleep on it.” But does the we word apply? What’s at stake, after all, are the rest of her life, her emotions, her chaotic career as a stand-up comic (and all the attendant media attention that will fall on her ).\n\nAnna Zohra Berrached’s 24 Weeks ( 24 Wochen in German; the number refers to the six-month-old foetus) doesn’t judge Astrid, but it’s impossible for us not to be conflicted when we hear how the child will go if she decides to abort (which is legal in Germany). A Potassium Chloride injection will stop the heart, the 1.50-kg corpse will be placed on the mother’s chest for a last goodbye. 24 Weeks make us see – literally see – what the pro-life people are talking about, even if we are pro-choice.\n\n* * *\n\nThe great French director André Téchiné likes to say he doesn’t make movies – he finds them as he goes along. His new film, another one of his high-toned melodramas, is ostensibly the story of two boys – Damien (Kacey Mottet Klein), Thomas (Corentin Fila) – who cannot stand each other. But when Thomas’s mother gets pregnant, he moves into Damien’s house so he can be near the hospital, and... Being 17 ( Quand on a 17 ans ) is divided into three “trimesters”, as we follow the relationship between the boys, who battle sexual confusion with aggression. But this is also about Damien’s mother, whose husband is off fighting a war.\n\nIt’s also about Thomas’s parents, who 17 years after adopting him, are overjoyed at the prospect of a “real child,” though we are told there is no such thing as a “fake child.” It’s the complex web of life, in other words – and Téchiné is a master weaver. The tale may be cliché, but the telling never is.\n\n* * *\n\nDanis Tanovic’s Bosnian drama Death in Sarajevo ( Smrt u Sarajevu ) is set in a hotel on the centenary of the assassination that set off World War I. A high-level EU delegation is expected, and the staff, who haven’t been paid in months, want to use the opportunity to stage a strike. The film, as it follows multiple characters, instantly slots itself as “Altmanesque”. Children practice Ode to Joy , the staff members elect a leader, a French dignitary rehearses a speech even as CCTV cameras spy on him, and Lamija (Snezana Vidovic), the overwhelmed manager’s right hand, is trying to shrug off the moonstruck man she spent the night with.\n\nThe action, mirroring the various hierarchies of politicking and negotiations, glides from the terrace to the lobby to the kitchens and laundry rooms below, and the snaking camerawork lets us see how labyrinthine the situation is. Even if a lot of the content goes over one’s head (the Bosnian Muslim position, the Black Hand, unity of Southern Slavs, Chetnik thugs), the form, the filmmaking , is a model of clarity.\n\n* * *\n\nIn Guillaume Nicloux’s The End – one of the many films much better than those in the competition section – Gerard Depardieu plays a man who goes on a hunt with his dog. It disappears, and looking for it, he loses his way. What is this pond doing here?” he wonders. “Where’s all this water coming from?” More questions follow: Who stole his gun? Who is the strange boy who seems to know his way through this maze? Who is the ashen woman who lands up naked? And are those really scorpions, the kind you find in deserts? What looks, at first, a man-cut-off-from-civilisation drama (like Cast Away or All Is Lost ) slowly morphs into an existential horror movie. Soon, bugs are crawling all over the Depardieu character, but even that’s not as scary (to us) as his slow approach to the woman, in a scene where she’s seen only from the back. We expect her to turn and... But there are no cheap thrills. Only a what-just-happened? ending that you will be discussing for days.", 
    "section": "national", 
    "title": "The complex web of life", 
    "subsection": "general", 
    "date": "2016-02-18"
}