{
    "author": [
        "Madhur Tankha"
    ], 
    "text": "Manish Arora, who has won the French government’s highest civilian honour, talks about his cuts and colours\n\nIn 1939 art critic Clement Greenberg was heavily criticised for using avante garde and kitsch in the same line in his essay ‘Avant-Garde and Kitsch’. Had they seen Manish Arora’s works they would have not. From pop art and street sign to capturing the drama of Indian festivals, Manish Arora changed the vocabulary of Indian fashion like none other.\n\n“Pop art has influenced me the most. Indians love festivals; they are a part of our culture. Growing up in Mumbai Ganesh Chaturthi was an intrinsic part of my life. As for drama, it depends on individual perception and point of view,” says Manish, honoured with the Chevalier de la légion d’ Honneur from the French government in New Delhi this week.\n\nFor fresh ideas, Manish recalls, “I used to read street signs and use some of them while making quirky T-shirts with bold statements. I need a new idea every season but innovation needs to be done keeping in mind that the style remains intact.” Edited excerpts from an interview:\n\nHow does it feel getting Chevalier de la légion d’ Honneur?\n\nThis is the highest honour that you can get from the French government. This is the first one in fashion. It feels special; it feels great to be in the company of Amitabh Bachchan, Shah Rukh Khan, Ravi Shankar, Zubin Mehta, JRD Tata.You now have a deep French connection. Share with us your experience of working as creative director of Paco Rabanne?\n\nI was the first Indian to work as a creative director for a French brand. It was a great learning experience to work there for a year. Living in France gave me so many ideas. The kind of planning that went into preparing ensembles was methodical. I had to adapt to the brand. We shared the same sensibilities in terms of craftsmanship. They have a unique way of putting together metals on the fabric.\n\nFrance knows more about the business fashion than anyone else but as far as embroidery is concerned India has been doing it before them. Though India is young in fashion, it has the oldest embroidery. French use colours differently because of their taste.\n\nInitially, your clothes were dismissed and described as unwearable in India…\n\nIt was something new for them. It took them time to understand my work. I was too forward, advanced for India at that time. Now they understand. One magazine which described my clothes as unwearable changed its opinion by putting me on its cover two years later.\n\nWas this newness of ideas that enabled you to mark your presence in the West?\n\nI was able to break barriers because of my personal style, my colours and how I represented India. It was all about being different from others. I used vibrant colours which nobody was doing at that particular time. Colours still play prominence in my work. I use colours which I love.\n\nHow do you reinvent?\n\nLearning, seeing new things, watching films and refreshing my personality. Travel teaches me a lot. My passport is full. I grasp new things and they come into my work.\n\nIndian designers are now gung-ho about Make-in-India and we see the work of weavers of Banaras getting attention on the ramp.\n\nI have been working with weavers of Banaras for the past eight years. The idea is to make weavers happy and excited . So I ask them to implement new ideas, I ask them to weave new things.\n\nA designer label that you would like to wear?\n\nUnfortunately, I am not in touch with emerging designers. The one I know is Rajesh Pratap Singh. I like to wear his clothes.", 
    "section": "national", 
    "title": "The king of fashion", 
    "subsection": "general", 
    "date": "2016-02-18"
}