{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "The NIA has been closely studying the similarities between the Pathankot and the Samba-Kathua attacks.\n\nAs investigations into the Pathankot airbase attack gathers pace, investigators say that the 2001 Parliament attack convict Afzal Guru has emerged as the common link in at least three attacks on police and Army camps along the Jammu-Pathankot highway in the past one year.\n\nAfzal Guru was hanged in Tihar jail in 2013.\n\nInvestigators have found at least one more letter, written in Urdu, on the body of one of the four terrorists killed in Pathankot. It said the attacks were to avenge Afzal Guru. As reported earlier, an Urdu statement, written in English, was found in the vehicle belonging to SP Salwinder Singh the terrorists had used to reach the airbase on the night of December 31.\n\nSimilar letters were found on the bodies of the intruders gunned down during an attack on a police post at Rajbagh in Kathua, Jammu, on March 20, 2015 and those who attacked an Army camp in nearby Samba on March 21, 2015. All these places are located within 15-20 km of the Pakistan border and along National Highway 1A. The National Investigation Agency (NIA) has found that Chawinda in Pakistan is directly connected to Bamiyal in Punjab, from where the terrorists are believed to have infiltrated into India.\n\nIndia has said that Jaish-e-Mohammad (JeM), a Pakistan-based terrorist outfit, was behind the Pathankot attack. In the case of the other two incidents, no conclusions have been reached so far.\n\n“Both the pieces of paper seized during the Pathankot operation had the same content,” said a senior NIA official. “The Urdu letter in English had Jaish-e-Mohammad (JeM) written on top of the page and it was signed by A.G.S (Afzal Guru Squad). This letter dated December 25, 2015, said the group had planned the attacks to avenge Afzal Guru. The other paper found tucked inside the jacket of one of the four terrorists said much the same thing. Only, this was written in Urdu.”\n\nThe NIA has been closely studying the similarities between the Pathankot and the Samba-Kathua attacks since it took over the investigations. An official said even the rifles used by the terrorists were similar in nature. An identical AK-47 rifle with an Under Barrel Grenade Launcher (UBGL) attached was seized by the J&K police during the Samba and Kathua attacks.\n\n“Through these pieces of paper, they are trying to send out a message that the attacks were to seek revenge for Afzal Guru’s hanging. Similar pieces of paper have been found after all the three attacks. It cannot be a coincidence. There is a larger conspiracy behind it,” said an official.", 
    "section": "national", 
    "title": "The Afzal Guru link in recent terror attacks", 
    "subsection": "general", 
    "date": "2016-02-18"
}