{
    "author": [
        "M Balaganessin"
    ], 
    "text": "The proposed textile park at Padalur is likely to have mainly export-oriented units.— FILE PHOTO: B. VELANKANNI RAJ\n\nThe proposed Textile Park at Padalur on the Tiruchi – Chennai National Highway has evoked good response from the entrepreneurs, with as many as 31 entrepreneurs from different parts of the state expressing interest to set up units.\n\nThe proposal, which hit several bottlenecks with regard to identification of site, was finally fixed at the junction of the Padalur and Irur panchayat on 40.35 hectares — 36.79 hectares of government poramboke land in the Padalur village and 3.56 hectares government poramboke land in Irur village.\n\nThe park is being promoted by State Industries Promotion Corporation of Tamil Nadu (SIPCOT) and the State government had accorded permission to the Directorate of Handlooms and Textiles for the formation of the textile park.\n\nAccording to sources, a meeting of the entrepreneurs would be held soon in Perambalur when their views would be sought on providing amenities and infrastructure.\n\nThe park will mainly cater to the needs of export-oriented ready-made garments units, production of yarn and so on. “We have received applications from units for making T-shirts also,” says the source.\n\nRoad\n\nThe Tamil Nadu Water Supply and Drainage Board would ensure adequate water supply to the Textile park.\n\nThe site is about 1 km away from the National Highway. To access the site, a road is being laid now.\n\nThe cooperation extended by the Padalur village panchayat was crucial for materialisation of the proposal.\n\nOriginally, the park was planned to have been set up at Eraiyur.\n\nBut strong objection from the local residents made the district administration shifted the site to the Padalur where a vast extent of government porrambokke land was available.\n\nHIGHLIGHTS\n\nThe textile park is coming up on a land of 40.35 hectares at Padalur and Irur\n\nIt was originally intended to be set up at Eraiyur and shifted later\n\nExport-oriented units making readymade garments to be set up\n\nA one-km road is being laid from the National Highway", 
    "section": "national", 
    "title": "31 entrepreneurs show interest in Textile Park", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}