{
    "author": [], 
    "text": "The sports quota has enabled many studentsto join good colleges\n\nSports is a great metaphor for life and many colleges in the city have taken it upon themselves to encourage sportsmen and women.\n\nThe sports quota has enabled many students to join good colleges which otherwise they may not have had the access to. Spokespersons of various educational institutions say that it is a matter of pride for them to have strong sporting teams across various disciplines. “We have 26 teams and this year we admitted nearly 160 students through the sports quota,” says B. Navaneethan, Director of Physical Education of PSG College of Arts and Science. One of its students Michael Ajay represented the State in basketball even when he was in school and says he always knew he had a fighting chance to get into a good college because of this background.\n\nHe is studying BSc. Michael says, “The sports quota is a great opportunity especially for those who come from economically deprived backgrounds and rural areas. Not only do they get the benefit of a good education, they also stand a great chance of getting government employment.” He says marks are not that important if you are good at a sport.\n\nAccording to Mr. Navaneethan, colleges compete during admission time to pick the cream of sports students. Athletes, basketball and volleyball players, shooters, swimmers…\n\n“The college benefits from their presence and they in turn stand a very good chance of getting selected for government and bank jobs,” he says.\n\nSri Krishna Institutions that is known for churning out national and international players in various disciplines, has eminent coaches who train the students.\n\nCEO K. Sundararaman says, “We invite sports coaches of various disciplines from across India to furnish names of students who are athletes, basketball and volleyball players and cricketers. The applicants come to our college for three days where there is a selection process under the supervision of eminent coaches and selectors. Those picked get free hostel facilities besides a complete waiver of tuition fees,” says Mr. Sundararaman.\n\n“We ensure that they get a degree in three years and we have academic tutors for them so that they do not lag behind in their studies when they go out for championships,” he says. Sri Krishna has Dronacharya G.E. Sridharan who mentors the volleyball players.\n\nDr. NGP College of Arts and Science is another college in the city where sports, particularly athletics, is very high on priority. Nirmala College for Women, Bishop Appaswamy College of Arts and Science, GRD College of Science and Commerce, Karunya University and a host of other colleges in the city have promoted sports and according to a sports enthusiast, “Few other districts are so pro active and encouraging when it comes to sports than Coimbatore.”\n\n(Reporting by\n\nPankaja Srinivasan)", 
    "section": "national", 
    "title": "A sporting chance for education and career", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}