{
    "author": [
        "S Senthalir"
    ], 
    "text": "Public have been invited to voluntarily test for STI/HIV\n\nStudents participating in the AIDS awareness rally organised by the AIDS Control Society in Puducherry on Wednesday.— Photo: S.S. Kumar\n\nPeople can avail the free voluntary testing for STI/HIV in Puducherry. Beginning from February first week, the Pondicherry AIDS Control Society has started a two-month communication campaign inviting the general public to voluntarily test for STI/HIV.\n\nThe campaign was flagged off by Director of Health and Family Welfare Services K.V. Raman at the Directorate of Health and Family Welfare Services on Wednesday.\n\nIn order to reach out to people in the village, at least 100 cultural programmes will be organised in Puducherry, 25 in Karaikal and Mahe and pamphlets would be distributed.\n\nDr.S.Jayanthi, Project Director, AIDS Control Society said:\n\n“This is the first time in Puducherry that the intensive campaign for voluntary testing for STI/HIV is being held for the general public. Previously, only the high-risk groups would be targeted. People should come forward voluntarily to test for HIV status and the results would be kept confidential.\n\nFree services\n\nIf found positive, they can avail free medical services at the major government hospitals for a healthy and long life.”\n\nShe added that without any hesitation, people could get free testing done at Indira Gandhi Government General Hospital and Postgraduate Institute, Jawaharlal Institute of Postgraduate Medical Education and Research (JIPMER), Indira Gandhi Medical College (IGMC), CHCs at Mannadipet and Karikalampakkam, Rajiv Gandhi Women and Children Hospital and can also avail the service at the 12 Primary Health Centers (PHCs).\n\nPeople who would want to test for Sexually Transmittable Infections (STIs) can go to the hospital at Odiansalai, JIPMER, IGMC, Rajiv Gandhi Women and Children Hospital, government hospital in Karaikal. This is a curable disease and patients can avail treatment at the hospitals.", 
    "section": "national", 
    "title": "AIDS control society begins two-month campaign", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}