{
    "author": [
        "S Senthalir"
    ], 
    "text": "(Clockwise) With the help of the pictures of Hindu temple idols available in the archive section line drawings are created through CorelDraw. One of the pictures created for the software. Photographs of Sivakamasundari idols archived in the IFP and the façade of the French Institute of Pondicherry.— Photos: IFP and T. Singaravelou\n\nFrench institute is developing a mobile application, which is scheduled for launch by year-end\n\nhen we go to a Hindu temple, how many of us are informed enough to identify the icons of Hindu gods and goddesses.\n\nIt is a specialized field of iconographers who can describe in detail about these icons with different features.\n\nSoon, this subject is not going to remain confined to iconographers alone.\n\nA mobile phone application to identify any icon from Hindu temples is being developed.\n\nThe French Institute of Pondicherry (IFP) is developing icon-identification software to facilitate students and common public to identify and learn about the hundreds of icons in the Hindu Temples in South India.\n\nIFP Director Pierre Grard said that this software is being modelled using IDAO (Identification Assistée par Ordinateur).\n\nThe IFP had developed software to identify plants using the features of the plants and the same methodology would be followed to identify icons as well.\n\n“The online identification will provide options of different attributes of the idols. The matching attribute could be selected through the options available. This application can be downloaded using smart phones or iphones and anyone can access this,” he said.\n\nK. Ramesh Kumar, photographer, working in the photo archive section of IFP said that with the help of the pictures of Hindu temple idols available in the archive section, line drawings are created through CorelDraw.\n\n“Many options related to the posture, attributes of the icon or the number of heads, shape of the head would be available. Looking at these line drawings, they can select the suitable one. Each feature selected through this process will lead to the formation of a whole figure of the icon of god or goddesses,” he said.\n\nHe added that once the right icon is identified, the name and description of that particular icon would also be displayed.\n\nDr. N. Murugesan, researcher, IFP, told that pictures of 230 icons of Hindu temples are available and they have already prepared the drawings of more than 125 Hindu icons.\n\nThis will help mainly students and foreigners to learn more about the icons of Hindu Temples.\n\nIFP director added that the application will be ready by the year end.\n\nThis will help mainly students and foreigners to learn more about the icons", 
    "section": "national", 
    "title": "An apt app to identify Hindu icons", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}