{
    "author": [
        "S Prasad"
    ], 
    "text": "Bharati’s memorial before renovation and its 3D view.Photos: S S Kumar and Special Arrangement\n\nThe restoration was taken up by INTACH at a cost of Rs.1 crore\n\nOne of the city’s famous heritage structures and residence of Tamil poet and nationalist Subramania Bharati which remained closed for the last seven years is now all set to sport a new look. The renovated Mahakavi Bharathiyar Museum-cum-Research Centre will be inaugurated and be open to public from Friday.\n\nThe restoration was taken up by the Indian National Trust for Art and Cultural Heritage (INTACH) in 2014 at a cost of Rs.1 crore without disturbing the original features of the heritage building.\n\nThe Mahakavi Bharathiyar Memorial Museum, a Grade I heritage structure, is a synthesis of French colonial and traditional Tamil-style architecture. The façade is in vernacular architectural style with a ‘thinnai’ and a ‘thazhvaram’.\n\nTraditional materials\n\nThe building has been renovated using traditional materials like Madras Terrace roofing with rafter and beams. INTACH said that this part of the Tamil precinct had been identified as a special zone owing to its high concentration of listed heritage buildings.\n\n“The existing main building served as Bharati’s residence. The adjoining building which the government acquired in 2005 would house rare memorabilia including photographs and literary works of the poet during the freedom struggle and would be a museum-cum-research centre. The main building would house a seminar hall with audio visual and wi-fi facilities for research scholars,” A. Arul, senior architect of INTACH, told The Hindu.\n\nOver 17,000 books and journals related to Bharati and rare manuscripts which were temporarily housed in the Subbiah memorial house and library on Vellala Street due to the restoration work have been shifted to the annexe building.\n\nDelays\n\nThough the house was closed to tourists in November 2009, the renovation work was hampered by procedural delays and a tug of war between the Department of Art and Culture and the Public Works Department.\n\nUltimately, the territorial government recommended restoration by INTACH and the construction of a new building adjacent to it.\n\nThe house located on Eswaran Kovil Street in the heart of the town had been the centre of literary activities of the poet during his stay in Puducherry.\n\nDuring his political asylum in Puducherry from 1908 to 1918, he was given full liberty by the French regime and Bharati penned a number of patriotic songs and also published the weekly India .\n\nHe had also penned his “Paanjali Sabatham, Kuyil Paatu and Kannan Paatu” here.\n\nThe Government acquired the house in 1973 and converted it into a memorial and research centre.", 
    "section": "national", 
    "title": "Bharati’s home to be opened tomorrow", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}