{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "He picked up a call while the phone was on charge\n\nA nine-year-old boy was badly injured a few days ago, reportedly due to a mobile phone exploding in his face. According to reports, the phone exploded when he picked up an incoming call when the device was charging. He suffered burns on his right hand, face and both eyes. The child is now being treated at the Government Ophthalmic Hospital in Egmore.\n\nAccording to Waheeda Nazir, director and superintendent of the hospital, the boy, Dhanush, a class IV student from Maduranthakam, came in to the hospital on Saturday morning.\n\nSevere injuries\n\n“The incident occurred on Friday night. His parents had first taken him to the Chengalpattu government hospital, from where he was referred to the Government Kilpauk Hospital for the treatment of his burns and then, he came to us. In his right eye, the cornea was damaged and there was a cataract. In his left eye, the globe was ruptured. The injuries are very severe,” she said.\n\nNirmala Ponnambalam, head of the burns and plastic surgery department at Government Kilpauk Hospital, said the child had suffered first and second-degree burns on his hand and face. “We gave him first-aid and immediately sent him to the ophthalmic hospital for his eyes to be treated,” she said.\n\nAt the ophthalmic hospital, under general anaesthesia, doctors grafted a patch from a cadaver donor cornea onto Dhanush’s right eye, and gave shape to the globe, she said.\n\n“We also sutured the left eye. At the moment, he has vision up to 3 metres in his left eye, but we have to wait and see what happens with his right eye. After about 15 days, we may operate on the cataract, try and put in a lens, and wait and see if vision can be restored,” she said.\n\nThis is the first injury caused by a mobile phone explosion that the hospital has seen.\n\nDr. Waheeda said people must be warned not to use their phones when they are charging.\n\nThe boy suffered first and second-degree burns on his hand and face, said doctors", 
    "section": "national", 
    "title": "Boy injured as mobile phone explodes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}