{
    "author": [
        "Dennis S"
    ], 
    "text": "Ever since the AIADMK government headed by Chief Minister Jayalalithaa came to power on May 16, 2011, the Chief Minister’s Special Cell, functioning from the Secretariat, has received about 17.55 lakh petitions from the people and has disposed of 17.16 lakh of them with a disposal rate of 98 per cent.\n\nHowever, about 10 lakh of total petitions received have been rejected, since they were either anonymous letters targeting individuals for settling personal scores or had sought for remedies beyond legal possibilities such as seeking pattas for poromboke lands or seeking government jobs of their choice.\n\nThough the number of petitions received was highest in 2012 with four lakh petitions, it has been gradually decreasing since then. All the petitions received between 2011 and 2014 have been disposed of and only six per cent of the ones received last year are pending for disposal, informed sources said.\n\nPetitions received in the Cell have been over a variety of issues, ranging from employment to assistance for medical complications, to basic civic amenities such as drinking water and roads, to old-age pension. Among the petitions dealt with efficiently was a case in which a widow and her daughter were evicted from their ancestral house by the former’s in-laws after her husband’s death. On persuasive action from the CM’s Special Cell, the widow was able to get her legal share of the property.\n\nThere have been cases in which the Cell has gone out of its way to help people without waiting for a petition to be filed. In one such case, officials at the Cell noticed a youth with osteoporosis struggling to get a seat in engineering college from a newspaper report and helped him get admission. He is in third year now and his tuition fee is being supported by the State government, sources said.\n\nThe number of petitions\n\nreceived was highest in 2012\n\nat four lakhs", 
    "section": "national", 
    "title": "CM’s Special Cell disposed of 98 per cent petitions", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}