{
    "author": [
        "Staff Reporter"
    ], 
    "text": "One of the 11 persons appointed as members to the Tamil Nadu Public Services Commission (TNPSC) last week was a district judge who was “compulsorily retired” from judicial service, the DMK has alleged in a petition filed in the Madras High Court on Wednesday seeking to quash the appointments.\n\nThe TNPSC is the apex body that conducts competitive examinations, interviews candidates and recruits them to various posts in State government, including Group I officers.\n\nIn his petition, DMK organising secretary T.K.S. Elangovan contended that the appointments are in violation of various dictates laid down by the Supreme Court. Senior counsel P. Wilson who appeared for the petitioner said, “The 10th respondent in the petition, V. Ramamurthy, who was a District Judge and who has been compulsorily retired by the High Court from judicial service can, at no stretch of imagination, be found fit to be appointed to a constitutional post.”\n\nSuch an act of the government cannot be countenanced in law and the office of the Member of the State Public Service Commission is being belittled, the petition said.\n\nThis is the second petition to be filed on the issue. On Tuesday, the PMK’s legal wing had moved a similar plea.\n\nAdmitting the petition, Justice R. Subbiah directed the State government to file a counter affidavit by March 4 and ordered notice to the 11 members and the TNPSC.\n\nThe petitioner, who is a former Member of Parliament, submitted that the 11 individuals who were appointed as members of TNPSC are not persons of impeccable character having administrative skills, high degree of calibre, competency and the requires integrity and hence they are not qualified to be appointed for the posts.\n\nClaiming that the appointments are void ab initio and illegal, the petitioner prayed the court to grant an interim stay against the operation of the appointments pending disposal of the petition.\n\nOn Tuesday, the PMK’s legal wing had also moved a similar plea\n\nin High Court", 
    "section": "national", 
    "title": "‘Compulsorily retired’ judge is member of TNPSC: DMK", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}