{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Salem District Central Cooperative Bank has extended farm loans to the tune of Rs. 300.49 crore, both short term loans and medium term investment credit, so far during the current financial year 2015-16 to the farming community in the district.\n\nThe loans have been extended to a total of 55,107 farmers through the primary agricultural cooperative banks.\n\nThe bank had set a loans disbursal target of Rs. 342.40 crore for the current fiscal.\n\nThe Central Cooperative Bank has extended short term loans to the tune of Rs. 282.95 crore (target Rs. 322.40 crores); and medium term loans of Rs. 17.54 crore (target Rs. 20 crore) till January 25.\n\nAccording to official sources, the primary agricultural cooperative banks have extended short term loans of Rs. 4.34 crore to 880 paddy farmers; Rs. 49.99 crore to 8,405 sugarcane farmers; Rs. 59.43 crore to 12,456 tapioca farmers; Rs. 78.10 crore to 14,125 plantain farmers, Rs. 90.62 crore to 16,376 turmeric and vegetable farmers and Rs. 45.96 lakh to 130 groundnut farmers from April 1 2015 to January 25, 2016.\n\nThe primary agricultural cooperative banks have sanctioned medium term loans of Rs. 17.54 crore to 2,735 farmers of different categories.\n\nWhile Rs. 4.98 crore was sanctioned to 891 farmers for rearing goats; Rs. 4.05 crore to 689 farmers for rearing cattle; Rs. 2.65 crore to 388 farmers for the purchase of farm animals; Rs. 54.30 lakh to 41 farmers for setting up milk dairies; Rs. 23.4 lakh to three farmers for the purchase of tractors; Rs. 30.22 lakh to 45 farmers for setting up drip irrigation etc.\n\nCompensation\n\nOnly recently the cooperative societies in the district had disbursed a compensation of Rs. 4.29 crore to 12,466 farmers whose crops suffered damages during the recent heavy downpour experienced by the district.", 
    "section": "national", 
    "title": "Cooperative bank extends Rs. 300-crore farm loans", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}