{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Passengers of government buses desire an exclusive corridor for swift passage at the toll plazas along the Salem-Coimbatore National Highway.— PHOTO: M. GOVARTHAN\n\nTravelling public are peeved at what they describe as the ‘apathy’ of the Tamil Nadu State Transport Corporation to the inconveniences they experience due to the inordinate delay caused at toll plazas during peak hours at the toll plazas along the Salem-Coimbatore National Highway.\n\nSeveral hundreds of office-goers travelling to and fro daily between Erode and Coimbatore get held up at the toll plazas during the morning hours. The onus is on the TNSTC to prevail upon the National Highways Authority of India to instruct the concessionaires to operate an exclusive passage for government buses, a daily passenger said.\n\nThe purpose behind operating point-to-point Ero 100 buses stands negated. These buses are supposed to transport passengers from the Corporation Bus Stand in Erode to Gandhipuram Bus Stand in Coimbatore within 100 minutes. But, the buses waste at least half an hour at the two toll plazas in between.\n\nThe problem, according to the passengers, get acute when the queues get longer due to closure of a few passages by the toll plaza operators, apparently due to manpower shortage. Boards seeking staff for billing and other operations could be found at the toll plazas. According to a driver of a TNSTC bus, the staff appointed at the toll plazas do not remain for long at the toll-plazas as the remuneration is insufficient.\n\nThe public transport corporation buses are allowed through the toll plazas under ‘multiple-entry’ category for payments made on a monthly basis, it is learnt.\n\n“It is highly improper for the TNSTC to let down its passengers, particularly office-goers. Blocking a passage exclusively for TNSTC buses will provide a lasting solution,\" Ramesh, a daily commuter said.\n\nThe Divisional Manager - Commercial of TNSTC, Erode, did not respond to phone calls.", 
    "section": "national", 
    "title": "Delay during peak hours at toll plazas irks bus passengers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}