{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "The Asian Spotted Swallow Tail Moth (‘Micronia aculeata’) seen in the foothills of the Pachamalai nature reserve.\n\nA city-based ecologist has claimed to have to spotted a diurnal (daytime) moth, more common to the Western Ghats and north-eastern India at the foothills of the Pachamalai nature reserve, near Thuraiyur during the recent rainy season.\n\nQ. Ashoka Chakkaravarthy, ecologist and assistant professor of Environmental Science, Department of Foundation Courses, St. Joseph’s College has recorded the presence of the Asian Spotted Swallow Tail Moth (‘Micronia aculeata’) over a 25-day study period in December and January.\n\n“There is very little data on this particular species, which makes its detailed study very difficult,” Mr. Chakkaravarthy told The Hindu . “While there is a lot of literature on the flora and fauna of the Western Ghats, not much exists on that of the Eastern Ghats,” he said.\n\nMoths are the cousins of butterflies, both of them belonging to the order “Lepidoptera”.\n\nThere are approximately 15,000 to 17,000 species of moths in India, active both during day and night.\n\nFound in India, China, Taiwan, Sri Lanka, and Taiwan, the Asian Spotted Swallow Tail Moth is mostly white in colour. The adult of this species has speckled pale brown wings with two faint darker sub-marginal bands. Each forewing has a hooked tip. On each hind wing there is a short tail with a black spot.\n\nThe ‘Uraniidae’ are a family of moths containing four sub-families, 90 general, and roughly 700 species.\n\nMoths constitute an important part of the food chain of insectivores such as bats, some species of owls, lizards, and rodents.\n\n“The tendency of moths and butterflies to mimic other species can confuse even the experts while identifying the exact insect,” said Mr. Chakkaravarthy, who has been studying them and maintaining photographic evidence for over two years.\n\n“Around a hundred species of the butterflies are on the verge of extinction in India. New and accurate study material on butterflies and moths will be of great use to lepidopterists everywhere,” he added.", 
    "section": "national", 
    "title": "Diurnal moth spotted in Pachamalai reserve", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}