{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Earth Trust has opened a new organic shop on Thalayatumund Road in Udhagamandalam on Wednesday.- Photo:M.Sathyamoorthy\n\nA U.K. born health professional Vanya Orr came to India on a mission to find her Colonial roots in The Nilgiris. But she ended up finding a local population that had lost its indigenous ways of cultivation and traditional healing techniques, which was once in sync with nature. This made her start The Earth Trust (ET), an NGO, to restore the land to its God-given fertility.\n\nET, which has created awareness in over 100 villages and trained over 5,000 farmers in various parts of The Nilgiris, opened a new shop off the Ooty – Coonoor Road near Crescent Castle School on Thalayatumandu Road on Wednesday.\n\nAccording to a release, besides hill vegetables, fruits and herbs, the new shop also offers wheat, rice, millets pulses, oils, spices and condiments. It will also make produce from warmer climes available to locals.\n\nThe aim is to make it a one stop shop that links the small farmer and tribal to the consumers who wish to avoid the slow poisoning of their families and environs.\n\nThey have also formed Bio-gain, a co-operative of 30 odd small farmers, where the prices are decided every three months, by the farmers themselves.\n\nIn a bid to convert larger acreage to organic cultivation, Earth Trust now undertakes year-long training and hand holding of medium and large farmers with a ‘buy back’ agreement for their produce. It achieves this through its farming team of experts by providing seeds, seedlings and natural manure from the ET Resource and Biodynamic farms.\n\nAll Nilgiri farmers can avail of this service. The ET teams visit every supplying farmer three times a month to ensure credibility/ authenticity of produce.\n\nM.Veeramani, Deputy Director Agricultural Business, Tamil Nadu Horticultural Research Station (HRS), Ooty and N. Selveraj, Professor of Horticulture, both ardent advocates of organic agriculture, inaugurated the new outlet. The Earth Trust can be contacted atearthtrust@gmail\n\n.com, 97877-49840.", 
    "section": "national", 
    "title": "Earth Trust opens organic outlet", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}