{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Disagreeing with a view taken by a single judge, a Division Bench of the Madras High Court Bench here has held that the management of a private company cannot claim an absolute right to move out finished goods from its factory under lockout since not only capital and raw materials but also employees’ labour goes into manufacturing a product.\n\nA Division Bench of Justices V. Ramasubramanian and N. Kirubakaran made the observation while setting aside an order passed by the single judge who had concluded that employees had no right to prevent their employer from moving out manufactured products just because they suspect the management of attempting to make false claims of suffering losses in the business.\n\nDisposing of a writ appeal filed against the single judge’s order by the general secretary of a trade union at a private firm that manufactures industrial boilers in Tiruchi, the Division Bench agreed with senior counsel V. Prakash, appearing for the appellant, that “if strike is a weapon in the hands of the workers, then lockout is a corresponding weapon in the hands of the management.” Observing that the single judge’s view “does not reflect the correct position in law,” the Bench pointed that the validity of the company’s lockout had been questioned in separate proceedings under the Industrial Disputes Act and conciliatory efforts too had failed.\n\n“In such circumstances, the management does not have an absolute right to take away all the materials.\n\n“After all, any product manufactured in a factory has several inputs such as capital, labour, raw materials and services rendered by various parties. When the salary payable to the workers has not been paid, even for the period immediately preceding the date of the lockout, the management cannot claim any absolute right to take away the goods,” the Division Bench said.\n\nNevertheless, since the company had already moved a part of the goods on the basis of single judge’s order, the judges ordered that Rs. 80 lakh deposited by it in a fixed deposit should be disbursed to the employees of the firm towards salary arrears and directed the Deputy Registrar (Administration) of the High Court to oversee the task of disbursement.", 
    "section": "national", 
    "title": "Employers cannot claim absolute right to move out finished goods: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}