{
    "author": [
        "K Manikandan"
    ], 
    "text": "An escalator at the western side of the Egmore railway station will be completed by the end of March—Photo: B. Jothi Ramalingam\n\nSouthern Railway is constructing escalators at Egmore railway station for the convenience of suburban passengers.\n\nThere is a staircase at the eastern side of the station and though there is a ramp at the western side, differently abled and senior citizens still find it tough to have access to suburban platforms. The escalators will help them, officials said.\n\nLong-distance trains\n\nThe escalators are being constructed as part of the Passenger Amenities Improvement project of Southern Railway, officials said. Escalators were first installed at the Egmore station in 2006 to help passengers arriving at the Gandhi Irwin Road side of the station and board long- distance trains on platforms 4, 5 and 6.\n\nSince then, there has been a persistent demand for building similar facilities for the benefit of suburban commuters too.\n\n“Escalators were first built at Egmore in 2006 as part of a Rs. 4.4 crore project to improve amenities. Later, Tambaram was the first station on the suburban sector to get escalators in 2013,” said Southern Railway sources.\n\nJ. Sabari, a commuter, said Chennai Metro Rail Limited was raising the standard of amenities in railway stations in the city and the suburban train network should not lag behind.\n\nHe said the ramp on the western side of the station made it easy for elderly commuters to reach the suburban and main line platforms, but an escalator will be even more convenient for passengers, especially the elderly travelling with heavy baggage. Over 22,000 commuters used suburban services at Egmore, while 50,000 people used long-distance trains, including express trains originating from here and those passing through, officials added.", 
    "section": "national", 
    "title": "Escalators for suburban passengers at Egmore", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}