{
    "author": [
        "R Srikanth"
    ], 
    "text": "A student was recently injured when he attended a call on a cell phone plugged to a charger\n\nThe invasion of the market by unbranded cell phone products that do not have the ISI label poses a great risk to people. Mobile accessories sold at Ritchie Street —Photo: R. Ragu\n\nPlanning to save money by purchasing cheap, fake cell phone batteries and chargers? Think twice as they can have disastrous consequences.\n\nRecently, a class IV student was injured and his vision affected when he attended a call on a mobile phone that was on charge. The incident is most likely to have been caused by a fake battery, says Gulfaraz Makani, director, Enforcers of Intellectual Property Rights (EIPR). “Many times, instead of buying the original batteries, people get lured into purchasing duplicate ones which have the stickers of the original company,” he says.\n\nHe adds that such batteries may cause short-circuits and even explode due to over-heating. “The products are made locally, but are packed well and stickers of popular brands are stuck on the products to deceive gullible people. Consumers have to be careful while buying such products,” he adds.\n\nThough electrical safety experts are not clear about what exactly might have caused the cell phone to burst, they do emphasise that people should never answer any mobile phone that is being charged. Experts also warn people not to recharge cell phone batteries during the night as there may be variations in the power voltage.Technical snags\n\nAn engineer working in a mobile phone manufacturing company says the printed circuit board - the mother board, can catch fire if there is water or moisture content in the phone. He also cautions against charging cell phones after they have fallen in water. A senior official of Tamil Nadu Generation and Distribution Corporation (Tangedco) says mishaps can happen due to technical snags in adaptors or charging wires.\n\nCharging batteries over a long time can affect the Lithium-ion batteries.\n\nThe invasion of the market by unbranded cell phone products that do not have the ISI label poses a great risk to people. EIPR along with Video Piracy Cell (VPC), CB-CID, Chennai Unit-I, conducts raids at shops in the city in an attempt to keep spurious products and mobile phone accessories away from the market.\n\n“We gather information about the areas in which such products are sold and then lodge a complaint with the VPC, adds Gulfaraz.", 
    "section": "national", 
    "title": "Fake mobile accesories may be lethal", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}