{
    "author": [
        "R Sujatha"
    ], 
    "text": "Activists against sex-selective abortion say the Union Minister Maneka Gandhi’s reference to an “alternative point of view” that every pregnancy should be registered and the parents informed of the gender of the foetus is unfeasible.\n\nThe Minister had on Monday said that some stakeholders believed that such registration would help to check female foeticide.\n\nThe Pre-Conception and Pre-Natal Diagnostic Techniques (PCPNDT) Act currently prevents scan centres from revealing the gender of the foetus. Though very few violators have been punished so far, activists say registering the foetus is not the answer.\n\nThey point out that despite a robust birth and death registration Act abortions have not fallen drastically. Scientifically too the suggestion cannot work as gender of the foetus can be determined with some certainty only in the 18th to 20th week of pregnancy and an abortion that is done beyond 20 weeks could harm the woman, they add.\n\nM. Jeeva, convenor of Campaign Against Sex Selective Abortion says the village health nurses (VHN) attached to primary health centres, who are empowered to record all pregnancies do not do so.\n\n“A VHN covers a population of 40,000 to 50,000. If 10 women get pregnant then the logical end is that their birth/death should be known. But not all data on abortions are recorded,” he says.\n\nThree years ago the National Rural Health Mission devised a solution by making it mandatory for every pregnant woman to register at the scan centre.\n\nShe would have to bring the form with her during every scan.\n\nBut the process was abandoned within six months.\n\nS. Elango, former director of Public Health and president of Tamil Nadu chapter of Indian Public Health Association says the element of surprise to the parent is recognition of Nature.\n\n“A foetus registered as boy could turn out to be a girl at birth. Also, how will the government take forward the concept? Who will register the pregnancies, where will they be registered and will there be an age limit on pregnancies,” he asked.", 
    "section": "national", 
    "title": "Foetus registration is not feasible: activists", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}