{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Nellai Cancer Care Centre has so far screened 12,570 patients\n\nThe Nellai Cancer Care Centre has planned to conduct a free cancer screening camp for the public on its premises near Krishna Hospital on North High Ground Road between 10 a.m. and 5 p.m. on Saturday.\n\nAccording to B. Sankar Mahadevan of Udhavum Ullangal, the NGO which has established the centre along with Cancer Institute, Adyar, and Krishna Hospital, said the 2016 theme of world cancer awareness day is ‘We can, I can’, which would explore how everyone could do their duty to reduce global burden of cancer.\n\nAbout 30 per cent of cancer deaths were due to the five leading behavioural and dietary risks viz. high BMI, consumption of low fruits and vegetables, lack of physical activity and use of tobacco and alcohol.\n\n“Nellai Cancer Care Centre has so far given cancer awareness to 41,869 patients and screened 12,570 patients. We have diagnosed 46 cancer cases, and among them 20 are breast, 16 are cervix and other malignancy,” Mr. Sankar Mahadevan said.\n\nIn the cancer awareness day organised by Radiation Oncology, Surgical Oncology and Surgery Departments of Thoothukudi Medical College Hospital on Wednesday, over 250 persons participated.\n\nAn exhibition highlighting the causes of cancer, demonstration of self-breast examination, good dietary practices, etc., was conducted by the nursing students of Thoothukudi Medical College Hospital, Sivanthi Adhithanar and St. Anne’s Nursing Schools.\n\nAwareness lectures on early detection of breast cancer, stomach cancer, uterine and cervical cancers were delivered by Dr. Lalitha Subramaniam, Dr. K. Karunakaran, Dr. D. Amudhan and Dr. U. Insuvai. Warning signs of cancers like lump in the breast, nipple discharge, rectum bleeding, post menopausal bleeding, non-healing ulcers in oral cavity and burning sensation in abdomen were stressed by the speakers.\n\nThe participants had a rare opportunity of interacting with long term survivors.\n\nMedical Superintendent Dr. K. Rajendra Rethinam, Resident Medical Officer Dr. Silas Jeyamani and professors of various departments participated in the awareness programme.", 
    "section": "national", 
    "title": "Free cancer screening on Saturday", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}