{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The project will adversely affect lands of 1,500 farmers: Dr. Anbumani\n\nPattali Makkal Katchi’s Chief Ministerial candidate Anbumani Ramadoss has faulted the State government for its “failure in proper presentation” of the adverse impact on farm land in western region in the GAIL underground pipeline project case in the Supreme Court.\n\n“The lackadaisical approach of the State government has led to the Supreme Court giving its nod to the project that would affect over 1,500 farmers in the western region,” Dr. Anbumani told reporters here on Wednesday.\n\nStating that the pipeline could be taken through Kerala to Karnataka, he said even otherwise it could be laid along the national highways without affecting farm land. “The only issue is that it would incur additional expenditure,” he said.\n\nThe project that aimed to take the pipeline through districts in the western region, including Coimbatore, Erode, Tirupur, Salem, Krishnagiri and Dharmapuri, will adversely affect farm lands of 1,500 farmers, he said. Besides, it also faced the prospect of causing environmental problem, he said pointing to a fire accident that occurred in Andhra Pradesh.\n\n“Still, the Centre can scrap the alignment,” he said. The Chief Minister, Jayalalithaa, should take up the issue with the Prime Minister, he said.\n\nStating that the Sagayam Committee, in its granite-mining related report, had said that the State exchequer had incurred huge loss in illegal granite quarrying in Madurai district, Dr. Anbumani wondered why the Dravida Munnetra Kazhagam president, M. Karunanidhi, and its treasurer M.K. Stalin were silent on the issue.\n\nDr. Anbumani also blamed the State government for its failure in bringing AIIMS-like multi-speciality hospital at Thoppur for which he (Dr. Anbumani) had laid foundation stone in the past when he was the Union Health Minister.\n\nProject shelved\n\n“The Centre had allocated Rs. 150-crore in the first phase. The plan was to construct a most modern hospital like AIIMS in New Delhi at a cost of around Rs. 1,000 crore that would have benefited the people of south Tamil Nadu. But after the change of guard in the State, the project had been put on the backburner,” he said.\n\nThe construction of a new building near Government Rajaji hospital, was not adequate for such a huge health-care facility proposed in the past, he said.", 
    "section": "national", 
    "title": "GAIL pipeline: Anbumani faults State for SC verdict", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}