{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Farmers in the district have not lost hope about the State Government’s capability to prevent GAIL (Gas Authority of India) from laying natural gas pipelines across the fields, in the wake of the Supreme Court order on Tuesday favouring the company.\n\nAccording to representatives of farmers’ associations here, Tamil Nadu, at this juncture, must mobilise the support of other States and pressurise the Central Government to withdraw amendments made to the Petroleum and Minerals Pipeline Act 1962 in 2012.\n\nWaters sources\n\nLeave alone the destruction of wells and water sources along the alignment to a breadth of 60 feet and disruption caused to the agricultural ecosystem, the proposed amendments, farmers say, puts them at the risk of stringent punishment if the pipeline is wantonly damaged by miscreants.\n\nCiting the Bengaluru-Dabhol pipeline project for which, the farmers point out, a realigned route was taken to prevent the pipeline from traversing through agricultural fields beyond five km. length, K.V. Ponnaiyan, president, Tamil Nadu Swadeshi Farmers’ Association, wondered why a separate yardstick is adopted for laying of the pipeline in Tamil Nadu. Productivity of the fields where the pipelines are laid would go down, precipitating the economic crisis the farmers are already in, according to Mr. Ponnaiyan.\n\nLand values\n\nAlso, the land values will plumet. Farmers deem ‘forcible’ laying of pipeline worse than full-fledged acquisition, he said, urging the Central Government to consider the collective plea of the farmers to realign the route along the National Highways passing through the seven districts: Coimbatore, Tirupur, Salem, Erode, Namakkal, Dharmapuri and Krishnagiri.\n\nFarmers in the region will stand by whatever step the State Government takes to prevent destruction of agricultural fields due to the project, S. Periyasamy, district president of Tamizhaga Vivasayigal Sangam said.\n\nLivelihood\n\nof farmers\n\nThe Supreme Court order was tantamount to crushing livelihood of farmers, Mr. Periyasamy said.", 
    "section": "national", 
    "title": "GAIL verdict: farmers rally behind State Govt. for next step", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}