{
    "author": [
        "Staff Reporter"
    ], 
    "text": "G. Selvarajan, dean of Government Vellore Medical College Hospital, Adukkamparai with Yasmeen Banu, who underwent a cochlear implant procedure, and her parents.— Photo: C. Venkatachalapathy\n\nA cochlear implant has made a huge difference to the family of R.P. Shabir, a resident of Viruthampet.\n\nHis youngest child – four-year-old Yasmeen Banu – who was born with hearing impairment received the first cochlear implant after the programme was launched at the Government Vellore Medical College Hospital (GVMCH).\n\nCochlear Implant Programme was introduced at GVMCH after receiving the State government’s nod nearly two months ago.\n\nVery few government medical colleges in the State perform the procedure, G. Selvarajan, professor of Ear, Nose and Throat (ENT) and GVMCH dean said.\n\nThe surgery was performed on Yasmeen on January 9 by a team of doctors at GVMCH. ENT specialist Mohan Kameswaran of Madras ENT Research Foundation (MERF), Chennai assisted the team. Dr. Selvarajan along with Madana Gopal, head of ENT and Bharathi Mohan, associate professor performed the surgery.\n\nMoU with MERF\n\n“She was brought to GH in November to get disability certificate. However, we examined her and found she was eligible to get a cochlear implant. Following the implant, she has started to hear. We have entered into a Memorandum of Understanding with MERF under which they will provide speech therapy for those who undergo cochlear implants here,” Dr. Selvarajan said.\n\nR.P. Shabir and his wife S. Hajeera have four children – three boys and a girl - Yasmeen.\n\nTheir second son, now 15 years old, is hearing and speech impaired.\n\n“The disability has been caused owing to consanguineous marriage. The cochlear implant procedure can be performed in children aged one to six years,” he said.\n\nConsanguineous marriage\n\nThe cochlea, auditory portion of the inner ear, can be damaged due to various reasons, one being consanguineous marriage.\n\nOther reasons are infections, fever in women during pregnancy and delay in labour.\n\n“Problems in the outer and middle ear can be rectified by surgery, while damage to the cochlea results in sensory hearing loss. Children with partial damage to the cochlea can be helped by hearing aids. Those with congenital hearing loss will be examined if they are fit for the cochlear implant,” he explained.\n\nFollowing the procedure, the children will undergo speech training. “The surgery costs Rs. 7 lakh, and has been covered under the Chief Minister’s Comprehensive Health Insurance Scheme,” he added.\n\nScrap seller\n\nMr. Shabir, a scrap seller, was short of words when he saw that Yasmeen, who was studying in a special school, was able to hear after the procedure.\n\n“When we approached private hospitals, we were told that the procedure costs Rs. 8-10 lakhs that we cannot afford. Now after the procedure at GVMCH, we were filled with joy when she turned and saw us when we called her by her name. Now, she is also saying a few words such as bhaiyya, ammi and appa,” he said.\n\n“GVMCH is now one of the centres to perform cochlear implants in the State. It is a milestone for us,” the dean said.\n\nThe surgery was performed on January 9 by a team of doctors at GVMCH", 
    "section": "national", 
    "title": "Girl receives cochlear implant", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}