{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The made-in-India aircraft will undergo ground runs and taxi trials\n\nThe first prototype of basic military trainer aircraft HTT-40, planned as the first of three-rung trainers for novice air force pilots, has just rolled out of the hangar, Hindustan Aeronautics Ltd. said on Tuesday.\n\nThe made-in-India aircraft will next undergo ground runs and taxi trials followed by a maiden flight, it said.\n\nThe twin-seater Hindustan Turboprop Trainer can be modified into a light attack aircraft, used for aerobatics, instrument flying, navigation, night flying and close formation.\n\nA Hindustan Aeronautics Ltd release, quoting Chairman and Managing Director T. Suvarna Raju, said, “The project has managed to steer through the initial headwinds and is now going full throttle. There are plans to weaponise and optimise the aircraft.”\n\nThe HTT-40 project, touted as a symbol of capability to design and manufacture a trainer aircraft within the country, was almost aborted until the Defence Acquisition Council announced in March last year that 68 of them would be bought for the air force.\n\nThe IAF has a total requirement of 181 basic trainers, the rest being filled by importing the Swiss-make Pilatus PC-7 Mark-II. The HTT-40 prototype was recently rolled out of the Aircraft Research & Development Centre’s hangar using a remotely operated mini car. It was witnessed by top officials of HAL, members from flight operations, IAF-Integrated Project Management Team headed by Air Marshal Rajesh Kumar, Regional Centre for Military Airworthiness and Regional Director of Quality Assurance. HAL said the team working on HTT-40 is the youngest on any of its prototype programmes. It will be powered by the Honeywell TPE 331-12B engine and produced at the Aircraft Division, Bengaluru. Seventy of the 90 LRUs, or systems on the trainer, are sourced from the Lucknow, Hyderabad and Korwa divisions of the company.\n\nThe made-in-India aircraft will next undergo ground runs and taxi trials", 
    "section": "national", 
    "title": "HAL rolls out the first prototype of basic trainer", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}