{
    "author": [
        "Special Correspondent"
    ], 
    "text": "There was a growing impression among the minorities and public that higher education campuses in the country were slowly turned anti-Dalit, said speakers at a seminar on ‘Educational institutions and caste discrimination’, organised here by Evidence, an NGO, on Wednesday.\n\nAfter the change of guard at the Centre, the situation had worsened and on many campuses, Dalit students were not allowed to express their views, they said.\n\nFocus shifted\n\nIn the case of Rohith Vemula, a research scholar at the University of Hyderabad, the focus had now shifted from his death to whether he was a Dalit or not.\n\nSeveral politicians, including Union Ministers Sushma Swaraj and Smriti Zubin Irani, were keen on maintaining that Rohith was not a Dalit, they claimed.\n\nMisleading\n\nThe Ministers were trying to mislead the public through a section of media that all was well on campuses. But, it was not so.\n\nTo create awareness and also to bring out the truth, the civil society had to wake up and deeply look into the facts behind the tragic circumstances which forced the research scholar to take the extreme step.\n\nThe speakers urged the higher educational institutions to set up monitoring and grievance redressal committees on their campuses.\n\nEvidence executive director A. Kathir said that at a time when many Dalits found it tough even to get admission to schools in backward districts, rising to the level of a research scholar in a renowned university had to be commended. Many universities and institutions of higher education were controlled by politicians indirectly through student unions.\n\nStop atrocities\n\nThe government should stop these atrocities to prevent recurrence of such incidents.\n\nAdvocate Henri Tiphagne, writer Kavinmalar, Semmalar and Joshua Isaac spoke. Dravidar Viduthalai Kazhagam president Kolathur Mani presided. Students, advocates, social workers participated in the seminar.\n\nSpeakers at a seminar organised by Evidence, an NGO, condemned the death of Rohith Vemula and called for action by government and civil society", 
    "section": "national", 
    "title": "“Higher education campuses are anti-Dalit”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}