{
    "author": [
        "Staff Reporter"
    ], 
    "text": "For the first time, ancient panchaloka idols, mostly utsavamurties and parivara idols and other valuable items including precious stone studded gold jewels, silver wares kept in various temples under the control of HR&CE Department with less security, will soon be kept in safe and highly secured zones, thanks to construction of an Icon Centre at a cost of Rs.1.5 crore on the campus of Sri Gowmariaman Temple in Veerapandi.\n\nSimilar icon centre to cater to the needs of temples in Dindigul district is also established on the campus of Sri Srinivasa Perumal Temple near Rock Fort in Dindigul town.\n\nThese centres will have strong room to keep idols and other valuables. Both centres will have hi-tech security mechanism to ensure cent per cent safety to temple properties. They will also have close circuit cameras, emergency alarms and other safety equipment to guard the centre.\n\nWhen contacted, Sri Gowmariamman Temple Executive Office P. Balakrishnan said the construction of the icon centre was over. “It will soon be opened for temple authorities for the safekeeping of valuables safely. The centre has all infrastructure and requisite safety measures for safekeeping of the precious idols of all temples under Hindu Religious and Charitable Endowments (HR&CE) Department in the district, he added.\n\nIn Dindigul, work on establishment of an icon centre is almost over. Finishing touches is being given. It will be thrown open for use shortly, said sources in the HR&CE Department.\n\nThese centres have the capacity to stock hundreds of ancient idols. The Dindigul centre is being constructed at an estimated cost of more than Rs.1 crore.\n\nSuch centres will not only ensure cent per cent security to the idols and other properties of the temples but also prevent theft and smuggling of idols to a larger extent.\n\nSeveral temples, mostly in rural areas do not have adequate facilities to keep the idols safely.\n\nThe concerned temple authorities can take these idols during festival period and bring them back to the centre after completion of festival, the officials opined.\n\nNormally, several temples in rural areas do not display all idols for worship throughout the year. They use them during festivals only.", 
    "section": "national", 
    "title": "Icon centres coming up in Dindigul, Theni to protect idols", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}