{
    "author": [
        "Special Correspondent"
    ], 
    "text": "RELIGION\n\nShri Bhandarakeri Mutt: Programme on Sri Vyasarajara songs, Sri Raghavendra Swami Temple, 6 p.m.\n\nGENERAL\n\nSri Ramakrishna Institute of\n\nOncology & Research: World Cancer Day, 10.30 a.m.\n\nDr. G.R. Damodaran College of Science: National conference on “Achieving Business Excellence: Through the convergence of globalization, technology and innovation”, Charles Babbage Hall, 9.30 a.m.\n\nTRAFFIC (WWF): National workshop on “Capacity building for combating wildlife crime in India”, TN Forest Academy, 8.30 a.m.\n\nLisieux Group of Institutions: Annual Day Celebration, 5 p.m.\n\nSri Jayendra Saraswathy Maha Vidyalaya College of Arts and Science: Programme on “Vaanam Vasappadum”, seminar hall,\n\n10.30 a.m.\n\nAvinashilingam Institute for Home Science and Higher Education for Women University: National conference on “Recent trends in adolescent nutrition and reproductive health care”, 9 a.m.\n\nINTACH & The Vanavarayar Foundation: Museum trip, Govt Arts College, 9.30 a.m.\n\nPoompuhar: Crafts Mela, Meenakshi Hall,\n\n10 a.m.\n\nMaharaja Arts and Science College: Guest lecture on “Positive thinking and personality development”, seminar hall, 10.30 a.m.\n\nV.L.B Janakiammal College of Arts and Science: Guest lecture on “Basics of .NET & JAVA”, Conference hall, 2 p.m.\n\nSNMV College of Arts and Science: Workshop on “TALLY”, Computer lab, 8.30 a.m.\n\nNehru Arts and Science College: Exhibition on “FENIX EXPO ‘16”, 10.30 a.m.\n\nVLB Janakiammal College of Arts and Science: Electronics exhibition programme,\n\n10.30 a.m.\n\nThe Coimbatore Productivity Council: Programme on “Basic management tools”, Conference hall, 9.30 a.m.\n\nThe Coimbatore Productivity Council: Guest lecture on “Evolution of Coimbatore city and development”, Conference hall, 5.45 p.m.\n\nKovai Medical Centre and Hospital: Cancer awareness programme, Coimbatore Railway Station, 8 a.m.\n\nUdumalpet\n\nSri G. V. G. Visalakshi College for Women: \"Gateway 16' Inter-departmental programme, 9.30 a.m", 
    "section": "national", 
    "title": "In Coimbatore Today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}