{
    "author": [
        "Rayan Rozario"
    ], 
    "text": "Fighting for the ball and the top honour in the all-India inter-collegiate basketball tournament at the Nehru Stadium courts in Coimbatore on Wednesday.— Photo: S. Siva Saravanan.\n\nAfter creating the right environment that put women’s basketball in a different pedestal in the city, the Jayalakshmi Sports Academy (JASA) has now set its sight on men.\n\nTo give the sport a fresh new look, it has added the big boys in its annual all-India inter-collegiate basketball fixture that got under way at the Nehru Stadium and RKS Kalvinilayam courts here on Wednesday.\n\nObviously, it came as a pleasant surprise for many because JASA works for the cause of women’s basketball. The Academy set up in 2009 in memory of K. Jayalakshmi, the Physical Directress of Nirmala College, who gave her heart and soul for the development of women’s basketball, is instrumental in inspiring many young girls take up basketball as their career sport. JASA not only identifies talented players, but also guides them physically and financially to the top of the ladder. Many from its stables have found a place in the State and national teams. Today students from across the globe still cherish the profound influence that their late ‘Madam’ had on their lives and continue to contribute to JASA’s endeavours.\n\nJASA has wisely used this support to further promote the game by conducting a tournament of this stature. The last couple of years have seen JASA hosting tournaments exclusively for women. But this time around with the men joining the ring, the ongoing championship is expected to witness that extra spark.\n\nThe men will take home the V.R. Kumaravel Memorial Rolling Trophy. Late Kumaravel, the great grandson of R.K. Shanmugam Chettiar, India’s first Finance Minister, was JASA’s executive president. After his demise last year, JASA thought it fit to institute a trophy in his memory. And Mr. Kumaravel’s family has come forward to sponsor the tournament this year.\n\n“He was a pillar of strength for our Academy,” said Baboo Vivekanandaon, JASA’s secretary and husband of late Jayalakshmi.\n\nThe women will have the privilege of holding the Jayalakshmi Rolling Trophy. The top three finishers in both categories will be richer by Rs. 30,000, Rs. 20,000 and Rs. 10,000 respectively. It only goes to show that both men and women are equal in the eyes of JASA.", 
    "section": "national", 
    "title": "JASA gives collegiate basketball a new dimension", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}