{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Attitudinal issues among textile entrepreneurs here look to be slowing down the shift from being a mere cotton-based knitwear production hub to a cluster that could cope with the current global demands for apparels made from man-made fibres.\n\nEven after the share of apparels made of man-made fibres in the global market is now over 60 per cent vis-a-vis the garments made of pure cotton, almost 90 per cent of the export turnover in Tirupur knitwear cluster still comes from catering to the orders of cotton-based apparels.\n\n“Of course, the knitwear producers here need to change their outlook drastically failing which they might end up losers in the long run. Majority of them are not ready to think beyond the comfort zone of producing cotton-made apparels as the going was smooth for them in past many decades. So, they are failing to view with seriousness the paradigm shift happening towards consumer demand for clothing made of man-made fibres”, pointed out R. Girish, a buying agent-cum-exporter and founder member of Tirupur Exporters and Manufacturers Association. Lack of adequate awareness among the entrepreneurs about the parameters of the man-made fibres like shrinkage pattern and knitting properties too is compounding the problems.\n\n“Unless a profound understanding about the properties of man-made fibres are there, exact costing of the products become difficult even when the apparel producers here wanted to take the orders and execute the same at short periods”, said Raja M. Shanmugam, an apparel exporter and state committee member of Confederation of Indian Industry.\n\nDue to this general reluctance for a transition and failure to compute the exact costs, even Tirupur-based buying agents-cum exporters like Mr. Girish who source orders from foreign buyers for apparels made of man-made fibres like polyester, viscose and even its blends with cotton too, are now executing the same by approaching garment units in Jaipur, Ludhiana and Delhi clusters. Sripuram Trust has formed of textile stakeholders are trying to create awareness in the cluster to improve the production of apparels from man-made fibres.", 
    "section": "national", 
    "title": "‘Knitwear producers need to change their outlook’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}