{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "Online logistics aggregator Porter that is headquartered in Mumbai has forayed into the Tamil Nadu market by starting its services in Chennai. In the next six months, Porter will have its presence in tier-II cities like Coimbatore.\n\nSadhanandhan N, Head-Expansion, Porter, said “We did a pilot in Parry’s corner Chennai three months ago and received a positive response. Then, we spread our area of coverage to Ambattur and other locations.” In a span of three months, Porter, in Chennai, has 200 vehicles (ace and super ace) on its platform and makes 400 trips a day. In the next 6 months, they expect to increase the supply size by 500 vehicles making 1,500 trips a day. “Coimbatore is also on the cards. We are analysing and studying the Coimbatore market,” added Mr. Sadhanandhan.\n\nPranav Goel, one of the co-founders, said, “South India markets are adaptive to new technology. Our target is to capture 20-25 per cent market share in Tamil Nadu.”\n\nFounded by IIT-ians Pranav Goel, Uttam Digga and Vikas Choudhary in August 2014, Porter helps residents hire trucks to shift goods from one place on another. Porter is quite similar to Ola and shows the vehicles available nearby. Once the trip is booked, the customer receives the trip details like driver name, vehicle number etc. It allows the customers to track their consignment in real time and pay either at pick-up or drop.\n\nThe start-up firm, which was funded by Sequoia capital in 2015, said it would be investing Rs. 20 lakh in the Chennai market per month for demand and supply generation. The firm wants to focus only on intra-city pickups and deliveries.\n\nPorter claims that its services are 30 per cent cheaper than market rates and expects to break even in 18 months.\n\nPorter also helps the drivers earn more, the company claims. “We take 20 per cent commission and the rest goes to the driver,” Mr. Sadhanandhan, said. An industry expert points out that the truck market is unorganised here and such aggregators would help drivers get more business.\n\nPorter has more than 25,000 SMEs under its clientele. It has serviced more than 50,000 individual customers.\n\nThe aggregator allows users to book vehicles for shifting and track them online", 
    "section": "national", 
    "title": "Logistics aggregator enables shift of goods at the click of a button", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}