{
    "author": [
        "Staff Reporter"
    ], 
    "text": "NCC cadets along with NCC officers from Tamil Nadu, Puducherry and Andaman and Nicobar Region at the Headquarters, Puducherry, on Wednesday. (Left) Manoj Parida, Chief Secretary, Government of Puducherry, felicitating an NCC cadet.- Photo : T.Singaravelou\n\nThey participated in a R-Day parade camp at New Delhi\n\nThe 116 NCC cadets and 13 instructors from NCC Directorate (Tamil Nadu, Puducherry and Andaman and Nicobar) who participated in the Republic Day Parade Camp 2016 at New Delhi won the fourth position.\n\nThe RDC contingent was felicitated by Manoj Parida, chief secretary, Government of Puducherry on Wednesday at NCC Group headquarters, Puducherry.\n\nFirst place in five events\n\nIn the competitions held during the Republic Day Parade Camp, NCC Directorate (TN, P and AN) has won first position in five events, second position in four events and third position in five events.\n\nThe medal tally of the directorate include 5 gold medals in dressage, ship modelling competitions namely VIP model, RC model, Open class mode and cultural competition, 4 silver medals in events like hacks, camp model and drill and 5 bronze medal in best cadets SW, Control line aerobatic, guard of honour and National Integration Awareness Programme (NIAP).\n\nIt is pertinent to mention that the directorate has won the cultural trophy after a gap of more than 10 years.\n\nThe 116 NCC cadets belong to various groups such as Puducherry group, Madras A and Madras B, Coimbatore, Madurai and Tiruchi. “Eleven cadets from Puducherry Group were part of the RDC Contingent. The Puducherry Group includes Chidambaram, Karaikal, Yanam and Mahe. The national event witnessed participation of 17 NCC Directorates from across the country,” said Lt Col P.Kumar, contingent commander.\n\nParticipants\n\nCommodore Vijesh Kumar Garg, VSM, Deputy Director General NCC (Tamil Nadu, Puducherry and Andaman and Nicobar), Colonel Anil Nautiyal, Group Commander, NCC Group Headquarters, Puducherry and other dignitaries, besides the officers of NCC Group headquarters, Puducherry attended the ceremony.", 
    "section": "national", 
    "title": "NCC cadets win laurels", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}