{
    "author": [
        "Staff Reporter"
    ], 
    "text": "It will help to cross the Chennai-Bangalore NH-48 near Sathuvachari\n\nEssential facility:Once preliminary works are completed, it will take three months to complete the subway.— Photo: C. Venkatachalapathy\n\nCrossing the Chennai-Bangalore National Highway-48 near Sathuvachari has for long been a nightmare for pedestrians. But this is set to change in the coming months, as the long-felt need for a subway across the NH will soon become a reality.\n\nThe National Highways Authority of India (NHAI) has given its nod to construct a subway enabling pedestrians to cross the six-lane NH at the Regional Transport Office (RTO) Road point at Sathuvachari. Residents have been demanding for a subway for more than six years now.\n\nFrom being NH-46, the Chennai Bangalore NH was recently re-numbered as NH-48 as part of a nation-wide exercise.\n\nBhoomi puja\n\nWith the “bhoomi puja” for the subway works held on Monday, officials said excavation works for the subway will begin after certain preliminary works are completed.\n\n“Encroachments have to be removed from the service lanes on either sides of the NH. We need to shift certain utilities such as major Ponnai water pipelines and electricity lines. We will then widen the service lanes to allow the local traffic to flow, and divert the main traffic from the NH into the service lanes,” said an official.\n\nOnce the preliminary works are completed, he added that it will take about three months from the date of commencing work to complete the subway. “The excavation for the subway on the NH will be carried out for a depth of 3 m and width of 5 m. The subway will be built for a length of 51 m,” he added. Officials said the subway will come up at a cost of around Rs. two crore.\n\nUseful for cyclists too\n\nIn fact, the subway will come up in such a way that even cyclists would be able to utilise it. “We will be providing a ramp to enable physically challenged persons to use the subway,” he said.\n\nOfficials said the work that will be carried out by L & T has been agreed upon for public cause as it was a long-pending demand.\n\nM. Abdul Rahman, former Member of Parliament, Vellore had taken up the need to establish a subway at this junction during his tenure 2009-2014.\n\n“Residents brought this issue to my notice as there were several fatal accidents at this spot. They had also resorted to stage road blockade then to draw the attention of the government,” he said.\n\nHe had raised this issue in the Parliament eight times, and represented during the visit of then Union Road Transport and Highways Minister to Vellore in 2012.\n\nThere have been persistent demands from public in various parts of the district for underpasses or flyovers on the NH. A demand for an underpass near Ambur Sugar Mill surfaced a few years ago.", 
    "section": "national", 
    "title": "NHAI gives nod for pedestrian subway", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}