{
    "author": [
        "Special Correspondent"
    ], 
    "text": "TN fully prepared to tackle the virus and there is no cause for concern , says Health Secretary\n\nTamil Nadu is fully prepared to tackle the Zika virus and there is no cause for concern at present, said Health Secretary J. Radhakrishnan.\n\nA high-level review meeting was held on Wednesday to assess the State’s preparedness and measures such as capacity building for doctors – both government and private, as well as intensifying vector control measures that are being taken, he said.\n\nThe Zika virus, transmitted by Aedes mosquito – which also transmits dengue – has been declared a public health emergency of international concern by the World Health Organisation with its spread to over 20 countries.\n\nThe Union Health Ministry on Tuesday issued guidelines on the disease, urging Tamil Nadu and Kerala to be extra vigilant as “dengue transmission is going on currently owing to conducive weather conditions.”\n\nWhile the illness caused by the virus is reported to generally be a mild fever, the guidelines state that microcephaly and other neurological syndromes have been temporally associated with the infection.\n\nAccording to information on the Mayo clinic website, Microcephaly is a condition in which an infant’s head is smaller than the heads of other children of the same age and sex. It usually is the result of the brain developing abnormally in the womb or not growing as it should after birth.\n\n“All essential and precautionary measures have been taken. We have constant surveillance of fever cases in the State. Information on signs and symptoms of the disease has been given to all government doctors, and we are working with the Indian Medical Association to ensure this awareness spreads among the private sector doctors too. Doctors have been asked to take the travel history of patients with fever if they have travelled to the affected countries,” said Mr. Radhakrishnan.\n\nThis apart, a 24x7 health information post manned by a public health official that was set up after the Ebola virus scare is continuing to function, he said. “At the airport too, there are strict protocols in place, including fumigation and vector-control measures,” he said.\n\nHowever, the Union Ministry has not, at present, advocated screening of passengers, Mr. Radhakrishnan said. The State is also in close coordination with the Union Health Ministry and following a protocol-based approach, he said. There are no cases in Tamil Nadu or India at present, but testing has been facilitated at the National Centre for Disease Control, Delhi, and National Institute of Virology, Pune. “The King Institute of Preventive Medicine, Guindy, may also soon be declared a testing centre,” Mr. Radhakrishnan said.\n\nThe Centre has issued a number of guidelines on travel, including some for pregnant women or those trying to become pregnant such as deferring or cancelling non-essential travel to affected countries.\n\nVector-control measures\n\nThe State is also escalating its vector control measures. According to an official release, 10 temporary workers are being assigned to every taluk for source reduction. Every town panchayat will get 20 workers, and at Corporations, the staffing will be as per requirements.\n\nFogging and spreading of awareness are also being taken up. A total of 10,128 sprayers are available across the State – 9,861 handheld and 247 fitted on vehicles. An additional 175 handheld sprayers and 25 vehicle-based sprayers have been acquired.\n\nAll hospitals are prepared to tackle infectious diseases, the release said, adding there is enough stock of medicines to deal with illnesses if any.\n\nMr. Radhakrishnan reiterated that was no need for any panic.\n\n‘TN is in close coordination with Centre and is following a protocol-based approach’", 
    "section": "national", 
    "title": "‘No need to panic over Zika virus’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}