{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Call taxis have begun to enter Erode Railway Junction, to pick up and drop passengers.— Photo: M. Govarthan\n\nCall taxis, which were hitherto blocked by local tourist taxi and auto operators, have started entering the Railway Junction premises for dropping and picking up passengers.\n\nWarning\n\nThe Police and Transport Departments have reportedly issued stern warning to the auto operators at the local stand to desist from causing hindrance to the call taxis and the public, according to official sources.\n\nSo far, it was difficult for passengers alighting at Erode Junction to book call taxis for pick up.\n\nThe local auto stand drivers, who used to monopolise, used to pick quarrels with the call taxi operators due to fear of losing business. But from the passengers’ angle, the call taxis are much cheaper and convenient as well.\n\nTo prevent unsavoury situations, the call taxis picked up passengers outside the jurisdiction of the Railway Junction.\n\nBut, walking out to the main road with the load of luggage is cumbersome for passengers. The passengers, still, used to put up with the discomfort due to the cost-effectiveness of call taxis when compared to the autos or the tourist taxis.\n\nHenceforth, passengers could freely book call taxis to drop or pick them up from the Railway Junction.\n\nThe Police and Transport Departments have been asked by the district administration to keep a watch at the junction to smoothen the process, the sources add.\n\nMeeting\n\nThe issue was discussed at the Divisional Railway Users Consultative Committee meeting recently and the Railway authorities favoured hassle-free entry of call taxis to the junction, said N. Sivanesan, president of Federation of All Trade and Industry Association in Erode district, and the committee member.", 
    "section": "national", 
    "title": "Now, call taxis can enter Erode Railway Junction", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}