{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "The Supreme Court’s order on Wednesday allowing pipelines of the Gas Authority of India Limited (GAIL) to be laid through agricultural fields in western Tamil Nadu could adversely affect some parties in the coming Assembly election when it comes to tapping into the votes of the farmers.\n\nIronically, the verdict came on a day when Prime Minister Narendra Modi spoke in Coimbatore of his government’s measures to improve agriculture.\n\n“The impact of the verdict will affect the fortunes of not only the BJP but also the AIADMK and DMK in the Assembly election,” claims Kongunadu Jananayaka Katchi president G K Nagaraj, an erstwhile member of the NDA. “The DMK government had signed the agreement with the GAIL for laying the pipelines and the AIADMK government did little on this front until farmers rose in protest during 2012-13. The Congress and BJP had paid only lip service to the farmers’ interests,” he charged.\n\nThe GAIL pipeline along with Jallikattu will be the contentious issues in the Kongu region, says E.R. Eswaran of the Kongunadu Makkal Desiya Katchi.\n\nIn this backdrop, it is felt that an option for the ruling AIADMK could be to file a petition in the Supreme Court seeking a review of the order. The BJP could intervene through the Ministry of Petroleum and Natural Gas and ask the GAIL to change the alignment of the pipelines to take it along the highways, feels Eswaran.\n\nBJP insiders here concede that the GAIL pipeline project could be a troublesome issue for the party.\n\nHowever, C. Nallasami, a leading farmer’s leader, says all political parties must share the blame for the plight of the farmers.\n\n“Though the parties accuse each other, the truth is none of them have worked keeping the interests of the farmers in mind,” he charged.\n\nThe affected farmers will not be able to even sell their land for housing or industrial projects as the Petroleum and Mineral Pipelines Act prohibits the same.\n\nThis could make vent their anger at the polling booths, he added.\n\n‘The impact of the verdict will affect the fortunes of not only BJP but also AIADMK and DMK’", 
    "section": "national", 
    "title": "Pipeline issue might echo in polls", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}