{
    "author": [
        "D Madhavan"
    ], 
    "text": "Though a private builder has installed lamp posts on Water Canal Road, which comes under Metrowater, the latter is reportedly not giving permission for fitting street lights on them —Photo: K. Pichumani\n\nResidents of Ambattur have urged Chennai Metropolitan Water Supply and Sewerage Board (CMWSSB) to clear the decks for providing street lighting on a crucial link road connecting two arterial roads.\n\nThe 800-m Water Canal Road that connects Inner Ring Road and Kolkata Highway (NH 5) lacks street lighting, though lamp posts have been installed by a private builder who has constructed a residential apartment complex in the locality. Residents said Water Canal Road came under the CMWSSB and that about a decade ago, it permitted Ambattur municipality (prior to its merger with Chennai Corporation in 2011) to use the stretch as an approach road to residential localities. However, it did not give permission to the local body to install lamp posts.\n\nAs a water supply line built during the British period from Red Hills to the Kilpauk water treatment plant run along the road, the municipal administration was told to take proper care of the road and to prevent movement of heavy vehicles. However, over the years, heavy vehicles, including those that come for applying for fitness certificates at the Ambattur RTO, used the road, posing a risk to the supply lines.\n\nMetrowater officials said they did not give nod for the street lighting as heavy vehicles would start using the road throughout the night and this could risk the water supply lines. However, residents said that to prevent this, an iron barricade could be installed to allow only cars and two-wheelers,” said Ganapathy Suresh, a resident, adding that if street lighting was provided, over 2,000 families would benefit.\n\nMetrowater says heavy vehicles will start using the road throughout the night, posing a risk to water supply lines", 
    "section": "national", 
    "title": "Provide street lights, residents tell Metrowater", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}