{
    "author": [
        "S Ganesan"
    ], 
    "text": "Notwithstanding the recent assurances from Railway authorities, construction of the first stage of the new multi-level bridge at Aristo Junction in Tiruchi continues to be hampered by the delay in grant of approval for transfer of railway land for the project.\n\nThe Highways Department was hoping to complete the first of the two stage project by the end of 2016, ahead of its scheduled time of February 2017.\n\nBut a question mark has risen now on whether it would be able to meet the target. In the first stage, a new three-lane bridge with five arms will be built at a cost of Rs. 44.28 crore adjacent to the existing bridge.\n\nIn the next stage, the old bridge would be dismantled and a new bridge with two arms built in its place.\n\nThe second stage is scheduled for completion by 2019. Although both the Highways Department and the Railways were working simultaneously at the site, the Highways Department could not take up work on full swing on the first stage of the project as Railways has to transfer about 5,095 square metres of its land. Of this, nearly 872 square metres of land is required for laying the service lane along the left side of the bridge towards the Dindigul Highway.\n\nParleys have been going on between the Railways and the Highways Department for the transfer of the land over the past several months.\n\nOver the past few months, the Highways authorities and the Tiruchi MP P. Kumar have taken up the matter with the Railways seeking at least in principle approval from the railways so that the work could proceed until the inter-departmental process of land transfer was completed.\n\nIn October, Mr. Kumar had taken up the matter with the Railway Board chairman A.K. Mittal, who on receiving a representation from Mr. Kumar, reportedly instructed the Southern Railway General Manager to take steps for granting in-principle approval.", 
    "section": "national", 
    "title": "Railways yet to transfer land for Aristo bridge", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}