{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "NO MORE MONKEY BUSINESS:Cages kept ready at the Rescue Centre for monkeys in Sholavandan Range office near Madurai.— Photo: G. Moorthy\n\nA Cluster Rehabilitation Centre to control monkey menace in Madurai and surrounding districts will soon become fully functional at Sholavandan Forest Range Office at T. Andipatti.\n\nDistrict Forest Officer Nihar Ranjan said that while the newly constructed building with 16 cages to house monkeys was ready, procurement of equipment to assist the rehabilitation would be completed in a week’s time.\n\nThe centre has been constructed as part of a special initiative of the Department of Environment and Forests through a government order issued in January 2013.\n\nWhile 10 places – Udhagamandalam, Coimbatore, Salem, Erode, Vellore, Tiruchi, Madurai, Tirunelveli, Ramanathapuram and Kanyakumari – were chosen to establish the centres apart from a nodal centre at Arignar Anna Zoological Park in Vandalur, they are yet to come up in most of these places.\n\nThe centre will not only be used to capture the monkey troops from places where there is menace and relocate them but also to sterilise the alpha and beta males of the troops to control the population.\n\n“The idea is not to reduce the population of monkeys but to stabilize their population. Not all the alpha and beta males from captured troops will be neutered. It will be done only when the population is found to be abnormally high than the carrying capacity of the forest,” Mr. Ranjan said.\n\nThe centre will have vehicles, veterinary surgeons and medical assistants available on call basis.\n\nDr. T.R. Jayakrishnan, Wildlife Veterinary Consultant for Madurai Forest Division, said that a minor keyhole surgery would be performed for neutering and the monkeys could be released in three days after the surgery.\n\n“Various measures had been tried in different places to control the menace but nothing has proved very successful. We hope this will work because the public are also involved,” Dr. Jayakrishnan said.\n\nMadurai Forest Division has also been training the locals in trapping the monkeys in Alagarkoil, Kutladampatti and Tiruvathavur where the menace is high.\n\nThe Cluster Rehabilitation Centre in Madurai division will be used by nearby Theni and Sivaganga districts. “When monkeys are caught in these districts, vehicles will be sent to bring them to the centre for rehabilitation,” Mr. Ranjan said.", 
    "section": "national", 
    "title": "Rehabilitation centre for monkeys to come up in Madurai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}