{
    "author": [
        "D J", 
        "Walter Scot"
    ], 
    "text": "Work on Dhanushkodi-Arichalmunai stretch under way\n\nDhanushkodi, once a flourishing town on the eastern tip of Rameswaram island which was obliterated in the 1964 cyclonic storm, is all set to regain its lost glory, thanks to the road link provided by the Union Ministry of Road Transport and Highways.\n\nThe Ramanathapuram-based contractor, who has been entrusted with the execution of the work, has laid the five-km-long stretch from Muhuntharayar Chathiram to Dhanushkodi and the sector is expected to be thrown open for the public transport by the month end.\n\nD.S. Arvind, Regional Officer, Ministry of Road Transport and Highways, inspected the road last week and tested the depth and quality of the road, laid at a cost of Rs. 22 crore under Engineering, Procure and Contract (EPC) mode. The work was taken up in November 2014 with 15 months project period. “The stretch will be ready for use by the month end after installation of signboards and middle and edge markings,” official sources said.\n\nThe 12-metre-wide road, with seven metres for carriage and 2.5 metres pave shoulders on either side, has been laid as per the design obtained from the Department of Ocean Engineering of the Indian Institute of Technology-Madras.\n\nAs the road was flanked by shores, gabion boxes were erected as suggested by the IIT-M on both sides to protect it from possible tidal action. The contractor has also been awarded the contract to lay the 4.5-km-long second stretch from Dhanushkodi to Arichalmunai, the tip of the land strip, at a cost of Rs. 25 crore.\n\nThe contractor has completed levelling work and laid gravel road for 2.5 km. The stretch, expected to be completed by May end was also being laid as per the designs of the IIT-M, the sources said, adding the specifications for the gabion boxes, however, would change.\n\nThanks to the much-awaited road connectivity, the rough jeep rides in the sandy terrain to Dhanushkodi could become a thing of the past. Pilgrims who would not wish to complete their pilgrimage to the island without a visit to Dhanushkodi, could now take a pleasant drive.", 
    "section": "national", 
    "title": "Road to Dhanushkodi may be opened by month-end", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}