{
    "author": [
        "R Rajaram"
    ], 
    "text": "Nearly 1,000 RPF, RPSF personnel to be deployed in Kumbakonam\n\nWith hectic preparations under way for the ‘Mahamaham’ festival slated on February 22, the Railway Protection Force (RPF) and the Government Railway Police (GRP) are tightening security at Kumbakonam and other nearby railway stations anticipating a mega congregation of devotees for the event.\n\nIn addition to mobilising additional manpower strength to provide escort on board trains and on stations, security personnel would install a host of surveillance cameras at Kumbakonam station ahead of the festival.\n\nThe RPF and the GRP have drawn up security plans separately for the event which will attract devotees from various corners. Apart from RPF personnel those from the Railway Protection Special Force (RPSF) would be deployed to augment the security strength.\n\nThe Inspector General-cum-Chief Security Commissioner-RPF, Southern Railway, S.C. Parhi told The Hindu on phone on Tuesday that 800 to 1,000 RPF and RPSF personnel would be deployed for the festival.\n\nThis includes four companies of RPSF personnel who would be drawn from different battalions. The security arrangements would be put in place along with the Government Railway Police, the Chief Security Commissioner said.\n\nMr. Parhi, who inspected Kumbakonam railway station a few days ago, said the RPF and RPSF personnel would be deployed in stations and in escorting passenger trains that would be operated on the Thanjavur-Mayiladuthurai broad section in connection with the festival.\n\nA major portion of security would be in place at Kumbakonam which would be the centre of activity. Security personnel would be deployed in wayside stations between Thanjavur and Mayiladuthurai.\n\nAround 50 to 60 surveillance cameras would be installed at Kumbakonam station for effective monitoring in the station and its vicinity, Mr. Parhi said.\n\nA senior GRP officer said four companies of Tamil Nadu Special Police would be drawn for security in addition to Railway Police personnel.\n\nTemporary railway police outposts would be created in different railway stations falling between Thanjavur and Mayiladuthurai as part of an effort to step up vigil, the officer added.", 
    "section": "national", 
    "title": "RPF, Railway Police draw up plans for tight security", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}