{
    "author": [], 
    "text": "Amma People’s Service Centres have been opened in all the four zones of the Tiruchirapalli City Corporation to address grievances of residents. Residents of the city can submit petitions, including those seeking birth and death certificates and commercial licences at the services centres every Wednesday. On Wednesday, Mayor A. Jaya, accompanied by Corporation Commissioner M. Vijayalakshmi and elected representatives, inspected the functioning of the centres. The Mayor said in a release that 246 petitions were received at the centres on the first day. Action will be taken on the petitions before February 10, she said.\n\nCentres for voters\n\nVoters services centres have been established at the office of the District Collector and all Revenue Divisional and Taluk offices in the district for members of the electors and representatives of political parties to get details about the electoral rolls, Collector K.S.Palanisamy has said.\n\nAMMA camps\n\nSpecial camps under the Assured Maximum Service to Marginalised People in All Villages (AMMA) Scheme will be held at the following places in the district on Friday: Tiruchi Town , Panchapur, Kiliyur, Kumara Vayalur, Poigaipatti, Nallur, Ariyur, Kariyamanickam (West), Kodunthurai,Sirunavalur and Appananalur. Residents of the villages can avail the services of the Revenue Department at the camp, Collector K.S. Palanisamy said in a press release.\n\nBanana auction\n\nBanana arrivals and prices saw an improvement at the Integrated Market Complex for Banana at Thiruchendurai in the district on Tuesday. About 1,234 bunches of banana were auctioned at the market with about 16 farmers and a dozen traders participating in the auction. Rasthali variety fetched a maximum of Rs. 250 a bunch, poovan, and monthan Rs.150, pachaladan Rs.100 and karpoorvalli Rs. 70 a bunch. The next auction at the market would be held on February 9, an official release said.", 
    "section": "national", 
    "title": "Service centres opened", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}