{
    "author": [
        "Special Correspondent"
    ], 
    "text": "This is essential for screening programmes to cover all rural areas, says Dr. V. Shanta\n\nWith 56,000 new cancer cases in Tamil Nadu in 2015 and the incidence of cancer rising every year, eminent cancer specialist and chairperson of Cancer Institute, Adyar, V. Shanta called for standard protocols for screening and treatment across the State.\n\nSpeaking at the institute on Wednesday, on the eve of World Cancer Day, Dr. Shanta said there were many centres in the State that had their own ways of screening and treating patients. “All of this should be done under one standard protocol and the data collated. We want to be the leaders in this. Only then can screening programmes and treatment cover all rural areas,” she said. Earlier, she had pointed out that facilities for diagnosis and treatment were concentrated in the urban areas. “Covering only urban areas is not ethical and not social justice,” she said.\n\nDr. Shanta also stressed on the importance of tobacco control: “When there is no control on tobacco, cancer cannot be controlled,” she said. She also spoke about the importance of palliative care, saying that a lot needed to be done in this field and adding that this was an important component of cancer control.\n\n“Cancer control starts with prevention and then goes on from early detection to rehabilitation,” said Hemanth Raj, vice-chairman of the institute. By June or so, the institute will also launch a bus, which will function as a mobile exhibition and go around various towns and villages with information, including videos, for the public on cancer, said Dr. Raj.\n\nOn the trends in cancer, R. Swaminathan, additional director of the institute, said breast cancer was now the number one cancer for women in Tamil Nadu, followed by cervical.\n\n“A lot of this has to do with lifestyle changes – for instance we see a lot of breast cancer in more urban areas such as Chennai, Coimbatore and Madurai but more cervical cancer in places such as Perungalathur,” he said.\n\nAccording to data provided by the institute, breast cancer in Chennai rose from 16 per 1,00,000 in 1985 to 35 per 1,00,000 in 2013. Cervical cancer, while being the second-most common cancer in women, dropped from 35 per 1,00,000 in 1985 to 16 per 1,00,000 in 2013 in Chennai.", 
    "section": "national", 
    "title": "‘Standard protocols needed for screening, treatment of cancer’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}