{
    "author": [
        "L Srikrishna"
    ], 
    "text": "Employees’ trade unions demand government to disburse benefits\n\nA suicide for non-receipt of superannuation benefits from Tamil Nadu State Transport Corporation (TNSTC) has triggered unrest among employees’ trade unions across the region.\n\nAfter the news spread that M. Natarajan (60) of Kovilpatti, a retired TNSTC employee, allegedly ended his life by committing suicide on Monday, the unions, cutting across party lines, condemned the State government for its nonchalant attitude and demanded compensation to the family members of Natarajan and that his arrears at least be settled without any further delay.\n\nThe reason for ending his life, according to police and revenue authorities, was that he had retired from service in April 2014 and had mounting debts, since then. He was eagerly looking forward to receiving his monetary benefits from the Corporation, with which he had planned to settle the debts and lead a peaceful life. However, with no sign of disbursement from TNSTC, Mr. Natarajan ended his life.\n\nIs this the way, a person, who had served the TNSTC for 30 to 35 years, would be treated by the Corporation, asked A.V. Pitchai, a union office-bearer affiliated to CITU. When the government can direct the buses to operate free service to flood victims, what prevented the officials from showing similar concern towards its employees, who had given their everything, while in service, he asked.\n\nS. Sampath, State treasurer of Tamil Nadu State Transport Employees’ Federation, said the TNSTC buses paid a whopping Rs. 1,600 crore towards toll every year for using four-way highways. For purchases made on tyres and automobile spares, it paid commercial tax to the government. The Corporation paid Motor Vehicle Tax. As per the government’s directive, students were issued free bus passes every year. The rubber parts were taxed. When such was the case, the government should also be swift in settling the dues of employees, at least to those, who completed service on superannuation.\n\nWhen the Corporation paid Rs. 1.35 crore per month to as many as 325 retired personnel, who had gone to court, with six per cent interest , what prevented the officials from disbursing retirement benefits to other pensioners in queue, Labour Progressive Front union (affiliated to the DMK) office-bearers in Madurai division of TNSTC asked.\n\nWhen contacted, a top official from the TNSTC in Chennai said that the government was aware of the financial commitment to the employees across the State. “Steps are being taken to settle the benefits for the retired employees now. It was unfortunate that a retired employee had ended his life in Kovilpatti,” he added.\n\nHe was waiting to receive his monetary benefits from TNSTC, with which he had planned to settle the debts and lead a peaceful life", 
    "section": "national", 
    "title": "Suicide of retired TNSTC employee kicks up unrest", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}