{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Seven days after the Madras High Court ordered a second post-mortem on the body of Monisha, one among the three students of SVS Medical College of Yoga and Naturopathy, who was found dead in a well near the college, the father of another deceased girl Saranya has moved a similar petition on Wednesday.\n\nRaising suspicion over the death of his daughter, Elumalai, who is working as a driver prayed the court to order fresh post-mortem to be conducted in the Kilpauk Government Hospital, in the presence of a doctor of his choice (by exhuming her body). He further sought Rs. 25 lakh as compensation from the State government.\n\nIn his petition, Mr. Elumalai alleged that though he made a complaint on January 24 requesting the Villupuram district administration to conduct the autopsy in any of the government hospitals in Chennai, the authorities intimidated him to accept the post-mortem conducted in the Villupuram Government Medical College and Hospital.\n\n“When I refused to budge, they threw my daughter’s body out of the freezer box from the autopsy room and forcefully obtained consent from me,” the petitioner alleged.\n\nHe added that he has no faith in the autopsy conducted by the district administration in Villupuram.\n\nThe petition, which was filed on Wednesday, is likely to be heard by court on Thursday.\n\nMeanwhile, the court dismissed as withdrawn a plea moved by Subramanian, trustee of SVS Educational and Social Service Trust which runs the SVS College, seeking anticipatory bail.\n\nPIL seeks SIT probe\n\nThe Madras High Court on Wednesday disposed of a PIL moved by an advocate seeking to appoint a Special Investigation Team to probe into the issue of alleged illegal recognition granted to the SVS Medical College of Yoga and Naturopathy.\n\nRefusing to entertain the PIL, the First Bench comprising of Chief Justice S.K. Kaul and M.M. Sundresh said, “Since the representation made by the petitioner to the authorities concerned is recent in character, it could not be accepted that within three or four days response would be forthcoming from government authorities. The authorities may look into the representation in respect to the same within a reasonable period of time.”", 
    "section": "national", 
    "title": "SVS college row: Saranya’s father for fresh autopsy", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}