{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Increasing sale of liquor through State-run retail shops is one issue that has affected every family in Tamil Nadu, Pattali Makkal Katchi’s Chief Ministerial candidate Anbumani Ramadoss said on Wednesday.\n\nAddressing a demonstration here demanding total prohibition in the State, Dr. Anbumani said the Tasmac shops had plundered the common man’s wealth and ruined many a family. “The gold, silver and money kept in almirahs have all vanished as the men in the family have used them to buy liquor,” he said. He attributed alcohol addiction as the reason for rise in number of road accidents, young widows and increasing crime against women.\n\nStating that no mother would allow her children to drink, he said it was only the Chief Minister (fondly called Amma by her partymen) who was encouraging people to drink. “No other government in the world is generating one-third of its annual revenue through liquor sale,” he said.\n\nDr. Anbumani faulted the Dravida Munnetra Kazhagam for having lifted total prohibition in the State despite advice against the move from leaders like Periyar, Rajaji and Kamaraj. He said majority of the 12 units manufacturing various types of Indian-made foreign liquor were owned by people in DMK, All India Anna Dravida Munnetra Kazhagam and the Congress, he charged.\n\nHe also ridiculed the DMK’s claim of bringing prohibition. “What was the party doing when it was in power in the past,” he said.\n\nDr. Anbumani assured that if PMK was elected to power, its first move would be to ban liquor and impose total prohibition.\n\nNo freebies\n\n“My government will not give you home appliances as freebies. But, we will give you a life with dignity and self respect. All the freebies from my government will be free education and free healthcare. Every family will save at least Rs. One lakh a year through those schemes,” he said.\n\nBesides, every district would have a centre to rehabilitate those addicted to liquor. Special efforts would be taken to provide job opportunities to young widows.", 
    "section": "national", 
    "title": "Tasmac shops have plundered common man’s wealth: Anbumani", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}