{
    "author": [
        "B Kolappan"
    ], 
    "text": "Two native bulls classified as endangered; one nearly extinct\n\nCattle breeds unique to Tamil Nadu are facing a threat due to a slew of factors including mechanisation of agriculture, introduction of exotic germplasm through cross breeding programmes, conversion of farm lands into housing plots, shrinkage of grazing grounds and lack of manpower for maintenance.\n\nThree of the five cattle breeds — Pulikulam, Bargur and Alambadi — have already joined the list of endangered species. “As per the guidelines of the Food and Agriculture Organisation of the United Nations, if the numbers of a particular species are less than 5,000, it will be a potential candidate for being considered an endangered species.\n\nThe Alambadi breed is already facing the threat of extinction as its population is extremely small,” said a scientist of the Tamil Nadu Veterinary and Animal Sciences University (TANUVAS).\n\nThe other two breeds, Kangayam and Umblachery, are able to raise their head above water due to local patronage and government intervention.\n\nEven though their numbers have come down drastically over the years, Kangayam bulls are widely present in the western region of Tamil Nadu because of local patronage and breeding tracks.\n\nThe Umblachery breed, a native of Cauvery delta districts including Thanjavur, Tiruvarur and Nagapattinam districts, has also escaped the threat of being wiped out because of the District Livestock Farm in Korgai in Thanjavur established by the Animal Husbandry Department of the State government.\n\n“They are basically draught animals and never used for the dual purpose. We primarily used these breeds for agriculture and not for dairy management.\n\nThe introduction of a cross breeding programme to increase milk production and a fall in agriculture have brought down the importance of the indigenous breeds,” said a senior scientist of TANUVAS.\n\nToday, the numbers of Pulikulam, Bargur and Alambadi breeds are dwindling and TANUVAS has set up a Cattle Research Station in Bargur to conserve the species. The conservation efforts focus on preventing cross breeding and preserving the sperm in a frozen form for future breeding, among others.\n\n“The Pulikulam bulls are used in jallikattu. A ban on the sport has posed a threat to the breed, but organic farming and vineyards in the Theni district have offered it a new lease of life,” said another scientist who has done research on the breed.\n\nThe native breeds have adapted to local climatic conditions, developed resistance to diseases and possess the ability to survive under severe nutritional stress.\n\nAn atlas on native breeds compiled by TANUVAS warned that if the trend continued, the invaluable native germplasm would be depleted and even be lost forever. “There is a need to create awareness among the people to protect the species. The government should also consider giving incentives to those who are ready to keep these breeds as maintaining them are not easy,” said a senior scientist.", 
    "section": "national", 
    "title": "The not-so-bullish tale of native breeds", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}