{
    "author": [], 
    "text": "RELIGION\n\nSath Sangh, Kailasapuram: Radha kalyana mahotsavam, discourse on Srimad Bhagavatha Sankraham by Rengaswamy Dikshithar, BHEL Township, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Parayana goshti procession, South Gate, Srirangam, 5.30 a.m.; Sri Vishnu Sahasranama parayanam, Sri Maruthi Vinayagar Temple, CKVI Apartments, Thiruvanaikovil, 6.30 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama nama parayanam, 74,I Main Street, SMESC Colony, 6 p.m.\n\nGovindammal Tamil Mandram: Devotional songs by Tharalam Music troupe, Pappammal Anna Chathram, Keezha Chinthamani, 6.30 p.m.\n\nGENERAL\n\nMIET Arts and Science College: MIETY Expo – district-level science exhibition, A. Mohamed Yunus, college chairman, presides, 10 a.m.\n\nHarshamitra Super Speciality Cancer Centre and Research Institute and Rose Garden Charitable Trust: World Cancer Day, pattimandram and quiz programme on cancer, Bishop Heber Higher Secondary School, Teppakulam, 2 p.m.\n\nSeethalakshmi Ramaswami College: Mathematics Association meeting, A.Arulmuguran, senior algorithm engineer, Utechzone Co.Ltd., speaks on ‘Scintillating applications of convex optimisation: From satellite images to early stage cancer detection,’1.30 p.m.\n\nAIMAN College of Arts and Science for Women: Training programme on aptitude testing and logical, M.Ragunath, high speed mathematics trainer, resource person, 10 a.m.\n\nUrumu Dhanalakshmi College Department of Tamil: Seminar, 12.30 p.m.\n\nNational Institute of Technology Department of Instrumentation and Control Engineering: ACODS - international conference on “Advances in control and optimisation of dynamical systems”, 9 a.m.\n\nBishop Heber College Department of English and South Asian English Language and Literature Teachers Association: International conference on English Language and Literature: Retrospect and Prospects, 9.30 a.m. Department of Social Work: Medical camp, Primary School, Karumalai Pudupatti, 10 a.m.;awareness programme on health and hygiene, St.Anne’s Higher Secondary School, Melapudur, 3 p.m.; awareness programme on child rights, JMJ Play School, Pudutheru, Airport, 6 p.m.\n\nPonsiva Research and Innovation Trust and Innovation Incubator of Nehru Memorial College: Innovation trigger camp, college campus, Puthanampatti, 3.15 p.m.\n\nTamil Nadu Handicrafts Development Corporation: Crafts Bazzar, Kailasapuram Club, BHEL, 10 a.m.\n\nNorth Eastern Handicrafts and Handlooms Development Corporation: North East crafts bazaar, SRT Hall, Thillai Nagar, 10 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}