{
    "author": [
        "R Rajaram"
    ], 
    "text": "Suresh Prabhu to inaugurate the facility on February 7 via video conference\n\nThe escalator installed at Tiruchi railway junction is all set for commissioning on Sunday. The new facility at Tiruchi, a major station in the Southern Railway zone, will be inaugurated by Railway Minister Suresh Prabhakar Prabhu through video conference from Chennai on February 7.\n\nRailway sources told The Hindu that Mr. Suresh Prabhu would inaugurate the facility on Sunday afternoon in the presence of top Southern Railway officials.\n\nMr. Suresh Prabhu would lay the foundation stone for the Tambaram–Chengalpattu third line and a new line between Chinnasalem and Kallakuruchi through video conferencing on the occasion.\n\nThe commissioning of the escalator connecting platforms 2 and 3 would come as a great relief for passengers. The facility had been created following long-pending demand of the rail travellers. The project was executed at a cost of Rs. 92 lakh with funds sanctioned by DMK Rajya Sabha member Tiruchi Siva under the Member of Parliament Local Area Development Scheme.\n\nThe escalator had been installed towards the Chennai side to connect platforms 2 and 3 which accommodates more number of trains passing through Tiruchi Junction and those originating from the station.\n\nPassengers’ especially senior citizens would no longer have to face the ordeal of climbing the footsteps along with their belongings to reach platforms 2 and 3 once the escalator was commissioned. However, the footsteps towards the Madurai side leading to platforms 2 and 3 continue to remain.\n\nThe escalator project which commenced in June last year started with civil works. Subsequently, the escalator was installed and trial runs carried out, a senior railway official said.\n\nTiruchi Junction has on all seven platforms – six of which could be reached using the pedestrian subway barring platform 1 which accommodates important trains such as the Rockfort, Vaigai, Guruvayur, Jan Shatabdhi, and Mangalore Expresses.\n\nOfficials say the escalator would great reduce hardship faced by passengers boarding trains from platforms 2 and 3.", 
    "section": "national", 
    "title": "Tiruchi Junction escalator ready", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}