{
    "author": [
        "Special Correspondent"
    ], 
    "text": "SHINING BRIGHT:Tamil Nadu boys and girls who won overall championship in Ramanathapuram on Wednesday.— Photo: L. Balachandar\n\nTamil Nadu boys and girls made a clean sweep in all the three categories to lift overall championship in the 61st National School Carrom Championship 2015-16 held here from January 30 to February 3.\n\nMore than 250 school students, including 120 girls, from 11 States and Union Territories, took part in the championship, hosted by Tamil Nadu School Education Department under the auspicious of School Games Federation (SGF) for the first time in the district.\n\nRight from day one, Tamil Nadu boys and girls had an upper hand winning the gold in all the individual categories and silver in most of the three categories – Under 14, 17 and 19.\n\nSimilarly, in the team championship, which comprised singles and doubles, they raced ahead of others to win overall championship for the second successive year.\n\nThey won all but one of the 12 gold medals in individual and team events. Maharastra Under 19 boys’ team was the only other team to win a gold medal in the championship.\n\nMember of Parliament A. Anwar Raja, who distributed medals and trophies to the winners at the closing ceremony here on Wednesday, said that sports symbolised national integration, and united countries which even severed diplomatic ties.\n\nLike music, sports had no language, caste, creed or religion, he added.\n\nThe championship was conducted at Syed Ammal Engineering College, which arranged for boarding and lodging facilities for the participants. College correspondent A. Chinnadurai Abdullah, Chief Education Officer (CEO) Jayakannu and Tamil Nadu Chief Inspector of Physical Education M. Kalaiselvan were also present.\n\nS. Prasath, District Inspector of Physical Education, who conducted the events, said that the district unit would be too happy to host football championship next year.\n\nThe boys and girls who won gold and silver medals in different categories: Boys Under 14 – C. Dinesh, K. Sooraj (Tamil Nadu); Under 17 – Dhinesh Babu Suriya Prashun (TN); Under 19 – K. Venkatesh, V. Elangovan (TN); Girls Under 14 – M. Sathya, S. Roshini Sree (TN); Under 17 – B. Sneha Praba (TN), L. Hari Priya (Andhra Pradesh); and Under 19 – K. Naga Jothi (TN), and Ku Janhavi Sunil More (Maharashtra).", 
    "section": "national", 
    "title": "TN players win National School Carrom Championship", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}