{
    "author": [
        "Special Correspondent"
    ], 
    "text": "With the cattle feeding cost escalating every year to reduce the income of dairy farmers, the Veterinary College and Research Institute here organised a hands-on training for dairy farmers on azolla cultivation as it drastically reduces the feeding cost.\n\nA total of 375 farmers (25 farmers from 15 villages) were trained on azolla cultivation.\n\nDairy farming plays a vital role in generating sustainable income for farmers when compared to other livestock enterprises in the district. The ‘constraints analysis on dairy farming,’ which was recently conducted among the dairy farmers of the district, revealed that minimal production of green fodder and high cost of concentrate cattle feed were the major constraints.\n\nIn order to reduce the concentrate feed cost, several research trials have been conducted by scholars of VC and RI with azolla to find an alternate supplement source of cattle feed. Since azolla is considered as the most economic and efficient feed substitute and a sustainable feed for dairy cattle, the VC and RI organised the training programme on azolla cultivation.\n\nThe prevailing micro-environment of the district is quite conducive for cultivation of azolla and hence the scheme on ‘Popularisation of azolla as low cost supplemental cattle feed among the dairy farmers of Tirunelveli District’ is being implemented by the Department of Veterinary and Animal husbandry Extension Education, Veterinary College and Research Institute, Tirunelveli with financial assistance from NABARD, Chennai since January 2015.\n\nUnder this scheme, progressive dairy farmers of NABARD Farmers Club in Manur, Radhapuram, Alangulam, Tenkasi, Nanguneri, Palayamkottai, Cheranmahadevi, Melaneelithanallur and Keezhapaavoor blocks were selected for the study.\n\nA training programme on ‘azolla cultivation through method demonstration’ was conducted.\n\nAs a part of the scheme, for popularising azolla amidst farming community, training programmes were conducted in 15 villages including Malayadipudur, Nanguneri, Kalakkudi, Thenpaththu, Ayansingampatti, Cheranmahadevi, Surandai, Ayankurumpalaperi, Kuththukkalvalasai, Old Courtallam, Ponnaakudi, Pillaikulam, Moovirunthaali, Panneerooththu and Karaichuttrupudhur.\n\nThe last phase of the training was conducted at Karaichuttrupudhur village of Radhapuram block recently, in which K. Ramalingam, Assistant General Manager, NABARD, Tirunelveli delivered a special address.\n\nS. Senthilkumar, Principal Investigator and Assistant Professor, Department of Veterinary and Animal Husbandry Extension Education, Veterinary College and Research Institute, Tirunelveli was the resource person.\n\nHe explained in detail the technicalities involved in cultivation of azolla in plots with an area 6 feet X 3 feet and its harvest for feeding the cattle.", 
    "section": "national", 
    "title": "Training in azolla cultivation", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}