{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Ironically, traditional fishing families are switching to other trades, finds pre-census exercise\n\nThe number of families along the coastline that depend on fishing for a living has increased over the past five years. In what sounds ironical, many people from traditional fishing community have however shifted to other professions.\n\nThis was one of the early findings of the Marine Fisheries census, which was launched on Monday and is expected to be completed on March 1. The last Marine Fisheries census was carried out in 2010.\n\nThe Central Marine Fisheries Research Institute (CMFRI) launched the census at Kasimedu on Monday to collect information about the fishing community, which includes their social, demographic and economic profile, types of fishing activities and aquaculture practices.\n\nThis census is conducted every five years. Households that depend on fishing as occupation have increased from 1.92 lakh in 2010 to three lakh families now across the State. Of this, nearly 40,000 families are in Chennai alone.\n\nAs part of the efforts to update the database of fishing community and their needs, the CMFRI has involved nearly 700 enumerators to check on the family details, fishing craft ownership and fishing-associated activities as well.\n\nThe month-long exercise, which will end on March 1, will cover 591 fishing villages in 15 districts.\n\nP. Laxmilatha, principal scientist and scientist-in-charge, Chennai Research Centre, CMFRI, said in the pre-census exercise, it was found that several people from the traditional fishing families were giving up the profession.\n\nBut, it had not affected fishing as several others were taking up the occupation.\n\n“We are also looking at aspects of migration from other places like Orissa and types of fishing gears they use. Many fishermen have started using technology like GPS and satellite forecast about potential fishing zones in their daily activity. This helps in saving time and fuel,” she said.\n\nThis census will help develop a comprehensive database on coastal fishing population and enable the State Fisheries Department to chalk out schemes and policies for the community.", 
    "section": "national", 
    "title": "Unlikely takers for fishing", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}