{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The international carnival has over 100 events in store for four days\n\nAnnual cultural fest:The logo for VIT University's Riviera 2016 being released on Wednesday. Vice Presidents of the university G.V. Selvam and Sekar Viswanathan are in the picture.- Photo: C. Venkatachalapathy\n\nVIT University’s Riviera 2016, an international sports and cultural carnival, will take off on Thursday with over 100 events in store for four days. It will start with a 9.9-km-long marathon on the theme – Stand up India — to promote women entrepreneurship.\n\nThis year, the fest runs on the theme — “Unmask the Mask” to provide a platform for students to portray their hidden talents.\n\nThe university is expecting a footfall of 30,000 students from across the country. Students from nearly 250 institutions are participating in this annual cultural fest that will go on till February 7.\n\n“For the first time this year, we organised ‘Knockouts’ in Hyderabad on January 7, and the response from students was encouraging,” Devanshi Kanyal, student organiser told reporters on Wednesday.\n\nA total of 160 students from 60 colleges took part in the ‘Knockouts’ in three events.\n\nFive pre events\n\nAs part of Riviera, five pre-events have been conducted, including VIT Model United Nations, Riviera Youth Summit, and Spell Bee spelling contest for school students, Abhyuday Chaudhaury, another student organiser, said.\n\nDuring the four days of Riviera, there would be 102 events that will cover various domains such as dance, music, drama and literature. There will also be eight workshops, including on freestyle football, dance, graffiti and DJ. Aikya, a parade depicting the cultures of 11 States and China will be held on February 5.\n\nLiterary competitions\n\nAmong the events are Tamil, Telugu, English and Hindi literary competitions. In Tamil, there will be poetry writing, short-story writing, debate, short-film making and comedy-related events, Arun, another student organiser, said.\n\nAdventure sports have been introduced this year. The student organisers said the total prize money for the cultural events was Rs. 20 lakh.\n\nOn the sports side, athletic events have been introduced. Students from 50 colleges are participating in 16 sports categories. Prizes worth Rs. five lakh are in the offing.\n\nPro-shows among highlights\n\nPro-shows are among the highlights of Riviera. Rockstar Group and Bollywood singer Sunidhi Chauhan will perform on February 4, while a laser show and singer Karthik’s performance will take place on February 5.\n\nOn February 6, musical performance by the band, ‘Parikrama,” will be followed by “Frisk Factor”, dance performances by VIT Dance club and other colleges.\n\nThe cultural fest will end with DJ Lloyd’s show on February 7.\n\nCricketer Ravichandran Ashwin will participate in the inauguration of Riviera, while actor Siddharth will be the guest for the valedictory programme. VIT Vice Presidents G.V. Selvam and Sekar Viswanathan were present.\n\nThe Hindu is the media partner for VIT Riviera 2016.\n\nThe festival’s theme “Unmask the Mask” will provide a platform for hidden talents", 
    "section": "national", 
    "title": "VIT Riviera 2016 to take off today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-04"
}