{
    "author": [], 
    "text": "The second and only official Grammy Museum outside of Los Angeles opens on Saturday in the Mississippi Delta, cradle of the blues.\n\nOrganisers chose Cleveland, Mississippi two hours north of the state capitol Jackson for the nearly $20 million project and promise one of the most advanced museums in the country. It’s a smaller but updated version of its sister museum in California and employs high-definition touchscreens and interactive technology to chronicle American music history from before the first Grammy Awards in 1959 to the present.\n\nThe bedrock of that history is the Mississippi Delta, said Bob Santelli, executive director of the Grammy Museum in Los Angeles.\n\nJazz and hip-hop\n\nThe rhythmic guitar and soulful ballads of bluesmen like Robert Johnson and B.B. King travelled up the Mississippi and across the country, influencing nearly every style of American popular music including, jazz, hip-hop and rock ’n’ roll. The state also claims the most Grammy winners per capita in the world.\n\n“Isn’t that wild?” Mr. Santelli said. “You take the state of Mississippi out of American music history and you have a very large gap to fill.”\n\nThe blues mesmerized musicians ranging from Tupelo native Elvis Presley to The Beatles and more in generations since, said Patricia Walker, songwriter and head of Delta State University’s music department. The original bluesmen mostly African-American men living in the Jim Crow era of discrimination in the South lived off the land and eased their hardships through music.\n\n“Everybody at one time or another has had the blues,” Ms. Walker said. “The musicians that came out of here had to dig deep in the soil to make a living, and they dug deep to capture those feelings in their music.”\n\nOfficials designed the museum the most upscale building to come to the region with the Delta’s history in mind.\n\nCorrugated metal on the building’s exterior is a nod to the tin metal sharecropper shacks many blues musicians grew up in. The entrance looks like a big front porch, a common feature of many Delta homes. Cleveland Chamber of Commerce Director Judson Thigpen estimates the museum could bring in about $20 million annually as a tourist draw to the entire region.\n\nThe museum was a collaborative effort to spotlight the Delta’s music legacy, said Allen Hammons who helped establish the B.B. King Museum in Indianola, Mississippi as well as a Blues Trail along a highway in the state. In 2011 Hammons joined Walker and others to form the Cleveland Music Foundation, a nonprofit foundation that built and operates the museum.\n\nThe museum features a diverse collection including the acoustic guitar Presley played during his landmark ‘50’s Sun Records Sessions to the bright, multicolored feather costume Cee Lo Green wore at the 2011 Grammy Awards.\n\nVisitors can record and produce a song with Grammy Award-winning bluesman Keb’ Mo’ and trace how Mississippians like Ike Turner considered the father of rock’n’roll influenced musicians through the ages along a 12-person, interactive touchscreen table. — AP\n\nThe U.S. state of Mississippi claims the most Grammy winners per capita in the world", 
    "section": "national", 
    "title": "A museum for Grammy fans", 
    "subsection": "general", 
    "date": "2016-03-05"
}