{
    "author": [
        "Special Correspondent"
    ], 
    "text": "IAF chief’s statement is a signal that the decision will be left to Modi\n\nPresident Pranab Mukherjee and Air Chief Marshal Arup Raha at the presentation of Presidential Colours and Standard at the Air Force Station in Jamnagar, Gujarat, on Friday.— Photo: PTI\n\nThe Indian Air Force will have no objection if the government decided to permit the Pakistan Special Investigation Team (SIT) into the Pathankot Air Force station, the Air Force chief, Air Chief Marshal Arup Raha, said on Friday.\n\n“If the government allows the team, why should we object? Whether to permit or not to permit [them] into the Pathankot base will be a political decision. I will not comment on it,” Air Chief Marshal Raha told mediapersons in Jamnagar on Friday.\n\nHe said that the case needed to be pursued towards “some outcome.”\n\n“We want a closure of the case with appropriate action against those who attacked the base,” he said.\n\nHeated debate\n\nThere has been a furious debate on whether the Pakistan SIT, which is investigating the terrorist attack on the Pathankot air base in January, should be given access. Several serving and retired officers have opposed the idea, saying that a forward base on the western border could not be thrown open to the Pakistani team.\n\nThe IAF chief’s statement is a clear signal that the decision to allow the Pakistan SIT will be left to Prime Minister Narendra Modi, because on various occasions in the past, Defence Minister Manohar Parrikar had opposed the move. The attack on the air base by six terrorists from Pakistan on the early hours of January 2 went on for five days and claimed the lives of seven security personnel.\n\nEarlier this week, Sartaj Aziz, Foreign Affairs Advisor to Pakistan Prime Minister Nawaz Sharif, said that the SIT team would visit India very soon.\n\n(With inputs from PTI)", 
    "section": "national", 
    "title": "Air Force not against Pak. SIT visiting Pathankot", 
    "subsection": "general", 
    "date": "2016-03-05"
}