{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "An inquiry conducted by the Information and Broadcasting Ministry into a Facebook post by an Indian Institute of Mass Communication (IIMC) student targeting Dalits, has had an unexpected fallout.\n\nAmit Sengupta, Associate Professor of English Journalism at the premier institute, who had expressed solidarity with students of JNU and the striking FTII students last year and also supported the protest by IIMC students following the suicide of Dalit research scholar Rohith Vemula, has been served with transfer orders, dated March 1, to the Dhenkanal campus in Odisha by the Officer on Special Duty (OSD), Anurag Mishra.\n\nMr. Sengupta chose to resign on Friday in protest. In his resignation letter, dated March 4, he has lashed out at the OSD for reducing the institute to a “handmaiden of [a] vicious, undemocratic and partisan regime”, and said the arbitrary transfer, without a discussion, was proof of victimisation for standing up for students. “Certainly, this is part of a larger witch-hunt against intellectual freedom, academic autonomy and professional excellence, to target and eliminate individuals who this regime has declared as enemies for reasons only they know,” Mr. Sengupta said in his letter.\n\nThough the Ministry officials insisted the transfer orders served on him on March 1 were routine, it is reliably learnt from sources that Mr. Sengupta, former president of the JNU students’ union, had earned the ire of the Ministry for actively supporting a series of causes, causing much concern to the I&B Ministry. “He was seen as challenging the system,” sources have pointed out.\n\nThe premier Institute was recently in the news for a Facebook post by a student of journalism, which contained derogatory and insulting remarks against Dalits. This followed protests held in the memory of Vemula. Three faculty members, including Mr. Sengupta, had associated themselves with students who had observed January 17 with discussions and debates on social inclusion. The next day, the questionable Facebook post went viral.\n\nFollowing an enquiry by the Ministry, the student has been suspended for three weeks even as another student, who had lodged a formal complaint in the case, was suspended for a week for sending an expletive-laden message against a faculty member on the WhatsApp platform.\n\nWhat has also added to the disquiet in the Institute is a proposal from the Ministry —mooted in October 2014 — seeking to introduce civil service conduct rules for the faculty, a move which has been resisted so far for fear that it will curtail the freedom of the teachers to write and be published freely. A code of ethics, it is learnt, is also being planned for teachers. Both await the nod of the Executive Council, the highest decision-making body of the Institute.\n\nAs the IIMC waits for a new Director-General to take over, a committee under the I&B Secretary Sunit Arora, who is also the chairperson, has shortlisted three candidates, two of whom are senior Indian Information Service officials, and one a consultant with the Prasar Bharati Corporation. From all indications, it looks like K.G. Suresh, consultant to DD News and senior fellow of the Vivekananda International, Foundation, will make the grade.\n\nAmit Sengupta has supported the student protests\n\nat JNU, FTII\n\nand IIMC", 
    "section": "national", 
    "title": "Alleging victimisation, IIMC professor quits", 
    "subsection": "general", 
    "date": "2016-03-05"
}