{
    "author": [], 
    "text": "Students from MIT and Cambridge university get cracking\n\nStudents from MIT and Britain’s University of Cambridge will spend the weekend hacking one another’s computers, with the blessing of their national leaders.\n\nThe two schools are competing in a hacking contest that U.S. President Barack Obama and British Prime Minister David Cameron announced last year among other joint cyber-security projects between the two nations. The White House billed it as a showdown between the two prestigious schools, both known as heavyweights in the world of computer science.\n\nBut the colleges opted to make it a friendlier match. Instead of facing off against each other, the schools assigned their top hackers to six teams made up of students from both institutions. Teams will gather at MIT on Friday and then, for a frenzied 24 hours, try to hack into their opponents’ computers and steal a trove of files.\n\n“This isn’t us versus them,” said Howard Shrobe, a principal researcher at MIT’s Computer Science and Artificial Intelligence Laboratory, which is hosting the event. “It’s the best of both schools working together.” Along with bragging rights, winners will receive cash prizes of more than $20,000. It’s intended to be the first in a series of global cyber-security competitions.\n\nAfter a summit in Washington last year, Mr. Obama and Mr. Cameron jointly called for wider collaboration on cyber-security. It was only weeks after the U.S. government accused North Korea of hacking computers at Sony Pictures Entertainment Inc. The leaders also agreed to form a joint “cyber cell” among their national security agencies, among other measures.\n\nMajor breaches like the Sony hack have underscored what experts say is a shortage of cyber-security professionals. An industry group reported last year that 86 per cent of its members believe there is a shortage of skilled workers. The contest at MIT aims to spark interest in the field and to promote cooperation among academics.\n\n“It is essential for us to work together and compare notes,” said Frank Stajano, leader of the Academic Centre of Excellence in Cyber Security Research at the University of Cambridge, which is sending 10 students to the competition. “If you’re not at least as good as the bad guys, then you have no chance against them.”\n\n“You have to identify them and patch them before other competitors notice them,” said Rahul Sridhar, a sophomore competitor from MIT.\n\nBoth schools provided training to their students in recent weeks to sharpen their hacking skills. At the University of Cambridge, Mr. Stajano is already planning to add that training to the broader curriculum.\n\nMeanwhile, organisers are already talking about arranging a sequel next year, perhaps with other institutions from around the world.\n\n“The bad guys are organised,” Mr. Stajano said, “so the good guys have to be organised as well.” — AP", 
    "section": "national", 
    "title": "College hackers compete to shine spotlight on cyber-security", 
    "subsection": "general", 
    "date": "2016-03-05"
}