{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "3 CoBRA battalion members killed in gun battle that lasted 24 hours\n\nInjured jawans, who were rescued after the encounter with Maoists in Chhattisgarh’s Sukma district on Friday, being administered treatment.— Photo: Special Arrangement\n\nA team of the Central Reserve Police Force’s (CRPF) 208 CoBRA battalion was rescued on Friday after an encounter with Maoists in the Sukma district of South Chhattisgarh on Thursday.\n\n“All our injured personnel were evacuated by 2 pm [on Friday]. The withdrawal has been tactical and orderly and after accomplishing a thorough search. The Maoists have sustained heavy losses (in the operation),” said Inspector General of the CRPF, Chhattisgarh sector, Sadanand Date.\n\nFateh Singh, N.S. Lanju and Laxman Kurti, all three constables with the battalion, were killed in the gun battle which lasted around 24 hours.\n\nThree remain critical\n\nThirteen injured personnel were shifted to Raipur for treatment, of whom three remain critical. The injured CoBRA commandos have been identified as 208 CoBRA Commanding Officer P.S. Yadav, assistant commandant Yogendra Kumar, Sub-Inspectors Rajvir Singh Gurjar, Kulveer Singh, Yashwant Raut and Mohd. Akhlaq, head constable Santosh Kumar, constables Suresh Kumar, Ramesh Soren, Sohram, Sanjay Chahal and S.P Sahu.\n\nAccording to Mr. Santosh Singh, Sukma district Additional Superintendent of Police, Inspector Prakash Rathod of Sukma police, who was part of a small DRG (District Reserve Guard) contingent to help the CoBRA team, suffered a bullet injury during the operation.\n\nOn the delay in evacuating the injured jawans to Kistaram police station, Mr. Singh, who led the rescue, said, “The operation was launched around 16 kilometers from Kistaram. The first encounter took place at 11 a.m. yesterday (Thursday). Then there was firing in the afternoon and evening. Our men were hit and most of the injuries took place during the evening firing. Around 16 people could not move (due to injuries), so they stopped in the forest. Since Kistaram is an interior camp, it did not have sufficient forces, so additional forces had to be sent from outside.”\n\nMr. Singh also claimed that the CoBRA team was fired at from the houses of Dabbamarka village.\n\n“But our men maintained the highest form of distance from the village. The second ambush was near Pottakapalli village,” he added.", 
    "section": "national", 
    "title": "CRPF team rescued after Sukma encounter", 
    "subsection": "general", 
    "date": "2016-03-05"
}