{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Adopting a pragmatic posture on India’s current policy of warming up to Iran, top Israeli officials told The Hindu that Israel understands that South Block’s desire to get close to Iran is “interest driven”.\n\n“Every country is following interest-driven foreign policy. India is also following its own interest,” said a senior policy professional from the Israeli Ministry of Foreign Affairs (MOFA), requesting anonymity. India in recent months has reoriented its policy to adjust to the rise of Iran after the nuclear deal was signed between Iran and the Western Powers.\n\n“But the fact is that India-Israel ties are unique. There are things that India alone can do for Israel and there are things that Israel alone can deliver for India,” the official told The Hindu .\n\nIsraeli policy makers are at present evaluating the rapid changes sweeping across the West Asian region following the civil wars in Syria, Iraq and the rise of the IS.\n\nThe observation on India-Iran ties came after India sanctioned funds to build the port of Chahbahar for Iran and agreed to open banks for smoother trade ties.\n\nIsrael, however continues to hold Iran-backed Hizballah as one of the greatest threats against its security. “Under the present circumstances, Israel’s eastern and northern borders are prone to elements like the IS and Hizballah,” said the official.\n\nIsrael circumspect\n\nThough the Iran nuclear deal has ensured greater acceptability of Iran in international affairs, Israel, the official said, will keep an eye on Iran’s intention to adhere to its commitment to stay non-nuclear in future.\n\nIndia has reoriented its policy to adjust\n\nto the rise of Iran after the nuclear deal was signed", 
    "section": "national", 
    "title": "Despite Iran factor, India-Israel ties are unique, say top Israeli officials", 
    "subsection": "general", 
    "date": "2016-03-05"
}