{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Defence counsel says people in South even kill themselves for leaders\n\nSixteen years after they torched a bus and burnt to death three college girls while protesting the arrest of then AIADMK general secretary Jayalalithaa, the convicts in the Dharmapuri bus burning case appealed to the Supreme Court on Friday to roll back their death penalty, saying murder committed during mob frenzy is not pre-meditated.\n\nArguing their review petition before a three-judge Bench led by Justice Ranjan Gogoi, senior advocate L. Nageshwar Rao, who also appears for Ms. Jayalalithaa in the disproportionate assets case, said mobs go berserk and possess a demented sight of what is around them.\n\nReferring to the riots after the killing of former Prime Minister Indira Gandhi, Mr. Rao used the defence of “diminished responsibility” to argue that the accused, who were part of a rampaging mob, cannot be held fully criminally liable for the crime as their mental capacity were impaired at the time.\n\nTo buttress the point, one of the defence counsel, senior advocate Sushil Kumar said “in the South, people worship their leaders and on their death even kill themselves”.\n\n“Mobs go berserk. Reason does not enter their minds. After the judgment at 10.30 a,m., the agitations had started. There was absolutely no pre-meditation. There was a workshop nearby, they took petrol from there and started sprinkling it on the buses,” Mr. Rao recounted events of the fateful day.\n\nMr. Kumar said the accused were only “looking for some government property to destroy and were not targeting human lives”. Mr. Rao argued that death was too harsh a punishment as the convicts had no personal animosity towards their victims and were themselves the victims of “mob psychology”.", 
    "section": "national", 
    "title": "Dharmapuri bus-burning: ‘mob frenzy behind madness’", 
    "subsection": "general", 
    "date": "2016-03-05"
}