{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "The current parliamentary session seems to be on the right track, says Venkaiah Naidu.\n\nA day after Prime Minister Narendra Modi attacked the Congress for disrupting Parliament and implicitly mocked its vice-president Rahul Gandhi’s political acumen, Parliamentary Affairs Minister M. Venkaiah Naidu on Friday said the government was willing to reach out to Mr. Gandhi to break the deadlock over the Goods and Services Tax (GST) Bill.\n\nIn an exclusive interview with The Hindu , Mr. Naidu said the BJP government had never accused Mr. Gandhi of being the main hurdle in the passage of the GST Bill, saying “it is the media and some political analysts who have said Rahul Gandhi calls the shots in the Congress.”\n\n“The government is talking to the Congress leadership in this regard,” said Mr. Naidu. “Finance Minister Arun Jaitley is speaking to Congress interlocutors and I have been in regular touch with their leaders ... we can talk to Rahul Gandhi also.”\n\nCompared to the last two parliamentary sessions that ended in complete washouts, Mr. Naidu said the current one seemed to be on the right track since it was happening in the backdrop of “increased public and political demand for a productive session.”\n\n“In various meetings [with the Opposition] convened by me, serious concern was expressed over persistent disruptions,” said Mr. Naidu, adding that leaders of the Opposition were told that the public were getting restive seeing Parliament at a standstill.\n\n“I am sure this will impact the conduct of the parties concerned,” he said.\n\nMr. Naidu had no regret over the government’s approach in dealing with the repercussions of Rohith Vemula’s suicide at Hyderabad Central University and the police crackdown at Jawaharlal Nehru University.\n\n“We have given effective responses on all these issues,” said Mr. Naidu.\n\n“The JNU incident raised some serious issues. Universities, the highest seats of learning, are supposed to be the breeding grounds for reason, responsibility and maturity instead of pioneering anti-national activities. This message has effectively gone out in the public domain as a result of some Opposition parties seeking to make a political capital out of it.”\n\nBJP never accused Congress leader\n\nof being hurdle in Bill’s passage, says Union Minister", 
    "section": "national", 
    "title": "Govt. willing to reach out to Rahul on GST Bill: Naidu", 
    "subsection": "general", 
    "date": "2016-03-05"
}