{
    "author": [
        "Omar Rashid"
    ], 
    "text": "Beginning to wonder how bad it must have been for Rohith Vemula: Richa Singh\n\nRicha Singh, first woman president of the Allahabad University Students’ Union since Independence, seen with her security guard at the Arts Department.— Photo: Rajeev Bhatt\n\nRicha Singh, the first woman president of the Allahabad University Students Union since Independence, has alleged that the varsity is planning to cancel her admission to the Ph.D programme to “settle scores” with her for her activism on campus.\n\nThe varsity had constituted an inquiry committee to probe the legality of her admission into the Ph.D programme in 2013-14. Its report says a “wrong process” was followed in Ms. Singh’s admission in violation of reservation norms.\n\n“This puts my academic career under threat. I am depressed. The university is harassing me. And I’m beginning to wonder how bad it must have been for Rohith Vemula,” Ms. Singh told The Hindu .\n\nEver since she assumed the post of union president, Ms. Singh has been in the limelight for her fight against gender insensitivity and opposition to some of the ABVP’s decisions, including the cancellation of the visit of hardline BJP MP, Yogi Adityanath to the campus.\n\n‘I’m being intimidated’\n\nMs Singh has written many times to Union Human Resource Development Minister Smriti Irani on the “repeated harassment” by the administration and the alleged inaction against ABVP students who, she alleges, sexually and physically intimidated her.\n\n“They desperately want to see me removed so that an ABVP student is made president. [Out of five posts in the AUSU, the ABVP holds four, except that of president]. The administration is harassing me by sending unfounded show-cause notices and by constituting baseless enquiry committees against me. Ironically, they never do so when crimes against women are reported on campus,” Ms. Singh said. She claims she was recently threatened with defamation by the varsity for protesting the appointment of an official, accused of harassing a Dalit woman.\n\nDean of Arts A. Satyanarayanan denied the allegation that there was a ploy to cancel Ms Singh’s admission. He, however, said it was found that the “process followed in her admission was wrong.”\n\n“The roster principle was applied where it is only meant for promotion and direct recruitment to employment. It seems like a procedural flaw of the administration. There seems no fault of the candidate or the coordinator. There was no evidence of her producing a false certificate,” Mr. Satyanarayan said.\n\nThe Vice-Chancellor, who is out of station, is expected to take the final call on Ms. Singh’s admission. Ms. Singh contests the varsity’s report saying her admission was effected by “a ruling” of the Allahabad High Court after it sought a “legal opinion”. Professor V.P. Singh, her coordinator in the Centre for Globalization and Development studies, confirmed this.\n\n“They are questioning my admission two years after I was admitted. Why was no question raised during the scrutiny of papers in the election,” Ms. Singh asked.\n\nABVP student leader Siddharth Singh has criticised Ms. Singh for blaming the outfit and said she should be booked for “fraud.”\n\n“If she is correct, why is she reluctant to face a proper probe into her admission? You cannot manipulate the real documents,” he said.\n\nA senior professor, who is aware of the case details, supported Ms. Singh’s cause and said on the condition of anonymity: “Why is the VC acting merely on the complaint of an M.A. student who has nothing to do with the department? It is a clear case of settling scores.”\n\nMs. Singh said it was a scheme to “disturb” her and reflected the “patriarchal attitude” of the administration and the ABVP, who are “not ready to accept a woman as student union president.”", 
    "section": "national", 
    "title": "I am being harassed for campus activism, claims student leader", 
    "subsection": "general", 
    "date": "2016-03-05"
}