{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "As the Supreme Court agreed on Friday to hear immediately a petition filed by cellular operators against a law making it mandatory to pay compensation for dropped calls, telecom service providers said a “100 per cent call-drop-free network” was impossible under the law of physics and they would have to pay hundreds of crores to subscribers every month.\n\nThe petition also said the telecom licences issued to the companies did not prescribe 100 per cent coverage.\n\nThe Telecom Regulatory Authority of India (TRAI) said the Telecom Consumers Protection (9th Amendment) Regulations, 2015, which was upheld by the Delhi High Court in February, was framed purely in the interest of the common man.\n\nA Bench of Justices Kurian Joseph and Rohinton Nariman asked the Centre and the TRAI to file their response to the petition filed against the February 29 order of the Delhi High Court. The Cellular Operators’ Association of India and telecom majors such as Bharti Airtel, Aircel, Vodafone, Idea Cellular and Telenor have jointly filed the petition.\n\nAt one point, Justice Nariman said he lived next door to the Prime Minister, but still faced dropped calls. The debate in the court then moved on to how strict liability could be imposed on service providers without a mechanism to certify whether a call was dropped or never got connected.\n\nCounsel for the government and the operators entered the realm of physics to disprove each other’s arguments about the plethora of reasons behind call drops, which range from entering no coverage zones such as a basement or lift when a conversation is on, to complex terrains, moving vehicles, the presence of huge waterbodies and even “landlords shutting off power supply”.\n\nAttorney-General Mukul Rohatgi, appearing for TRAI and the Centre, said, “How many basements do we have in India after all? The regulation imposes liability only if the call is established at the receiver’s end. You say ‘hello’ and the phone gets cut.”\n\n“We have done detailed studies. They [regulations] are in consumers’ interest,” he said.\n\nSenior counsel Kapil Sibal, appearing for the companies, said, “If it is my fault, we will pay. But we cannot be asked to pay compensation without any verifiable mechanism to determine the reasons for the call drops.”\n\nSC asks Centre, TRAI to respond to the petition filed against the\n\nDelhi HC order", 
    "section": "national", 
    "title": "Laws of physics won’t allow zero call drops, say telcos", 
    "subsection": "general", 
    "date": "2016-03-05"
}