{
    "author": [
        "Special Correspondent"
    ], 
    "text": "India has not issued visas for a delegation of the U.S. Commission on International Religious Freedom (USCIRF) that was planning to travel on Friday. For the past several years, India has turned down the request for visas for such annual visits by the USCIRF. “The goal of the Commission’s trip was to discuss and assess religious freedom conditions in that nation,” the USIRF said in a release.\n\n“We are deeply disappointed by the Indian government’s denial, in effect, of these visas. As a pluralistic, non-sectarian, and democratic state, and a close partner of the United States, India should have the confidence to allow our visit,” Robert P. George, Chairman of USCIRF, a bipartisan body, said.\n\nResponding to the USCIRF, the Indian embassy in Washington said in a statement: “There is no change in the policy of the Government of India with respect to such visits. India is a vibrant pluralistic society founded on strong democratic principles. The Indian Constitution guarantees fundamental rights to all its citizens including the right to freedom of religion. We do not see the locus standi of a foreign entity like USCIRF to pass its judgment and comment on the state of Indian citizens’ constitutionally protected rights.”\n\nThe embassy said India looked “forward to continuing working with the United States government for sharing of experience and best practice on all issues of mutual interest under the established bilateral mechanisms like the India-United States Global Issues Forum.”\n\n“The USCIRF will continue to pursue a visit to India, given the ongoing reports from religious communities, and NGOs that the conditions for religious freedom in India have been deteriorating since 2014,” Mr. George said.", 
    "section": "national", 
    "title": "No Indian visas for U.S. religious freedom commission", 
    "subsection": "general", 
    "date": "2016-03-05"
}