{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "‘Decision on signing LSA will be taken on national interest’\n\nDays after a top U.S. Admiral expressed keenness in co-ordinated patrols between India and U.S,, Defence Minister Manohar Parrikar said on Friday that there was no scope for such patrols at this point of time.\n\n“As of now India has not taken part in joint patrols but we do participate in joint exercises. So the issue of joint patrols at this time does not arise,” Mr. Parrikar told a press conference here.\n\nEarlier this week Admiral Harry Harris, U.S. Pacific Commander speaking at a seminar here called for turning exercises into coordinated patrols and pitched for quadrilateral cooperation between India, Japan, Australia and the U.S.\n\nHe said that if such a decision was taken “we will brief the media that we have taken this in the interest of the country.” Responding to a question from The Hindu if the Logistics Support Agreement (LSA), one of the three foundational agreements, would be signed with the U.S., Mr. Parrikar said any decision would depend on national interest.\n\nU.S. Defence Secretary Ashton Carter is scheduled to visit India in April during which the agreements are expected to be discussed.\n\nFMS funds utilised\n\nThe Defence Ministry had not returned Rs. 11,000 crore from the budget but had indeed saved the amount by utilising funds locked in the Foreign Military Sales (FMS) account, Mr. Parrikar said.\n\nThere is an account for paying the U.S. for defence procurements under the FMS route. The amount is paid to the U.S. government which further pays the companies concerned.\n\n“For the first time, the Defence Ministry took stock of the FMS. There is an account for managing them... Due to mismanagement, we had slightly less than $3 billion piled up in the account without any interest”, he said.\n\nLast year, India paid Rs. 6,000 crore for committed liabilities from this account. “We have recalibrated the full management of the account from $3 billion and got down to $1.7 billion”, he said.", 
    "section": "national", 
    "title": "No scope for India-U.S. joint patrols at this time: Parrikar", 
    "subsection": "general", 
    "date": "2016-03-05"
}