{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Reeling from the fallout of the suicide of Dalit scholar Rohith Vemula and blowback from rural India because of two years of successive drought, the BJP has charted out a series of programmes to address these issues.\n\nAccording to top sources in the party, at a meeting of party general secretaries held in Delhi and presided over by BJP president Amit Shah last week, it was decided that a week-long programme, commemorating Constitution framer Dr. Bhimrao Ambedkar be held starting from April 14, his birth anniversary.\n\n“There is a growing feeling that Dalits who had in the General Elections of 2014 voted in large numbers for the BJP are not likely to do so in the Uttar Pradesh elections of 2017, where we are seeing a resurgent Bahujan Samaja Party,” said a general secretary who was present at the meeting.\n\nSocial harmony\n\nThe programme would be about the RSS’ concept of “samajik samarasta” or social harmony that had first been articulated in the 1980s by then sarsanghchalak, Balasaheb Deoras.\n\nA booklet, prepared by the RSS, titled Sabhi Hindu Sahodar Hain (all Hindus are brothers and sisters) will also be distributed.\n\nThe booklet praises Dr. Ambedkar, and contains the lectures of the late Deoras and Golwalkar denouncing untouchability.\n\nThe second set of programmes will start on May 1, when the party intends to launch a series of seminars on the panchayati raj and how best to deal with the impression (after the agitation against the Land Ordinance) that the party was against farmers.\n\nThe Union Budget, and its rural focus will also be selling point at these seminars.\n\n“The Uttar Pradesh polls are looming in 2017, and we need to begin work on the ground to counter all this propaganda against us,” said the general secretary.\n\nChalks out programmes to deal with fallout of suicide of Vemula and farm distress", 
    "section": "national", 
    "title": "Post-Vemula, BJP aims at reaching out to Dalits", 
    "subsection": "general", 
    "date": "2016-03-05"
}