{
    "author": [
        "Karnataka Bureau"
    ], 
    "text": "‘We were thrashed when we went to Bengaluru to demand water’\n\nShutters were down in the Kolar and Chickballapur districts of Karnataka, while major highways were blocked on Friday after protesters vented their anger at the Karnataka government for lathi-charging farmers who came to Bengaluru on Thursday, demanding a “comprehensive drinking water” project in the region.\n\nIn Kolar, the busy National Highway 75 (Bengaluru to Chennai) was blocked, while in Chickballapur, National Highway 7 (towards Hyderabad) was blocked by villagers and farmers who burnt tyres and placed stones and tree branches on the major roads.\n\nAlmost all commercial establishments and transport services in the towns and cities of the region were closed throughout the day. Pre-university examinations scheduled for Friday were postponed to March 8 in both the districts. Though the bandh was largely peaceful, a couple of KSRTC and private buses were damaged in Kolar.\n\nThe call for the bandh was given by the Shashwata Neeravari Horata Samiti, the Karnataka Rajya Raitha Sangha, the Hasiru Sene, and pro-Kannada outfits against the government's ‘atrocities’.\n\n“They trapped us at Windsor Manor bridge (in Bengaluru), and hit us like animals in a cage. Even senior citizens and women were thrashed. Is this the way to treat farmers who asked only for water,” Mr. Rajanna, a farmer from Soppahalli asked.\n\n“When they did not listen to us for more than five months, don’t we have the right to go to where they sit? Instead [of hearing us], they thrashed us,” said Usha Reddy, whose husband, Anjaneya Reddy, president of the Shashwata Neeravari Horata Samiti, was among those arrested on Thursday.\n\nCases to be withdrawn\n\nThe Karnataka government, which is facing the Opposition’s wrath for the poor handling of the protest by the farmers of Kolar and Chickballapur districts who blocked the Kempe Gowda International Airport defying the ban, told both the Houses of the legislature on Friday that it would withdraw cases registered against the farmers and their leaders.\n\nReading out a statement in the Assembly, Home Minister G. Parameshwara said all would be withdrawn. The police had detained 190 people and released them later. Four farmers and six policemen were injured during the protest on the busy airport road. More than 300 people missed their flights due to traffic jam. He denied the Opposition’s allegation of lathi-charge against farmers. Chief Minister Siddaramaiah said the farmers had resorted to the protest, though he had convened a meeting on March 6 to discuss their issues.\n\nEarlier, accusing the Congress government of being “anti-farmer”, the Opposition BJP and the JD (S) condemned the alleged lathi-charge against the famers, who drove to the city from drought-prone districts of Chikkballapur, Kolar, Tumakuru and Bengaluru Rural, seeking a solution to drinking water and irrigation crisis.", 
    "section": "national", 
    "title": "Protesting farmers block national highways in Kolar, Chickballapur", 
    "subsection": "general", 
    "date": "2016-03-05"
}