{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "The Supreme Court on Friday agreed to pass orders confirming a Central notification issuing a standard operating procedure (SOP), for the protection and examination of ‘good Samaritans’ — those who help road accident victims — and make it binding on all State governments and authorities.\n\nThe court’s endorsement of the notification, issued on January 21, 2016, by the Transport Ministry, is a boost to concerted efforts at changing the public’s tendency to turn away from a road accident victim.\n\nThe SOP was framed by the government on the orders passed by the Supreme Court on the basis of a PIL petition filed by the NGO, SaveLIFE, in 2012, highlighting that lives of more accident victims could be saved if a law could be made to protect good Samaritans from legal and procedural hassles at the hands of police and hospitals.\n\nThe Centre issued a series of guidelines on May 12, 2015 to protect good Samaritans. They included assurance of anonymity, protection from any civil or criminal liability for taking the victim to the nearest hospital, and even a suitable reward for the life-saving initiative.\n\nThe government had also indicated that an SOP should be evolved in this regard.\n\nIn the January 16 notification, the government highlighted that bystanders or passers-by, who chose to help a person in distress on the road, should be “treated respectfully and without discrimination on the grounds of gender, religion, nationality, caste or any other.”\n\nOther SOPs include complete anonymity in case the good Samaritan does not want to reveal his name or details, use of video-conferencing in case of any further interaction with him by the authorities, and provision for the police to examine him at his residence or office or any place of his convenience.", 
    "section": "national", 
    "title": "SC nod for guidelines to protect saviours of accident victims", 
    "subsection": "general", 
    "date": "2016-03-05"
}