{
    "author": [
        "National Bureau"
    ], 
    "text": "Prime Minister Narendra Modi having a word with the family members of the former Lok Sabha Speaker P.A. Sangma inNew Delhi on Friday.- Photo: PTI\n\nThe first big political break for Purno Agitok Sangma came when he became general secretary of the Meghalaya Pradesh Congress Committee in 1975. He became Minister of State for Commerce and Civil Supplies in the Rajiv Gandhi government in the 1980s.\n\nFrom 1988 to 1990, he served as Meghalaya Chief Minister. He served as a Minister of State for Coal (independent charge) in the Narasimha Rao government in the 1990s.\n\nMr. Sangma broke away from the Congress, along with Sharad Pawar and Tariq Anwar, in 1999, raising the banner of revolt against Sonia Gandhi’s leadership. They founded the Nationalist Congress Party.\n\nHe was expelled from the party in 2012 when he refused to accept its decision to back out of the election for President of India.\n\nHe took on Pranab Mukherjee, supported by the BJP and some other parties. After he lost, he filed a petition against the election of Mr. Mukherjee.\n\nIn 2013, Mr. Sangma founded the National People’s Party. Known for his affable nature, Mr. Sangma was considered by many as the tallest north-eastern leader in terms of national stature.\n\nHis daughter, Agatha Sangma, was the youngest Minister in the previous UPA government.\n\nPrime Minister Narendra Modi tweeted: “Shri PA Sangma’s tenure as Lok Sabha Speaker is unforgettable. His down to earth personality and affable nature endeared him to many.” The twitter handle Officeof RG tweeted Congress leader Rahul Gandhi’s tribute to Mr. Sangma. “Deepest condolences on the passing away of veteran leader and former LS Speaker Shri PA Sangma. His demise is a great loss to the nation.”", 
    "section": "national", 
    "title": "Tallest north-eastern leader in terms of national stature", 
    "subsection": "general", 
    "date": "2016-03-05"
}