{
    "author": [
        "Kritika Sharma Sebastian"
    ], 
    "text": "Says JNU students can never be anti-national, appeals to all to change perspective about them\n\nJNUSU president Kanhaiya Kumar with Rama Naga, who too faces a sedition case, on the JNU campus on Friday.- Photo: PTI\n\nJawaharlal Nehru University Students Union president Kanhaiya Kumar said here on Friday that “we are just students not terrorists.’\n\nAddressing a press conference on the JNU campus, a day after he was released from jail on interim bail, Mr. Kumar said: “We are all students here. We are like any other young person in the country who is trying to receive good education in order to succeed in their life. I appeal to everyone to change their perspective towards our students.”\n\nHe was arrested on February 12 in connection with the February 9 event organised to protest the hanging of Parliament attack convict Afzal Guru on his third death anniversary during which “anti-national” slogans were allegedly raised.\n\nMr. Kumar was granted interim bail for six months by the Delhi High Court on condition that he would cooperate with the ongoing investigation.\n\nAsked whether he would join politics, Mr. Kumar said: “I am not a politician, I am a student”, insisting JNU students can never be anti-national as they understand the meaning of freedom of speech and meaning of freedom.\n\n“My task is to study and fight for those who wish to study but are unable to do so. Since the fight is long, there can’t be a victory march but a unity march on that.”\n\nReacting to remarks that taxpayers’ money was being wasted in running the university, Mr. Kumar said “I want to tell the people of the country that the taxes they pay are being invested in the right place.”\n\nTeachers meet V-C\n\nMembers of the JNU Teachers’ Association (JNUTA) met the Vice-Chancellor again on Friday with a list of demands, the primary among them being the removal of the officiating Registrar Bhupinder Zutshi. Vikramaditya Chaudhary, the JNUTA secretary, said the delegation sought the Vice-Chancellor’s response to the issue by Monday.\n\n“But the V-C said he would be able to respond only by Tuesday. We agreed to give him the time,” said Mr. Chaudhary after the meeting.", 
    "section": "national", 
    "title": "We are not terrorists, says Kanhaiya", 
    "subsection": "general", 
    "date": "2016-03-05"
}