{
    "author": [], 
    "text": "‘It is the role of not only the Left but everyone to unite for the right cause’\n\nIn a free-wheeling conversation with Kritikia Sharma Sebastian , JNU students’ union president Kanhaiya Kumar , who was released from Tihar Jail on Thursday, spoke about his future plans about the students’ movements, his experience and takeaway from the recent controversy.\n\nYou spent 22 days in custody. What do you think is your takeaway from the experience?\n\n… it is yet to sink in that I am finally out of jail. I am trying to comprehend the entire situation. However, I do realise that huge damage has been caused to the name of our university and I have to try to mend it.\n\nThe students all over the country are looking up to you as a youth icon. What is the future plan of action for the students’ movement?\n\nI am happy that a large number of students across the country have supported me and the university. I am definitely looking forward to taking the students’ struggle forward.\n\nWe have been associated with the FTII struggle, then we associated with the Rohith Vemula movement. Now a large number of people are with the “Stand JNU” movement.\n\nThis is definitely a new high for the students’ movement in the country.\n\nDo you think student organisations are playing the role of the Opposition party in the country, in the way they are taking on the government?\n\nThere are two centres of power, one is Parliament and the other is the struggle on the streets.\n\nWe have to take the struggle from the streets to Parliament.\n\nThe Left is divided into five factions in JNU, but for your release, they united. What do you have to say about them?\n\nIt is the role of not only the Left but everyone to unite for the right cause. Whoever believes to be not only Left but also Ambedkarite have come forward.\n\nAre you going to campaign for a political party or contest elections in the future?\n\nI do not see my life in fragments. I am a student right now and I am doing politics. In future, whatever I do, politics will be a part of my life. I do not want to be a political leader, I want to be a teacher. But once I am in that profession, then also politics will be a part of my life.\n\nDo you think the space for debates on human rights violations and Kashmir issues will cease to exist after the February 9 incident?\n\nI don't think it will! This is the beauty of JNU. We let all spaces co-exist on the campus.", 
    "section": "national", 
    "title": "We have to take the struggle to Parliament", 
    "subsection": "general", 
    "date": "2016-03-05"
}