{
    "author": [
        "Somesh Jha"
    ], 
    "text": "As the Road Safety Week begins on Monday, officials say the actor was never part of the campaign.\n\nTo create awareness of road safety, the Union Ministry of Road Transport and Highways will organise the Road Safety Week from Monday with several events across the country.\n\nMinistry officials, however, denied reports about actor Aamir Khan being dropped as the face of the road safety campaign, saying he was never part of it officially.\n\n“Officially, Aamir Khan was not the face of the road safety campaign. There must have been talks about the TV show (Satyameva Jayate) in which the road safety issue was raised but the Ministry never appointed him as the face of the campaign,” said a senior Ministry official.\n\nRoad Transport and Highways Minister Nitin Gadkari had publicly announced in October last year that he had approached Mr. Khan to support the road safety awareness programmes in the country and the actor had “agreed to support the cause.” However, since then, there has been no mention about the actor’s participation in the Road Safety Week.\n\nThe series of events throughout the week will see participation of celebrities such as cricketer Gautam Gambhir and actor John Abraham, Ministry sources said.\n\nHome Minister Rajnath Singh will flag off the Road Safety Walk at India Gate here on Monday.\n\nLater in the day, Mr. Gadkari will hold a press conference to discuss the issue of road safety with the media. “During the week, awareness about various causes of road accidents and measures to prevent them will be highlighted by organising various activities with school or college students, drivers and all other road users,” a statement from the Ministry of Road, Transport and Highways said.\n\nOther events the Ministry will be a part of include awareness campaign during National Youth Festival in Raipur, a seminar organised by Geneva-based International Road Federation in which State government officials will participate.", 
    "section": "national", 
    "title": "Aamir not in road safety drive", 
    "subsection": "general", 
    "date": "2016-01-11"
}