{
    "author": [], 
    "text": "The battle to be at the centre of people’s digital life has taken on a new dimension amid a proliferation of connected devices. At the Consumer Electronics Show which concluded in Las Vegas on Saturday, the contenders included robots, televisions, speaker hubs and even wearable trackers powered by artificial intelligence. Here are some key highlights:\n\n1. Netflix stunned the show with the announcement that it added 130 new countries for its streaming TV service to bring its total to 190, calling it \"the birth of a new global Internet TV network.\"\n\n2. Google and Lenovo announced plans to produce the first consumer handset using the U.S. computing giant’s Project Tango 3D technology. The device set to launch worldwide later this year aims for a new generation of smart devices that can be used for indoor mapping, augmented reality and more.\n\n3. The 4K high-definition television format became the standard base for manufacturers, which showcased thinner and more spectacular displays for those willing to pay the price.\n\n4. The Internet of Things showed spectacular growth from products like a smart mirror from Haier that delivers news and weather, and digitally-connected spoons and diet scales.\n\nSamsung unveiled a smart refrigerator that lets its owner use a smartphone to virtually peer inside.\n\n5. Wearable technology probed deeper to get more data about health, while making inroads into the medical field: diagnosing conditions and even offering treatment for pain and other ailments. Shoes measured steps and shirts kept tabs on heart rates.\n\n6. Automakers moved to connect not only to the smartphone, but to the smart home. Ford teamed with Amazon to link the carmaker’s Sync vehicle hub with the online giant’s smart home hub called Echo.\n\n7. In the realm of virtual reality, Facebook-owned Oculus began taking pre-orders for its eagerly-anticipated Rift VR headsets at a price of $599.\n\n8. Startups turned attention to ways to tap into the brain. A “mind control” headband unveiled by startup BrainCo hacks into brain signals with a range of possible applications — from improving attention spans, to detecting disease and controlling home appliances. — AFP", 
    "section": "national", 
    "title": "Battle to control digital lives", 
    "subsection": "general", 
    "date": "2016-01-11"
}