{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Union Textiles Ministry has asked the Central Bureau of Investigation to expedite its probe into alleged theft and sale of jute bags meant for packaging of foodgrains under the Public Distribution System in Haryana.\n\nThe Ministry has shared fresh documents with the CBI to establish that during an inspection, bags of the same quality as that of 30,000 jute bags, recently intercepted by the Commercial Tax Department in Telangana, were found in Haryana.\n\n“It is requested that an officer be deputed to the Jute Commissioner’s office for any further information on apprehending those indulging in similar irregularities,” states the letter to the CBI.\n\nThe CBI has instituted a preliminary inquiry into the allegations. It is learnt that the agency has also recorded the statements of the government officials concerned and some of the suspects.\n\nIt has been alleged that the consignment seized in Telangana was sold for Rs.6 lakh, much below the government price and that it had been dispatched by a Haryana-based firm through a Delhi-based transport firm that existed only on paper. Also, the quoted carriage charge of Rs.22,000 was way below the market rate.\n\nAs there are no manufacturing units in Haryana, the Ministry believes that the bags were first supplied from West Bengal.\n\nThe government, which procures jute bags worth about Rs.5,000 crore every year for PDS packaging, suspects large-scale thefts and recycling of bags supplied by the manufacturers.\n\n“We have come across evidence suggesting that several bag manufacturers supply unbranded gunnies to State government agencies. They are then replaced with used ones and the new bags are diverted to middlemen, who either sell them in the open market or supply them back to the manufacturers, at rates almost half the price fixed by the government,” said an official.\n\nThe current government procurement rate is Rs.43 per bag, while in the open market it sells for Rs.15 to Rs.20.\n\nOn the basis of a complaint by RTI activist Gouri Shankar Jain, the Ministry had recently detected similar irregularities in Bihar.", 
    "section": "national", 
    "title": "CBI to probe theft, sale of PDS jute bags", 
    "subsection": "general", 
    "date": "2016-01-11"
}