{
    "author": [
        "Ellen Barry"
    ], 
    "text": "Wealthy landowners want to keep alive the ways of maharajahs through traditions such as dog racing\n\nA column of all-wheel drives turned off a dusty road in rural Punjab last week, past ox carts and farm workers holding sickles, and came to a stop in an unmarked field. Helpers circled around to the backs of the vehicles and unloaded, ever so carefully, the animals everyone had come to see.\n\nThere were greyhounds from Canada, from Ireland and England, and a few from the United States. The track of plain tractor-groomed dirt belied the colossal investment represented by the dogs, many of which were housed in air-conditioned kennels and fed buttermilk and chicken.\n\nDogs are a big deal in this part of Punjab, about 30 km from the border with Pakistan. So is single-malt Scotch, skeet shooting and wild-boar pickle. The guardians of these traditions can be found seated in chairs arranged at the finish line: wealthy Sikh landowners who, despite government’s attempts to dismantle the feudal system, are keeping alive the ways of the maharajahs and nawabs who came before them.\n\nOne of the most prominent among them, Kushaldeep Singh Dhillon, was scanning the track for a glimpse of a 17-month-old brindle bitch named Baby Doll. This was complicated, at times, by the number of young men coming by to bend down and touch his feet.\n\n“All the big families are into dogs,” said Mr. Dhillon, who is known as Kiki. “You import the best dog. You have the best handler. It’s not the horse competing, or the dog competing. It’s the man’s name competing.”\n\nCostly hobby\n\nMr. Dhillon estimates the cost of a top greyhound at half-a-million rupees. This is a fraction of what he will pay for a Marwari stallion, a Perazzi shotgun or a big-game hunt in South Africa, but, still, it adds up.\n\n“Very few families have been left with all this, I’ll be very frank,” he said. “This is a bit of an expensive thing, the dogs, the upkeep.”\n\nThe trainers arrive first, laying thick blankets on the ground for the greyhounds, which bruise easily. Then come the dogs’ owners, recognizable by their quilted vests and Gucci sunglasses.\n\nMany wealthy families here own chains of gas stations in the United States or Canada, and most have relatives there. One imposing man, who turned out to be a police officer, explained in rapid-fire fashion that “I am doing duty as a gunman for Kiki Dhillon” and that “my in-laws are settled in Modesto (California).”\n\nEven without the benefit of elected office, the scions of old families serve as a kind of shadow government.\n\nMr. Dhillon is an excellent example. Though he lost his most recent parliamentary election, he still spends several hours a day receiving petitioners who wait on his terrace, bringing him their problems and occasionally asking him to settle disputes. They refer to him as “sardar,” akin to “chieftain.”\n\n“Communism was never a hit in North India,” he said. Mr. Dhillon’s family owns interstate buses and trades in liquor, but he spends most of his time on politics.\n\nHe has four cellphones, two of which are in the possession of his personal secretary, and they ring approximately every 5 minutes, including when he is on horseback. “The main job for politicians is not to make laws, the main job is to go to social functions,” he said, a little wearily. “There are all these deaths.”\n\nDog races offer some relief from this routine. A man turns a crank, the dead rabbit scoots down the track on a wire and two dogs shoot out at a full gallop, their spines flexing like springs. Greyhounds can be legally raced only using a mechanical lure, in this case a bedraggled dead rabbit affixed to a dinner plate.\n\nDust rises around the men along the track: farmers with deeply lined faces; New Jersey gas station moguls; one princeling in aviator sunglasses who described himself happily as “that type of guy, you give me $100,000, I guarantee within two, three days, I am spending every penny.”\n\nIn the end, top prizes went to the dogs belonging to Punjabis living in North America; one of them, an electrical engineer, lives outside Detroit and raced a dog from West Virginia. — New York Times News Service", 
    "section": "national", 
    "title": "Chasing the lure of a royal past in Punjab", 
    "subsection": "general", 
    "date": "2016-01-11"
}