{
    "author": [
        "Smita Gupta"
    ], 
    "text": "The Congress brass at the Centre is still mulling over the advisability of forging pre-electoral alliances in poll-bound Assam even as the State leadership has publicly opposed the idea, stating its preference for going it alone.\n\n“The Antony Committee was set up to take a view on where and when we should forge alliances,” Congress general secretary in charge of Assam C.P. Joshi told The Hindu . , “We will have to take a decision and it will be then conveyed to the State unit.”\n\nAsked to comment on Tarun Gogoi stating publicly that he did not favour an alliance with the Badruddin Ajmal-led All-India United Democratic Front (AIUDF), Dr. Joshi said: “The Chief Minister has the right to express his opinion. But the matter is yet to be discussed at the highest level.”\n\nDr. Joshi’s comments come in the wake of his party’s Assam leadership dismissing an ambitious plan by Bihar Chief Minister Nitish Kumar and election strategist Prashant Kishor to recreate a Bihar-style RJD-JD(U)-Congress ‘mahagathbandhan’ in the State, with the Congress, AIUDF and the Asom Gana Parishad (AGP), to defeat the BJP in the coming Assembly election.\n\nThe differences between the national and State leadership on forging a pre-election alliance or going it alone, centre round conflicting perceptions. The State leadership feels that if the Congress enters into an alliance, it will concede space to its partners. Secondly, with the AIUDF being essentially a “Muslim” party, the Congress State unit fears an arrangement with it could lead to communal polarisation as the BJP is its principal antagonist.\n\nThe Bihar experiment\n\nThe Central leadership, meanwhile, is looking at the Bihar experiment, where the JD-U, the RJD and the Congress fared poorly in the Lok Sabha elections of 2014 when they contested separately, but in combination trounced the BJP-led NDA in the Assembly polls.\n\nIn Assam, the BJP had polled 36.5 per cent of the votes in the 2014 general elections and won seven of the 14 seats. The Congress, with 29.6 per cent, got three seats and the AIUDF, with 14.8 per cent (concentrated in a smaller region), secured another three seats. The AGP failed to open its account, but managed 3.8 per cent. Going by pure arithmetic, add the Congress, the AIUDF and the AGP, and the combination could defeat the BJP.\n\nThe Congress’s dilemma is one it faces elsewhere in the country too: should it focus just on defeating the BJP by forming a pre-election alliance as in Bihar or should it preserve its space on the ground and live to fight another day?\n\nBesides, there is the risk that chemistry could defeat the logic of arithmetic.", 
    "section": "national", 
    "title": "Congress on the horns of a dilemma", 
    "subsection": "general", 
    "date": "2016-01-11"
}