{
    "author": [
        "Chintan Girish Modi"
    ], 
    "text": "Amid the uncertain nature of diplomatic talks between India and Pakistan, Euro School in Thane of Mumbai undertook a unique initiative. Sini Nair, Head of the English Department, organised an hour-long Skype interaction between students and Pakistani author Anam Zakaria.\n\nThe 25 students were from Class VII. They were chosen out of 70 students, based on their interest in the discussion and the quality of their research. Before the interaction, which was held on January 7, Ms. Nair asked them to read about key events leading up to Partition in 1947, and the history of India-Pakistan relations thereafter.\n\nZakaria is the author of The Footprints of Partition: Narratives of Four Generations of Pakistanis and Indians published in 2015. She teaches Development Studies at Headstart School in Islamabad, and also works with the Association for the Development of Pakistan. Her book draws much from her previous work on the Citizens Archive of Pakistan's Exchange for Change Project. This project gave her a first-hand opportunity to meet children and teachers from India.\n\nShe opened the interaction by wishing the students a happy New Year. “When you hear the name ‘Pakistan’, what comes to your mind? I want you to be honest. It could be anything — positive or negative. I promise you I will not feel hurt,” she said.\n\nOne of the students said, “India and Pakistan are like brothers. They keep fighting with each other. That is just like siblings. They too keep fighting.” Another student said, “Some people say you should never trust a Pakistani. They always betray you.” Yet another student said, “The perception about Pakistan is that it is a place full of terrorists. It does not make sense. People think of Africa as a continent full of snakes and infections. But when I went there, it was so wonderful. I am sure Pakistan too is beautiful.”\n\nSome of the questions the students asked her were: Has your book influenced the minds of people? How important is religion to you? How can we change the attitudes of Indians towards Pakistanis? If you were given a chance, what is the one thing you would like to change about Partition? Do you follow Indian media and politics? What do Pakistanis think of Gandhiji? Is it because of poverty in Pakistan that people join the Taliban? What was your childhood like?\n\nMost of the students were speaking to a Pakistani national for the first time.\n\nMs. Zakaria spoke to them of her own initial suspicion of Indians. Partition has been part of her family's history. Her grandmother had worked as a volunteer in one of Lahore's largest refugee camps in 1947. She warmed up to Indians after she met some in Canada while studying at McGill University. People who had seemed different from Pakistanis suddenly seemed a lot like her.\n\n(The writer is a freelance journalist)", 
    "section": "national", 
    "title": "For Mumbai children, a virtual intro to Pakistan", 
    "subsection": "general", 
    "date": "2016-01-11"
}