{
    "author": [
        "S Anil Radhakrishnan"
    ], 
    "text": "The route taken by a houseboat will be geo-fenced to prevent route violations.\n\nKerala Tourism will soon roll out a Global Positioning System-based fleet safety management system for houseboats in the State.\n\nHouseboats will be tracked on a Geographic Information System (GIS) map. There will be SOS/panic buttons for timely emergency response, and the route taken by a houseboat will be geofenced to prevent route violations.\n\nKeltron-iTAC, a vehicle-tracking and fleet-management solution by Keltron, a State government undertaking, will be used to track houseboats and ensure safety of tourists and crew. Sanction has been granted for the project and Rs.1.60 crore has been allocated for implementing the tracking system in 12 months, official sources told The Hindu .\n\niTAC integrates advanced technologies in GPS, Global System for Mobile Communication (GSM), General Packet Radio Service (GPRS), and microprocessor subsystems. “The application is being updated for houseboats. We will roll out the facility first in 500 houseboats,” S.P. Gopakumar, project manager, Keltron, said. A GPS mobile unit with GPRS module and internal battery that can provide additional power up to six hours will be installed in each houseboat at a cost of Rs. 8,000.\n\nThe GPS module on the houseboat will capture the geographical coordinate data and send the spatial information in real time to the control room in Keltron’s Karakulam unit via Internet. A tilt sensor will sound an alert when the houseboat tilts beyond a particular angle, says project manager, Keltron, V. Vijeesh. “We are yet to decide whether to make the panic button available to both the crew and travellers.”\n\nThe server at the central monitoring system will process the GPS data and relay the information in real time, to information retrieval interfaces. The tracking software application can provide route, halt, distance travelled, speed violation, fleet summary, and geofence alerts.", 
    "section": "national", 
    "title": "GPS-based tracking system for Kerala houseboats", 
    "subsection": "general", 
    "date": "2016-01-11"
}