{
    "author": [], 
    "text": "Apart from presentations on the spread of IS terrorism to Afghanistan, and the possibility of radicalisation in India, the briefings from top security agencies included a look at the three different coalitions now engaged in the fight against the radical terror group — the U.S.-led coalition of more than 60 countries that are conducting strikes on IS locations and supporting anti-Assad rebel groups, the Russian forces sent in to support President Assad’s Syrian military forces against IS and other groups, and the newly announced Saudi Arabia-led coalition of 34 Muslim nations, which claims it will attack IS as well.\n\nThe considered opinion of military and intelligence officials was that it would be inadvisable to offer any operational support beyond the current intelligence that has led to several IS-bound Indians to be apprehended. A senior official who was privy to the briefings told The Hindu : “We will also not do anything that could lead to the spread of IS terror inside India.”\n\nOfficials also rejected the possibility of joining a “ceasefire-monitoring mechanism” outside of the UN mandate, given pressure from the U.S. to join its coalition. Speculation over Indian support has been growing since Defence Minister Manohar Parrikar spoke on the issue on his return from a visit to U.S. naval facilities and meetings in Washington. “We have made it clear that if there is a UN resolution and if there is UN flag and a UN mission, then as per India’s policy to operate under UN flag, we will participate,” Mr. Parrikar had said.\n\n“If Syrians seek support, India can provide them indirect support,” a senior official said, referring to humanitarian aid, agricultural support and financial aid to develop its energy interests. “Syrians have offered oil fields to India. India is interested but the security situation is difficult. But India would prefer to purchase oil fields from Syria now and keep them frozen for future use,” the official confirmed.\n\nBut the West Asian nation can be given indirect support, if asked, says an official", 
    "section": "national", 
    "title": "India may not send troops to Syria", 
    "subsection": "general", 
    "date": "2016-01-11"
}