{
    "author": [
        "Madhumathi D S"
    ], 
    "text": "To engage domestic firms in launch vehicles — from integrating sub-systems to assembling and launching the PSLV\n\nTwo space industry enclaves or “parks” that have been conceived — one for launchers at Sriharikota and a smaller one at an existing Bengaluru spacecraft campus — signal increased privatisation of the nation’s space programme over the next five years.\n\nFor now, the facilities will be “captive” to drive the future missions of the Indian Space Research Organisation.\n\nFirst, ISRO wants to groom and engage domestic industry in the launch vehicles area from integrating sub-systems up to assembling, and even launching the PSLV.\n\nThis well-established rocket has put Indian and foreign satellites of up to 1,600 kg into space.\n\nISRO Chairman and Secretary, Department of Space, A.S. Kiran Kumar, told The Hindu: “Internal discussions have just started on the mechanism of forming a (launch vehicle) consortium. A few key industry players working in the space programme have been sounded.”\n\nEventually the future consortium will be fully responsible for building and launching the light-lift PSLV rocket.\n\nCurrently industries such as Hindustan Aeronautics Ltd, Godrej & Boyce, Larsen & Toubro, MTAR and Walchandnagar Industries produce 80 per cent of the launch vehicle parts and sub-units.\n\nThese production works are scattered across their respective locations. The launch industry initiative must be close to ISRO’s launch complex, the Satish Dhawan Space Centre, at the 145-sq km Sriharikota range, on the lines of the launch complex of Europe’s Arianespace in French Guiana, Mr. Kiran Kumar told The Hindu .\n\nSatellite support\n\nOn the spacecraft front, ISRO plans to increasingly support small and mid-sized industries at its 10-year-old second spacecraft complex, the 100-acre ISITE, at Marathahalli in Bengaluru.\n\nISITE, short for ISRO Satellite Integration & Test Establishment, is already open to a few suppliers who assemble and test their spacecraft systems for the ISRO. In the coming years, more satellites will be needed for replacing the ageing ones in orbit and new advanced communication, Earth observation and navigation spacecraft.\n\nPointer to increased privatisation of the nation’s space programme over the next five years", 
    "section": "national", 
    "title": "ISRO conceives two ‘space parks’", 
    "subsection": "general", 
    "date": "2016-01-11"
}