{
    "author": [
        "Mohit M"
    ], 
    "text": "With 4.5 lakh professionals, the city has more engineers than New Delhi and Mumbai\n\nThe IT capital of the country truly seems to have cemented its position as the home of engineers.\n\nWith 4.5 lakh persons, or nearly seven per cent of the city’s population, Bengaluru has more people with an engineering degree than New Delhi (all three corporations) and Greater Mumbai.\n\nRecently released 2011 census data enumerates those with technical degrees (that is, engineering and technology graduates) match the numbers cumulatively residing in Hyderabad and Chennai — both of whose economy boasts of large IT and ITeS companies.\n\nAs an indicator of the large gulf in engineer populations in the mega cities that dot the country’s landscape, Bengaluru — which contributes to nearly one-third of the country’s Information Technology exports — has nearly 1.4 lakh engineers more than the sprawling National Capital Region (Delhi, Gurgaon, Noida, Faridabad) and nearly two lakh more than Mumbai and its adjacent cities of Thane and Navi Mumbai.\n\nMore than 70 per cent of the engineers in the city are below the age of 35. The city can also boast having the maximum number of women engineers. At 1.4 lakh, women constitute a little more than 30 per cent of the work force — a ratio that increases to 40 per cent when considering the engineering work force below the age of 35.\n\nIt’d seem like in the past decade — since the IT ‘boom’ took shape in the city in 2000s — the number of persons either graduating or migrating to the city with graduate degrees in tow has disproportionately increased.\n\nWhile the past decade has seen the population of Bengaluru urban rise by 47 per cent, the number of graduates (not just engineering) has risen by a staggering 125 per cent.\n\nWhile the influx of engineers from outside may have been a factor (the census 2011 figures on migrants are yet to be released), Narendar Pani, Professor, School of Social Sciences, National Institute of Advanced Studies, believed the nearly century-old inclination towards engineering as well as the collapse of interest in non-technical degrees in the city may have contributed to the rise in engineers here.\n\nMore than 70 per cent of the engineers in the city are below the age of 35", 
    "section": "national", 
    "title": "It’s destination Bengaluru for techies", 
    "subsection": "general", 
    "date": "2016-01-11"
}