{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "Only BJP had the courage to choose a person from an OBC family for Prime Minister, says Amit Shah.\n\nBJP chief Amit Shah on Sunday said the party had given top posts like Prime Minister and Chief Minister to leaders from the backward classes and accused the Congress of having worked against the interests of OBCs.\n\nHe was addressing delegates from the newly constituted OBC Morcha (front) of the party. Delegates from 19 States had converged here for the party’s OBC Morcha meet. Mr. Shah also underlined the purpose of the Morcha, which came up in 2015, ensuring constitutional rights to OBCs without social disharmony, and reaching out to the most backward castes among the OBCs.\n\nThe former Prime Minister, H.D. Deve Gowda’s assertion last year that he was the first OBC Prime Minister notwithstanding, Mr. Shah claimed once again that Narendra Modi was India’s first Prime Minister from a backward caste.\n\n“We alone had the courage to choose a person from a poor, backward family for the Prime Minister’s post. Today he is making India proud globally,” Mr. Shah said.\n\nHe hit out at the Congress for having “ignored” the OBCs, saying the word “backward” would not have to be still used for so many had the Kaka Kalelkar (First Backward Class Commission) report been accepted.\n\nAs for the Mandal Commission (Second Backward Class Commission), Mr. Shah said: “It was constituted by the Janata government, of which we were a part. Its recommendations were also accepted not by a Congress government but by the Jan Morcha, which we supported.”\n\nThe context: the 1950 Constitution did mention the OBCs, but these two commissions went into who would be included in the category and what the government should do for them. Mr. Shah said the Morcha should aim at OBC rights sans caste conflict and reach out to the most backward castes among the OBCs.\n\nHe accused the OBC-related parties in north India of pursuing interests of a family or caste in the name of the whole category.", 
    "section": "national", 
    "title": "It’s BJP that honoured backward classes: Shah", 
    "subsection": "general", 
    "date": "2016-01-11"
}