{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "Constant compartmentalising of one’s identity is one of the biggest stress factors to the mental health of Lesbian, Bi-sexual and Transgender (LBT) community, according to the findings of the National Consultative Meet of LBT collectives and practitioners that was held in Tata Institute of Social Science (TISS), last month.\n\nThe meet was organised by iCall and comprised sessions on stressors the community faces and the way they are addressed currently. The gathering also discussed gaps in the services addressing these mental health needs and what can be done to solve these lacunae.\n\n“A person may use a different identity with different people. Identities are different at different places. The person has to do with this constant juggling act and that’s the most taxing thing for most people from the LBT community,” said Paras Sharma, Program coordinator at iCall.\n\niCall, a telephone helpline, is one of the many field action projects at the Tata Institute of Social Science (TISS), attached with the School of Human Ecology. It was initiated in 2012, sensing dearth of qualified mental health professionals in India. The helpline receives around 1,000 to 1,500 phone calls every month and around 100-200 emails from people from all over India. The helpline, 022-25521111, does not restrict to any particular issue, but deals with a wide range of problems. “That’s why we call it psycho-social helpline,” said Mr. Sharma.\n\nViolence from partner and family\n\nViolence from the partner and family was also discussed as one of the reasons leading to psychological trauma to people from the LBT community. “If a person is in a lesbian relationship and is faced with violence, who does that person go to? There is hardly any legal protection,” said Mr. Sharma, adding that the community itself is agreeing to the fact that this is becoming a big issue.\n\n“Mourning the loss of a partner too becomes a huge issue. How do you do that? There is no legitimacy to the relationship in front of the outside world. That takes a toll on mental as well as physical health,” he said.\n\nThe issues discussed included livelihood problems for transgender individuals if they openly admit their sexuality. Access to healthcare is also one of major issues of concern. “Many a time it has been seen that doctors are not sensitive when told he or she is treating a homosexual,” was an observation made during the meet.\n\nLeading collectives working with LBT individuals such as Sappho for Equality from Kolkata, Nazariya and Qashti from New Delhi, Zehen collective, Labia and Umang based in Mumbai as well as prominent LBT affirmative independent practitioners from Chennai and Bengaluru took part in the meet.\n\nA short report on the meet advocated affirmative adoptive stance from mental health services towards individuals identifying as LBT. iCall with the help of participants in the meet will be coming up with a bigger report on challenges faced by LBT groups in near future.", 
    "section": "national", 
    "title": "‘Juggling identities biggest challenge for LBT community’", 
    "subsection": "general", 
    "date": "2016-01-11"
}