{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Venues getting ready, officials to brief organisers on safety measures to be adopted\n\nTwo days after the Centre cleared the decks for the conduct of jallikattu or bull taming, the Madurai district administration has begun the groundwork for hosting the events during Pongal, the festival of harvest, between January 15 and 17. The event would be held at Avaniyapuram in the city and at Palamedu and Alanganallur in the rural areas, all of which attract curious tourists from across the globe.\n\nDistrict Collector L. Subramanian with other officials on Sunday began the inspection of the venues to take up work on construction of gallery, erection of barricades for bulls and the area for medical inspection of bulls and the collection area, where the bulls would reach after their run in the arena.\n\n“This time, we are going to earmark a 15-metre radius within which the bull tamers should try to tame the animals as per the Centre’s notification, which facilitated the lifting of the ban on jallikattu . A red flag would be put up at the 15-metre mark beyond which no bull tamer would be allowed. Stringent action would be taken against violators and they would be removed from the arena,” Mr. Subramanian said.\n\nThe district administration has convened a meeting with the members of jallikattu organising committees to give the instructions for safer conduct of the sport.\n\n“As per the notification of the Centre, the events would be conducted under the watchful eyes of officials to ensure the bulls’ safety. A team of Government veterinary doctors would test every bull for their good health before being permitted into the arena,” Mr. Subramanian said.\n\nDouble barricades would be erected around the arena to ensure safety for spectators.\n\nA medical camp, along with ambulances, would be kept ready at venues to treat the injured bull tamers.\n\nThe event\n\nwill be held at Avaniyapuram, Palamedu and Alanganallur", 
    "section": "national", 
    "title": "Madurai gearing up for jallikattu", 
    "subsection": "general", 
    "date": "2016-01-11"
}