{
    "author": [
        "Suvojit Bagchi"
    ], 
    "text": "Rights group says last Sunday’s incident that triggered unrest was the result of general lawlessness in West Bengal\n\nFile picture of vehicles set on fire during clashes between two groups in Malda on January 3. —Photo: PTI\n\nA week after mob-led violence in Malda in north-central Bengal, a rights group has said the incident which triggered it was “not communal” in nature.\n\nThe Malda chapter of the civil rights organisation, Association for Democratic Rights (APDR), has issued a statement that last Sunday’s incident cannot be called “communal by a long shot.” Malda district secretary of APDR, Jishnu Roy Chowdhury, has blamed miscreants for “triggering” unprecedented violence, which is “a symptom of lawlessness in the State.”\n\n“But it was never a fight between communities where Muslims targeted Hindus or vice versa, as reported by a section of the national press, especially television,” said Mr. Chowdhury. APDR, which has been routinely critical of Chief Minister Mamata Banerjee, issued the statement after a fact-finding exercise.\n\n“Communal comments by a Hindu leader provoked an unfortunate incident in Kaliachak police station area in Malda. We condemn the fact that communal flavour has been added to the incident to incite people,” the statement said.\n\n“Miscreants could take advantage of the incident due to negligence on the part of the administration and a religious campaign of extreme nature. However, the incident was not communal by a long shot. Even if the administration was late in responding, it acted positively to establish peace,” the statement, signed by Mr. Chowdhury, said.\n\nThe civil rights group also claimed that there was “an attempt to spread rumours of communal nature” and asked the local residents to distance themselves from such efforts.\n\nAnjuman Ahle Sunnatul Jamat (ASJ) organised a rally in Malda on January 3 in the Kaliachak block to protest against an alleged derogatory statement made against Prophet Muhammad by a leader of a Hindu organisation in Uttar Pradesh. Contradictory reports emerged regarding the size of the gathering, a section of which turned violent, injuring over a dozen policemen, torching police vehicles and even firing shots. A 22-year-old person was injured in the incident. It was later reported by a section of the media that the incident was communal in nature, “escalating some tension” in the area, officials of Malda district police told The Hindu .\n\nInitial investigations revealed that an escalation in police activity in the area to stop large-scale opium trade in Golapganj and Mehndipur under the blocks of Kaliachak irked the traders associated with the “business.”\n\nThe other factor that apparently escalated the violence was a rumour that the National Investigation Agency was setting up an office in Malda to monitor fake currency transaction, cow smuggling and drug trade.\n\nRetired police officials attributed the Malda violence to “general lawlessness” in West Bengal as names of some of the local TMC leaders featured in the initial investigation. At least 10 persons have been arrested and the Home Ministry has sought a report. The BJP has set up a three-member fact-finding team that will visit Malda. The team, set up by BJP president Amit Shah, will be headed by party national general secretary and Member of Parliament Bhupender Yadav, a party release said.", 
    "section": "national", 
    "title": "‘Malda not a fight between communities’", 
    "subsection": "general", 
    "date": "2016-01-11"
}