{
    "author": [], 
    "text": "Vehicles stranded at Poonch in Jammu and Kashmir following heavy snowfall on Sunday.— PHOTO: PTI\n\nMercury on Sunday dropped across north India with Leh in Jammu and Kashmir recording a low of minus 14.7 degrees Celsius even as the minimum temperature in the national capital was 8.7 degrees Celsius, two notches above the season’s average.\n\nIn Kashmir, mercury dropped across the Valley as the minimum temperature settled several degrees below freezing point.\n\nIn Leh town, the temperature dropped by a degree to settle at minus 14.7 degrees Celsius against minus 13.5 degrees Celsius on Saturday night, the local MeT official said. Kargil town recorded a low of minus 13 degrees Celsius, up by one degree compared to previous night.\n\nThe minimum temperature at the famous ski resort of Gulmarg recorded a low of minus 9.2 degrees Celsius. Most parts of Himachal Pradesh continued to reel under freezing cold wave as night temperatures stayed four to five degree below normal.\n\nKeylong in tribal Lahal and Spiti district was coldest in the region with a low of minus 10.9 degree, while Manali and Kalpa shivered under freezing cold wave conditions with mercury dipping to minus 3 degrees and minus 1.8 degree.\n\nHowever, it was a warm and sunny day in Delhi as the maximum temperature was recorded at 24.4 degrees Celsius, four notches above normal, and the minimum at 8.7 degrees Celsius, two above the season’s average.\n\nNarnaul in Haryana was the coldest in the State where mercury dropped to a low of 4.6 degrees Celsius. Chandigarh registered a low of 5.8 degree Celsius, one degree above normal, as per local MeT department report. In Punjab, Amritsar recorded its low at 4.8 degrees Celsius, while minimum temperatures in Ludhiana and Patiala settled at 5.7 and 7.7 degrees Celsius, respectively. — PTI", 
    "section": "national", 
    "title": "Mercury drops in North India", 
    "subsection": "general", 
    "date": "2016-01-11"
}