{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Security experts say these commandos have been trained for operations inside bases\n\nLate on January 2 evening, Union Home Minister Rajnath Singh tweeted that the 15-hour operation in the Air Force Station, Pathankot, ended and all four terrorists were killed. Defence Minister Manohar Parrikar and even Prime Minister Narendra Modi made similar statements.\n\nWithin no time, however, the government was proved wrong — more terrorists re-engaged the special forces and the operation continued for another three days.\n\nWhy do a majority of security experts believe that the Pathankot operation, in which personnel of the elite National Security Guard, Garud commandos of the Indian Air Force and later the infantry columns of the Army were deployed, was botched up?\n\nWas there a better force, or a combination of many, available?\n\nGiven the nature of the operation and the location, the Special Forces of the Parachute Regiment (Para SF) of the Army would have been ideal, say those familiar with its training and operations.\n\n“Perimeters should have been secured by the local Army units. The Army Special Forces would have been a better option, as they do regular exercises inside bases ... Whoever decided [during the Pathankot operation] did not even know the type of Special Forces we have,” Lt. Gen. Prakash Katoch, a former para-commando, said.\n\nThe Parachute Regiment has essentially two components — the parachute force and the Para SF, with battalions of 600-700 soldiers each. They are typically armed with Israeli Tavor-M assault rifles, Galil sniper rifles, M4A1 carbines, and Beretta and Uzi pistols. They are known as “Maroon Berets” because of their characteristic maroon caps.\n\nIn contrast, the very mandate of the NSG and the Garuds is different. The NSG has been raised for anti-hostage operations and confined battle situations.\n\n“The NSG is required for a specific target; it cannot tackle an area target,” Lt. Gen Katoch said.\n\n“The Para SF should have been employed initially to minimise collateral damage and reduce loss to our troops. They would have been the ideal force,” Lt. Gen. Bhatia, former Director-General of Military Operations, said.\n\nThe arguments find further validation as at least three Para SF units were available not very far from the airbase, Army officers say.\n\nThe Garuds are trained for special Air Force missions behind enemy lines. “The Garuds were raised for a different mandate for special Air Force tasks and not anti-terror operations,” the former Chief of the Air Staff Fali H. Major said.\n\nIn two hours, half the Indian Army could have been mobilised to Pathankot, a senior serving infantry officer said, referring to the large Army formations nearby.\n\n“The Para SF has been battle-hardened, fighting insurgency in the Valley [Kashmir]. The ideal thing would have been to dominate the base with infantry units and press in Para SF to take out the terrorists,” he said.\n\nTough standards\n\nGetting into the Para SF units is not easy even for Army personnel. The selection standards are extremely high and the training rigorous. The officer selection rate is about 12-15 per cent and for the soldiers, it is slightly higher as they are drawn from their regimental centres, Lt. Gen. Bhatia said.\n\nFor instance, in September 2013, when an Army camp was attacked in the Samba sector, after some initial casualties, the Para SF units came and finished off the operation in four hours, killing three terrorists.\n\nIn the cross-border raids on terrorist camps in Myanmar last year, 21 Para SF units led the operations without any casualties.\n\nThe parachute regiments of the Army are among the oldest airborne units globally. It dates back to October 1941 when 50 Indian Parachute Brigade was raised in Delhi. It fought in World War II. Post-Independence, the para-battalions have been successfully employed in various wars and operations.", 
    "section": "national", 
    "title": "Para SF team was the ‘best bet’", 
    "subsection": "general", 
    "date": "2016-01-11"
}