{
    "author": [], 
    "text": "All British parents will be encouraged to take government-run parenting classes under plans due to be announced by Prime Minister David Cameron, The Observer reported on Sunday.\n\nA previous scheme to educate parents from under-privileged backgrounds after the 2011 London riots flopped, attracting around 15 per cent of the expected intake.\n\nBut the government believes that opening the scheme to all parents will rid it of its stigma, helping it become as ingrained as antenatal classes, the newspaper reported. “In the end, getting parenting and the early years right isn’t just about the hardest-to-reach families; it’s about everyone,” Cameron was expected to say on Monday, according to The Observer .\n\n\"Of course they [children] don’t come with a manual...we all have to work at it. And if you don’t have a strong support network — if you don’t know other mums or dads — having your first child can be enormously isolating.”\n\nParents receive support immediately after the birth, but the prime minister said that needed to be extended.\n\n“What about later on, when it comes to play, communication, behaviour and discipline? We all need more help with this — the most important job we'll ever have,” he said. “So I believe we now need to think about how to make it normal — even aspirational — to attend parenting classes.”\n\nThe 2011 CanParent pilot attracted just 2,956 parents, despite the government budgeting for 20,000.\n\nThe £5 million scheme ended up costing £1,088 per parent, although a study of attendees found high degrees of satisfaction.\n\nPoorer parents could receive vouchers to attend the courses while funding for relationship counselling classes is set to double, according to extracts of Cameron’s speech published in Sunday’s newspapers. — AFP\n\nDavid Cameron is likely to announce government-run childrearing classes on Monday", 
    "section": "national", 
    "title": "Parenting lessons for British parents", 
    "subsection": "general", 
    "date": "2016-01-11"
}