{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Congress, Shiromani Akali Dal and AAP turn Maghi Mela into a competitive platform\n\nPunjab, where the Assembly elections are due early next years, is set to witness shows of strength by the Congress, the Aam Aadmi Party (AAP) and the ruling Shiromani Akali Dal (SAD), with all three parties planning to hold huge rallies at Muktsar on January 14 on the occasion of Maghi Mela.\n\nCadre of all parties are busy making arrangements to ensure the presence of the most number of people at their venues and make their rally a bigger success than that of their rivals.\n\nThe AAP has announced that its election campaign will be officially launched with the January 14 rally, which will be addressed by AAP’s national convener and Delhi Chief Minister Arvind Kejriwal.\n\n‘Ready for challenge’\n\nState Congress president Amarinder Singh has said the party is ready to take on the new entrant, AAP, and dismissed the ruling SAD-BJP alliance as not being in a position to pose any challenge. The SAD-BJP, on the other hand, is harping on development and good governance during its rule in the State to garner people’s support.\n\nLeaders of the AAP are expecting at least five lakh people to attend the rally.\n\nSucha Singh Chotepur, the convener of the AAP’s Punjab unit, said several senior leaders of other parties, including those of the Congress and the Akali Dal, were keen to join the AAP in the presence of Mr. Kejriwal at the Muktsar rally.\n\nThe Congress has also planned its rally in the same area on the day. Capt. (retd.) Singh told The Hindu that the AAP had become a junkyard for deadwood in the Congress, while the SAD-BJP had failed on all fronts.\n\n“We will try to convince the people that they (AAP) don’t have a face or programme. And on the other hand, we have had 10 years of bad governance (SAD-BJP rule), and we may not recover if another bad government is elected,” he said.\n\nThe Congress will take up issues such as corruption, drugs, unemployment and lawlessness.\n\nThe SAD, meanwhile, is planning to hold its rally at a 22-acre site with Deputy Chief Minister Sukhbir Singh Badal overseeing arrangements for the rally. SAD leaders said the government had done immense development work and now it was time that the message was conveyed to the people.\n\nKejriwal to launch election campaign, other parties to hold rallies at Muktsar", 
    "section": "national", 
    "title": "Shows of political might in Punjab", 
    "subsection": "general", 
    "date": "2016-01-11"
}