{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "The Supreme Court, on Monday, will decide on a petition filed by the Supreme Court Women Lawyers’ Association (SCWLA) seeking castration as a punishment for child rapists.\n\nThe court is hearing the petition at a time when new anti-rape laws have made rape punishable with the death penalty. The association, represented by senior lawyer Mahalaxmi Pavani, described its petition as a “feeble and strong appeal to this highest court of the country to come out in support of these innocent and unprotected children of our country”. The petition quotes passages from the works of ancient Greek tragedian Sophocles, observations made by Justice N. Kirubakaran of the Madras High Court and Union Minister M. Venkaiah Naidu’s comments to back its plea. “When the law is ineffective and incapable of addressing the menace, this court cannot keep its hands folded and remain a silent spectator, unmoved and oblivious of the recent happenings of horrible blood-curdling gang rapes of children in various parts of India,” says the petition quoting Justice Kirubakaran in a recent judgment.\n\nIt then goes on to quote the “reaction” of Mr. Venkaiah Naidu to this judgment. “He said, ‘Happy about the Madras High Court judgment. ‘Human Right’ is not a term restricted to, and only reserved for, offenders.’ ”\n\nIt also quotes Sophocles: “Laws can never be enforced unless fear supports them.”\n\nNoting that the court could fill in when there was a vacuum in the statutory law, the petition said, “Castration is any action, surgical, chemical or otherwise, by which a biological male loses sex drive.”\n\nNew law has already added the death penalty as a punishment for the offence of rape", 
    "section": "national", 
    "title": "Supreme Court to hear plea to award castration to those who rape children", 
    "subsection": "general", 
    "date": "2016-01-11"
}