{
    "author": [], 
    "text": "“We are definitely keen to do away with the tax provisions that characterise angel investments into a new venture as the investee company’s income, thus taking away roughly 30 per cent of the investment from the start-up’s cash flow as it is taxed,” the official added.He added that this tax applies only to domestic investors and thus acts as a disincentive to local funding for start-ups that the government wants to incentivise instead. “This is not about sops for start-ups, but ensuring equal treatment. Which country in the world taxes its own investors higher than foreign investors?” R. Chandrasekhar, president of IT industry body Nasscom told The Hindu . Industry has told the government that this is tantamount to double taxation on angel financiers who may have already paid taxes on their investment amount and would be taxed again on the returns from such investments.\n\n“By its very definition, angel investing is risky and if a particular investment leads to windfall profits, it must be taxed. But the problem is that tax is levied at the time of investments not at the time of booking profits, so it discourages domestic angel investors who are keen to bet on start-ups as the stock markets are not going anywhere,” Mr. Chandrasekhar pointed out. The tax treatment and difficulties of doing business in India as start-ups attain scale, make it attractive for such ventures to relocate out of India to countries like Singapore; 65 per cent of successful start-ups that began in India have moved out of the country, industry secretary Amitabh Kant said recently.\n\nNasscom and the Confederation of Indian Industry have flagged the taxing of angel investments as well as income of high-net worth angels as a major impediment for the government’s drive to create a friendly start-up ecosystem. The CII has pointed out that the tax on investments by angels is particularly unnerving as it could also lead to disputes on the valuation of such investments with tax authorities and scare investors away.\n\n“At the stage that angels invest, start-ups have no revenue or profits and the valuation is based on the potential and promise of the idea and is usually a simple negotiation between founders and angel investors. The IT department would not have the domain understanding to value the innovation...This will subject all investments in start-ups to re-evaluation and will open a plethora of disputes,” a note from the CII to the government stressed.\n\nAccording to estimates by the team of officials working on the Start Up India programme, start-ups in the country received around 9 billion dollars of funding in 2015.\n\nReturns made by domestic individual investors from their start-up investments are taxed at the highest marginal personal tax rate (around 33 per cent), while investments routed through a Mauritius-based fund or by corporates who only need to pay long term capital gains tax of around 10 per cent are taxed much lower, pointed out Mr. Chandrasekhar.\n\nAnother government official dealing with start-ups said the tax on angel investments is something that can be fixed in the Budget, but he wasn’t sure that the tax on income of individual angel investors could be resolved so soon.\n\n“In such cases, we would have to look at reviewing the three-year lock-in period, just for investments in start-ups, so that such investors can pay long-term capital gains tax. Such a long lock-in period is not compatible with the hectic pace at which investors exit and enter start-up ventures,” he explained.\n\nIndustry leaders said the government’s focus on start-ups is welcome, but it must recognise that they can now operate from anywhere in the world virtually, even if they have employees and business income in India.\n\n“The tax treatment is only the symptom of the larger malady. The talent for start-ups is here, value is added here, so why should this value and the taxes it could yield go out of our national accounts books and accrue to some other country,” Mr. Chandrasekhar asked.", 
    "section": "national", 
    "title": "Tax on seed funding goes", 
    "subsection": "general", 
    "date": "2016-01-11"
}