{
    "author": [
        "Nikhila Henry"
    ], 
    "text": "‘I told the immigration authorities in Hyderabad that we cannot detain our own students,’ said Mahmood Ali.\n\nTimely intervention by Telangana Deputy Chief Minister Md. Mahmood Ali helped 16 student deportees from the U.S., who landed in the city airport late on Saturday, from a 12-hour ordeal of immigration check and document signing process.\n\nWhen the Deputy Chief Minister, who was on a two-day trip to Jammu and Kashmir, landed in Hyderabad at 12 a.m. on Sunday, it was the sight of tired, starved and thirsty students waiting at the immigration counters that greeted him.\n\nWhen the parents and relatives of those stranded in Hyderabad approached Mr. Ali, he marched straight to the immigration counter to talk to the authorities. “I told them that we cannot detain our own students. The students looked tired and had already been through a lot in the U.S. I instructed them not to torture them with a long wait further,” Mr. Ali told The Hindu later on Sunday.\n\nAmong the deportees were six with I-20s issued by University of New Haven, Connecticut. The others had taken admission in universities including Silicon Valley University and Northwestern Polytechnic University. The fresh group of student deportees had landed flying five different airlines — Air India, Etihad, Emirates, Singapore and Silk. Most were deported from New York’s JFK International Airport.\n\nThe students, on reaching the U.S., were asked to “voluntarily surrender their visas” or face a five-year entry bar. After eight hours of staying cuffed in the airport, they were deported, the students said. “But it was Hyderabad which broke us completely. They wanted us to sign papers after papers. At JFK airport there were water points, but in Hyderabad we were not allowed to move or talk to others,” said Abhilash Vonumpalli from Hyderabad.\n\nMost students did not have food for almost 10 hours, they complained.\n\nTo clear the immigration tussle, Mr. Ali contacted the airport authorities, security officers and Customs wing heads. “I landed in Hyderabad at 8 p.m. on Saturday and could meet my father only at 3.30 a.m. on Sunday,” Mr. Vonumpalli rued. The Deputy CM, however, stayed in the airport till 1.30 a.m. to help students clear the process.", 
    "section": "national", 
    "title": "Telangana Deputy CM comes to the help of deported students", 
    "subsection": "general", 
    "date": "2016-01-11"
}