{
    "author": [
        "Nikhila Henry"
    ], 
    "text": "The book discusses gender in its composite form without limiting itself to crime against women\n\nThe textbook has been introduced on a pilot basis in engineering colleges. —Photo: Special Arrangement\n\nTelangana has become the first State to introduce compulsory gender education at the graduate level; without repeating gender stereotypes in its bilingual textbook titled, ‘Towards a World of Equals.’\n\nThe book introduced on a pilot basis in engineering colleges affiliated to the Jawaharlal Nehru Technological University (JNTU-Hyderabad) discusses gender in its composite form without limiting itself to crime against women. From information on unacknowledged women writers of Telangana to problems of sex selection and women’s work in politics and economics, the book attempts to cover it all.\n\nIt also touches upon complex subjects like female-centric history and male-female relationships.\n\nStructured in simple language and form to suit under-graduates, the book discusses different strands of women’s movements across the world, introducing students to political movements of Afro-American, Caribbean, African, Dalit and minority women.\n\nAnd coupled with the book is a collection of visual teaching tools which include documentary films.\n\nThe book is being taught over 14 weeks in a semester at the rate of two classes per week.\n\nCredits earned in the end semester examination add up to students’ GPAs.\n\nA nine-member, all-women, panel which drafted the syllabus and developed its content has already held four training workshops for groups of 15 to 40 teachers and is expected to take up yet another session this week.\n\nWhat makes the textbook interesting is the gamut of reactions and classroom discussions which it attempts to generate. For instance, in its first chapter on Socialisation, the book hints at initiating a discussion in the classroom on “Are boys taught household work while growing up? Discuss your experiences at home.”\n\nOptimistic\n\nEditors of the textbook published by the Telugu Academy are optimistic about the results.\n\n“We have received a lot of good feedback from teachers,” said A. Suneetha, one of the editors.\n\nThe book discusses construction of gender stereotypes through pictures on male and female hairstyles, clothing and discussions on popular songs like ‘Kolaveri’, advertisements and films.", 
    "section": "national", 
    "title": "Telangana becomes first State to make gender education compulsory", 
    "subsection": "general", 
    "date": "2016-01-11"
}