{
    "author": [], 
    "text": "The U.S. multi-State Powerball lottery on Sunday soared to a whopping $1.3 billion in a new world record, tickling Americans’ dreams further of overnight riches after there were no winners for a record $900 million jackpot.\n\nNo ticket holder had the magic combination of 32-16-19- 57-34 and the Powerball number 13.\n\nThe next drawing for the Powerball lottery, which takes place on Wednesdays and Saturdays at 10.59 p.m. (9.29 a.m. IST) has shot to a whopping $1.3 billion.\n\nThe grand prize for the lottery, which is played in 44 States, Washington, and two U.S. territories, has been climbing for weeks after repeated drawings produced no big winners.\n\nThe jackpot began on November 4, 2015 at $40 million but rolled over 19 times before Saturday.\n\nBut, the Saturday night drawing for a record $900 million jackpot — the largest in U.S. history — produced no winners, fuelling excitement of being a potential winner even more. “No #Powerball jackpot winners in any state tonight. Wednesday’s jackpot is a new WORLD RECORD! Can you believe it?” Texas Lottery tweeted.\n\nIn the Powerball lottery, five white balls are drawn from a drum containing 69 balls while a sixth red one is pulled from a drum with 26. A ticket holder has to match all the numbers on the selected balls to win the jackpot.\n\nThe first five can be in any order, but the sixth must be the Powerball number.\n\nThe winner can either opt to receive the full jackpot in annual instalments over 29 years or take a lower one-off payment in cash.\n\nGary Grief, the executive director of the Texas Lottery was quoted as saying by the Chicago Tribune that the chance of no one hitting all five initial numbers and the Powerball number was growing slimmer, anticipating that about 75 per cent of all combinations will have been bought. — PTI", 
    "section": "national", 
    "title": "U.S. powerball lottery jackpot springs to $1.3 billion in a new high", 
    "subsection": "general", 
    "date": "2016-01-11"
}