{
    "author": [], 
    "text": "Record players that have spun back into fashion were on display at CES 2016 in Las Vegas\n\nVictrola turntables with vintage designs but modern technology on display at the Consumer Electronics Show. — Photo: AFP\n\nTurntables turned heads as a renewed love of old-time vinyl records struck a chord at the famously futuristic Consumer Electronics Show.\n\nSony, Panasonic, Victrola, and Audio-Technica were among the companies showing off turntables boasting digital age spins such as high-resolution audio or wirelessly connecting to speakers.\n\nTurntable makers at CES, which wraps in Las Vegas on Saturday, told of vinyl records being all the rage after years of digital tunes dominating the music industry.\n\nSony Electronics president Mike Fasulo said at the show that vinyl records were \"on fire\" and that the Japanese entertainment giant’s music arm was working hard to keep up with demand.\n\nA Victrola booth on the CES show floor was packed with a wide array of turntables that combined modern features with vintage designs.\n\nVictrola turntables date back more than a century, and the brand was bought recently by Innovative Technology which has offices in the US and Hong Kong. “There is something retro about vinyl that inspires the nostalgia in all of us,” Guillermo Moncada of Innovative told AFP at the Victrola booth.\n\n“We grew up with our parents vinyl collections, and our millennial generation is now collecting them as well,” the 29-year-old continued. “We have a personal relationship with vinyl as opposed to an MP3 file.”\n\nWhile digital music from mobile devices or streamed online might slipped into the background for people, vinyl tends to be more tactile and interactive.\n\nListeners may admire album cover art or ponder lyrics printed on the back or on record sleeves. Records also call for listeners to get involved by flipping them over. “You are sitting there actually enjoying the music,” Moncada said of opting for vinyl records.\n\n“You have a connection with it in a sense; that is something a lot of us are starting to realize again.”\n\nIn addition, many audiophiles appreciate the sound of music on vinyl, grainy edges and all.\n\nTurntables have been hot sellers for Los Angeles-based Boytone, which even has a model with a cassette tape player. An array of turntables found at CES were built into carry cases to go mobile in designs reminiscent of decades past. Despite vintage looks, new model turn tables boasted features such as Bluetooth connections to speakers of headphones, or being able to plug into computers so music on records could be “ripped,” or copied, into digital files.\n\n“It allows you to keep your turntable and vinyl in one room while enjoying your records virtually anywhere in the house,” Crystal Griffith of Audio-Technica said of wireless capabilities in a freshly-unveiled model.\n\nA new Sony turntable included the ability to automatically convert analogue music from records into digital format for listening on other devices. — AFP", 
    "section": "national", 
    "title": "Waxing nostalgic over vinyl records", 
    "subsection": "general", 
    "date": "2016-01-11"
}