{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "The whistleblower in the “leaked tape” saga in Chhattisgarh, Firoz Siddiqui, has refused to confirm that it was his voice in the purported conversation to “fix” a bypoll last year, which also featured the alleged voices of senior Congress leaders and relatives of Chhattisgarh Chief Minister Raman Singh.\n\nIn a letter written to Chhattisgarh Chief Secretary Vivek Dhand, who has been asked by the Election Commission to submit a report in the matter, Mr. Siddiqui said, “Since December 30, many newspapers and news channels are carrying news of an audio CD regarding the Antagad bypoll last year and my name is also being dragged into it. But the truth is that I never said that the voices in the CD were that of mine or that of Ajit Jogi [senior Congress leader], Amit Jogi [Congress MLA], Puneet Gupta [son-in-law of CM], Manturam Pawar [the Congress candidate who withdrew] or Amin Menon.”\n\n‘Dirty politics’\n\n“It appears my name is being dragged by some political parties which are playing dirty politics in the State. I strongly oppose it. I cannot say that the voice in the tape is that of mine. I have been maintaining that there should be an inquiry into this matter,” he wrote.\n\nAfter the tapes were leaked to the media, Mr. Siddiqui had told some newspapers and a news channel that it was his voice in the tape.\n\nHis denial came a day after a press conference by State Congress chief Bhupesh Baghel, who alleged threat to his and Mr. Siddiqui’s life.\n\nCongress’ poser\n\nReacting to Mr. Siddiqui’s letter to the Chief Secretary, Mr. Baghel said, “How did the letter he wrote to the Chief Secretary get leaked? The Chief Secretary has questioned only Mr. Siddiqui. What about others whose voice featured in the tapes? When is he going to question them?”\n\nSays it is not his voice in the purported conversation to fix Chhattisgarh bypoll", 
    "section": "national", 
    "title": "Whistleblower in leaked tapes does a U-turn", 
    "subsection": "general", 
    "date": "2016-01-11"
}