{
    "author": [
        "S Harpal Singh"
    ], 
    "text": "With the ban on caste panchayats, the annual event has lost much of its character\n\nTraders are coming in lesser numbers to the annual fair as there is no one to settle their disputes. .— Photo: S. Harpal Singh\n\nWill the Malegaon yatra, the second biggest animal fair in the country after Rajasthan's Pushkar mela, continue to be as glorious without its donkeys, horses and camels? The number of animals traded at the annual yatra which takes place in the month of Pousya (December-January) has fallen drastically over the last three years since the clampdown on the ‘jaat’ panchayats at the place.\n\nThe fair goes back at least 350 years in this small town in Loha taluka of Nanded district in Maharashtra and reflects the culture and traditions of the notified castes and dependent communities in areas that were once part of the Hyderabad State under the Asaf Jahi rulers. It served as a meeting place for the scattered families of communities like Vaidu, Kaikari, Potharaju, Masanjogi, Chudbudkewale, Wadderas and Pardis from the Telangana-Marathwada-Karnataka regions. Apart from the trade in cattle, the fair was also an occasion to hold panchayats to settle disputes among the scattered communities.\n\nThe Malegaon yatra, or jatra , revolves around the temple of Khandoba, the deity worshipped as Mallanna and Mailara in Telangana and Karnataka by many communities. “The assemblage of communities which depended on donkeys as a means of livelihood elevated the fair as an important donkey market which subsequently became a horse and camel trading centre,” states Purushottam Patil, a retired professor and member of the family of priests of the Khandoba temple.\n\n“With no panchayats to settle their disputes or address concerns, more and more number of our people are finding it irrelevant to come here,” said Rama Kale, a donkey trader from the Vaidu community from Osmanabad in Nanded district.\n\nThe annual event is believed to have started during the reign of the Qutub Shahi kings in the Deccan and given its present colour and shape by the Nizams of Hyderabad.\n\nOne of the ancestors of Patil was designated Jagirdar of the area and priest presumably by the first Nizam.\n\nThe family used to conduct the yatra until Independence.\n\nOld trade route\n\n“This village was selected for trading in animals for its location on the old trade route and its expansive grasslands which were necessary to keep the animals alive over a longer period of sojourn. Initially, horses and camels from the north and elephants from the south were traded but later on the trade was extended to even cats, dogs, monkeys, squirrels and what have you,” he said.\n\nThis year, however, only about 1,500 camels and only 2,500 donkeys were put on sale at the yatra, a drop of about 50 per cent.\n\n“We have brought fewer camels from Patan in Rajasthan as it is becoming increasingly difficult to find dry fodder,” said Rizwan Ali Khan, a camel trader from Hyderabad.", 
    "section": "national", 
    "title": "Without panchayats, Malegaon yatra loses its sheen", 
    "subsection": "general", 
    "date": "2016-01-11"
}