{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "Till April 2012, Ambikesh Mahapatra had been leading a quiet life teaching chemistry at Jadavpur University. On the twelfth of that month, his life changed. The police arrested him for forwarding an e-mail containing a joke on Chief Minister Mamata Banerjee. Now, Professor Mahapatra has grown into a political adversary of the ruling Trinamool Congress in the State.\n\nAfter his arrest, he became a household name, a symbol of helpless victimisation at the hands of an intolerant government.\n\nHanging a card around his neck reading “We the victims”, Professor Mahapatra is taking on a Trinamool heavyweight, Sovon Chatterjee, the Mayor of Kolkata, as an Independent candidate in the Behala East Assembly constituency on the southern fringes of the city. Though pitted against a strong candidate, he is not unnerved.\n\n“I teach at Jadavpur University. Despite being an innocent citizen, I have two criminal cases against me, courtesy Trinamool Congress. You will have to give a fitting reply to them,” he tells voters.\n\nHe does not need to introduce himself to all. A voter comes forward to say, “I have seen you many times on television. We are aware of what you have gone through.” This has been the drift.\n\nHe is contesting as an Independent candidate under the banner of Aakranta Aamraa, a forum of “victims of human rights violations under the Mamata Banerjee regime”. He has the support of the Left Front-Congress partnership. A CPI(M) worker accompanying him says the party State secretary, Surjya Kanta Mishra, will campaign for the Professor. “We are getting a good response from the people of the constituency,” he says.\n\nThe Congress too has pooled in its resources to support him.\n\n“Lot of things have changed since April 2012. The intolerance of this government, which started with my arrest, has grown with every passing day. These four years have also given me courage to take on the ruling party,” Mr. Mahapatra told The Hindu . “Being refused justice, I thought of contesting elections.”\n\nHer plight\n\nProtima Dutta, another Independent candidate contesting under the banner of Aakranta Aamraa, too is a victim of intolerance. Her husband, Tapan Dutta, a Trinamool activist, was killed allegedly by a rival party faction for protesting against an illegal construction coming up by filling a waterbody in May 2011.\n\n“I have run from pillar to post seeking justice for my husband. But in the past five years, I have realised that if you want to bring in change for the people, it has to be through the electoral process,” said Ms. Dutta, a homemaker who too has no political experience.\n\nWhile campaigning in the Domjur Assembly segment in Howrah district, what draws her attention most is that there is little concern for the environment in the region.\n\n“Along the side of the highway, there used to waterbodies. But everything has been filled in the past few years. None of the political parties has anything constructive to say on environment protection in their political manifestos,” Ms. Dutta said. Her opponent is State Irrigation Minister Rajib Banerjee.\n\nThe nomination of both these candidates under the banner of Aakranta Aamraa shows that the Opposition is keen on highlighting human rights violation under the Trinamool regime. The forum set up in July 2014 has been vocal in protesting against trampling of rights. The ruling party initially ignored the forum. A prominent Trinamool Congress Minister ridiculed Aakranto Amra last year, saying it had become fashionable these days to pose as “victims”. However, in the changed political circumstances, a Professor and a homemaker are posing a challenge to an established party.\n\nAmbikesh and Protima, victims of intolerance, mount a strong fight in the electoral arena", 
    "section": "national", 
    "title": "A professor and a homemaker: victims then, challengers now", 
    "subsection": "general", 
    "date": "2016-03-24"
}