{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The BJP tried to put on a brave face when its former National Democratic Alliance partner, Desiya Murpokku Dravida Kazhagam (DMDK), led by Vijayakant, joined hands with the People’s Welfare Front (PWF), declaring that it would cobble a larger alliance of several smaller parties for the Assembly elections in Tamil Nadu.\n\nThe PWF comprises another former NDA partner, Marumalarchi Dravida Munnetra Kazhagam (MDMK), led by Vaiko, the CPI, the CPI(M) and the Thol. Thirumavalavan-led Viduthalai Chiruthaigal Katchi (VCK).\n\nThe BJP’s election in-charge for the State, Environment Minister Prakash Javadekar, said the party would be going to the polls as “BJP-plus” and that its first list of candidates would be decided on Thursday.\n\nMeet today\n\nThe State’s election committee will be meeting in Chennai on Thursday where the list will be decided.\n\n“The BJP, along with our friends, Indiya Jananayaka Katchi (IJK), New Justice Party (NJP) and some other parties who are willing to come with us, is contesting [polls]. Our election committee of the State will meet tomorrow to finalise the candidates,” Mr. Javadekar said.\n\n“We are going ahead with our campaign. Rumours were there or floating [that] the BJP is contesting on its own and with its friends who are coming with us. Tomorrow [Thursday] we are having an election committee meeting and day after tomorrow, the Tamil Nadu team will come to Delhi. First batch of tickets will be decided tomorrow,” he said.\n\nDifferent context\n\nAsked about the BJP failing to keep the DMDK in its fold, Mr. Javadekar said, “In the Lok Sabha, many parties came together. That time, whole context was different. When there is a State election, every party has to take a call. Today we are going as BJP-plus,” he said.", 
    "section": "national", 
    "title": "BJP-plus will take on new front: Javadekar", 
    "subsection": "general", 
    "date": "2016-03-24"
}