{
    "author": [
        "Mini Anthikad Chhibber"
    ], 
    "text": "Writers and artists pay tribute to the 150-year-old classic that fascinated them during their childhood\n\nWhat would have happened if Neo hadn’t followed the White Rabbit? He wouldn’t have known of The Matrix, Morpheus wouldn’t have talked portentous mumbo jumbo and Kansas probably wouldn’t have gone bye-bye.\n\nWhen a gifted mathematician and logician, writing under the pen name of Lewis Carroll, told a tale of a young girl’s adventures underground where logic, semantics and fantasy collide to form a psychedelic cocktail, little did he realise the profound impact Alice in Wonderland would have on popular culture.\n\nIt is 150 years since Alice met the motley crew of the enigmatic Cheshire Cat, the bad-tempered Duchess, the tempestuous Queen, the Mouse, the Dodo, the Mad Hatter, the March Hare and the Mock Turtle who studied “Reeling, Writhing, different branches of arithmetic including ambition, distraction, uglification and derision, ancient and modern Mystery and Drawling”. Alice in Wonderland and Through the Looking Glass with their sparkling simplicity and playfulness have been irresistible to children and adults alike.\n\nThere are quite a few artistes and writers who fell under the spell of Alice and her friends and have counted the work as a major inspiration for their work.\n\nBengaluru-based author Dipu Darko describes her young adult novel Bitchweed as “Lewis Carroll meets David Lynch meets Japanese horror. The central characters are inspired from the original story. Sisters Alison and Lily Von Durland are drawn to elusive artist Mark Embery who embodies traits of the Red Queen. Other characters such as Ringo, Sebastian, Buddhist lama and Missy the cat are indirect representations of the Mad Hatter, the Knave, the Caterpillar and the Cheshire Cat.”\n\nEnigma and mystery\n\nMs. Darko says she chose to re-imagine Alice in Wonderland because she wanted “to take my readers down that lucid rabbit hole and make them experience a journey like no other.” Drawn to “the enigmatic and magical creatures”, the author says, “I always read the book as a mystery. For some reason the book still remains a puzzle. My favourite character in the book is the Mad Hatter who is at once funny, silly and quirky. After many readings I’d say he is more of a shape-shifter and trickster who manipulates Alice in varying capacities.”\n\nThen there is writer Mainak Dhar whose Alice in Deadland series talks about a world taken over by zombies with a 15-year-old Alice as the only hope for mankind. His series features a zombie called Bunny Ears and a Queen as well a secret weapon called the Snark.\n\nMr. Dhar, who lives in Hong Kong, says, “ Alice in Wonderland resonates with me at many levels. It shows just how far curiosity and imagination can get you. I had thought of a dystopian adventure with a young girl uncovering her destiny through a quest and learning that the world around her is much more complex and layered than she has been brought up to believe. As I developed the story, I began to see some concepts where I could pay homage to Alice in Wonderland — a book I really enjoyed as a child. What sealed it for me was the chance conversation with my wife where I realized that Alice Liddell, who was the inspiration for Lewis Carroll for Alice in Wonderland , shared her birthday with my muse — my wife — on May 4.”\n\nGraphic artist and researcher Sarita Sundar says, “My first real interest in Alice was in college at NID, in 1990 where as part of a book-animation project I animated scenes from the book. I also have a dedicated sketch book with my interpretations of Alicisms — conversations and quotes. I think it is the irreverence of the text and imagery, which have an inherent wisdom that appeals to me. Because of my obsession, I am now gifted Alice-themed presents — notebooks, a pencil case, a salt-and-pepper set, an annotated version of the book...”\n\nMs. Sundar has also made an Alice dress. “It was a book sculpture, a dress made of banana fibre paper. It showed in Bangalore at an artist book workshop and then moved to Bangkok and China. Woven into the dress are conversations and objects (a tiny pocket watch, a golden key, flowers and a butterfly). The dress is a story within a story. In that sense, it is iconic, transformative and symbolises the metamorphosis that is a recurring trope in the book.”", 
    "section": "national", 
    "title": "Curiouser and curiouser: the many retellings of Alice", 
    "subsection": "general", 
    "date": "2016-03-24"
}