{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Economic models have a direct bearing on the living standards of most sections of society, especially minorities and the marginalised, said Finance Minister Arun Jaitley, while speaking at a lecture organised by the National Commission for Minorities. The Minister specifically pointed to the example of poll-bound West Bengal to illustrate his point that “despite political stability, the living conditions of minorities was extremely inadequate.”\n\nSpeaking on the subject ‘Economic Empowerment of Minorities,’ Mr. Jaitley referred to a report ‘Living Realities of Muslims in West Bengal’ released recently in Kolkata by Nobel Laureate Amartya Sen. “Why is it that in a State like West Bengal, which has otherwise seen political stability since independence and has a sizeable minority population, has data which indicates living conditions which are far less than adequate?” he asked.\n\n“The model followed by the State where growth levels were not fast enough to raise standards of all sections could be a factor for the condition of the minorities,” he said. “Post 1991, India has witnessed a faster growth which has also led to a substantial reduction in poverty,” he added. “Certainly there is a need, amongst minorities, amongst certain groups, Muslims in particular, that this advantage of the resource of the State, benefits them in more than one way,” he added. He said that post 1991, when in most parts economic conditions improved, West Bengal had come up with such findings. When there was high growth all sections benefit, though some more than others, and the government could provide “targeted assistance” to all those left out, he said.\n\n“We also have our fair share of our policy diversions. Though the principal agenda is to ensure the welfare of all, diversions do come up and some of them are extremely unpleasant,” Mr. Jaitley said, referring to the blocking of legislation in the Rajya Sabha.", 
    "section": "national", 
    "title": "Economic models have a direct bearing on living standards: Jaitley", 
    "subsection": "general", 
    "date": "2016-03-24"
}