{
    "author": [
        "Devesh K"
    ], 
    "text": "The Enforcement Directorate on Wednesday provisionally attached assets worth about Rs.8 crore in connection a money laundering case against Himachal Pradesh Chief Minister Virbhadra Singh.\n\nThe veteran Congress leader has been accused of showing unaccounted wealth as agricultural income.\n\nDuring investigations, the Directorate zeroed in on a flat worth Rs.4.47 crore located in the posh Greater Kailash Part-I area of Delhi. The flat, which was purportedly in the name of Mr. Singh’s wife Pratibha, has now been provisionally attached along with life insurance policies totalling Rs.2.5 crore, fixed-deposits for Rs.15 lakh and some bank accounts.\n\nTerming the move a “gift” from the ED on the occasion of Holi, Mr. Singh — through his Twitter handle — said the CBI had also conducted searches at his house on the day of his daughter’s marriage. He accused the BJP of indulging in dirty political conspiracy against him. Stating that he had faith in the judiciary, Mr. Singh said he would continue to fight against the ‘politically motivated’ allegations against him.\n\nThe ED has launched money laundering probe against Mr. Singh on the basis of a case of disproportionate assets registered by the CBI.\n\nIn its own case, the CBI has accused Mr. Singh, his wife and associates Anand and Chunni Lal Chauhan of having amassed assets worth over Rs.6 crore disproportionate to their known sources of income. The agency has alleged that Mr. Singh, as the Union Minister of Steel during 2009-2012, amassed unaccounted wealth in his name and that of his family members. His associates Anand and Chunni Lal allegedly assisted him in committing the offence.\n\nAccording to the CBI, Mr. Singh had allegedly invested unaccounted income in LIC polices by falsely projecting the amount as agricultural income. The policies were also bought in the name of his wife and other family members.\n\nThe CBI alleges that this was done by creating a memorandum of understanding dated June 15, 2008, for maintenance of an apple orchard for a period of three years.", 
    "section": "national", 
    "title": "ED attaches Rs. 8 crore assets of Virbhadra Singh", 
    "subsection": "general", 
    "date": "2016-03-24"
}