{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Even as the Naveen Patnaik government presented a separate budget for agriculture on March 18 claiming that it is taking a series of measures for the welfare of the farmers, at least four distressed farmers have committed suicide in different districts of Odisha during the past few days.\n\nMore than 200 distressed farmers have committed suicide in the State since September last due to crop loss and loan burden.\n\nThe latest incident of farmer suicide was reported from Keonjhar district on Wednesday. The deceased was identified as Purushottam Dehuri who hailed from Janardanpur village under Sadar Block. According to sources, Dehuri consumed poison on Tuesday night and was admitted to the district headquarters hospital at Keonjhar town. He breathed his last in the morning. The deceased had taken loans amounting to Rs.40,000 from different sources, and had cultivated tomato in two acres of land. But the crop was damaged due to scanty rainfall.\n\nOf the three other cases, two were reported from Balangir and Bargarh districts in western Odisha where Prime Minister Narendra Modi addressed a farmers’ rally a few weeks ago, and one from Dhenkanal.\n\nThe State government, however, has not admitted a single such death of farmer to be due to crop loss or debt burden although it has admitted in the State Assembly a few days ago that 175 farmers had committed suicide in the State during 2015-16.\n\nEnquiries by the respective district administrations showed that none of the farmers ended their lives due to crop failure, said School and Mass Education Minister Debi Prasad Mishra while making a statement on behalf of Agriculture Minister Pradeep Maharathy in the House. Mr. Mishra had said that the State government was not in favour of giving compensation to families of farmers who committed suicide because the move may encourage others to end their lives. While demanding adequate compensation for the family of the farmers who had committed suicide, the Opposition parties had demanded a change in the method and approach to probe into the farmer suicides taking place in the State.", 
    "section": "national", 
    "title": "Four more farmers commit suicide in Odisha", 
    "subsection": "general", 
    "date": "2016-03-24"
}