{
    "author": [
        "Haroon Habib"
    ], 
    "text": "Bangladesh Prime Minister Sheikh Hasina joined a video conference with Indian Prime Minister Narendra Modi on Wednesday, jointly inaugurating the supply of 100 MW power from India and leasing of 10 GBPS Internet bandwidth from Bangladesh.\n\nIn exchange for 10 GBPS Internet bandwidth from Bangladesh, India will supply 100 MW electricity, which comes as a major stride into bilateral relationship in the warm ambiance of Holi festival in India.\n\nInaugurating the power supply from Tripura, Mr. Modi described it as a “historic occasion”, and “an example to the world” on how Bangladesh and Tripura, which share historic relations as the tiny Indian State had given millions of Bangladeshis shelter during the nation’s liberation war in 1971.\n\nBangladesh allowed the transport of over-dimensional cargo through its territory during the construction of the Palatana power plant in Tripura in 2011.\n\nThe power grids of the two countries have been hooked up with the supply of 500 MW of power to Bangladesh through transmission cable. The supply of another 500 MW through the same interconnection was also announced during Mr. Modi’s Dhaka visit in 2015.\n\nExternal Affairs Minister Sushma Swaraj, Bangladesh Foreign Minister AH Mahmood Ali, and Chief Minister of Tripura Manik Sarkar also addressed the inauguration via the video conference.\n\n“The sharing of bandwidth and power is yet another milestone in the development of ties between Bangladesh and India,” said Ms. Hasina during the video conference, adding: “Bilateral ties between and Bangladesh and India have reached new heights. I am sure we will witness more joyful moments so as to bring greater benefits to our people.” The Bangladesh leader also stressed: Connectivity is the next frontier of our cooperation. Ms. Hasina said “the import of electricity from Tripura fulfils yet another political commitment made by India.”\n\nMr. Modi has expressed his ‘earnest desire’ to take the country’s cooperation with Bangladesh to the sphere of space. “I have said earlier that we should work together in the sphere of space. It is India’s earnest desire that India wants to be with Bangladesh in the Bangabandhu satellite [project].”\n\nMr. Modi said the two countries have “set an example” of how relations between the neighbours should be, of how to make an inter-dependent world.\n\nReferring to the Bangladesh-Bhutan-India-Nepal (BBIN) connectivity deal, the Indian PM said, “We have already started working together on road connectivity. Today, we are forging a new bond through electricity sharing. We are also working together on digital connectivity, a must for the 21st century. “This means Bangladesh and India are going forward hand in hand in the spheres of land, water and space.”\n\nBangladesh hopes to launch the Bangabandhu-1 Satellite by the end of 2017.\n\nAt the beginning of the conference, Mr. Modi wished Bangladesh a happy Independence Day on March 26.", 
    "section": "national", 
    "title": "India and Bangladesh barter power, bandwidth", 
    "subsection": "general", 
    "date": "2016-03-24"
}