{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Salwinder Singh and injured personnel to be presented as witnesses at Pathankot\n\nSecurity personnel in action during the Pathankot operations. India has decided to provide access to Pakistan’s Joint Investigation Team to the airbase on March 29.\n\nIndia will play a 15-minute audio message posted by Abdul Rauf Asghar, the brother of Jaish-e-Mohammad (JeM) chief Maulana Masood Azhar, in front of the Joint Investigation Team (JIT) from Pakistan, which arrives here on Sunday to probe the Pathankot attack.\n\nThe audio message, which will be presented as one of the many pieces of evidence establishing the Pakistan-based terror outfit’s involvement in the attack, was posted on JeM’s website, hours after the terrorists struck at the Pathankot airbase.\n\nAsghar, who is one of the handlers of the Pathankot terrorists, is heard praising the attackers and also talks about the successful operation.\n\nThe National Investigation Agency (NIA) is in possession of phone intercepts between Asghar and four of the six terrorists, which have been sent to a forensic laboratory to match the voice samples with that available on the website. The audio clip has been obtained from rangonoor.com, a propaganda website of JeM.\n\nThe four terrorists had snatched mobile phones from taxi driver Ikagar Singh, police officer Salwinder Singh and his jeweller friend Rajesh Verma, with which they spoke to their handlers between December 31 and January 1. The airbase was attacked in the early hours of January 2.\n\nFormer Gurdaspur SP Salwinder Singh, whose SUV was snatched by terrorists to reach the airbase and who was subjected to intensive grilling by the NIA later on, has been asked to be present at the Pathankot airbase as a “witness” when Pakistan’s JIT visits there. Officials said they would give full cooperation to the JIT which had expressed a desire to examine the witnesses. Mr. Singh is the complainant in the Pathankot FIR but till now he has not been given a clean chit by the NIA.\n\nIndia has decided to provide access to the JIT to the Pathankot airbase on March 29. The witnesses include Defence Security Corps (DSC) personnel who were injured in an encounter with the terrorists. After they were challenged by the Garud commandos, the terrorists ran towards the DSC mess where they killed five DSC personnel and injured six others.", 
    "section": "national", 
    "title": "India to play JeM man’s audio clip for Pak. team", 
    "subsection": "general", 
    "date": "2016-03-24"
}