{
    "author": [
        "K C"
    ], 
    "text": "The Act will fix accountabiity, make it easier for people to help accident victims\n\nThe Act is expected to make the police as well as hospital authorities follow the guidelines.— File Photo: V Sreenivasa Murthy\n\nThe next time you pass a road accident victim, stop. Most people hesitate to step in to help victims for fear of getting entangled in police questioning and hospital admission processes. But this may soon be a thing of the past with Karnataka all set to bring about a ‘Good Samaritan Act’.\n\nAimed at insulating citizens who help accident victims, the Act is expected to make the police as well as hospital authorities follow the ‘Good Samaritan’ guidelines by binding them to a law.\n\nThe draft of the Act, readied by the Health Ministry, reportedly includes a punishment clause for officials violating the guidelines.\n\nBengaluru has witnessed many incidents of accident victims being denied treatment at hospitals or delays in taking victims to hospitals in time. The death of Harish N., after a truck ran over him on the State Highway in Nelamangala, prompted the government to come up with the Mukhyamantri Santwana Harish Scheme.\n\nThe scheme promises cashless treatment for accident victims during the first 48 hours, considered the golden hour, with a maximum entitlement of Rs. 25,000 per victim per episode.\n\nWelcoming the move, Piyush Tewari, founder of SaveLIFE Foundation which was instrumental in getting the government to frame the ‘Good Samaritan’ guidelines, said the challenge now was the lack of accountability.\n\n“Hospitals and the police know that these guidelines exist, but no one is accountable. The guidelines also don’t talk about who implements them. We need the guidelines to be converted into a State law and Karnataka is already working in that direction,” he said.", 
    "section": "national", 
    "title": "Karnataka to make Good Samaritan law a reality soon", 
    "subsection": "general", 
    "date": "2016-03-24"
}