{
    "author": [
        "S Anil Radhakrishnan"
    ], 
    "text": "The three high-rises in the flight path of Thiruvananthapuram international airport that stand to benefit from the government’s decision to grant them Occupancy Certificates were built violating the norms notified by the Union Civil Aviation Ministry in 1998, 2008 and 2010. The norms notified by the Ministry in the official gazette clearly state that no building or structure higher than the height specified shall be constructed or erected or no tree which is likely to grow or ordinarily grows higher than the height specified shall be planted in any land within a radius of 20 km from the Aerodrome Reference Point of the aerodromes.\n\nThe notifications, issued by the Ministry in exercise of powers conferred by Section 9-A of the Aircraft Act 1934, had also tasked the Airports Authority of India (AAI) to issue No Objection Certificate for civil aerodromes in the country. It is the responsibility of the State government and authorities concerned to take action against the building, structure, tree installation or chimney that violates the height specifications.\n\nBut, the Secretary, Local Self Government, in his March 4 order to implement the Cabinet decision, has concluded that that the permits and plans approved by Thiruvananthapuram City Corporation for these high-rises will not come under the purview of the notification as norms of height clearance had come into effect only on January 14, 2010.\n\nThe executive engineer, City Corporation, has reported to the government that the high-rises were issued permits in 2007 under the Kerala Municipal Building Rules and that the structures were completed before 2012.\n\n“Concealing” the earlier notifications of the Civil Aviation Ministry is to “save” and regularise the three high-rises in Attipara village and Akkulam and four-high rise flood light masts in University stadium constructed without the AAI’s NOC, highly placed sources in Civil Aviation said.\n\nUnion Civil Aviation Ministry norms issued in 1998, 2008 and\n\n2010 violated", 
    "section": "national", 
    "title": "Kerala ignored notifications to give Occupancy Certificates to high-rises", 
    "subsection": "general", 
    "date": "2016-03-24"
}