{
    "author": [
        "Afshan Yasmeen"
    ], 
    "text": "1,097 cases detected in Karnataka in the last one year\n\nThe increasing resistance to tuberculosis (TB) drugs among patients has become a major public health concern in Karnataka, which the health authorities here are struggling to deal with.\n\nAlthough officials admitted that the number of multidrug-resistant (MDR) TB cases are on the rise in the State with the detection of 1,097 such cases in the last one year, they say it is because of the high-detection rate after the State procured 26 gene Xpert machines to augment the diagnosis of TB at the district level.\n\nHowever, the incidence in Karnataka is considerably low compared to other States, officials said.\n\nEvery year, March 24 is observed as World TB Day and the theme this year is “Unite to End TB.”\n\nOf the 17,980 culture and drug susceptibility tests done in the State in the last one year, 1,097 have tested positive for MDR TB. Last year, 8,000 samples had been tested and 1,057 tested positive. However, according to TB experts these numbers are only the official statistics and many more cases could have gone missing without detection.\n\nState TB Cell Deputy Director Anil S said the number of TB cases notified by private practitioners and hospitals in the State has also increased over the years. From 315 in 2013, the number of TB cases reported by private practitioners has increased to 9,000 in 2015, he said.\n\nShashidhar Buggi, Director of the State-run Rajiv Gandhi Institute of Chest Diseases (RGICD), attributed the rise in MDR cases to lack of awareness among patients and non-compliance of the treatment regimen by most.\n\nAccording to him, the best first-line anti-TB drugs (rifampicin and isoniazid) are not effective against MDR-TB cases. Nearly three per cent of the newly diagnosed sputum positive cases in the country are found to develop MDR-TB. One patient can directly spread the disease to at least 10 others if it is not checked at the initial stage.\n\nExperts attribute the rise in the cases to lack of awareness among patients", 
    "section": "national", 
    "title": "Multidrug-resistant TB, a major health concern", 
    "subsection": "general", 
    "date": "2016-03-24"
}