{
    "author": [
        "Shankar Bennur"
    ], 
    "text": "The 47 year-old Timbo was received from a German Zooin 1976 and was one of the star attractions at the Mysuruzoo.— FILE PHOTO: M.A. SRIRAM\n\nMysuru zoo has lost yet another prized animal from its collection. A male African elephant, Timbo, aged about 47, died in the early hours of Tuesday.\n\nThis elephant had been received from a German Zoo in 1976.\n\nTimbo, one of the star attractions at the zoo, thanks to its height and grace, was suffering from chronic arthritis.\n\nThe elephant had been limping for 25 days and was unable to bear weight on its right hind leg.\n\n“Necessary treatment had been carried out since Timbo started limping but no significant improvement was noticed,” said zoo director Venkatesan.\n\nThe zoo had sought opinion from Khadri, a noted wildlife veterinarian, Jacob Cheeran, an elephant expert from Kerala, and Dhanalakshmi, Assistant Professor, Veterinary College, Shivamogga, to treat it.\n\nHowever, Timbo started showing contra lateral limb lameness since it bore its weight continuously on its left hind limb. Nevertheless, the elephant received necessary medication and physiotherapy.\n\nBut the jumbo continued to suffer, and around 8.30 p.m on Monday, the animal was unable to stand on its legs and lay down on its right side in its enclosure.\n\nZoo veterinarians, supervisors and keepers tried to resuscitate the jumbo, a release said.\n\nEfforts to lift Timbo with the help of a crane went in vain. The animal died around 12.15 a.m. on Tuesday after it collapsed on Monday evening.\n\n“The exact cause of death will be known once the post-mortem is done,” he said.\n\nWith Timbo’s death, the zoo is now left with Rambo, who was born to Timbo and Zambia. Zambia died a few years ago.\n\nTimbo had grand tusks and was usually found at the main entrance of the African elephant enclosure.\n\nA few days ago, a male African white rhinoceros, Bheema (49), passed away at the zoo.", 
    "section": "national", 
    "title": "Mysuru zoo loses African jumbo", 
    "subsection": "general", 
    "date": "2016-03-24"
}