{
    "author": [
        "National Bureau"
    ], 
    "text": "Tells bureaucrats that solving problems faced by the people is the ‘biggest aspect of democracy’\n\nPrime Minister Narendra Modi on Wednesday set a 60-day deadline for government departments to resolve public grievances, saying redressing such complaints is the “biggest aspect of democracy.”\n\nReiterating his directive for top officers, the Prime Minister called for a focused action plan over the next one month to ensure that only exceptional cases take more than two months to address.\n\nMr. Modi revealed the plan while speaking to secretaries at the central government and chief secretaries of States at a review meeting under the PRAGATI (Pro-Active Governance and Timely Implementation), an ICT-based, multi-modal mechanism to track key projects and policy outcomes.\n\nFollowing the PM’s directive to improve the resolution of public grievances at a meeting in January, the Cabinet Secretariat asked top officials in all ministries having substantial public interface to personally resolve 10 to 30 grievances every week. At Wednesday’s meeting, Mr. Modi reviewed the progress on this initiative and urged officers to speed up the pace of work, according to a statement issued by the Prime Minister’s Office.\n\nThe PM also asked officials to integrate all land records, presently being digitised, with Aadhaar ‘at the earliest’ and stressed that this is ‘extremely important to monitor successful implementation” of the government’s new crop insurance scheme.\n\nEase of doing business\n\nCalling for further efforts to build on the government’s progress in improving ease of doing business, Mr. Modi said it was necessary to create a ‘positive perception’ and noted the healthy progress among States competing for investment.\n\n“Reviewing the progress of provision of citizen-centric services electronically, the Prime Minister called for a comprehensive district-wise review across the country, of how many services are actually being delivered online. In the social sector, the Prime Minister assessed the status of the Widow Pension Programme, and the progress towards eradication of leprosy,” the PMO statement said.\n\nThe progress on vital infrastructure projects in the road, railway, power, and oil sectors, spread over several States was also reviewed during the meeting.", 
    "section": "national", 
    "title": "PM sets 60-day deadline for officials", 
    "subsection": "general", 
    "date": "2016-03-24"
}