{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In a strongly-worded letter to Telangana Chief Minister K. Chandrasekhar Rao, Communist Party of India (Marxist) general secretary Sitaram Yechury has sought the immediate release of the students arrested in University of Hyderabad (UoH) and dropping of the cases against them. The Telangana police should proceed on the case registered against Vice-Chancellor P. Appa Rao, he said.\n\nMr. Yechury said the police had resorted to “brutality” against students and abused women, instead of proceeding against the V-C charged with abetting scholar Rohith Vemula’s suicide.\n\n“Most of us in the country are aghast at the manner in which such brutal assault is mounted on the university community by the Telangana police in one of the premier central universities of our country,” the letter read, alleging that the police mounted another attack on Wednesday when a few students tried to cook food in the open due to the closure of mess and stoppage of water supply.\n\nLeaders denied entry\n\ninto campus\n\nPolitical leaders of the Congress and the Communist Party of India (CPI) decried the decision of the university not to allow any ‘outsider’ on the campus on Wednesday due to apprehensions that it would lead to ‘unwanted tensions.’\n\nThey wondered how the Vice-Chancellor, P. Appa Rao, could be re-instated after he left the campus following research scholar Rohith Vemula’s suicide in January. They wanted Prof. Rao’s arrest under the provisions of the SC, ST (Prevention of Atrocities) Act.\n\nOn Wednesday morning, Rajya Sabha member V. Hanumantha Rao (Congress) tried to enter the campus, but was denied entry by the police who firmly told him that they had a written request from the varsity management asking police not to allow anybody.\n\nThe MP told the waiting presspersons that Jawaharlal Nehru University Students’ Union (JNUSU) president Kanhaiya Kumar was himself a student. Why did the management want him to stay away from the campus, he wondered. “After all, he is coming only to console Rohith Vemula’s mother,” he added.\n\nCPI(M) leader demands the immediate release of those arrested on Tuesday", 
    "section": "national", 
    "title": "Police resorted to brutality against students: Yechury", 
    "subsection": "general", 
    "date": "2016-03-24"
}