{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘Re-instatement of P. Appa Rao as V-C is an insult to the self-respect of Dalits’\n\nHeavy security was in place at the main entrance of the University of Hyderabad on Wednesday barring entry for outsiders.— Photo: Nagara Gopal\n\nPolitical leaders of the Congress and the Communist Party of India (CPI) decried the decision of the University of Hyderabad management not to allow any ‘outsider’ on the campus due to apprehensions that it would lead to ‘unwanted tensions.’\n\nThey wondered how the Vice-Chancellor, P. Appa Rao, could be re-instated after he left the campus following research scholar Rohith Vemula’s suicide in January. They wanted Prof. Rao’s arrest under the provisions of the SC, ST (Prevention of Atrocities) Act.\n\nOn Wednesday morning, Rajya Sabha member V. Hanumantha Rao (Congress) tried to enter the campus, but was denied entry by the police who firmly told him that they had a written request from the varsity management asking police not to allow anybody.\n\nThe MP told the waiting presspersons that Jawaharlal Nehru University Students’ Union (JNUSU) president Kanhaiya Kumar was himself a student. Why did the management want him to stay away from the campus, he wondered. “After all, he is coming only to console Rohith Vemula’s mother,” he added.\n\nEarlier, he was received by the CPI’s national executive member K. Narayana and city unit president Sudhakar who escorted him to the Chandra Rajeswara Rao Foundation in Hafeezpet.\n\nOn Tuesday, the Registrar In-Charge of UoH, M. Sudhakar, had written to the Cyberabad Police Commissioner C.V. Anand recalling the turn of events on the campus.\n\n‘Vandalism’\n\nCalling it ‘vandalism’, he said the management suspected detrimental repercussions. He wrote that as a precaution, media personnel, members of political groups, external students’ organisations and politicians would not be allowed to enter the campus.\n\nSenior leaders of the Telangana Pradesh Congress Committee (TPCC), including president N. Uttam Kumar Reddy and working president Mallu Bhatti Vikramarka demanded the arrest of Prof. Appa Rao. They held the TRS government responsible for the sequence of events at UoH in the past few days. They demanded the release of students who were allegedly detained at the UoH campus illegally by the police when they protested on Tuesday, as the Vice-Chancellor was addressing a press conference.\n\nMr. Uttam Kumar Reddy and Mr. Bhatti Vikramarka said the real reason for violence on UoH campus was the re-instatement of Mr. Appa Rao and added that his return was an insult to the self-respect of Dalits.", 
    "section": "national", 
    "title": "Political parties criticise decision", 
    "subsection": "general", 
    "date": "2016-03-24"
}