{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "The Bill does not mention a ceiling on the rate of interest private moneylenders can charge farmers.— Photo: Akhilesh Kumar\n\nThe Shiromani Akali Dal-BJP government in Punjab, which faced the wrath of farmers in October last year, is leaving no stone unturned to posture itself as pro-farmer ahead of the 2017 Assembly elections.\n\nWith an aim to develop a framework for regulation and settlement of agricultural debts, the State government had on Tuesday passed the Punjab Settlement of Agricultural Indebtedness Bill, 2016.\n\nThe Bill, however, has not impressed agriculture experts and farmer bodies which believe it may not yield desired results.\n\nThe Bill seeks to provide a forum for prompt settlement of debts of agriculturists and other people dependent on agriculture. However, it has kept no ceiling on the rate of interest private moneylenders can charge from farmers.\n\n“Agriculture indebtedness among farmers has increased due to mismatch between input costs and minimum support prices of agricultural produce. The Bill should have focussed on increasing their [farmers’] income, the root cause that makes farmers fall into the debt trap. Unfortunately, it has not been addressed,” food and trade policy analyst Devinder Sharma told The Hindu , adding that farmers across Punjab were committing suicide and they needed an “immediate relief.”\n\nMr. Sharma pointed out that the original proposal was to have a ceiling on interest rate that could be charged by private moneylenders, but in the Bill that had been passed no such cap on the rate of interest had been kept. The interest rate would be decided each year, on the basis of the interest rate charged by banks.\n\nThe Bill also provides that the government shall at every district set up a district agriculture debt settlement forum to carry out the purposes of this Act.\n\n“We already have debt settlement tribunals at the national level. I doubt how useful these new forums would be,” added Mr. Sharma.\n\nMany farmers’ unions have termed the Punjab Settlement of Agricultural Indebtedness Bill eyewash and see it as merely an attempt to win over farmers ahead of the Assembly polls due in 2017.\n\n“The Bill has been drafted under the pressure of commission agents [Arthiya] and therefore, the State government has not fixed a cap on interest rates to be charged by private moneylenders,” Nirbhay Singh, the president of Kirti Kisan Union, Moga, told The Hindu .\n\nMr. Singh said the State government should have made a provision to stop the practice of auctioning land or houses of farmers in case of default of loan amount. Also, a financial package should have been announced to bail out the farmers in distress.\n\n“The Bill is anti-farmer as most critical issues pertaining to farmers have not been addressed by the government. We will fight and get the Bill amended,” added Mr. Singh.", 
    "section": "national", 
    "title": "Punjab farmers’ Bill fails to find favour with experts", 
    "subsection": "general", 
    "date": "2016-03-24"
}