{
    "author": [
        "Maria Akram"
    ], 
    "text": "On February 19, a group of officials from the RAW and the Intelligence Bureau (IB) walked into the former Delhi University professor S.A.R. Geelani's prison cell and asked him to explain his position on Kashmir issue.\n\nBooked on sedition charges on February 16 for co-hosting an event at the Press Club of India to commemorate the hanging of Parliament attack convict Afzal Guru, Mr.Geelani was surprised to see that the intelligence officials were more keen on knowing where he stood on Kashmir than what transpired at Afzal Guru's memorial. “The Press Club event was their least concern,” he said, adding that in case of Kanhaiya Kumar, the JNU student leader who was also arrested on sedition charges, it was just Delhi police that investigated the matter. “In my case, the entire Home Ministry was involved. I wonder why?” he asked.\n\nMr. Geelani’s past has the answer to his own question. He was arrested in the 2001 Parliament attack case and spent 18 months in jail, where he said he was physically tortured and then sentenced to death by a fast-track court. But Delhi high court found no evidence to connect him to the Parliament attack and he was acquitted of all charges. The Supreme Court upheld his acquittal. Three years after he was released, he had a close shave with death on February 8, 2005. Unknown assailants pumped five bullets into his body outside his lawyer’s office in Vasant Vihar. “Even today, three bullets are still inside my body while two were taken out,” he said smilingly.\n\nSitting relaxed in his recently renovated drawing room, Mr. Geelani, who was released on Monday on bail, isn’t very worried about his latest case. “See, there is nothing against me. I have fought bigger battles in the past and this shall too pass.” He maintains that no slogans that can be considered ‘anti-national’ were raised. Bharat ki Barbaadi slogans were not raised.”\n\nSharing his views on the debate on nationalism, dissent and freedom of speech, the professor said that free speech and the willingness to discuss uncomfortable ideas were under threat. “It is the present government which is on the path of Bharat ki Barbaadi . They are destroying India.”", 
    "section": "national", 
    "title": "‘RAW, IB keen on my views on Kashmir’", 
    "subsection": "general", 
    "date": "2016-03-24"
}