{
    "author": [
        "Yunus Y"
    ], 
    "text": "Mess closed for the second day, no sign of Internet and other services resuming\n\nHeavy security was in place at the university on Wednesday and outsiders were refused entry.— Photo: Nagara Gopal\n\nThe effects of the brutal police crackdown on students of the University of Hyderabad (UoH) became evident on Wednesday, with many of them, including girls, complaining of injuries they sustained in Tuesday’s lathi-charge. A total of 34 students were rushed to the varsity’s health centre, while another 10 were sent to a private hospital. One student sustained severe head injuries.\n\n“The protest was on, and the police ‘warned’ us twice. We were raising slogans peacefully. Then the police started dragging us out of the lawns. I was hurt and left gasping for breath,” recalled Avipsha. Another student, unwilling to be identified, said he was dragged from the lawn near the Vice-Chancellor’s office, and then beaten up by the police. “They took us outside because there are no CCTV cameras outside the V-C’s guesthouse,” he added. “A number of other students sustained cut marks and bruises during the lathi-charge,” said a source in the UoH’s medical centre.\n\nOn Wednesday, Uday Bhanu, another student, who was trying to cook food in the afternoon near the Shopcom area sustained injuries after he was picked up by the police. He was let off only after students got into an argument with the policemen.\n\nThe impasse between the students and non-teaching staff continued for the second day at the university on Wednesday, with the former cooking food for themselves as the mess was closed for the second day.\n\nWater supply to the hostel rooms was also affected, as the non-teaching staff continued their strike for the second day, throwing regular life out of gear. With the mess being closed and just one canteen remaining open, students began cooking food.\n\nHowever, policemen prevented them from doing so. It was later decided that the food would be prepared behind the Shopcom area. Prior to that, with no signs of the Internet and mess facilities resuming, some girls took the initiative to cook around 12.30 p.m.\n\nLater, even members of the boys’ hostels did the same, and started bringing in provisions. Availability of water continued to be an issue.\n\nThe situation got tense when a huge posse of policemen, in combat gear, began stepping out of security vehicles intimidating students, who expected another bout of lathi-charge.\n\nIt was later discovered that police had come to pre-empt a clash between two groups.\n\n‘Many protesters, including girls, sustained injuries\n\nin Tuesday’s police crackdown’", 
    "section": "national", 
    "title": "Tension as students left to fend for themselves", 
    "subsection": "general", 
    "date": "2016-03-24"
}