{
    "author": [], 
    "text": "Exhibits at the ‘FASHIONable in Communist Poland’ presenting Polish fashion in the time of communism at the National Museum in Krakow.— PHOTO: AFP\n\nAn elegant former hotel employee remembers dyeing gauze bandages and turning them into ruffled skirts to remain fashionable despite chronic shortages in communist-era Poland.\n\n“It was a major challenge; to make something that was impossible to get your hands on otherwise,” recalled Iwona Koczwanska who groaned when asked her age.\n\n“We had to be creative. I remember once sewing myself a lovely summer dress out of a duvet cover,” she said at the ‘FASHIONable in Communist Poland’ exhibition at the National Museum in Krakow.\n\nDressed in a leopard-print hat, beige turtleneck and long brown skirt , Ms. Koczwanska reminisced while watching old fashion reels projected onto a gallery wall. “Look how drab the women are. That’s how it was. Mostly drab women. All alike, in brown, navy blue, grey, grey, grey,” she said of footage that showed women queuing before empty shelves at a shop.\n\nInventiveness was a must for looking good in Poland’s communist decades from 1944 to 1989 faced with the limitations of a planned economy. “This exhibition is largely about a time when to participate in fashion, cultural capital mattered more than financial capital,” said Malgorzata Mozdzynska-Nawotka, one of the curators who had been mulling the idea for this exhibit for years. Fashion under communism reflected the impact of the system on social reality — showing the resourcefulness of Poles now on display in Krakow.\n\nRecycled fashion\n\nIn the immediate post-World War II period, with the economy in ruins and privation everywhere, it was the reign of recycled fashion.\n\nExamples in the exhibition include a Girl Scout jacket that is made out of a parachute and a blouse sewn out of one of the silk maps carried by World War II airmen for when they were shot down over enemy territory.\n\nBy the time Christian Dior’s cinched, full-skirted New Look debuted in the West in 1947, the situation in Soviet-controlled Poland had worsened. “The Stalinist period was a period of repression, a period when communist ideology was heavily enforced, when there was censorship and no shows of sympathy with the West were allowed,” co-curator Joanna Regina Kowalska said.\n\nComfortable daily wear\n\nThe regime highlighted the values of a worker or peasant, stressing that daily wear should be comfortable and practical. Aspiring to a higher echelon was a no-no.\n\nDior’s ‘New Look’ still managed to seep into Polish fashion, though toned down. The exaggerated lines were softened in the copy-cat items because Poles had little access to the right materials or necessary tools to give a skirt its proper form.\n\nThe confrontation between the desired and the feasible under communism could be seen in the popular mid-1960s raincoat made of a polyamide fabric called ortalion. — AFP", 
    "section": "national", 
    "title": "The practical fashionista of communist-era Poland", 
    "subsection": "general", 
    "date": "2016-03-24"
}