{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Bomb threats to 11 IndiGo flights, some bound for the city and others departing from there, put under strain the security machinery at the Indira Gandhi International Airport on Wednesday. The airport has been under a security alert following the terror attacks in Brussels on Tuesday, when threat calls were received for five Jet Airways flights from the city.\n\nAn IndiGo spokesperson said the threat calls were received at the airline’s call centre in Chennai at 11.13 a.m.. By the time the call was received, most of the flights had already taken off. A bomb threat assessment committee convened a meeting at the Delhi airport’s Terminal 1D, from where IndiGo operates.\n\nOne of these flights was a Srinagar-Jammu-Delhi flight of IndiGo (6E 853) that was on its way from Jammu and was about to land in Delhi when the call was received. The aircraft had a safe landing and all precautionary measures were put in place. After landing, the passengers were immediately evacuated from the aircraft. The Airbus A320 aircraft was taken to an isolation bay at the Delhi airport, where a thorough search was being carried out till late on Wednesday.\n\nPassengers were also searched after de-boarding and all baggages were checked. According to sources at the airport, nothing suspicious was found on-board the aircraft.\n\nSenior officials of the Central Industrial Security Force (CISF) said that the other flights that had taken off from Delhi were searched after these landed at their respective destinations. These flights were IndiGo's 6E 591 (Kolkata-Dibrugarh), 6E 516 (Delhi-Chandigarh), 6E 443 (Delhi-Chennai), 6E 135 (Nagpur-Pune-Ahmedabad), 6E 223 (Mumbai-Kochi), 6E 612 (Delhi-Dehradun), 6E 329 (Delhi-Goa), 6E 571 (Delhi-Dibrugarh), 6E 161 (Delhi-Ahmedabad) and 6E 734 (Delhi-Vadodara).\n\nCalling from U.S.\n\nThe threat call was made using Voice over Internet Protocol (VoIP) and the caller claimed that he is calling from the U.S. and got the details about the bombs from Pakistan. “While the other flights had already landed by the time the information was received, the call regarding flight 6E 853 was specific and that is why it was rigorously checked,” said a senior Delhi Police official.", 
    "section": "national", 
    "title": "Threat calls to airline trigger security alert at Delhi airport", 
    "subsection": "general", 
    "date": "2016-03-24"
}