{
    "author": [
        "Sonam Saigal"
    ], 
    "text": "Pakistani-American terrorist and Lashkar-e-Taiba operator David Coleman Headley told a court conducting the 26/11 case trial against one of the alleged plotters Syed Zabiuddin Ansari alias Abu Jundal that after the U.S. Drug Enforcement Agency arrested him in 1997, it instructed him to visit Pakistan and sponsored the trip too.\n\nHeadley, who was made an approver in the trial, made the claim on Wednesday when he was being cross-examined before Judge G.A. Sanap.\n\nHe surprised many when he said he had not received any money from the LeT and that he had donated 60-70 lakh Pakistani rupees to the terror outfit. Headley made the claim when defence advocate Abdul Wahab Khan asked him whether he had bought a few shops in the United Arab Emirates with the money he had received from the LeT.\n\nHeadley said the money he donated was not used for the November 2008 attacks as the last time he had donated was in 2006. “It was impossible that the money would be used as 2006 was the last time I had donated.” Asked whether money was donated for terror activities, he said: “I had donated for many things.”\n\nHe replied in the affirmative when advocate Khan asked him whether Tahawwur Hussain Rana, a fellow accused in the Denmark plot, knew of his association with the LeT. He said he had also informed Rana of the training he underwent with the terror outfit. Headley said he had told Rana that he was acting as a spy for the Mumbai 26/11 attacks just before the conspiracy was to end and Rana did not object to his association and participation in the attacks.\n\nBut Rana did not want Headley to continue using his office in Mumbai, and accordingly, he stopped using it in July 2008, three months before the attacks that killed 164 people.\n\nAsked about the whereabouts of his first wife Shazia and whether she was in the U.S. or Pakistan, Headley said: “I can’t disclose her location as there are safety and security issues.” Asked more about Shazia, he said: “I am not going to answer any question about my wife.” She had never visited India and he had told her about his association with the LeT.\n\nI can’t disclose her location as there are safety and security issues...", 
    "section": "national", 
    "title": "‘U.S. agency asked me to visit Pakistan’", 
    "subsection": "general", 
    "date": "2016-03-24"
}