{
    "author": [
        "Aditya Bharadwaj", 
        "K V"
    ], 
    "text": "The structure, built in 1893, lies in the proposed heritage corridor\n\nThe city, which has lost more than four hundred heritage structures in the past three decades, is set to lose another one. The latest victim could be the 1893-built Central Observatory, a meteorological centre on Palace Road.\n\nIronically, this comes after the Karnataka Tourism Vision Group, a State-government appointed body working on a palace-to-palace heritage corridor on Palace Road, suggesting conservation of heritage structures.\n\nThe meteorology centre, which is among the 40 listed heritage buildings in the corridor for conservation, comes under the Union Department of Earth Sciences, which now proposes to raze the 123-year-old structure.\n\nThe heritage building was the first weather observatory in the State built by the then Mysore State., and even today houses an obsolete weather radar. The building is in a dilapidated condition and has been lying unused for over a decade now. Old and damaged furniture has been dumped inside.\n\nMost of the offices were shifted to the new building built in 1995.\n\nDepartment proposal\n\nGita Agnihotri, in-charge director, Meteorological Centre, Bengaluru, told The Hindu that the proposal was sent to the Union government from the department. However, she declined to comment further on the proposal or give out details on what will replace the heritage building as per the new proposal.\n\nThis move comes close on the heels of proposals to build a Legislature’s club demolishing Balabrooie Guest House and in Carlton House, were dropped following virulent opposition from civil society and heritage conservationists.\n\nB. Puttanna, former director of the centre, said that the Chief Engineer of Central Public Works Department had inspected and certified the building to be non-habitable four years ago, leaving no better alternative but to demolish it.\n\nA senior officer in the department also confirmed that the proposal for its demolition has been sent. However, the officer was not sure of any alternative development in its place.\n\nThe proposal to raze down the structure has drawn the ire of heritage conservationists in the city. Architect Naresh Narasimhan, who has designed the Palace-to-Palace heritage corridor, said that it was a pity that government departments did not see the value of heritage and looked at these spaces only as land and realty.\n\nSatyaprakash Varanasi of INTACH’s Bengaluru chapter, said that the building could be restored and conserved at a very affordable cost. “The building can be converted into a museum of weather prediction science which will be a great opportunity for students to learn and explore. We have done a similar restoration work to house a museum in NIMHANS,” he said.", 
    "section": "national", 
    "title": "123-year-old observatory may be razed down", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}