{
    "author": [
        "M Balaganessin"
    ], 
    "text": "The swimming pool at the government stadium in Ariyalur being beautified with lawns and shade-giving horticultural plants. At right is a fossil on the site.— Photos: M. Srinath\n\nThe district stadium is being spruced up with a renovated swimming pool and walkway\n\nThe District Sports Stadium is being beautified and improved with additional infrastructure. Launched a month ago, the Rs. 60-lakh beautification work is the initiative of the district administration. Providing a safe and eco-friendly facility to sportspersons and walkers, particularly in the late evening, is the objective of the work.\n\nMost important component of the work is the raising of a lawn all around the swimming pool spread over one acre of land. The infrastructure, declared open in 2013, has two swimming pools – one for adults and the other for children. The swimming pool for adults measures 25 metres x 19 metres while the smaller one is 10 metres x 5 metres. District Collector E. Saravanavel Raj said the swimming pool had been attracting a large number of sportspersons and the district administration had taken special steps to beautify it. A large space encompassing the swimming pool was found ideal for environmental protection. All around the pool, a lawn is being raised. Further, saplings of shade-giving horticultural species are being grown. A small park was being raised in the swimming pool zone at an estimate of Rs. 3 lakh, he said.\n\nThe Collector said a 510-metre-long walkway has been another attraction. The track is six-foot wide, facilitating the walkers in their work-out.\n\nThe work is being executed at an estimate of Rs.16.50 lakh. He said that a high mast lamp had been set up at one end of the stadium. According to official sources, the high-mast lamp had come as a blessing for the sportspersons to continue their practice even after dusk. “So far, sportspersons and coaches used to disperse by 6 p.m. With the commissioning of high mast lamp on the New Year’s Day, a large number of sports lovers have started practising for about two hours in the evening,” a source told The Hindu on Friday.\n\nPlan for arch\n\nThe source said that it had been planned to set up an arch in front of the sports stadium. “We are looking for patrons and donors,” he said.", 
    "section": "national", 
    "title": "Ariyalur’s fitness enthusiasts get the much-needed space", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}