{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Many of the bank branches in Palayamkottai and Tuticorin wore a deserted look as bank employees struck work on Friday.— Photos: M. Lakshmi Arun and N. Rajesh\n\nFinancial transactions in 186 branches of various banks across the district were totally paralysed as the employees struck work on Friday in support of the protesting workers of State Bank of India’s subsidiary banks.\n\nThe protesting employees of SBI’s subsidiary banks viz State Bank of Travancore, State Bank of Mysore, State Bank of Patiala, State Bank of Hyderabad and State Bank of Bikanir allege that the ‘parent bank’ was adopting “anti-worker policies” by enforcing the rules and regulations applicable for SBI on them.\n\nExtending support to the protesting bankers, employees of all other nationalised banks excluding the SBI and the Indian Overseas Bank participated in the one-day strike called by the employees of SBI’s subsidiary banks. Consequently, banking transactions worth several crores of rupees were affected.\n\nIn Tuticorin, over 500 bank employees participated in the strike.\n\nNagercoil\n\nBanking operations were affected partially in Kanyakumari district due to the strike on Friday. However, the Lead District Bank - Indian Overseas Bank, SBI functioned as usual, said S. Sundararaman, Zonal Secretary, State Bank of Travancore Employees Union affiliated to the All India Bank Employees Association (AIBEA).\n\nMr. Sundararaman said the strike call was given by AIBEA to protest against the violation of bilateral settlement by five associate banks of State Bank of India and their attempt to force unilateral service conditions on the employees.\n\nBanking operations in all commercial banks except SBI and IOB were affected.\n\nMr. Sundararaman said that banking operations were hit in over 100 branches and over 1,000 bank employees participated in the strike.\n\nMembers of the AIBEA affiliated unions of different banks staged a demonstration in front of the Regional Office of the State Bank of Tranvancore near Head Post Office in Nagercoil.\n\nThe demonstration was presided over by N. Raghunathan, Vice President of SBT Employees Union. T. Chidambaram, Secretary, Kanyakumari District Bank Employees Association inaugurated the demonstration.", 
    "section": "national", 
    "title": "Banking services paralysed", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}