{
    "author": [], 
    "text": "Perungudi and Austinpatti stations do not have regular Inspectors for the past one year, writes S. Sundar\n\nBifurcation of Madurai district police force has left two police stations of the rural police district in a lurch. The police stations of Perungudi and Austinpatti do not have regular Inspectors of Police and are managed by officials in charge for the past one year.\n\nThis happened after major police stations of Tirupparankundram sub-division of the then rural police district — Tirupparankundram, Avaniapuram, Tirunagar and Tirupparankundram All Woman Police Station — were merged with the Madurai city police to make it co-terminus with expanded Corporation limits on January 1, 2015.\n\nWhile Perungudi was under the control of Tirupparankundram Inspector, Austinpatti was under the control of Tirunagar Inspector. Subsequently, Inspector of Police (Prohibition Enforcement Wing-PEW) and Inspector (Crime Records Bureau) were made in charge of the two police stations respectively.\n\nBesides, the sub-division also shrunk in only these two police stations where the station house officers (SHOs) were Sub-Inspectors of Police. An IPS officer, who was the former Assistant Superintendent of Police of Tirupparankundram sub-division, continued to manage it till his transfer a couple of months back.\n\nSince then no DSP has been posted for the sub-division. The Deputy Superintendent of Police, Tirumangalam, was made in charge of these two sub-divisions.\n\nHowever, things became worse when the Tirumangalam DSP was transferred and Prohibition Enforcement Wing (Tirumangalam) Inspector was made in charge of Tirumangalam with additional charge for these two stations.\n\nThe significance of Perungudi station is in providing security to Madurai International Airport.\n\n“Following the recent terrorist attack at Pathankot air base, a red alert was issued for Madurai airport. Security remains fortified in the airport round-the-clock for the last one week,” a police source said. Only a regular Inspector could closely monitor such a sensitive assignment, the source added.\n\n“Without regular Inspectors, investigation on grave cases such as murders will be an additional burden in the long run. Cases booked under SC/ST (Prevention of Atrocities) Act are to be investigated by a DSP,” the source added.\n\nSince these police stations did not come under a regular sub-division, every time an offence was committed against children, the Superintendent of Police had to assign the investigation to the Inspector of Police, (AWPS-Tirumangalam) as a special case.\n\nA regular Circle Inspector could be posted for these stations to make things easier. Similarly, the stations could be brought under Tirumangalam sub-division for all practical purposes, the source said.", 
    "section": "national", 
    "title": "Bifurcation leaves two police stations in lurch", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}