{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Owners, enthusiasts celebrate Centre’s decision to lift the ban on ‘jallikattu’\n\nBull owners and enthusiasts of Eruthu Vidum Vizha celebrate the lifting of ban on jallikattu by bursting crackers and distributing sweets in Vellore on Friday.— Photo: C. Venkatachalapathy\n\nIt was time to celebrate for bull owners across the Vellore district. With the Central Government clearing the grounds to conduct ‘jallikattu’ in the State on Friday, it was a day to cherish for hundreds of bull owners and enthusiasts of eruthu vidum vizha (bull race).\n\n“It is like a dream come true for all of us. We have been eagerly waiting for this day since jallikattu was banned putting a hold on the district’s own eruthu vidum vizha . This event has been a tradition during Pongal in hundreds of villages here,” said R. Soundarajan, president of Tamil Nadu Eruthu Vidum Vilaiyaatu Paadhukaapu Sangam, Vellore district.\n\nThere are 750 bull owners across Vellore district. They have been rearing 2,000 bulls exclusively for the bull race. Following the Centre’s move to allow the conduct of jallikattu , the owners and enthusiasts celebrated by bursting crackers and distributing sweets to the public in various parts of the district. “We took a bull on procession at Mittur and Kurusilapet to share our joy with villagers,” he added.\n\nThey are planning to conduct the race in four places on January 17. The races will be held including at Muthukur near Latheri, Vellakuttai near Vaniyambadi and Kalnarasampatti near Tirupattur on the same day, he said.\n\n“We are drawing up the schedule for the bull races. Starting from Pongal, it will be held for nearly six months in over 350 villages across the district,” L.B. Babu, a bull owner in Latheri, and secretary of the association said.\n\nHe said the race will be held in Latheri after nearly four years. “We stopped conducting the race after stringent regulations came into place,” he noted. With animal welfare organisations planning to approach the court against the Centre’s decision, Mr. Soundarajan said the Tamil Nadu Government could enact legislation to enable smooth conduct of the traditional sport.", 
    "section": "national", 
    "title": "Bull races to be held from Jan. 17", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}