{
    "author": [
        "B Kolappan"
    ], 
    "text": "How far is jallikattu a part of Tamil culture and ancient tradition? A translation of Kalitogai , a major work in Sangam literature, by A.K. Ramanujan gives a vivid description of the ancient sport known as Eru Thazuval : “That the bull is wilder than an elephant gone wild; do not loosen your hand’s grip on him, and the shoulders of our girl will bring you victory flags.”\n\nP.A. Krishnan, writing a preface to the English translation of Vaadivaasal , a book on jallikattu by C.S. Chellappa, notes that there is another poem in Kalitokai that says “if a shepherd boy is afraid of hugging a bull, he will not be hugged by a shepherd girl even in his next birth.”\n\nNoted historian A.L. Basham in his book, The Wonder that is India , says the bullfight was looked at as an ordeal to test the manhood of young men “since it is stated that the girls who watched the performance would choose their husbands from among the successful competitors in a sort of Tamil swayamvara .”\n\nHowever, he hastens to add that “though Tamil literature gives no evidence of this, the bullfight had certainly some ritual significance, and was connected with the fertility of crops.” Over the years, the sport came to be seen as an inextricable feature of Tamil culture, with embellishments being added to the lore around it. Tamil scholar V. Arasu, however, explains that the story has nothing to do with Tamil literature or tradition. “Such stories find a place in later literature only as references,” he says.\n\nBasham also appears to note that far from being associated with glory, it was a gory sport. Though there was no attempt to kill the bull, it “was evidently a sport of great danger, for the poem contains a gory description of a victorious bull, his horns hung with the entrails of his unsuccessful opponents.”\n\nMr. Arasu said jallikattu was a continuation of a pastoral society’s bond with the cattle, rejecting the argument that it caused cruelty to the animal and danger to tamers. “From a colonial perspective it is cruel. Can we give up using automobiles because of accidents,” he asks.", 
    "section": "national", 
    "title": "Bull fight, an inextricable feature of Tamil culture", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}