{
    "author": [
        "M Balaganessin"
    ], 
    "text": "T. Raja, who has been rearing this bull for seven years at Suriyur village near Tiruverambur is delighted with the Centre's notification on lifting the ban on Jallikattu on Friday.— PHIOTO: A. MURALITHARAN\n\nBull owners, bull tamers, and rural youths reacted with jubilation to the Centre’s move to allow the conduct of “Jallikattu” by altering the notification of the Union Ministry of Environment and Forests on Friday.\n\nCrackers were burst and sweets distributed at many villages where the bulls are being reared Tiruchi and neighbouring districts. Youths took out rallies, along with bulls, in places such as Manapparai, Lalgudi, and Pudukottai.\n\nResidents of Suriyur, Chinna Suriyur, and surrounding villages in Tiruverumbur block in Tiruchi district where bulls are reared exclusively for jallikattu expressed happiness over the Centre’s move.\n\nRaja, one of the organisers of the jallikattu , said that though it was a “delayed gift” as there were just a few days to go for Pongal this year, the move would facilitate reviving jallikattu with full dynamism from next year.\n\nHe said that villagers and bull owners were not sure whether the jallikattu could be organised within the short span of time. Elaborate procedure had to be followed and arrangements such as safety structures have to be put up, Mr. Raja pointed out.\n\nThe people of the village were planning to convene a meeting on Saturday to discuss the issue and the arrangements for organising the jallikattu in the village this year.\n\nT. Sundararaj, a youth of Suriyur village, said that his bull had been participating in the jallikattu for the past seven years. This year, the people of the village were not certain about organising the event.\n\n“We needed more time and resources for organising the event for which at least 10 days is needed,” he said expressing doubts on whether the permission could be fully utilised this season. Fund raising for making the arrangements and purchase of attractive prizes for winners needed adequate funds and time, he said.\n\nMr. Sundararaj said that he had been rearing the animal incurring a huge expenditure daily. “It is part of our family and we even disposed a part of our property for its maintenance,” he said.", 
    "section": "national", 
    "title": "Celebrations erupt in rural areas over Centre’s move on Jallikattu", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}