{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "With just days left for Pongal festival to start, the Ministry of Environment and Forests has invoked “culture and tradition” to bring ‘jallikattu’ back.\n\nBut in doing so, the Centre has circumvented a May 7, 2014 judgment in which the Supreme Court hails the very same reason of “culture and tradition” to ban jallikattu as plain act of cruelty shown to a dumb animal. It had held that this “sport” was grossly against the Tamil culture and tradition to “embrace bulls and not over-powering the bull, to show human bravery”.\n\n“Yeru Thazhuvu, in Tamil tradition, is to embrace bulls and not over-powering the bull, to show human bravery... Welfare and the well-being of the bull is Tamil culture and tradition, they do not approve of infliction of any pain or suffering on the bulls, on the other hand, Tamil tradition and culture are to worship the bull and the bull is always considered as the vehicle of Lord Shiva,” Justice (retired) R.K. Radhakrishnan observed.\n\nBy issuing the notification, the NDA government has only successfully accomplished the U-turn its predecessor, UPA II, tried to take but only to be stopped just in time by the Supreme Court through its 2014 judgment banning jallikattu.\n\nA careful reading of the 117-page verdict shows the court expressing its resentment at the “abrupt” change in the stand of the UPA II government against its own notification issued on July 11, 2011 exempting the ‘bull’ as a performing animal.\n\nThe reasons quoted by the UPA II government in court then are identical to what the NDA government's latest notification. The Centre said it wanted jallikattu back “keeping in mind the historical, cultural and religious significance of the event”. The judgment also recorded the MoEF assuring the apex court that no “unnecessary pain or suffering” would be caused to the animals.\n\nBut the apex court trashed the Centre's argument and “abrupt” change in stand. Justice Radhakrishnan said jallikattu, no matter what regulations are put in place, can never be free from cruelty.\n\n“Sadism and perversity is writ large in the actions of the organisers of jallikattu and the event is meant not for the well-being of the animal, but for the pleasure and enjoyment of human beings...” the apex court had observed.\n\nThe court had, possibly apprehending future notifications to circumvent the spirit of its judgment, held that no regulations or guidelines should be allowed to dilute or defeat the spirit of a welfare legislation like the Prevention of Cruelty to Animals (PCA) Act, 1960 and constitutional principles. If so, the Supreme Court should strike them down without hesitation.\n\nWith the possibility of the Animal Welfare Board of India challenging the 2016 MoEF notification looming high, the judgment has already laid down the law that a court’s duty under the doctrine of parens patriae is to take care of the rights of animals, since they are unable to take care of themselves as against human beings.\n\nThe notification violates the very essence of the PCA Act as interpreted in the May 2014 verdict of the Supreme Court. Under Section 3, no right is conferred to inflict necessary or unnecessary pain or suffering on the animals.\n\nIronically, the Supreme Court\n\nhad referred to\n\nthe same tradition\n\nto ban it", 
    "section": "national", 
    "title": "Centre invokes culture to bring bulls back into the ring", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}