{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Commuters’ associations of Salem and Namakkal districts have pleaded for the introduction of more trains from Salem to different destinations and creation of additional infrastructure.\n\nWhen Vashishta Johri, General Manager of the Southern Railway, came to inspect the railway stations in the Salem – Namakkal – Karur section on Thursday, they presented petitions in this regard.\n\nThe Salem Railway Forum demanded introduction of direct train service from Coimbatore to Shirdi, day- time train from Salem to Chennai via Attur and using the coaches of the Yercaud Express lying idle at Erode to run a day-time train to Bengaluru. A. K. B. Krishnamoorthy, vice-president of the Forum, handed over the petition to the GM.\n\nG. Hariharan Babu, former member of the Zonal Railway Users Consultative Committee, demanded that the Railways should extend the Tirunelveli – Erode, Palakkad – Erode, Tiruchi – Erode and Coimbatore – Erode passenger trains to Salem. He appealed for using the coaches of Erode – Jolarpettai passenger trains to operate trains from Jolarpettai to Tirupathi and Chennai and also extending the Chennai – Tirupathur ‘Yelagiri’ Express to Salem. Mr. Babu also demanded steps for electrification of the entire Salem division.\n\nA section of farmers of Rasipuram, led by P. Swaminathan, educationist, presented a petition seeking steps to lay a service road on the western side of the Namakkal railway station to reach their farm lands. They said that the Railways had acquired their land for the laying the new track and construction of railway station assuring them the service road. The road had not been laid so far, and it caused much hardship to them to reach their farmlands, they said.\n\nThe Mohanur Rail Commuters Welfare Association, Namakkal district, demanded the inclusion of Mohanur station in the stoppage map of express trains, as the commuters had to travel for 25 km for the next major station. The Railways should set up a reservation counter at Mohanur station and also provide ramp facility.\n\nR. Natarajan of Makkal Nala Paadukappu Kuzhu demanded disbursement of compensation to all those who gave their lands for the laying of track and construction of Mallur Railway Station.", 
    "section": "national", 
    "title": "Commuters want more trains from Salem", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}