{
    "author": [
        "Special Correspondent"
    ], 
    "text": "While dealing with petitions for suspension of sentence, appellate courts cannot direct convicts to surrender before trial courts just because the latter had issued non-bailable arrest warrants immediately after conviction and sentencing, the Madras High Court Bench here has held.\n\nJustice M. Venugopal passed the order while reversing an order passed by the Principal District and Sessions Court in Karur on September 9 directing a woman to surrender before a Judicial Magistrate who had convicted her in a cheque bounce case and sentenced to five months of simple imprisonment.\n\nAllowing a criminal revision case preferred by A. Vijayarani, the judge agreed with her counsel N. Ananthapadmanabhan that the Sessions Court had erred in directing the convict to surrender while disposing of an application to suspend the sentence pending adjudication of an appeal preferred by her.\n\nHe said that the Judicial Magistrate had convicted and sentenced the woman on April 16 and also issued the non-bailable arrest warrant on the same day since she was not present before the trial court at the time of pronouncing the judgement.\n\nEven as the warrant was pending, the woman preferred an appeal against the trial court’s judgement before the Sessions Court along with an interlocutory application to suspend the sentence imposed on her until the disposal of the appeal.\n\nPassing orders on that interlocutory application, the Sessions Court directed her to surrender before the Magistrate since the warrant was yet to be executed and directed the trial court to consider withdrawing the warrant in accordance with Section 70 (2) of Code of Criminal Procedure.\n\nSetting aside the order passed by the Sessions Court, Mr. Justice Venugopal ordered rehearing of the interlocutory application to decide whether the convict was entitled to suspension of sentence or not. In the meantime, he gave liberty to the convict to file an application before the trial court for recalling the warrant.", 
    "section": "national", 
    "title": "“Convicts cannot be ordered to surrender”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}