{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "More than 28 mld treated water goes down River Noyyal\n\nCoimbatore Corporation has proposed to treat water already treated by sewage treatment plants (STPs) and supply it to farms or industries that are ready to buy it.\n\nAt its last Council meeting on December 22, 2015, the civic body said that it would like to do this with water let out from its sewage treatment plants in Ukkadam, Ondipudur and Nanjundapuram.\n\nIt wants to prepare a feasibility report and implement the project with or without public-private participation with funds from the Project Development Grant Fund.\n\nThe Corporation proposed three STPs under the Jawaharlal Nehru National Urban Renewal Mission in Ukkadam, Ondipudur and Nanjundapuram. Of the three, it had commissioned the Ukkadam STP, which has an installed capacity to treat 70 million litres a day (mld) of sewage.\n\nBut the Corporation is able to let in only 30 mld sewage as underground drainage lines from only a few areas are connected to the plant. Officials say once they connect the sewer lines from other areas the plant will run to full capacity.\n\nThe Corporation is yet to commission the Ondipudur STP that has an installed capacity to treat 60 mld sewage a day. Officials said they await power supply to the plant and once that is through, the trail run will begin. But sources say that even with a power connection the trial run cannot start as the pipeline laying work to carry sewage to the plant is yet to be complete.\n\nThe Corporation was at loggerheads with the National Highways over pipeline alignment. The two have since resolved their differences and officials say the work to lay sewer lines till the Ondipudur plant will be competed soon. The Corporation has been unable to resume the Nanjundapuram STP plant work as residents have challenged the project and the case is before the National Green Tribunal Southern Bench. Many feel that the project to treat and sell the water from the STPs was of no use until the problems related to the three STPs was resolved.\n\nBut officials say that the Corporation is only trying to better utilise the treated water. At present, more than 28 mld treated water goes down River Noyyal. If the civic body can put this to better use and earn money, why waste the opportunity. The officials also said that a few potential buyers have already shown interest in the proposal.", 
    "section": "national", 
    "title": "Corporation proposes to reuse treated water but STPs not ready", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}