{
    "author": [
        "M K"
    ], 
    "text": "The eight districts in the West Zone saw a significant drop in the number of major crimes in 2015 and these included murders, dacoity, robbery, chain-snatching, burglary and thefts.\n\nStatistics from the West Zone police, covering Coimbatore, the Nilgiris, Tirupur, Erode, Namakkal, Salem, Dharmapuri and Krishnagiri districts, show that 1, 472 such cases were reported in 2015 as against 1,717 in 2014 (In Coimbatore, Salem and Tirupur districts, the city is not covered).\n\nThough such crimes declined in Coimbatore, Erode, Dharmapuri and Krishnagiri, there was a significant rise in Tirupur and Salem districts and a marginal increase in Namakkal and The Nilgiris. But there was a marginal drop in the number of attempts-to-murder, rioting and injuring in the zone.\n\nThe beginning of last year did not start well for the police in West Zone. 41.273 kg of gold jewellery was robbed from the branch of Bank of Baroda at Ramapuram village in Krishnagiri on January 23. But this led to the police sensitising banks and other financial institutions in the zone.\n\nInspector General of Police (IG) for West Zone K. Shankar said the police in all the eight districts conducted meetings for banks, primary cooperative societies and other financial institutions to step up security arrangements.\n\nThey were asked to have more than one security check mechanism.\n\n“This yielded results as three attempts were made in banks (one each in Salem, Dharmapuri and Tirupur) after the Krishnagiri incident. But they failed as the security alert systems were in place,” he said and added that this could be one of the reasons for the drop in the number of major crimes during the rest of that year.\n\nProper security arrangements also led to more people being detained under Goondas Act. From 249 persons in 2014, it reduced to 361 in 2015. “Most of them were involved in a series of crimes, ” Mr. Shankar said.\n\nIn June and July 2015, the West Zone police profiled 5,666 grave offenders in the region during the last five years and regularly monitored them by conducting background checks. Copies of the profiles were circulated to all the 238 police stations in the zone.\n\nBut, there was a marginal dip in the rate of detection from 86.61 per cent in 2014 to 84.91 per cent in 2015.\n\nThe rate of recovery of valuables fell from 80 per cent to 78 per cent – during the same period.", 
    "section": "national", 
    "title": "Drop in major crimes in West Zone", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}