{
    "author": [], 
    "text": "SALEM\n\nRamakrishna Mission Ashrama: Narai S. Nellaippan speaks on ‘Swami Akhadananda’s life’, 7 p.m.\n\nSri Prasanna Varadaraja Perumal Devasthanam: Margazhi Tiruppavai Upanyasa Mahotsavam, B. M. Sathya Ram Acharya delivers upanyasam, Vasantha mandapam, Chinnakadai street, 6.45 a.m.\n\nTiruvembavai Peruvizha Kazhagam Trust: Tiruvembavai peruvizha, Tiruvembavai parayanam, Arulmigu Sugavaneswara Swamy Temple, 5.15 a.m.\n\nMargazhi Peruvizha Committee: Margazhi festival, E. Jayaraj from Sri Lanka, delivers relay discourse on ‘Mahabaratham’, Ammapettai Sengunthar marriage hall, 7 p.m.\n\nSri Skandasramam Trust, Udaiyapatti: Hanuman Jayanthi, yagasalai pravesam, Sri Vallaba Ganapathi homam, Sri Navagraha homam, Aavahanthi homam, poornahudi, 7 a.m.; special abishekams, 11 a.m.; bhajans by M. R. Sriram Bhagavathar troupe and bhajans and namasangeerthanam by Thiagu Bagavathar, 11 a.m.\n\nInfant Jesus Cathedral, Arisipalayam: Pangu Peruvizha, jabamalai, navnaal, 6 p.m.; tirupplai, Rev. I. Sathiyan, presides, 6.30 p.m.\n\nHR and CE Department: Paavai Vizha, contests for school students, Vasavi Marriage hall, 8 a.m.\n\nPeriyar University: Department of Textile and Apparel Design, modular training programme on ‘industrial pattern making’, 10 a.m.\n\nSri Ganesh College of Arts and Science: Indian Red Cross Society training programme, P. Thirumoorthy, district coordinator, chief guest, T. Vijay Ganesh, secretary, inaugurates, M. Thangavel, correspondent, presides, 9.30 a.m.\n\nSona College of Technology: Department of Information Technology, workshop on ‘Ruby on Rails’, R. Seetha Rama Guptha, Product Developer, Freshdesk, Chennai, resource person, 10 a.m.\n\nKnowledge Institute of Technology: National Mission on Education through ICT conducts ISTE sponsored STTP on ‘introduction to structural engineering’, 10 a.m.\n\nCluny Matriculation Higher Secondary School: Dance by girls on earthern pots for world record attempt, Fr. Benedict Anelin, Co-pastor, Infant Jesus Cathedral, chief guest, 8.30 a.m.\n\nSri Vidya Mandir Higher Secondary School, Kondalampatti: Annual Day, V. Panneer Selvam, MP, chief guest B. Shambu Kumar Guptha, Joint Secretary, Sri Vidya Mandir Association, distributes prizes, S. K. Selvam, MLA, presides, 5 p.m.\n\nSalem Sri Sowdeswari Matriculation Higher Secondary School: Yoga for harmony, A. Kannammal, Correspondent and J. K. A. Kumara Rajah, Executive Trustee, participate, 9.30 a.m.\n\nNorth Eastern Handicrafts and Handlooms Development Corporation Limited: North East crafts bazaar, Deiveegam Marriage hall, 10 a.m. to 9 p.m.\n\nMalabar Gold and Diamonds: Artistry branded jewellery show, showroom, Bharathi street, Swarnapuri, 10 a.m.\n\nNational Book Trust and New Century Book House: National Book Festival book exhibition, Bose Maidan, 9.30 a.m. and 9.30 p.m.\n\nCooptex: New Year and Pongal handloom textiles exhibition, Bose Maidan, 10 a.m. to 8 p.m.\n\nNAMAKKAL\n\nPaavai Engineering College: IIT Bombay sponsored ISTE short term training programme on introduction to structured engineering, 10 a.m.\n\nDepartment of Handlooms and Textiles: Pongal Festival handloom exhibition, Sri Namagiriamman Thirumana Mandapam, Kulakarai, 9.30 a.m.\n\nTIRUCHENGODE\n\nVivekanandha College of Arts and Science for Women: Department of Botany, national level workshop on ‘taxonomical techniques’ and tradition seeds expo, 10 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}