{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Religion\n\nBakthi Sorpozhivu Mandram: Villibaratham discourse, Kongu Nadu Arts and Science College, 6.30 p.m.\n\nThiruvenkatavan Charitable Society: Margazhi Mahotsavam, Sri Venugopalaswamy and Sri Kalyanavenkatesa Perumal Swamy Temple, 5.20 a.m.\n\nSri Pattatharasiamman Temple: Thiruppavai Chant, Periyanayakkampalayam, 5 a.m.\n\nSri Varasithti Vinayagar, Sri Varatharajapperumal, Sri Mahalakshmi, Sri Varathaanjineyar Temple: Sri Anumaan Jayanthi, Sri Varathaanjineyar Thirumanjanam, Vadaimalai, Vignesh Nagar, 6 a.m.\n\nISKCON: Ratha Yatra, Thermutti, 2.30 p.m.\n\nJeevajothi Family Fellowship: Prayer meeting, Gujarat Samaj, 10.30 a.m.\n\nGeneral\n\nJeeva Oli Mananiraivu Markkam: Thai Poosa Vizha and Medical Camp, Puliyakulam, 10 a.m.\n\nDr. N.G.P.Arts and Science College: Yoga Program, college Campus, 10 a.m.; guest lecture, 10 a.m.\n\nKarpagam Academy of Higher Education: Workshop on “SPSS”, MBA Computer lab, 10 a.m.\n\nKovai Kalaimagal College of Arts and Science: Faculty Development Program, 10 a.m.\n\nIncome Tax Employees Federation: Delegates Conference, Rajasthani sangh, R.S.Puram, 10 a.m.\n\nThe Coimbatore Productivity Council: Programme on “OHSAS-18001”, Vyshnav Building, Race Course, 9.30 a.m.\n\nInfant Jesus Matriculation Higher Secondary School: Annual day, School Premises, 5 p.m.\n\nAngappa CBSE Senior Secondary School: Sports Meet, T.A.Ramalingam Chettiyar Hr.Sec.School, Alagesan Road, 3 p.m.\n\nArya Vysya Charitable and Education Foundation: Distribution of Educational Scholarships, Hotel Aloft, 11 a.m.\n\nDR.SNS Rajalakshmi College of Arts and Science: Heftycom’16’ , college premises, 10 a.m.\n\nKarpagam College of Engineering: Workshop, College Premises, 9 a.m.\n\nTamilnadu Packaged Drinking Water Manufactures Association: Global Water tech expo, CODISSIA trade fair complex, 10 a.m.\n\n5th Pillar Corruption Killer: RTI training, Thiruvenkatasamy Road, 4 p.m.\n\nGanga Orthopaedic Research and Education Foundation: Update on musculoskeletal radiology, Ganga Hospital, 10 a.m.\n\nCoimbatore Advocates Association: Unveiling of the portrait of late C.R. Subramanian, Justice M.M. Sundaresh, judge, Madras High Court, chief guest, CAA Hall, 3 p.m.", 
    "section": "national", 
    "title": "Engagements. Coimbatore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}