{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Unit discharging effluents with chemicals affecting environment, say fishermen\n\nDistrict Collector M. Ravikumar has informed that the Tamil Nadu Pollution Control Board had issued notice to a fish processing unit near Tharuvaikulam as chemicals seriously affecting the environment were found in the effluents being discharged from the company.\n\nRaising this issue in the fishermen’s grievance day meeting held at the Collectorate on Friday, Johnson, president of North Tuticorin Country Boat Fishermen Association, said the district administration should take steps for closing down the fish processing unit as the effluents being discharged by it were seriously affecting the environment.\n\nMr. Ravikumar said the TNPCB had already analysed the effluents cascading from the unit and found presence of chemicals affecting the environment in objectionable levels in it. Based on its findings, the district administration had recommended the closure of the unit to TNPCB.\n\nPresident of Tharuvaikulam panchayat Maharajan said the processing unit had made some technical modifications in the plant following objections from the fishermen. Hence, action might be taken against the company if effluents discharged by the company had serious chemicals affecting the environment.\n\nPresident of Inland Fishermen Cooperative Society P. Lilyraj said ‘first preference’ should be given to inland fishermen for fish culture in the ponds in the district instead of taking it to ‘open auction.’\n\nPresident of Tuticorin District Anna Conch Divers’ Welfare Association M. Esakkimuthu said the incomplete fish landing centre at Terespuram should be completed at the earliest.\n\nMr. Ravikumar thanked the fishermen profusely for helping the district administration in rescuing the stranded people during the recent floods.\n\nTNPCB analysed effluents from the unit and found presence of chemicals affecting the environment in objectionable levels in it: Collector", 
    "section": "national", 
    "title": "Fish processing unit faces action", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}