{
    "author": [
        "B Kolappan"
    ], 
    "text": "PMK chief recalls college days when he was ragged in a friendly way\n\nIn the days when ragging in college was good natured, and it had not degenerated into crime, all students, especially those in the hostel, were subject to at least one session by seniors, almost as a rite of passage. None was spared. Neither was S. Ramadoss, founder of the Pattali Makkal Katchi, at Madras Medical College (MMC), a shy young man.\n\nBetween 1959 and 1965, during his stint doing medicine at MMC, Dr. Ramadoss quietly submitted himself to the ragging sessions.\n\nThese stories, thus far only a part of the batch’s alumni lore, came out in the open on Friday at the meeting of the batch of 1960 on campus.\n\nAmong the things his seniors asked Dr. Ramadoss to do were: ‘swim’ on the floor and mimic an aeroplane flying with an ear-piercing sound.\n\n“They used to force you to propose to a senior girl. Fortunately, I escaped that,” he said.\n\nClearly, neither his seniors nor his batch-mates were able to spot the traits of a leader/politician in Dr. Ramadoss.\n\nWhile most of his batch mates went on to earn a name for themselves in their area of specialisation, Dr. Ramadoss, after a roaring practice in his home town, plunged headlong into politics.\n\n“I got my appointment order as a doctor of Tindivanam taluk hospital six months before I graduated. I worked there three years and had a private practice even after I launched the party. My fee was Rs. 3 and sometimes I have given my poor patients the bus fare to go back home,” he recalled.\n\nOn Friday, Dr. Ramadoss said that he was probably the first among his batch-mates to get married — his marriage took place when he was a student.\n\nBatch mate and noted urologist K.C. Reddy and son-in-law of film-maker Nagi Reddy interjected to say it was he who married first.\n\n“The batch had 120 students when Tamil Nadu had only eight medical colleges. We had great teachers including Ratnavel Subramaniam, A.L Venugopal and A.S. Thambaiah,” said Dr. K. Balakrishnan, another Professor of Anaesthesia, who was instrumental in organising the event.\n\nAmong those who had turned up for the meet from far and wide were A.L. Arumugam, one of the first graduates of the National Institute of Mental Health and Neurosciences, S. Muralidharan, cardiac surgeon of the Kuppusamy Naidu Memorial Hospital in Coimbatore, Chittor Govindaraju, an expert in internal medicine and sleeping disorders, J.D. Eeran, a citizen of Malaysia and Saraswathy Ganapathy, daughter of C.S. Ganapathy who died in the frontlines during World War II.\n\nNeither his seniors nor batch-mates were able to spot traits of a leader in Ramadoss", 
    "section": "national", 
    "title": "From shy student to a seasoned politician", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}