{
    "author": [
        "S Annamalai"
    ], 
    "text": "Though the sport of bull taming is prevalent in different versions – kaalai anaithal, eru thazhuval and eruthu kattu – in Tamil Nadu, jallikattu is predominant in the southern districts.\n\nThe name itself is suggestive of the reward – jalli ( salli ) means coin and kattu is the package placed in between the horns of the bull. The winner, who used to take the bull by its horns, walked away with the kattu containing gold or silver coin or currency notes.\n\nIn its earliest form practised in the Mullai landscape of ancient Tamil Nadu, the victor won the hand of the bull owner’s daughter. “It was primarily meant to test the physique of the youth by an agrarian society. The father was confident that an able-bodied man would secure the future of his daughter,” says B. Thirumalai, a writer.\n\nWhen kings became patrons of jallikattu , the sport was organised as a post-harvest peace time activity to engage the youth.\n\nThe coveted prize in the form of a bride transformed into coins and later into household items such as almirah, stainless steel utensils, cots and mopeds.\n\nIn 2014, when the last jallikattu was organised in Alanganallur, a two-wheeler company offered prizes for the ‘bull of the match’ and ‘tamer of the match.’\n\nTill it became a regulated sport, prize money was offered to the winner by the owner of the bull or by other individuals, which was tantamount to betting.\n\nMore than the prizes, it has always been pride at stake for both the bull owner and tamer.\n\nFrom one point of view, the jallikattu arena was a level-playing field as tamers of all castes took on the bulls together. But there were also instances of post-event skirmishes if a Dalit tamed a bull owned by a person from the intermediate caste.", 
    "section": "national", 
    "title": "From bride to T-shirt, the prizes had it all", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}