{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Claiming credit for the efforts her government had taken to lift the ban on jallikattu , Chief Minister Jayalalithaa on Friday blamed the Congress and the DMK for putting a spoke in conducting it in the State through a notification issued in 2011.\n\n“The main reason behind the ban was due to a notification issued during the United Progressive Alliance rule headed by the Congress, in which the DMK was part of. It was on the basis of that notification, bulls were included in the list of animals that were not to be treated or exhibited as a performing animal,” Ms. Jayalalithaa claimed in a statement.\n\n“It was on my consistent insistence to the Prime Minister to take necessary legal steps expeditiously to ensure the conduct of jallikattu during the Tamil festival of Pongal, the Ministry of Environment, Forest and Climate Change on has issued a notification on January 7, 2016,” she contended.\n\nMs. Jayalalithaa had handed over a memorandum to Prime Minister Narendra Modi seeking a revocation of the ban last August.\n\nFollowing the notification issued by the Centre on Friday, she said, “there was no obstacle” for conducting jallikattu and the Tamil people could celebrate Pongal with gaiety.\n\n“I have also directed the Chief Secretary to issue a circular to District Collectors on the notification by the Centre on jallikattu ,” she added.\n\nTamil Nadu Congress Committee president E.V.K.S. Elangovan appreciated the efforts initiated by Union Minister Pon. Radhakrishnan to lift the ban.\n\nThe Congress was never against the event and it was because of a Supreme Court order that the sport could not be held in 2015, he said.\n\nMDMK general secretary Vaiko credited Mr. Radhakrishnan with facilitating the favourable notification. While the Centre had consistently gone against the sentiments of Tamil Nadu on many issues, it had finally heeded to the demands of the people, he added.\n\nThanking Prime Minister Narendra Modi and Union Minister Prakash Javadekar and Radhakrishnan,\n\nPMK founder S. Ramadoss urged the Centre to get adequate legal protection for the continuation of the sport.", 
    "section": "national", 
    "title": "Jayalalithaa takes credit; blames Cong, DMK", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}