{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Notification seems to run against reading of SC; whether an apex court order can be circumvented by executive order remains a debatable point\n\nn elated BJP on Friday celebrated the lifting of the ban on jallikattu with pomp. Union Minister Pon. Radhakrishnan proudly displayed at Kamalalayam a gazette notification of the Union Ministry of Environment, Forests and Climate Change that allowed the bull to perform in the sport and in other traditional events such as bullock cart races in several States.\n\nWhile the document provides BJP some political mileage, larger legal questions remain.\n\nThe Centre did not take the ordinance route and amend the Prevention of Cruelty to Animals (PCA) Act to facilitate the event. Rather, it has opted for an executive order which, while retaining the bull under the list of animals barred from being used for performances, exempts jallikattu and bullock cart races from the ambit of banned performances. Culture and tradition have been invoked to justify the event.\n\nThe legislative route was avoided as amending the Act may have attracted opposition in Parliament and delayed the move aimed at scoring political points ahead of Assembly elections. The question being raised now is whether the writ of the Supreme Court can so easily be circumvented by an executive order.\n\nIt is settled law that “delegated legislation” like this notification cannot be used to subvert the parent legislation. The power to frame rules can be used only to make consequential changes. The notification seems to run against the reading the Supreme Court gave to the provisions of the PCA Act, especially Section 3 (ensuring wellbeing of animal) and 11 (banning cruelty).\n\nThe notification, in its attempts to allay fears of the beasts being subjected to cruelty, states that the rights of animals as defined under PCA and the “five freedoms” declared by the Supreme Court in its 2014 verdict should be fully protected while conducting jallikattu.\n\nCuriously, what has been missed is that the “five freedoms” are aimed at ensuring a dignified life to animals. These consist of freedom from hunger, thirst and malnutrition; from fear and distress; from physical and thermal discomfort; from pain, injury and disease; and freedom to express normal patterns of behaviour. The Supreme Court order does not use the “five freedoms” as a regulatory guideline to conduct the event. On the contrary, it found jallikattu violating these freedoms and termed the very sport illegal since it subjects the animal to “unnecessary suffering”. A similar attempt in 2013 by the UPA government to remove bulls from the list of animals barred from performance was rejected as also the claim that jallikattu was indispensable to the Tamil tradition.\n\nThe government assurances on holding the event without cruelty are not new. The Tamil Nadu Regulation of Jallikattu Act addressed similar concerns in 2009. But an inspection by the Animal Welfare Board of India found that the bulls went through horrific cruelty in 2013 and 2014.\n\nWith animal rights activists readying to challenge the notification legally, the final word on conducting the sport this year is yet to be written.", 
    "section": "national", 
    "title": "Legal questions cast a shadow on the sport", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}