{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Centre lifting the ban on jallikattu after five years has evoked mixed reaction from the farming community in the district where the sport is surprisingly not relevant though cattle-rearing is integral to lives of people in the countryside.\n\nVillages in Bhavani and Anthiyur blocks are, however, known to have conducted rekla (bullock cart) races, which were also banned by the Environment Ministry citing restriction on treating bull as a performing animal. The Ministry’s latest notification permits exhibition or training of bull as a performing animal for jallikattu in Tamil Nadu, and bullock cart races in Maharashtra, Karnataka, Punjab, Haryana, Kerala and Gujarat, in accordance with the customs practised traditionally.\n\nErode does not figure in the list of districts where jallikattu is permitted. The places for bull fight events were chosen 10 years ago based on a government gazette notification based on consecutive conduct of the event for five preceding years, according to official sources. The Ministry had banned bull fight in 2011 based on representations by animal rights activists that the animals were ill-treated. The Supreme Court had upheld the ban in 2014. Though Erode is famous for its cattle markets, it is not known why the traditional sport has not taken roots in the rural milieu. Nevertheless, farmers will welcome the latest development, says E.N. Sivasenathipathi, secretary, Bargur Cattle Breeders’ Association.\n\nAnother section of farmers says the real issues they face have been ignored. “There is no need to make a heavy weather of conduct of jallikattu. The so-called sport is akin to a gamble,” says S. Kulandaivelu, functionary of Kalingarayan Pasana Vivasayigal Sangam. Problems such as water availability for irrigation and low returns that have been affecting livelihood of farmers ought to be given due importance instead to reverse rural to urban migration, he adds.", 
    "section": "national", 
    "title": "Mixed reaction among disinterested farmers in Erode", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}