{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Union Civil Aviation Minister P. Ashok Gajapathi Raju says Tiruchi international airport deserves a much longer runway\n\nAshok Gajapathi Raju, Union Minister for Civil Aviation, interacting with delegates of the Tiruchi Travel Federation in Tiruchi on Friday.— PHOTO: B. VELANKANNI RAJ\n\nThe new civil aviation policy will make the Indian skies more vibrant, Union Civil Aviation Minister P. Ashok Gajapathi Raju said here on Friday.\n\n“We have released the draft policy after extensive discussions and invited public comments. We have culled out certain issues from the suggestions received.\n\nThe policy will be announced after inter-ministerial consultations and, if necessary, being put before the Union Cabinet,” Mr. Raju said at an interaction with members of the Tiruchi Travel Federation.\n\nHe indicated that one of the features of the policy would be to revive “inactive airports” across the country\n\nOn the first day of his two-day visit to the city, Mr. Raju held extensive consultations to assess the requirements of the city, especially in terms of the aviation, travel, and tourism sectors.\n\nHe visited the airport and held consultations with senior government officials.\n\nAlthough Mr. Raju did not come out with any immediate assurances on the demands placed by the travel industry, he promised to take up actionable points with the Union government.\n\n“Tiruchi is on a good wicket and has a good airport though its runway needs to be expanded so that all aircraft can come here,” he said.\n\nHe pointed out that given the warm climate of the city, aircraft needed longer runway to operate without load restrictions.\n\nHe conceded the need for a new terminal as the airport is facing congestion and there was good scope for passenger and cargo traffic to go up.\n\n“We will work together on the issues raised here,” he said. When pointed out that the taxes on air turbine fuel were high in the airport compared to elsewhere in the country, Mr. Raju said the industry should take it up with the State government. He conceded that high taxes could be a disincentive for the industry.\n\nK. Shyam Sundar, Chief Executive Officer, Air India Express, told the meeting that Tiruchi was an important market for the airline and it would do justice to the city.\n\n“We do realise the potential for more flights from here. We will work it out and the city will be on top of our plans,” he said in response to the flurry of demands placed before him by the travel industry.", 
    "section": "national", 
    "title": "‘New civil aviation policy will make Indian skies vibrant’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}