{
    "author": [
        "P Sudhakar"
    ], 
    "text": "In the impact, some passengers thrown out through the broken windows were crushed under the bus\n\nThe omni bus that overturned near Valliyoor in Tirunelveli district on Friday.— Photo: A. Shaikmohideen.\n\nRash driving by an exhausted driver of an omni bus killed nine passengers and badly injured 33 others when the speeding vehicle overturned near Valliyoor in the district around 5.30 a.m. on Friday.\n\nThe deceased were identified as D. Edwin Michaelraj (32) of Ayanivilai near Thikkanamcode, B. Mary Lisa (35) of Kollam, her 18-month-old son B. Altroy, M. Jimmy (33) of Thooththur, L. Sujin (6) of Kochithurai in Thiruvananthapuram, V. Anjali (26) of Jamnagar in Gujarat, her twin brother V. Angilia (26), L. Vinoth (30) of Valiyathurai in Thiruvananthapuram and his wife V. Ancy (26). Two injured passengers are said to be critical.\n\nPolice said the multi-axle Volvo bus, proceeding from Karaikal to Thiruvananthapuram, overturned while crossing Pilaakottaipaarai near Valliyoor after hitting the concrete median.\n\nTwo of the victims breathed their last even as they were being rushed to different hospitals, including the Kanyakumari Government Medical College Hospital (KGMCH) at Aasaaripallam in Nagercoil, where 28 passengers with grievous injuries are undergoing treatment. A family from Jamnagar in Gujarat, which boarded the bus at Velankanni for going to Kanyakumari via Nagercoil, lost two of its members — Anjali and Angilia.\n\nIn the impact, some passengers thrown out through the broken windows were crushed under the bus.\n\nThe bodies retrieved from the accident site were in a highly mutilated condition.\n\nEven as the injured were being rescued, District Collector M. Karunakaran, Deputy Inspector General of Police, Tirunelveli Range, T.S. Anbu and Superintendent of Police V. Vikraman arrived at the spot to expedite rescue operations.\n\n“The exhausted and sleepy bus driver, who lost control over the speeding vehicle, is the reason behind the mishap as per preliminary investigations,” Mr. Karunakaran said.\n\nV.R. Vinoth, Additional District Magistrate from Thiruvananthapuram and Deputy Superintendent of Police Suresh Kumar from Neyyaatrinkara reached the KGMCH with two ambulances and two medical teams to assist the victims.\n\nThe bodies were handed over to the relatives in the afternoon after the post-mortem.\n\n(With inputs from R. Arivanantham in Nagercoil)", 
    "section": "national", 
    "title": "Nine killed as speeding bus overturns", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}