{
    "author": [
        "S Prasad"
    ], 
    "text": "Commence relay fast demanding disbursal of salaries pending for the last six months\n\nThe forthcoming Pongal festival could be anything but sweet for workers and staff of the Puducherry Cooperative Sugar Mill at Lingareddypalayam this year as the government has not disbursed salaries to them for the last six months.\n\nIrked by the unresponsive attitude of the government, the Joint Action Committee of trade unions of the Puducherry Cooperative Sugar Mills resorted to a relay fast in front of the Swadeshi Mills to press for their demands.\n\n“The delay on the part of the mill management in disbursement of salaries since July last year has left the workers in the lurch. The management has also defaulted to credit the amount debited from salaries of the workers towards Employees Provident Fund (EFP), LIC and settlement of dues to banks and cooperative societies,” E. Sivanandham, secretary of Joint Action Committee of trade unions told The Hindu .\n\nIn spite of repeated representations the Puducherry Government has not paid remuneration to the employees since July. Nearly Rs. 22 crore remains unpaid towards payment of EPF (August 2012 to June 2015), salary and other statutory liabilities on the part of the management, he said. A section of employees alleged that a three-member committed appointed by the government in 2012 to manage the affairs of the mill resulted in maladministration and irregularities. The mill is now struggling with a huge financial crunch and workers are severely affected due to non-payment of benefits by the mill management.\n\nS. Senthil Kumar, president of the Lingareddypalayam Sugarcane Farmers Association said that the crushing season which should have normally commenced in November had not yet started as farmers had also been left high and dry due to delay in payment of dues to them.\n\nThe mill management is yet to make payment to the tune of Rs.15 crore to farmers who had supplied cane for the crushing season during 2013-14 and 2014-15. Many farmers are not able to avail themselves of fresh crop loans as the management has not paid interest to the banks concerned, he said. More than 18,000 farmers are now left in the lurch with the government dragging its feet in convening the tri-partite meeting to fix the State Advisory Price for the crushing season of 2015-16.", 
    "section": "national", 
    "title": "Nothing sweet for sugar mill workers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}