{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "For the people of Alanganallur, Palamedu and Avaniyapuram, the three places renowned for jallikattu in Madurai district, the Centre’s notification on Friday enabling the conduct of the sport came like a happy ending.\n\n“The first question in the village every morning was whether a decision would be announced today,” said P. Karthigai Rajan, organising committee’s secretary.\n\nThe shopkeepers in Palamedu had in fact announced a strike on Friday demanding the removal of the ban. However, as the news came out in the morning about the Centre’s notification, the downed shutters were opened and jallikattu enthusiasts erupted in joy.\n\nCrackers were burst near the vadi vasal (entry point from where the bulls are let out in the arena) in Alanganallur and Palamedu by youngsters and members of organising committees and songs praising jallikattu were played.\n\nThe villagers were dismissive of the possibility that the Animal Welfare Board or activists could obtain a stay from the Supreme Court on the Centre’s notification. “If the government had gone to the extent of issuing notification, I am sure they will find a way to stop the AWBI,” said R. Govindarajan from Alanganallur.\n\nAlthough the BJP appeared to have gained mileage with the notification, many from Alanganallur and Palamedu, however, said that it will not influence their choice during the elections. “Every party voiced its support but the BJP was able to do it as it is in power and also because this is an election year. We are thankful for that but in elections other issues do matter,” said P.K. Bose from Palamedu.\n\nOn the other hand, some were vociferous in their support for the BJP, particularly for Union Minister Pon. Radhakrishnan.\n\n“It was his continuous assurance that gave us hope and he has now persuaded the Central government. I would not think twice to vote for the person he points,” said S. Sujatha from Alanganallur.\n\n\"We are thankful to the BJP, but it will not influence our voting choice during elections\"", 
    "section": "national", 
    "title": "Notification brings joy in Madurai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}