{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Recover valuables stolen from Chennai-based senior citizen\n\nA 51-year-old person, who impersonated as a police officer attached to the Vigilance Department and allegedly robbed a Chennai- based senior citizen’s money and valuables two months ago, has been arrested by Orleanpet Police.\n\nThe accused, has been identified as Saamu alias Samsudhin (51) of Tiruvannamalai district. The police also recovered jewels worth Rs. 1.5 lakh. The accused also allegedly involved in a few thefts and chain snatchings in Tiruvannamalai and Tiruchi.\n\nBagavathiyappan (60) of Avadi, was returning after visiting a friend’s family in Puducherry on November 4 last year. According to the complainant, when he was about to board the bus bound for Chennai at Puducherry Bus Stand, a middle-aged person posing as a plainclothes police officer attached to Vigilance Department directed him to appear for an interrogation.\n\nFinding that the victim had a number of debit cards in his purse, the accused with intention of cheating, took him around the city in an auto. He robbed the money that the victim had in his bank account by forcing him to withdraw money from three ATMs using the debit cards totalling Rs.1.28 lakh and part with gold chain and rings as well.\n\nFollowing a complaint from Bagavathiyappan, Orleanpet Police registered the case against unknown accused for the offences under Sections 419- (Punishment for cheating by personation), 420- (Cheating and dishonestly inducing delivery of the property).\n\nK.L. Viravallabane, Circle Inspector said, “We constituted a special team to nab the accused. After examining available CCTV footage, we mounted a surveillance focused on a hunch that the accused would again try his luck on unsuspecting victims at the bus stand. Our hunch proved right and the accused was nabbed at the bus stand.”\n\nHe was remanded to judicial custody in the evening. The police said the cash would be recovered after taking the accused into custody for interrogation.", 
    "section": "national", 
    "title": "Orleanpet police nab impersonator at bus stand", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}