{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Pattali Makkal Katchi (PMK) is placed well ahead in the race for providing an alternative to the Dravidian parties “which have been ruining the State for half a century”, according to party’s chief ministerial candidate Anbumani Ramadoss.\n\nTalking to reporters after meeting leaders of fishermen associations here on Friday, he said that the PMK, which enjoyed the support of the younger generation, was confident of winning at least 150 seats on its own.\n\nBarring the All India Anna Dravida Munnetra Kazhagam (AIADMK) and DMK, all other political parties in the State, including the Desiya Murpokku Dravida Kazhagam, were welcome to join the PMK-led alliance after accepting him as the chief ministerial candidate, he said.\n\nHe said that the AIADMK, which was facing a strong anti-incumbency wave, and the DMK, which was on the decline since the 2006 Assembly elections, were desperately looking for allies while other parties were busy in bargaining.\n\n“We are confident of making an impressive show in the elections as we enjoyed the confidence of the people, who are fed up with the two Dravidian parties and aspire for change,” Mr. Anbumani said.\n\nNow the PMK had chances of winning 100 Assembly seats and after three months it could comfortably win 150 seats, he said.\n\nAnswering a question, he said that there was no need for the PMK to hold talks with other political parties for forming an alliance.\n\nHe had been in the field for the past one year and the mood of the people was clearly in favour of the PMK, Mr. Anbumani said.\n\nChief Minister Jayalalithaa who had once said that she could see no enemy in the battlefield was looking for allies, and the DMK was ‘sponsoring’ pre-poll surveys to project itself as a strong contender, he added.", 
    "section": "national", 
    "title": "“Pattali Makkal Katchi will win at least 150 seats on its own”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}