{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Chief ministerial candidate of the Pattali Makkal Katchi (PMK) Anbumani Ramadoss has entered into an “agreement” with leaders of fishermen associations, assuring them that the party would find a lasting solution to the ‘fishermen issue’ within two years, if voted to power in the coming Assembly elections.\n\nTalking to reporters after holding a consultation meeting with leaders of fishermen associations and representatives of the fishing community here on Friday, he said that the party, if voted to power, would put an end to arrests of fishermen by Sri Lankan Navy.\n\nHe said that the PMK had already made promises in its draft election manifesto to protect the interests of the fishing community.\n\nMore than 800 fishermen were shot dead by the Lankan navy or died while fishing on the high seas in the last three decades, but the Central and State governments failed to find a permanent solution to the issue, Mr. Anbumani also said.\n\nCountries such as Malaysia, Indonesia and Australia had signed pacts to share the sea for fishing under historical fishing rights, he said, adding India and Sri Lanka should sign an agreement to avert the problems arising out of fishermen crossing International Maritime Boundary Line (IMBL).\n\nThe PMK would exert pressure on the Centre to retrieve Katchatheevu and form a separate ministry for fishing, if voted to power, he said. As a Member of Parliament he had taken up the issue with Prime Minister Narendra Modi and External Affairs Minister Sushma Swaraj, but more concerted efforts were needed, he noted.\n\n“The promises are not empty rhetoric,” Mr. Anbumani asserted, adding he would step down from Chief Ministership if he failed to fulfil the promises within two years. Taking a dig at Chief Minister Jayalalithaa for remaining silent after writing letters to the Prime Minister whenever the Lankan navy arrested the fishermen, he said that the Centre would act only if the State government exerted pressure on it.\n\nParty president G.K. Mani and fishermen association leaders U. Arulanandham and N.J. Bose were also present.", 
    "section": "national", 
    "title": "“PMK will find lasting solution to fishermen issue, if voted to power”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}