{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Collector M.Karunakaran inaugurating Pongal special sale at Co-optex showroom in Tirunelveli on Friday; (right) Collector Sajjansingh R. Chavan inaugurating the sale at the Co-optex showroom in Nagercoil.\n\nCollector M. Karunakaran inaugurated the ‘Pongal special discount sale’ of Co-optex on Friday.\n\nSpeaking on the occasion, Dr. Karunakaran said Co-optex products were sold through seven showrooms in the district. He informed that 40 per cent discount was being given for soft silk and wedding silk saris.\n\nThe organic saris, cotton saris, Jayakarthika cotton saris, bed sheets, churidhar and readymade shirts of Co-optex would attract the younger generation.\n\nThe Collector said interest-free loans were being given by the Co-Optex to employees of government and aided schools and colleges and transport corporation employees.\n\nRegional Manager of Co-optex N. Karthikeyan and manager of Gandhiamthi Co-optex showroom S. Vaithilingam were present.\n\nNagercoil\n\nCooptex has fixed Rs. 6.80 crore sales target for the Pongal special discount sale for Tirunelveli region, said Collector Sajjansingh R. Chavan.\n\nHe inaugurated the special sale for Pongal here on Friday at the Kumari Cooptex in Meenakshipuram. Mr. Chavan said that the region had achieved a sale of Rs. 5.58 crore during 2015 Pongal festival season.\n\nThe four showrooms in Kanyakumari alone achieved a sale of Rs. 1.82 crore during last year and the target for the Pongal season has been fixed at Rs. 2.23 crore.\n\nThe Pongal sales target fixed for Kumari Cooptex for the current season was Rs. 1.20 crore as against Rs. 98.52-lakh sales achieved during last year Pongal season.\n\nThe Thangamazhai Thittam and prize coupon scheme for purchases over Rs. 2000 during Pongal and Deepavali were available this year also.\n\nCollector Sajjansingh R. Chavan inaugurated the first sale in the presence of Co-optex Executive Committee Member M. Maria Anthony. Co-optex Tirunelveli Regional Manager N. Karthikeyan Nair was present.", 
    "section": "national", 
    "title": "‘Pongal special discount sale’ commences", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}