{
    "author": [
        "M K"
    ], 
    "text": "The lifting of the ban will encourage farmers to raise the native breed. —Photo: R. VIMAL KUMAR\n\nMinutes after the Union government lifted the ban on jallikattu and the ‘rekla race’, the price of Kangayam bulls, aged between three to four years, shot up to Rs. 50,000. It was just Rs. 16,000 till Thursday.\n\nS. Jayaprakash (39) of Pollachi who organises such races said the price is expected to reach Rs. 1 lakh soon.\n\nCelebrating the direction from the Union Government, organisers of the race plunged into celebration here on Friday.\n\nAbout 100 members of Tamil Nadu Rekla Club took the bulls out in a procession from Kinathukadavu, near Pollachi, to Mulanur (in Tirupur district), which is said to be the biggest market for such bulls and calves.\n\n“The State and Union governments have given a new lease of life for the breeds, which were on the verge of extinction,” R.S. Thirumugam the organising chairman of the club told The Hindu .\n\nSweets were distributed and fireworks burst as the procession passed through Pollachi, Udumalpet and Dharapuram.\n\nThe lifting of the ban will encourage farmers to breed bulls, says A. Kalimuthurajan of the Tamil Nadu Rekla Club. The price of prize-wining bulls is also likely to go up. A bull may fetch up to Rs. 2.50 lakh.\n\nDuring the ban period, farmers were on the verge of selling their animals to slaughterhouses as their maintenance was becoming difficult. Ponnapuram, Kinathukadavu, Vellalore, Thondamuthur and Dharapuram ‘rekla races’ are among the most famous ones in the region. Bulls with four or fewer teeth and attached to carts run for 200 metres, the older ones with more than four teeth run for 300 metres. The first race is expected to be conducted at Kinathukadavu early next week.\n\nS. Prabakaran of Arthanaripalayam near Pollachi said that more than 300 pairs of bulls took part in the race before it was banned. Bulls from Palakkad, Dharapuram, Erode, Karur, Dindigul, Palladam, Udumalpet and Gudimangalam and Tirupur regularly participated in races organsied at Pollachi.\n\nThe organisers said they would ensure the animals suffered no torture and would impose lifetime ban on persons found guilty.\n\nPrice of bulls aged between three to four years shot up from Rs. 16,000 to Rs. 50,000", 
    "section": "national", 
    "title": "Price of Kangayam bulls goes up three-fold after revocation of ban", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}