{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Property show under way in the city\n\nG. Ravindranath (left), General Manager, State Bank of India, Chennai, takes a look at a model at the Fairpro property exhibition in Tiruchi on Friday.— PHOTO: B. VELANKANNI RAJ\n\nWith the city in the reckoning for the Smart City project and the expected development of infrastructure, realtors in the city are hoping for a turnaround in the housing market in the coming months.\n\nMembers of the Tiruchi chapter of Confederation of Real Estate Developers (CREDAI) say that the market is showing definite signs of revival and demand is picking up. Tiruchi is all set to become a Smart City and it is one of the major investment destinations among the tier II cities in the state now, observed B. Senthil Kumar, president, CREDAI, Tiruchi.\n\nSeeking to give a push to the market, CREDAI has got up its property show, Fairpro 2016, in the city. About 28 leading flat promoters and builders have showcased over 100 projects at the expo. On offer is a range of choices for prospective buyers, including ready-to-occupy apartments and individual villas, in the range of Rs.10 lakhs to Rs.1 crore. “About 150 units were booked during the expo last year. This year, we hope the figure will double as the market situation has improved,” said M.Noor Mohamed, chairman, Fairpro 2016.\n\nBuilders said Tiruchi market had largely been free from speculation and prices had been stable. “After the floods in Chennai, many people are now seeking to purchase properties here,” said T.V.Murali, former president, CREDAI, Tiruchi.\n\nHousing finance companies also agree that Tiruchi had largely been stable market in terms of price. “The market has been largely steady. We are now seeing many builders from Chennai coming up with projects in Tiruchi,” said N.Balu, Deputy Regional Manager, LIC Housing Finance Ltd.\n\nThe expo will be open from at Hotel Sangam till Sunday.", 
    "section": "national", 
    "title": "Realtors expect a turnaround", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}