{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Filmmaker Suresh Krissna and actor Rajesh, both of whom have worked closely with filmmaker K. Balachander for several years, wowed film buffs at Woodlands theatre, with interesting anecdotes that reiterated K. Balachander’s legendary status.\n\nModerated by Shylaja Chetlur of Cinema Rendezvous, a well-known film club in the city,\n\nSuresh Krissna and Rajesh spoke on a number of topics: on how KB would instruct his actors, how he handled stars such as Kamal Haasan and Rajinikanth, his speciality, on how he made his first Hindi film and so on.\n\nSpeaking about spending 9 years as Balachander’s assistant, filmmaker Suresh Krissna extensively recollected how the famed filmmaker won over the sceptics in Mumbai while making his first Hindi film, Ek Duuje Ke Liye .\n\n“The way he approached the Hindi remake was itself different. The most remarkable thing was that its producer, L.V. Prasad, requested KB not to include the scene where the female protagonist gets raped. After watching the entire film, the producer realised that the emotion invoked by the rape of the protagonist was missing, KB asked him not to worry.\n\nIn a sheer touch of genius, he managed to convey the same on the editing table,” he said.\n\nAnd he added that another legendary filmmaker Manmohan Desai got up and applauded.\n\nTalking about how he handled stars, Suresh said that he never directed them the moment they became stars.\n\n“Rajini became a star after Thillu Mullu and Kamal Haasan became a star after Punnagai Mannan. He was very clear with that,” he said.\n\nAnswering a question about how it was possible for him to create progressive female characters, actor Rajesh said that it was a logical outcome of his belief that art must carry a social message.\n\n“He was highly social conscious and believed that his movies should propagate a progressive message,” he said.\n\nK. Balachander wanted his films to propagate a progressive message", 
    "section": "national", 
    "title": "Remembering a legend", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}