{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Water from Barur Lake will irrigate cultivable areas in seven panchayats\n\nKrishnagiri Reservoir and Barur Lake were opened for irrigation on Friday.\n\nA watershed area of 9,012 acres spread across 16 panchayats will come under irrigation for 110-day period from the water released from the right and the left sluices of Krishnagiri Reservoir. A total of 155 cusecs is being released, with 80 cusecs from the left sluice and 75 cusecs from the right sluice here.\n\nIn Krishnagiri, cultivable areas in Periyamuthur, Sundekuppam, Thimmapuram, Souttahalli, Thallihalli, Kalvehalli, Gundalpatty, Mittahalli, Errahalli, Penneswaramadam, Kaveripattinam, Balekulli, Maarichettyhalli, Nagojanahalli, Janaparahalli, and Payyur panchayats will be irrigated.\n\nSimilarly, about 1583.75 acres will be brought under irrigation for a 210-day period from the water released through the eastern sluice of Barur Lake; and 812.91 acres will be brought under irrigation from the water released through the western sluice of the lake. Water from the lake will irrigate cultivable areas in seven panchayats of Barur, Arasampatty, Pendarahalli, Keezhkuppam, Kottapatty, Jingalkadhirampatty, and Thadampatty.\n\nUnder the Krishnagiri Reservoir Project, the watershed area in the district is catered to by two main canals and 26 lakes here. The 52-feet KRP Dam holds a carrying capacity of 1666.30.\n\nEarlier, Collector T.P. Rajesh, and Minister for Higher Education Palaniappan flagged off the opening of the reservoir.\n\nSpecial Correspondent adds from Salem: Water was released from Kariakoyil and Aanaimaduvu dams in Pethanayakkanpalayam union on Friday for farm activities on more than 11,000 acres in the canal irrigation system in the blocks of Pethanayakkanpalayam and Vazhapadi.\n\nThe release of water from Aanaimaduvu dam into River Vasishtanadhi initially, instead of the canal, was marked by protest by a group of farmers. Edappadi K. Palanisamy, Minister for State Highways and Minor Ports, opened the shutters to release the water in Kariakoyil dam, in the presence of District Collector V. Sampath and other officials.\n\nThe water has been released from both the dams following persistent demand from the farming community.\n\nAbout 108 cusecs will be released from the Kariyakoyil dam situated in Pappanayakkanpatti village into River Vasishtanadhi for the initial ten days and another 40 cusecs into the canal for about a month for special wetting. This is expected to improve the groundwater table and also the water level in the open farm wells and bore wells to a big extent.\n\nThe water will pave the way for farm activities on 5,716 acres in the villages of Pappanayakkanpatti; Thumbal; Idaiyapatti; Kumarapalayam; Kottavadi; Yethapur; Kalleripatti; Padaiyachiyur; Abinavam; Puthiragoundanpalayam; and Pethanayakanpalayam in turn system. Amidst protest from a group of farmers, water was released from the Aanaimaduvu dam in Puzhuthikuttai village for special wetting. About 90 cusecs will be let out into River Vasishtanadhi for 11 days and another 60 cusecs into the canal for 18 more days, PWD sources said.\n\nThe release of water will help farm activities on 5,528 acres in Puzhuthikuttai; Kurichi; Sinnammanayakkanpalayam; Kolathukombai; Chandrapillaivalasu; Belur; Athanoorpadi; Kottavadi villages in turn system, an official release said. S. Satheesh Kumar, chairman, Salem District Panchayat, M. Chinnaraj, Superintending Engineer, and R. Periasamy, Executive Engineer, Public Works Department, were present on the occasion.\n\nThe agitation once again brought to light the difference of opining on sharing the water of Aanaimaduvu dam between the old ayacutdars and new ayacutdars. On receiving information, the police, revenue and PWD officials rushed to the spot and pacified the villagers. The PWD officials explained to them that as per the riparian rights, preference had to be given initially for the release of water in the river.", 
    "section": "national", 
    "title": "Reservoir, lake opened for irrigation", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}