{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Stating that samples of sago taken by the Food Safety officials had confirmed to the standards by the regional laboratory, members of Salem Sago and Starch Merchants’ Association demanded that the seized products worth Rs. 60 lakh should be immediately returned to merchants.\n\nAddressing media persons here on Friday, association president Tarachand Surana and secretary Vikas Sabu said that the Food Safety and Drug Administration Department had seized over 1,200 bags of sago from six merchants six months ago. The Government Food Laboratory in Udayapatti in the city had found the samples conferring to the standards. But the samples were again sent to Central Food Laboratory in Kolkata that declared it as unsafe.\n\n“The lab in Kolkata has the facility to screen only palm sago and not the sago made from tapioca,” they added. They wanted the laboratory in Salem Starch and Sago Manufacturers Service Industrial Cooperative Society Limited (Sagoserve) to be accredited so that samples could be tested here.\n\nThe members said that they met Commissioner of Food Safety, Kumar Jayant, and presented their case who later passed an order dated October 16, 2015. The order said that if the samples taken from the seized quantity conferred to the standards, the seized quantity should be returned to the merchants within five days from the receipt of the report. “But, it is more than six months that the products were not returned to the merchants. The market price of the products during the seizure was Rs. 60 lakh and now it has dropped to Rs. 30 lakh.”\n\nWhen contacted, District Designated Officer T. Anuradha told The Hindu that as per rule 2.4.3 of Food Safety and Standards Rules, 2011, one sample could be sent to referral lab which in this case had declared the product as unsafe.", 
    "section": "national", 
    "title": "Sago merchants demand return of seized goods", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}