{
    "author": [
        "T Madhavan", 
        "K Lakshmi"
    ], 
    "text": "Nanganallur P.0. is now part of a core banking solutions network; teething problems persist\n\nSenior citizens find it difficult to walk up to the first floor, where the post office is located —Photo: G. Krishnaswamy\n\nThe Nanganallur post office was recently made a part of a core banking solutions (CBS) network. But, going by what account holders have to say, there are still teething problems to overcome.\n\nCustomers complain they have to endure delay in transactions, caused by problems of connectivity.\n\nAnother problem has to do with the location of the new post office – it is on the first floor of the building.\n\nK.R. Krishnan, president of Senior Citizens Forum, Nanganallur, said, “Nanganallur post office became part of the core banking system on January 1 and many account holders are not aware of this. Even though it is a welcome measure, many issues remain.”\n\nIncrease in\n\naccount holders\n\nV. Rama Rao, secretary, All India BSNL Pensioners Welfare Association, said the number of accounts had increased to 60,000 and staff members were unable to do additional work. This had added to the woes of senior citizens who were already finding it tough to access the post office on the first floor.\n\nThe Postal Department has networked 521 post offices into the CBS facility, which will allow customers to carry out transactions in any of the post offices.\n\nJ. Srivenkatesh, former circle president of National Federation of Postal Employees (Group-C), said: “There has been much improvement in the service. Post offices that are newly networked will have problems for a few months. The department must also replace computer peripherals.”\n\nOfficials of the Postal Department said 16 more post offices, including Anakaputhur, Chitlapakkam, Kelambakkam, Puzhal, Avadi, Minjur, Tiruvottiyur, Mangadu and Porur would soon be networked with CBS facility this month.\n\n“We are attending to the issues that arise during the initial stage of networking and people will soon be able to enjoy facilities on the lines of banking operations once all post offices are covered under CBS,” said an official.\n\nCustomers complained of transaction delays caused by connectivity issues", 
    "section": "national", 
    "title": "Tech upgrade at post office in suburbs", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}