{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Anjaneya Swamy Temple, Kallukuzhi : Sri Hanuman Jayanthi, special abishekam, aradhanai,5.30 a.m.; 1,00,008 vada and 1,00,008 jangiri malai sattruthal, 7 a.m.; eka dina laksharchanai, 9 a.m.; thiruveedhi ula, 9 p.m.\n\nSri Sanjeeevana Anjaneyar Trust, Srirangam : Sri Hanuman Jayanthi, pal kudam procession, South Chithrai Street, Srirangam, 6 a.m.; 108 kalasa pooja, thirumanjanam, 7 a.m.; jangiri/vadai malai sattruthal, Raja alangaram, 2 p.m.; discourse by N.Vijayasundari, 7 p.m.\n\nOrganising Committee : Sri Radha Madhava vivaha vaibhavam, thodayamangalam, ashtapathi, Ramji Mahal, Woraiyur, 1 p.m.; Divya nama sangeerthanam, dolothsavam, 9 p.m.\n\nChinmaya Mission: Sri Hanuman Jayanthi, Ganapathy homam, Chinmaya Vidyalaya campus, Srirangam, 6 a.m.; Hanuman Chalisa homam, 8 a.m.; special abishekam and alangaram, 11.30 a.m.\n\nSri Andavan Ashram, Srirangam : Discourse on Thirupaavai by Sri Aravamudachariar, Sri Vedanta Desikan Sannidhi, North Chithra Street, Srirangam, 7 a.m.\n\nSri Ramanuja Siddandha Sabha : Discourse on Thirupaavai by Andal Rajan, Sri Kamalavalli Nachiar Temple, Woraiyur, 6.45 p.m.\n\nSri Bashyakarar Kainkarya Sabha and Thirumala Thirupathi Devasthanam : Discourse on Thirupaavai by Sri Rama Badrachariar, Sri Venkatachalapathi Temple, BHEL Township, 6.30 p.m.\n\nSri Ananthakrishna Varatharaja Perumal Temple, Angarai : Dhanur masa bhajans, 5.30 a.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Veera Sanjeevi Anjaneyar Sannidhi, West Gate, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam: Sri Hanumath Jayanthi mahotsavam, thirumanjanam, Sri Ashta Siddhi Vinayagar Temple, Ayyappa Nagar, 4 p.m.; Sahasranama archanai,5.30 p.m.; veedhi ula, 6.30 p.m.\n\nCULTURE\n\nRasavelar Shenbaga Tamil Arangu : Special address by A.Gopinath,102, Gandhi Salai, Srirangam, 6 p.m.\n\nGENERAL\n\nBharathidasan University : Inauguration of Career and Counselling Cell and job fair, V.M.Muthukumar, Vice Chancellor, inaugurates, P.Manoharan, Additional General Manager (Logistics), BHEL, Tiruchi, speaks, Khajamalai campus, 10.30 a.m.; Department of Commerce and Financial Studies and SMART Journal of Business Management Studies: Seminar on Financial Markets – issues and challenges, release of SMART journal and presentation of SMART Journal Awards, C.Thiruchelvam, Registrar, inaugurates, university campus, 9.30 a.m.\n\nSt.Joseph’s College : Graduation Day of arts and commerce graduates, K.Sekar, Director of Collegiate Education, delivers the graduation day address, 10 a.m.; Graduation day of science graduates, S.Manian, Vice Chancellor, Annamalai University, delivers the graduation day address, 3 p.m.; Seminar on social concerns in Indian Literature translated into English, P.Sivakami, writer and social activist, speaks, 9.30 a.m.\n\nTiruchi Engineering College, Surya Engineering College and Lions Club of Srirangam : ‘Ninaivu nijamagum,’- career guidance programme for Plus Two students, Tiruchi Engineering College campus, Konalai, 9 a.m.\n\nConfederation of Real Estate Developers Associations of India : Fairpro 2016 – property show, Hotel Sangam, 10 a.m. to 8 p.m.\n\nHoly Cross College Department of Chemistry: Chem Expo, 9 a.m.\n\nAnti-Corruption Movement : Awareness programme, K.M.Subramanian, presides, Hotel Raja Gardens, 5 p.m.\n\nM.A.M. College of Engineering and Technology and Chidambaram Pillai College for Women: Rural development programme on entrepreneurship and employability skills, A.Loganathan, presides, Chidambaram Pillai College for Women campus, Manachanallur, 9.30 a.m.\n\nShrimathi Indira Gandhi College : Programme on Tamil tradition and medicinal properties of turmeric, 2 p.m.\n\nJamal Mohamed College : Lecture on Sweeping through interviews by B.Balamurugan, assistant professor, H.H.The Rajah’s College, 11 a.m.\n\nThillai Nagar Sakthi Sangam: Sakthi Dina vizha, R.P.Rajeswari, vice principal, MIET Arts and Science College, chief guest, Hotel Mayas, 5.30 p.m.\n\nM.A.M.College of Engineering : Faculty development programme on pre fabricated structures, 9.30 a.m.\n\nBishop Heber College and We Trust : Awareness programme on mushroom cultivation, Mariamman Temple, Mudukupatti, 4 p.m.\n\nSRV Matriculation Higher Secondary School, Samayapuram : Vistas – 10{+t}{+h}annual day, R.Balakrishnan, Additional Chief Secretary, Odisha, and Sivakumar, actor, speak, 9 a.m.\n\nDistrict Administration : Distribution of monsoon sustenance assistance to potters, T.P.Poonachi, Minister for Khadi and Village Industries, chief guest, Collector’s Office, 10.15 a.m.; opening of new bus shelter, near Government Hospital, 10.30 a.m.; inauguration of special camp for changes in ration cards, R.C.Higher Secondary School, 10.45 a.m.\n\nAll India BSNL Officers Association : District conference and seminar on BSNL on Revival Path, V.Raju, Principal General Manager, BSNL, Tiruchi, and M.S.Radha Krishnan, Circle Secretary, AIBSNLOA, speak, office of the Principal General Manager, 10 a.m.\n\nJamal Mohamed College Department of Information Technology : Inter-collegiate technical symposium, A.Vadivel, Head, Department of Computer Applications, National Institute of Technology, inaugurates, 9.30 a.m.\n\nDepartment of Information and Public Relations : Government exhibition, St.John’s Vestry Anglo Indian Higher Secondary School grounds,\n\n4 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}