{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Tamil Nadu Open University has become eligible to apply for Central government research grants following its inclusion under Section 12 (B) of the University Grants Commission (UGC) Act. The institution is the fifth among open universities in the country to receive the status. Already Bhopal, Nashik, Kota and Hyderabad open universities have the 12B status.\n\nThe UGC has advised the TNOU to apply to the National Assessment and Accreditation Council for accreditation. TNOU Vice-Chancellor Chandrakantha Jeyabalan told journalists here on Thursday that the university had fulfilled all the criteria, including the required infrastructure.\n\nAs part of the UGC’s mandate, the university had set up centres in Chennai, Madurai, Dharmapuri and Coimbatore. A five-acre site had been identified in Madurai to set up a community college. The university had written to Collectors of Chennai, Madurai, Dharmapuri and Coimbatore to identify suitable plots for establishing the centres.\n\nThe 13-year-old university is now awaiting inspection by the National Council for Teacher Education to enable it launch UG and PG courses in education. With the council’s approval the university proposes to launch full-time B.Ed and M.Ed courses, which are expected to draw around 1,500 students.\n\nCourses such as B.Sc Ed and BA Ed, which students can join after Class XII, will also be introduced.\n\nA course for special educators with 250 seats is proposed to be launched with the approval of Rehabilitation Council of India.\n\nThe university is now eligible to conduct special assistance programmes, introduce new faculty position for five years and receive grants to build facilities such as research lab, auditorium, library, network facilities, women’s hostel and guest house.\n\nThe university now eligible to start more courses", 
    "section": "national", 
    "title": "TNOU eligible to apply for Central research grants", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}