{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In view of Sri Jagannath Rath Yatra, and State Government’s job fair\n\nFor the two major events to be held in the city on Saturday and Sunday , the city police have announced temporary traffic diversions.\n\nJanuary 9\n\nIn view of Sri Jagannath Rath Yatra organised by ISKCON on Saturday (January 9), the following traffic diversions will be in effect from 1 p.m. to 8 p.m.: Vehicles entering the city from Palakkad and Pollachi Roads should take the road over bridge on the Ukkadam-Sungam bypass road.\n\nAll vehicles from Avinashi Road flyover and Lanka Corner towards Palakkad Road should go via Big Bazaar Street, Vincent Road and pass through Ukkadam. Buses can take the Town Hall road to reach Ukkadam as usual, but not Vysial Street or Oppanakara Street. All vehicles from Avinashi Road Flyover to Thadagam Road and Mettupalayam Road should take Sukrawarpet to reach Gandhipark and Flower Market.\n\nVehicles from Thadagam Road to Palakkad and Pollachi should take Ponnaiahrajapuram, Chokkampudur, Ramamoorthi Road, Sivalaya Theatre and Perur Bypass Road to reach Ukkadam. Vehicles from Perur to the city should take the Perur Bypass Road, Ukkadam, Sivalaya Theatre, Ramamoorthi Road, Chokkampudur, Ponnaiya Rajapuram and Gandhipark before heading to their destinations.\n\nJanuary 10\n\nOn January 10, the following diversions will be in effect due to the job fair organised by the State Government at Sri Krishna Engineering College. All buses from Ukkadam to Palakkad should take Athupalam, Kurichi, Sundarapuram, Madukkarai Market Road and the Eachanari bypass to reach Palakkad Road. Buses from Palakkad can reach Ukkadam through Kovaipudur and Athupalam.\n\nAll buses from Athupalam that are heading to the job mela venue should stop at the college. The vehicles should be parked at Sri Krishna Arts College at Sugunapuram. These buses should have a pass. Residents from areas opposite the college should take Kulathupalayam, Sundakkamuthur, Rice Mill Road, Vasantham Nagar and Kovaipudur to reach Palakkad Road.\n\nTwo-wheelers and four-wheelers from Sundarapuram Junction to Kovaipudur Junction can take Madukkarai Market Road and Idayarpalayam Pirivu. Heavy motor vehicles will not be permitted to Kovaipudur. Persons coming to the camp in two-wheelers should park the vehicles at VLB School parking lot and four-wheelers should be parked opposite Surya Prabha Mill.\n\nSeven temporary bus terminals have been set up for the candidates to go to the venue. These are at: PSG College of Arts and Science, Government Polytechnic and Coimbatore Institute of Technology on Avinashi Road, ‘A’ Ground at Kovaipudur, R.S.L. Industries Ground on Palakkad Road, Government College of Technology on Thadagam Road and Tamil Nadu Agricultural University on Maruthamalai Road.", 
    "section": "national", 
    "title": "Traffic diversions in city on Saturday and Sunday", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}