{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Presenting a wish list for promoting the aviation and travel industry in the city to the Union Civil Aviation Minister here on Friday, travel industry representatives and stakeholders made a fervent pitch for expanding the runway of the Tiruchi International Airport and inclusion of the city under the Bilateral Air Service Agreements (BASA) to pave the way for operation of flights for more international destinations from here.\n\nIn a candid interaction with the Union Minister P. Ashok Gajapathi Raju, members of the Tiruchi Travel Federation (TTF) pointed out that Tiruchi had missed out much on development over the years and it was time more attention was bestowed on it.\n\n“We have missed out a lot of opportunities in the past. We are now hopeful that the Minister’s visit will address our concerns,” said V. Vasudevan, president, TTF, setting the tone of the meeting. Emphasising the need for improving domestic connectivity, especially to Chennai, he said the present services were not adequate and poorly scheduled. “We expect the national carrier to provide better connectivity to Chennai with morning and evening flights,” he said.\n\nMaking a presentation on “Opportunities for Growth” S.A. Mubashir, joint secretary, TTF, detailed the impediments hampering growth and pointed out that the non-inclusion of the city in BASA has prevented many carriers from the West Asia from operating to Tiruchi and stunted business growth.\n\nAbout 510 acres of land was required for the expansion of the airport, he said.\n\nCreation of domestic cargo terminal, introduction of electronic data interface for Customs, plant quarantine clearance for cargo on weekends, business class lounge, and other amenities at the airport were among the requirements.\n\nThe high percentage of value added tax made air turbine fuel very high at the airport, he said.\n\nHe suggested that a chapter of the Indian Institute of Tourism and Travel Management be set up here to produce qualified manpower for the tourism and hospitality industry.The demand was supported by Pon Ilango, Director (technical), Jenney’s Academy of Hotel Management and K.Pandian, Chairman, Indian Association of Tour Operators, Tamil Nadu, Andaman and Nicobar and Puducherry Chapter.\n\nMr. Pandian said there was a severe shortage of trained guides, especially those speaking foreign languages. He sought exemption from service tax for the travel industry.\n\nReferring to medical tourism, Dr. M.S. Ashraf pointed out that major surgeries such as organ transplants were performed by hospitals at affordable costs attracting many patients from neighbouring countries. He suggested the introduction of air ambulance service by the national carrier. If connectivity was improved it would help boost medical tourism in the city, he said. K. Meena, former Vice-Chancellor, Bharathidasan University, and M.A. Maluk Mohamed, correspondent, M.A.M. College of Engineering and Technology, spoke.", 
    "section": "national", 
    "title": "Travel industry pleads for runway expansion, BASA", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}