{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Judiciary is independent of politics, caste and religion, says High Court judge\n\nJustice S. Tamilvanan, judge, Madras High Court, coming out after inaugurating the judicial officers quarters in Vellore on Friday.— Photo: C. Venkatachalapathy\n\nThe Judiciary should act independently, without political, caste and religious bias, said Justice S. Tamilvanan, judge, Madras High Court.\n\nHe was speaking shortly after inaugurating the judicial officers’ quarters at Sathuvachari on Friday.\n\nThe inauguration witnessed a tussle among advocates after B. Annamalai, president of Bar Association, Vellore, in his felicitation, praised Chief Minister Jayalalithaa for providing infrastructure for the Combined Court Building, Vellore and spoke ill of former CM M. Karunanidhi.\n\nAs Mr. Annamalai spoke about CM Jayalalithaa and her achievements, Justice Tamilvanan asked R.V.R. Deenadayalan, Principal District and Sessions Judge, Vellore to stop him. Undeterred, the Bar Association president continued his speech, even as the judge intervened by saying loudly from his seat, “Do not speak politics here.”\n\nMr. Annamalai said he was speaking of history and not politics.\n\nHe went on to criticise Mr. Karunanidhi for constructing a ‘B’ block without ‘A’ block in the complex. Immediately, a number of advocates seated in the audience opposed his speech. One of the senior advocates went on the stage and confronted him in a bid to stop him from going ahead. This led to a heated argument, prompting the judge to leave his seat and take a few steps away. However, he returned to the seat.\n\nLater, in his inaugural speech, Justice Tamilvanan referred to the tussle and stated that courts do not have political colour. “Advocates might have political affiliations but should not speak out of place. It is important to protect the honour of courts,” he said.\n\nCourts are independent of politics, caste and religion, he said, adding, “Courts are a common organisation for the public. People approach courts confident of getting justice. Judges cannot have likes and dislikes and should work for equal protection of law.” He urged advocates to work towards completing cases quickly.\n\nThe quarters for judicial officers has come up at a cost of Rs. 3.18 crores. A total of six quarters have been constructed, of which two quarters would be for the use of Additional District Sessions Judge and Mahila Court Judge. The work commenced in April 2015 and was completed in November 2015. Collector R. Nanthagopal was present on the occasion.", 
    "section": "national", 
    "title": "Tussle mars inauguration function", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}