{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A woman, who was raped as a minor and was advised to go in for mediation with the convicted rapist by a High Court , has finally married the accused and is living with him in an undisclosed location.\n\nThe trial court in Cuddalore has also acquitted the rapist in the case.\n\nLakshmi (name changed) from a remote village in Cuddalore district, who had a six-year old child from him, has married the man convicted of raping her, against her family’s wishes, her brother claimed.\n\n“He had met her while grazing cattle in the village and had somehow convinced her to marry him or at least that’s what we were told. Since December 3, last year we have not seen her. We got a call from the court and they informed us that the couple registered their marriage at a registrar’s office in Cuddalore on December 24,” Lakshmi’s brother D. Parthiban said.\n\nStrangely, after their marriage, the man was living in the same village and the woman and her child were said to be in some other village.\n\n“He has married her only to come out of the case. We are sure he will marry his sister’s daughter who is living next door. Why is he living here alone leaving my sister and niece somewhere,” Parthiban asked.\n\nBoth parties had reported to the Madras High Court that they had reached a compromise and were now married following which the Mahila Court in Cuddalore was directed to verify the authenticity of the marriage claim. After the couple appeared before him, the Mahila court judge, M.Selvam, acquitted the man , after confirming the validity of the marriage certificate, sources in the trial court said.\n\nDespite several attempts by The Hindu , the woman could not be reached for comments.\n\nIt may be recalled that while hearing the rape convict’s plea for bail, a judge of the Madras High Court had suggesting mediation between the rapist and the woman.\n\n( With inputs from\n\nR. Sivaraman in\n\nPuducherry )", 
    "section": "national", 
    "title": "Woman marries rape accused, lives at undisclosed location", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}