{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Thirukameeshwarar- Kohilambigai temple getting ready for Mahakumbabishekam\n\nRenovation works of shrines and gopurams are in full swing at the ancient Thirukameeshwarar- Kohilambigai temple in Villiyanur which is one of the largest and important temples in the Union Territory that had been accorded a special place during the years of French rule.\n\nThe more than 1000-year-old Chola period temple is bracing up for the Mahakumbabishekam celebrations on January 20.\n\nN.Manoharan, Executive Officer of temple told The Hindu that the renovation works commenced in December 2012 at an estimated cost of Rs.11.55 crore.\n\n“We have almost completed the renovation works of main shrines and gopurams and are preparing for the Mahakumbabishekam which is scheduled to be held on January 20.”\n\nSandblasting was done in all parts around the prakarams and pillars and stones washed and scrubbed to restore their original grandeur as much as possible.\n\nThe vimanams and gopurams are being painted in multi-colour for the first time. Even floor stones were shifted to outer prakarams and new granite floor was laid inside. The flag mast which was erected in 1926 has been replaced with a teak version. High roof opening for ventilation has been established at eight places.\n\nThirukameeshwarar- Kohilambigai temple is located in Villiyanur, 11 km away from Puducherry. The town is also known as Villvanam, Vilvanagar, Villinagam, Thirukameeshwaram, Villivecham and Villipakkam in ancient texts and has retained the Villiyanur, which means the town with the tree name Villvam (Bael tree- Botanical name- Aegle mamelos). The temple is located at the heart of the town extending to a size of 4.33 acres encompassing the Thirukameeshwarar and Kohilambigai shrines and with a temple tank.\n\nThis big temple of Puducherry was built in 11th century by king Dharmabala Cholan with size of 368 ft by 502 ft , two temple gopurams on the eastern and southern side on the banks of River Mutharu also known as Sankaraparani.\n\nAccording to Sthala puranam of temple, once the king noticed a cow feeding its milk to the Linga and he constructed the shrine for the Goddess Kohilambihai in that location. Moreover it said that goddess statue was found while digging for the tank.\n\nThe temple’s historical significance is evident in its construction methodology and architectural knowledge system. Intricately carved stone pillars, its proportion, geometry and aesthetics clearly indicate that the temple is a piece of architectural splendour of its own kind in olden times.\n\nDuring the French rule in Pondicherry, the temple was seen as a significant monument. The temple bell was brought from Brox Born Bury in France and was rested on the roof in 1812. The southern gopuram was used as a military observatory during the regimes of Governor Francois Martin and Duplex.\n\nThe temple was renovated in 1880 by the French Governor Linde Francaise and later it was repaired for Kumbabishekam in 1987.", 
    "section": "national", 
    "title": "Work apace at 1000-year-old temple", 
    "subsection": "tamilnadu", 
    "date": "2016-01-09"
}