{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In yet another instance of influx of drugs through the rail route, a special railway police squad seized 22.5 kg of ganja, worth more than Rs. 50 lakh, from an Odisha native who transported it on board the Shalimar-Thiruvananthapuram Express.\n\nThe accused was identified as Anil Kumar Patra, 37, a native of Berhampur in Ganjam district of Odisha. Officials nabbed the accused, a seasoned carrier, during an investigation into the activities of a Visakhapatanam-based drug network.\n\nAccording to officials, the gang is suspected to be actively supplying ganja to peddlers in the State, especially Kochi, through middlemen. The special squad was formed after drug peddlers were found using trains to smuggle in the banned substance in a large quantity.\n\n“The accused had boarded the train from Salem, and since then he was put under surveillance. A five-member squad has been camping in Salem for the last two weeks,” said S. Jayakrishnan, Circle Inspector, Government Railway Police, Ernakulam.\n\nKumar was taken into custody while offloading the consignment at the Ernakulam South station. The narcotic substance was concealed in 21 cartons.\n\nOfficials also seized six mobile phones and several SIM cards from his possession.\n\nOfficials of the Anti-Narcotic Cell of the Kerala Police had received specific information on the operation of similar rackets in States like Andhra Pradesh. The groups are reportedly engaged in trafficking of banned tobacco products, cheap quality ganja and psychotropic drugs to Kerala. The drugs brought in by these gangss enter the State through the rail route, and are distributed mainly among inter-State labourers.\n\n“Racketeers are found to be relying heavily on trains that directly connect the north eastern States with Kerala for transporting huge drug consignments, including ampoules. After disembarking, they exit the stations through the rear exits and back alleys,” a top official said.\n\nThe Ernakulam Rural Police recently launched ‘Operation Shalimar’ to check the growing menace of the Aluva railway station being used as an entry point of drugs to the State. The operation envisages monitoring the movement of migrant workers disembarking at Aluva, especially from weekly trains like Shalimar Express, Guwahati Express and Dhanbad express.\n\nThe contraband, worth more than Rs. 50 lakh, seized from an Odisha native", 
    "section": "national", 
    "title": "22 kg of ganja seized at Ernakulam railway station", 
    "subsection": "general", 
    "date": "2016-03-25"
}