{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Shooting for Pinneyum will begin in Thiruvananthapuram on May 11\n\nEnding an eight-year hiatus, film-maker Adoor Gopalakrishnan is set to shoot for his 12th feature film, Pinneyum , with Dileep and Kavya Madhavan in lead roles.\n\n“It is an intense love story minus the customary song and dance,” he said, refusing to divulge details about the project, the shooting for which is slated to begin in Thiruvananthapuram on May11.\n\nFor Kavya and Dileep, it will be their first project together after five years, the last being Vellaripravinte Changathi released in 2011.\n\nAdoor said he belonged to a breed of filmmakers who took their time to conceive and develop an idea. “After a film is over, I immerse myself so deeply in life’s chores that I forget the process of film-making. So I approach each film feeling like a greenhorn.”\n\nAsked as to why he chose to cast the popular actors, he said his maiden film Swayamvaram had the most popular actors of that time in the lead. He thought he would be able to draw the kind of performance he wanted from the cast. “I have always liked Dileep as an actor but was waiting for the right kind of role for him. You will understand this when you watch the film,” he said.\n\nBesides the lead pair, the film will feature Adoor regulars like Nedumudi Venu and KPAC Lalitha, besides Vijayaraghavan, Indrans, Nandu, Srinda and Sudheer Karamana. Marathi actor Subodh Bhave will appear in a key role.\n\nBaby Mathew, who is coproduceing the venture with Adoor, said he was happy to work with a filmmaker of international standing.\n\nFor Dileep, it is a dream come true. “Adoor Air was the only director I approached, asking for a role. He is a rich part of our film history and our personal pride. I want to be worthy of the role he has cast me in and am approaching the film as a blank sheet. He will sketch what he wants on it. It is going to be an exciting experience,” said the actor.\n\nKavya, who had previously acted in Adoor’s Nalu Pennungal , said that as a child she wanted to act in Adoor’s Kathapurushan . “But I got the shock of my life when he cast me in Nalu Pennungal, and I thought it would be my only Adoor film. Cuckoo chechi [Parameswaran] shocked me a second time when she enquired if I could spare two months for this project. I’m fortunate to have been asked thus,” she said.\n\nI have always liked Dileep as an actor but was waiting for the right kind of role for him. You will understand this when you watch the film.\n\nAdoor Gopalakrishnan", 
    "section": "national", 
    "title": "Adoor’s next will be an intense love story", 
    "subsection": "general", 
    "date": "2016-03-25"
}