{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "Just plain graffiti:Posters of writers and intellectuals are not seen on the streets of Kolkata this time unlike in 2011 when they were faces that called for Paribartan in West Bengal.— Photo: Ashoke Chakrabarty\n\nive years ago, adding strength to the massive anti-incumbency wave against the 34-year rule of the Left Front government were intellectuals and prominent citizens of West Bengal, spearheading the call for Paribartan (change) in the State ahead of the Assembly elections.\n\nThe posters demanding change were a collage of faces — celebrated writer Mahasweta Devi, painter Shuvaprasanna Bhattacharya, film-maker Aparna Sen, theatre person Arpita Ghosh — along with many other icons of Bengali civil society, or Susheel Samaj, as it was called then.\n\nFive years after Paribartan was been ushered in the State and the ruling Trinamool Congress is seeking a fresh mandate, the Susheel Samaj is conspicuous by its absence and no longer part of the public discourse. Many of the faces on the posters have either joined the ruling party or are not so forthcoming with their opinions.\n\nLost sheen\n\n“The Susheel Samaj is no more. In fact, even before the 2011 Assembly polls, when the then Railway Minister, Mamata Banerjee, started accommodating these people in different railway committees, the movement — that had gained ground during Singur and Nadigram — lost its sheen,” Biswanath Chakraborty, psephologist and political analyst, told The Hindu .\n\nMr. Chakraborty, Professor and Head of the Department of Political Science at Rabindra Bharati University, says the ruling party slowly killed the movement.\n\nIf officially accommodating those from civil society, members of which took to the streets during Singur and Nandigram, was the beginning of the end the movement, the next stage saw the Trinamool Congress giving ticket to some of them in the 2011 Assembly elections, followed by 2014 Lok Sabha polls. This further weakened the movement.\n\nIn another interesting development, which virtually triggered the collapse of the civil society movement, was the institution of State awards — Banga Bhusan and Banga Bibhusan — by the Mamata Banerjee government. Most of the members of the Susheel Samaj have been recipients of these awards.\n\nHistorical reasons\n\nMinister Bratya Basu, who is contesting the elections from Dum Dum on the Trinamool Congress ticket, however, said the situation in 2011 was different. “It was a historical situation when the entire civil society had come together against a particular regime,” he said.\n\nTheatre person Koushik Sen, among a few members of the civil society group who has been vocal about both the regimes, rues the fact that the platform lost its way over the past five years.\n\n“I think the way the civil society movement has collapsed is a betrayal of society,” he said.\n\nWhile a few prominent intellectuals such as poet Sankha Ghosh have led street protests over incidents such as the brutal gang rape and murder of a college girl at Kamduni in June 2013 or the Park Street gang rape at Park Street, the movement could not sustain itself and those critical of the policies of the ruling establishment could not cobble together a platform as in 2011.\n\nReason for hope\n\nAsok Kumar Ganguly, former Supreme Court judge and ex-Chairperson of West Bengal Human Rights Commission, is, however, hopeful that a new civil society movement is emerging.\n\nJustice (retd) Ganguly, who is president of the Save Democracy Forum, was asked to contest the elections this time, but he politely declined.\n\n“There are two people from the Save Democracy Forum and two from Aakranta Amra [We the Victims] contesting the polls,” he told The Hindu , pointing out that this is the new civil society movement.\n\nThe movement that gained ground during Singur and Nandigram has\n\nlost its sheen\n\nBiswanath Chakraborty\n\nPolitical analyst", 
    "section": "national", 
    "title": "Civil society muted in Bengal", 
    "subsection": "general", 
    "date": "2016-03-25"
}