{
    "author": [
        "Santosh Patnaik"
    ], 
    "text": "Introduction of coastal shipping will trigger growth\n\nAfter Nepal signed agreement for designating Visakhapatnam Port as an alternative EXIM gate, now container traffic with Bangladesh is set to witness a quantum jump with the launch of regular service connecting Chittagong with Krishnapatnam.\n\nThe development also signifies launching of coastal shipping in less than a year of coastal shipping agreement signed between India and Bangladesh.\n\nThe ship will have connectivity with Kolkata, Haldia, Paradip, Visakhapatnam, Kakinada, Krishnapatnam and Chennai in India and Chittagong, Narayanganj, Ashuganj, Plava, Khulra, Mangla and Pangaon in Bangladesh. The coastal service was inaugurated last week by Bangladesh Shipping Minister Shajahan Khan.\n\nIndustry sources told The Hindu that there is a huge potential to import jute and textile products and export fertilizers, foodgrains, seafood, assembled products and project cargo. The sources said the two neighbours had a container cargo of 40,000 twenty-foot equivalent (TEU) units in 2013, 40,000 in 2014 and 62,000 in 2015.\n\nFeeder service\n\nAugmenting feeder service between the two countries will also help Tripura and its six other landlocked Sister States of Northeast to have supplies in less time by transporting cargo by road from Chittagong after building a bridge over Feni river.\n\nDelivery of containers from India, which is now routed through Colombo and Singapore, will have their delivery time reduced by two to five days with the availability of reliable feeder service.\n\n“We are expecting a huge demand for containers to Bangladesh from Kakinada,” a senior official of Kakinada Container Terminal said.\n\nNeepa Paribahon, which launched the coastal shipping between India and Bangladesh, sees bright scope to strengthen bilateral ties.\n\nIntroduction of coastal shipping will trigger growth", 
    "section": "national", 
    "title": "Container traffic between India and Bangladesh set to increase", 
    "subsection": "general", 
    "date": "2016-03-25"
}