{
    "author": [
        "T Karnakar Reddy"
    ], 
    "text": "Excavation at site in Nalgonda unearths 16-metre-long brick wall\n\nThe brick wall is believed to have been constructed 1,800 years ago.— PHOTO: Singam Venkataramanana\n\nIn a significant discovery, archaeologists excavating the early historic site located between Pazzur-Yarragaddaudem villages of Thipparthy mandal unearthed a huge 16-metre-long brick wall of a house that is believed to have been constructed some 1,800 years ago.\n\nAssistant Director P. Nagaraju said that the inhabitants of 2nd Century AD habitation had used light-weight bricks made in various sizes to construct their houses. The biggest brick was measuring 58 cm long, 28 cm wide and 9 cm high, the longest ever found in excavations in the past in Telangana and Andhra Pradesh. Earlier, the archaeologists had found 56-cm-long bricks at various early historic sites.\n\nThe excavation is being continued at Pazzur site as they are yet to find the end of the brick wall.\n\nAn horn of a deer was also unearthed at the site on Wednesday by the archaeologists, which proved that the inhabitants hunted wild animals for a living.\n\nApart from it, a huge number of beads and bangles made of various kind of materials, terracotta toys, and pottery were also found at the site.\n\nTerracotta toys of animals such as dog, ram, pig, besides fossils of human legs and others were found. Ornamental beads made with terracotta, jasper, conch shell, glass, steatite, carnelian and others were also found.\n\nThe Archaeology Department authorities conducted excavation at three locations at the early historic site that was spread in about 30 acres. Retired Chief Conservator Yerramraju Bhanu Murthy was guiding the workers.\n\nDirector of Archaeology and Museums N.R. Visalatchy had launched the excavation work on February 19. Historians, students, writers, poets and others have been regularly visiting the site to see the results of excavation.", 
    "section": "national", 
    "title": "Early historic wall surfaces in Telangana", 
    "subsection": "general", 
    "date": "2016-03-25"
}