{
    "author": [
        "Devesh K"
    ], 
    "text": "It is collecting info on findings of CBI, SEBI on firms involving businessman\n\nThe Enforcement Directorate is preparing to issue fresh summons to businessman Vijay Mallya if he fails to appear before the agency on April 2 to join investigation in the alleged IDBI Bank Rs.900-crore loan, money-laundering case.\n\nThe ED had earlier sought Mr. Mallya’s personal appearance at its Mumbai office on March 18. However, he expressed inability citing certain prior engagements. He was subsequently told to join the probe on April 2.\n\nIn the meantime, the ED is collecting information on the findings of other agencies, including the Central Bureau of Investigation and the Securities and Exchange Board of India (SEBI) pertaining to the companies involving Mr. Mallya. The accused had earlier informed the Serious Fraud Investigation Office that he would be travelling abroad in March. As part of its own inquiry, the SFIO also plans to examine him.\n\nThe ED will approach the court seeking initiation of legal proceedings against Mr. Mallya, also a Rajya Sabha member, in case he does not turn up despite repeated summons. Two such orders have already been served on him.\n\nInvestigating agencies are keeping a close watch on the developments involving Mr. Mallya, who is said to have decided to retire from the chairmanship of Sanofi India by not seeking re-election as a director. He has been chairman of the company’s board since December 1983.\n\nMr. Mallya’s transactions with the U.K.-based Diageo are also under the SEBI scrutiny and so are some instances of insider trading.\n\nThe businessman, who left for London on March 2, earlier refuted the allegations that he was evading the law. Through his Twitter handle, he said: “I am an international businessman. I travel to and from India frequently. I did not flee from India and neither am I an absconder …”", 
    "section": "national", 
    "title": "ED may issue fresh summons to Mallya", 
    "subsection": "general", 
    "date": "2016-03-25"
}