{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "The mother of Raghavendran Ganeshan, the Infosys software engineer who has been missing since Tuesday’s bomb explosion in the Brussels Metro, said her son had called her via Skype an hour before the explosion, and said he would be taking the Metro to work shortly. Mr. Ganeshan’s wife and month-old son are in Chennai.\n\nOfficials told The Hindu that telephone records of the engineer had placed him at the Montgomery metro station, just before 9 a.m.\n\nThe blast at the Maelbeek metro station, four stops away occurred at about 9:11 a.m.\n\nThe police say they believe at least 20 people died at the Maelbeek station, with the rail cars mangled in the blast which occurred after explosions at the Brussels airport, where 11 more were killed.\n\nHowever, while there has been no information about Mr. Ganeshan, officials don’t rule out that he could be among more than 260 injured and being treated in various hospitals. According to officials, many of the victims of the Maelbeek attack are sequestered in one particular hospital.\n\n“We are up against privacy laws that prevent us from getting a full list of those injured, as well as strict rules at the hospitals which won’t allow us to go in and personally identify anyone,” India’s Ambassador to the EU Manjeev Puri told The Hindu on the phone from Brussels.\n\n“We are hoping, we are praying that we can somehow make contact with Mr. Ganeshan, and now that his brother has arrived, we hope to take his help in identifying him,” he said.\n\nMeanwhile, there was relief for hundreds of Indian passengers stranded in Brussels since Tuesday as the airport was closed. While the Belgian government, which has raised its alert to its highest levels, refused to let passengers or their luggage be flown out of Brussels, the embassy and the airlines were able to negotiate for four Jet Airways planes to be flown out to Amsterdam along with others.\n\nBy Thursday, about 530 passengers had also been driven on specially arranged coaches to Amsterdam, from where they took flights to Delhi, Mumbai and Toronto. About 70 still remaining in Brussels are hopeful of getting the first flights available once the Zaventem airport reopens.", 
    "section": "national", 
    "title": "Ganeshan could be among injured in Brussels: officials", 
    "subsection": "general", 
    "date": "2016-03-25"
}