{
    "author": [
        "R Ravikanth Reddy"
    ], 
    "text": "‘Jai Jawan, Jai Kisan, Jai Constitution’ says JNUSU president; calls for a ‘save autonomy’ movement in universities\n\nPolice arresting ABVP activists, who tried to disrupt a seminar attended by JNUSU leader Kanhaiya Kumar, in Hyderabad on Thursday.— Photo: G. Ramakrishna\n\nAn activist of the ‘Go Seva Samithi’ threw a shoe at JNU Students’ Union president Kanhaiya Kumar when he got up to speak at a seminar on constitutional rights at the Sundarayya Vignana Kendra in the city on Thursday.\n\nThe shoe landed a few feet from Kanhaiya, who continued to speak, while his supporters roughed up the two trouble-makers. The seminar was organised by the Constitution Protection Committee, an initiative of Left students’ organisation.\n\nTrouble began when Naresh Kumar and Pavan Kumar of the Hindu Go Seva Samithi barged into the meeting hall shouting ‘Bharat Mata Ki Jai’ as soon as Kanhaiya rose to speak. The former hurled a shoe at him. Volunteers belonging to the All-India Students Federation (AISF) and others in the hall surrounded and physically assaulted Naresh, despite appeals from Kanhaiya Kumar not to harm him.\n\nThe police, who were present in large numbers anticipating trouble, led the duo away to a police station.\n\nContinuing his speech, Kanhaiya vowed to fight till the country was rid of divisive forces, and work towards establishing the concept of “Jai Jawan, Jai Kisan and Jai Constitution”. Taking a dig at the Bharatiya Janata Party (BJP) government, he said it did not respect even Swami Vivekananda. It had not named a single scheme after him, but had chosen to name schemes after RSS ideologues. Kanhaiya said he will respect nationalism enshrined in the Constitution, and not what the BJP government defines it to be.In an emotional speech heard with rapt attention, the JNUSU president said Rohith Vemula, not Afzal Guru, was an icon for him. “We will continue to fight till the Rohith Act becomes a reality,” he said.\n\n‘No hatred against Modi’\n\nAddressing a press conference, Kanhaiya said he had no hatred for or political agenda against Prime Minister Narendra Modi though university campuses had come under increasing attacks under the present regime.\n\nHe cited several instances of how university campuses had become ‘war zones’ because of the government’s design to promote ‘Hindu Rashtriya Vaad (Hindu nationalism)’.\n\nIn this context, he referred to the turmoil at the Pune-based Film and Television Institute following the appointment of Gajendra Chauhan as chairman, row at the Fergusson College in Pune and Allahabad and Jadhavpur universities because of the government’s attempts to project `Manuism’ as the ‘ultimate nationalism.’ Rohith Vemula who committed suicide at University of Hyderabad was a victim of the policy, and the struggle at JNU after his death was an extension of the UoH agitation, he said.\n\nKanhaiya also blamed Mr. Modi for the attacks on universities, as they were aimed at covering up government failures owing to development agenda taking the back seat in the last two years.\n\nWarning that there was a pre-planned script to wean away autonomy of universities, he called for ‘save autonomy’ movement on the campuses to protect social justice against autocratic rule.\n\nAt JNU, he said the students union believed in democratic transition aimed at overcoming challenges set up by the government.", 
    "section": "national", 
    "title": "Go Seva Samithi worker hurls shoe at Kanhaiya", 
    "subsection": "general", 
    "date": "2016-03-25"
}