{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "The Indian Council of Historical Research (ICHR) has invited historian Satish Chandra Mittal to address historians on its foundation day this year.\n\nMr. Mittal is national president of the All India Itihas Sankalan Yojana, an RSS body dedicated to shaping a nationalist narrative of history and one of the six petitioners who demanded a ban on Wendy Doniger’s book The Hindus: An Alternative History .\n\nLast year, the ICHR invited American David Frawley, an expert in yoga, ayurveda and vedic astrology, to deliver the keynote address, sparking criticism from historians.\n\nThis time, the invitation from ICHR chairperson Y. Sudershan Rao has left historians amused and concerned over the direction the premier institute is taking under Mr. Rao’s guidance. Mr. Mittal and Mr. Dinanath Batra are related. They were among the six petitioners who demanded a ban on Wendy Doniger’s book. Their criminal and civil suits forced the publishers Penguin to pulp the book. Mr. Batra confirmed that his son is married to Mr. Mittal’s daughter.\n\nOn March 29, Mr. Mittal, a retired professor of Kurukshetra University, will deliver a lecture on interpreting the national movement. Well-known for his affiliation to the RSS, Mr. Mittal, described as a good human being, has managed some of the schools run by the RSS in Haryana. His research focussed on the freedom movement in Punjab. He has several books to his credit, and they are critiqued by contemporaries for building a narrative that suits the RSS’s uncritical world view of India’s past.\n\nLast year, Mr. Rao submitted his resignation, listing several of his achievements. Though the official reason was not known, it was said he had quit just over a year after his appointment over the HRD Ministry’s inability to give him Rs.1.5 lakh a month in honorarium. Mr. Rao said he had quit for personal reasons and was waiting to hear from the Ministry, which is yet to accept his resignation.\n\nFrom the Ministry’s reaction, it appears Mr. Rao will continue to be at the helm.\n\nSatish Chandra Mittal had earlier sought a ban on Wendy Doniger’s book on Hindus", 
    "section": "national", 
    "title": "ICHR invites RSS historian for lecture", 
    "subsection": "general", 
    "date": "2016-03-25"
}