{
    "author": [], 
    "text": "He said the National Investigation Agency (NIA) had not made a request for his voice sample but if it did, he had no objections to giving it.\n\nMr. Khan asked Headley whether he remembered giving any information about Shazia Gilani, his first wife and daughter of a retired Pakistan soldier, in 1999. He asked whether Headley refused to give any information about Shazia to the NIA and whether he remembered giving out any information related to her to the NIA later. He replied: “I don’t remember.”\n\nHe was then asked if the NIA questioned him on Shazia’s role in the 26/11 attacks, he said: “It is not true as she did not have a role to play.”\n\nAfter the rapid-fire questions, Headley snubbed defence counsel and said: “I will not answer any question related to my wife, and any communication with her is private and personal information.”\n\nAsked 10 other questions related to Shazia and whether she knew about his association with the LeT, about the plan of the 26/11 attacks, about his fresh visit to India, whether she encouraged him or objected to the attacks, Headley’s reply was constant: “The same answer as before.”\n\nHeadley was then questioned about his second wife, Faiza Outhala, a Moroccan with whom he had visited India and videographed the city, including the Taj Hotel where the attacks took place. She did not have any idea that her husband was planning an attack in the city, he said.\n\nThe 55-year-old Headley agreed that he recognised Ajmal Kasab, the lone attacker who was awarded death penalty in 2012. He said he recognised his photo on the Internet and said: “Ajmal Kasab Rehamat Ullah Alaih” which, according to Headley, translates into “to be forgiven.”\n\nHeadley said: “The person is dead, so he should be prayed for whether he is good or bad, don’t you know that.” He said: “The act of murder is not a good act, and I didn’t know him whether he was good or bad.”", 
    "section": "national", 
    "title": "Lashkar made an attempt to kill Bal Thackeray: Headley", 
    "subsection": "general", 
    "date": "2016-03-25"
}