{
    "author": [
        "S Anandan"
    ], 
    "text": "Yesteryear superstar Prem Nazir dithered over contesting polls, but never threw his hat into the ring.\n\nUnlike the voters in the rest of south, Kerala has been politically conservative in letting film stars contest elections. Politics is for career politicians or those with a political consciousness and orientation.\n\nThat perhaps explains the one-off electoral win of someone from the film industry — ace film-maker Ramu Kariat, famous for helming Chemmeen , won from the Nattika Assembly constituency in Thrissur district as a Left-backed Independent candidate in 1965 — till the Lok Sabha elections in 2014. Even yesteryear superstar Prem Nazir, an ambivalent Congress supporter, dithered over entering the electoral fray.\n\nKerala gave a thumbs-down to film-maker Lenin Rajendran who tested the electoral waters twice from the Ottapalam Lok Sabha constituency in the early 1990s. Actor Murali contested the Assembly elections from Alappuzha in 1999.\n\nScript changes\n\nWhen actor Innocent, also fielded by the Left, trounced veteran Congress leader P.C. Chacko in the Lok Sabha elections in 2014, the script seemed to be changing. A headcount of the aspirants and probables from the Malayalam film fraternity for the Assembly elections on May 16 shows that Innocent’s win was a watershed moment. Kerala has changed. All the three major alliances are hankering after “stars” for granting candidature in the critical election.\n\nAmong the Left probables is actor Mukesh (from Kollam), a known CPI(M) fellow traveller. Though the party toyed with the idea of fielding KPAC Lalitha, another known Left sympathiser, from Vadakkancherry, the veteran actor backed off citing health issues in the wake of a vociferous protest in the constituency.\n\nSeveral actors, including Suresh Gopi, who is said to be annoyed by the treatment meted out to him by the party; Bheeman Raghu and Kollam Thulasi, are said to be trying for the BJP ticket.\n\nThe Congress is reported to have finalised actor Jagadeesh for Pathanapuram, a seat held by the Kerala Congress(B), which parted ways with the ruling United Democratic Front a year ago. K.B. Ganesh Kumar, actor-turned-politician, is currently representing the constituency.\n\n“These are signs of decadence in Kerala politics,” M.N. Karassery, writer and social commentator, explains the emerging trend of actors entering electoral politics.\n\n“Nothing should stop a politically aware and anxious film personality, anyone for that matter, from contesting the polls with a clear political perspective. However, what we are witnessing lately is an influx of ‘stars’ from a variety of fields into politics by virtue of their stardom in film, caste, community and religious identity and financial status if they are businessmen.”\n\nLenin Rajendran firmly believes that eminent people from all walks of life should enter electoral politics. “As a society, we have a lot of misunderstanding about development. A large number of professional politicians points at toilets, roads and bus stops constructed using their legislator’s fund to enlist their development track-record. Shouldn’t this change? Having said that, those brought in from other fields aren’t always meritorious either. Believably, glamour, money and caste also a play a role in candidate selection these days,” he says.\n\nMukesh is convinced that actors being sensitive individuals, understand societal sentiments better. “When people across sectors are entering politics, why does anyone want to ostracise film personalities,” he asks.\n\nJagadeesh, a likely Congress candidate, argues against politics being left to career politicians. “There’s no point in keeping artistes away, as their identity alone will not help them come up trumps in the polls.”\n\nKerala was reluctant to let stars wield the political megaphone.\n\nNot anymore.", 
    "section": "national", 
    "title": "Marquee stars in big-banner contests in ‘conservative’ Kerala", 
    "subsection": "general", 
    "date": "2016-03-25"
}