{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "Compulsions of political survival have dented her tough image\n\nSenior PDP leader Abdul Rehman Veeri signs in support of the election of PDP president Mehbooba Mufti as the leader of the legislature party in Srinagar on Thursday.— PHOTO: NISSAR AHMAD\n\nFinally, after two months of political wrangling between the Bharatiya Janata Party (BJP) and Peoples Democratic Party (PDP), the signs of having a coalition government restored in Jammu and Kashmir are clearly visible. On Thursday evening, PDP legislators endorsed their party president Mehbooba Mufti as chief minister, the post which has been vacant since the death in early January of her father, Mufti Muhammad Sayeed.\n\nThough the idea of assuming the highest office in the State sounds promising, Ms. Mufti’s public image of being a tough nut, the first mainstream leader to use the word “state-terror” in public lectures, has received a battering. Her two-month long demand — that the BJP leadership should come up with new assurances — yielded nothing.\n\nBefore Monday, when the PDP was yet to declare whether it wanted to form the government with the BJP or head for a new election, people either despised her style of politics or admired her for standing up to the BJP. Ms. Mufti constantly accused the ruling party of violating the Agenda of Alliance, a treaty that had brought these two ideologically different parties together in March 2015.\n\nAs the PDP-BJP deadlock has thawed, it remains to be seen whether Ms. Mufti would be a headache for the BJP government in the Centre, or she would compromise to keep the coalition government afloat.\n\nUncompromising\n\nFrom her rise in J&K’s political landscape, it’s hard to believe that she will accept being dictated to by the Centre. Though she respected her father’s decisions, she is poles apart from him in the exercise of authority.\n\n“Mufti sahib was a resister, he resisted things. Mehboobaji is a person on the front; she is more of a worker. While she knows what is happening today, Mufti was more like what will happen tomorrow,” the party spokesperson and youth leader, Waheed Parra, told The Hindu .\n\nA law graduate and single mother of two daughters, Ms. Mufti started her political journey as a Congress candidate in 1996 Assembly polls, when militant strikes were frequent. The first thing she did as a campaigner was to radically alter her wardrobe. She shunned jeans and T-shirts and adopted the traditional salwar-kameez and headscarf. She won from south Kashmir’s Bijbehera constituency, her home town, with a decent majority.\n\nHowever, her stint as MLA did not last long as she resigned from the Congress in 1999 to join her father, who was about to launch PDP — a political outfit that spoke within the framework of the Indian Constitution, yet maintained that Kashmir is a dispute between India and Pakistan and it must be resolved through peace talks.\n\nWhile Mr. Sayeed steered the party politically, Ms. Mufti cultivated the voters. She deployed a tough rhetoric, advocating “talks with militants without asking them to first lay down arms.” She also argued for tri-lateral dialogue process, demanding “talks must be held with the alienated Kashmiri people, and let the process of dialogue once begun throw up a solution.”\n\nThree years later, in 2002, the PDP contested the assembly elections and won ample seats to stitch together a coalition government with Congress.\n\nWhile Mr.Sayeed became the chief minister, Ms. Mufti oversaw the party affairs. By 2008, the coalition government fell apart with the outbreak of an agitation over an alleged illegal transfer of land to the Amarnath Shrine Board. As over 40 people were killed, PDP, a party that claimed to deliver a “healing touch” to the conflict-torn state, found itself at an odd spot.\n\nA senior PDP leader told The Hindu that it was Ms.Mufti, who single-handedly fomented the split to bring down the government.\n\nAt present, the party is in desperate need of seeing Ms. Mufti regain the confidence of the Kashmiri people, who are cold shouldering it over issues like the killing of a Kashmiri trucker by Bajrang Dal activists, the constant call from some BJP quarters to scrap Article 370 and the “intolerance debate” in the country.\n\nMs. Mufti’s ability to balance the multiple demands of governance and political survival will be crucial. Gul Wani, a political science professor, summed up Ms. Mufti’s situation: “She is caught between a rock and a hard place. If she withdraws it means she achieved nothing and went against what her father has done. If she continues, she has to deal with other kinds of troubles.”", 
    "section": "national", 
    "title": "Mehbooba Mufti – a rebel tamed?", 
    "subsection": "general", 
    "date": "2016-03-25"
}