{
    "author": [
        "Sharad Vyas"
    ], 
    "text": "Inspections followed complaints that they added facilities violating norms\n\nSeveral star-category hotels in the city have come the under scanner for violating fire safety norms and building additional facilities in violation of construction norms. The violations came to light during inspections carried out by Mumbai Police Commissioner and Commissioner of the Brihanmumbai Municipal Commissioner (BMC) at five-star hotels over the past one year. Some hotels were some found to have constructed additional facilities such as spa and basement gyms without proper permissions from the civic body.\n\nThe inspections were carried out at the Taj Mahal Palace, The Leela, Hotel Sahar, Grand Maratha, Hotel Lalit, Grand Hyatt and Le Meridien, the Chief Minister Devendra Fadnavis informed Maharashtra Assembly on Tuesday. Mr Fadnavis was responding to a question raised by state legislators who wanted to know why the Taj Mahal Palace had not paid up Rs 5.5 crore to the BMC despite repeated requests and reminders.\n\nOn June 18, 2015, the hotel was asked to pay Rs 5.5 crore for using a public road and a footpath by placing flower pots and barricades. The BMC had asked the hotel to pay up within 15 days.\n\n“The hotel had illegally encroached upon the footpath and has not paid up the penalty yet. On similar lines, star hotels near the airport have not been following fire safety norms and, constructing facilities such as gyms and spas without permission,” Mr Fadnavis said.\n\nThe inspections were carried out following complaints that hotels were constructing additional facilities beyond permissible limits. The CM said in his written reply that inspection at star hotels around the airport found violation of fire safety norms, and notices were served to six. Of the six, five had later complied with the guidelines to the satisfaction of the authorities.\n\nAt hotel Le Meridien, it was found that the management had altered the plan approved by BMC and constructed a saloon, staff canteen, and an administrative office.\n\n“Once we found that out, a notice under Section 53(1) MRTP Act (Maharashtra Regional Town Planning Act) was served to the hotel. But later it turned out that the changes were made by the hotel within the old rules of the corporation. We decided not to take necessary action,” he said in a written reply.", 
    "section": "national", 
    "title": "Mumbai five-star hotels under scanner", 
    "subsection": "general", 
    "date": "2016-03-25"
}