{
    "author": [
        "Soumya Das"
    ], 
    "text": "Arms and explosives seized in 7 districts of West Bengal affected by Naxalism\n\nThe Election Commission has sought a report from district magistrates (DMs) following seizure of illegal arms and explosives in seven districts of West Bengal affected by Left-wing extremism.\n\nAbout a week ahead of the Assembly polls, 11 persons allegedly involved in Maoist activities have surrendered during 31 operations in areas witnessing Left-wing extremism in the State.\n\nThe seizures were made from December 1 last year to March 20.\n\nIn Murshidabad, 321 kg of explosives were seized. Illegal arms were also seized from Malda, Bankura, Purulia, Nadia, Birbhum and Paschim Medinipur.\n\n“We have taken cognisance of media reports of stockpiling of illegal arms and ammunition in these districts and asked the DMs to take strict preventive measures,” Additional Chief Electoral Officer Dibyendu Sarkar said on Thursday. He said a report had been forwarded to the EC.\n\nApart from the surrender of Maoists, 65 explosives, 26 arms and 22 pieces of ammunition have been seized in the LWE areas.\n\nIn Murshidabad, 958 bombs, 96 arms have been seized and 143 persons have been arrested. Fourteen check posts have been set up along the Purulia-Jharkhand border.\n\nIn Purulia, besides 24 arrests, 14 arms and 19 pieces of ammunition have been seized. In Nadia, 89 arms, 79 bombs have been seized while 88 cases were registered.\n\nFake currency\n\nIn Malda’s Kaliachak and Baishnabnagar, fake currency notes of denomination of Rs. 58.88 lakh have been seized.\n\nAlso, 58 arms, 55 bombs were seized and 14 persons have been arrested in the district. In Birbhum, 2,099 bombs, 86 arms and ammunition have been seized.\n\nHuge haul of weapons and explosives in seven districts affected\n\nby the violence", 
    "section": "national", 
    "title": "Poll panel wants report on arms seizure in W.B.", 
    "subsection": "general", 
    "date": "2016-03-25"
}