{
    "author": [
        "Roli Srivastava"
    ], 
    "text": "Lord Jim O’Neill, the renowned economist who coined the acronym BRICS and predicted that India would become the second or the third largest economy by 2050, on Tuesday warned that the country will fail to reach this “exciting potential” if it doesn’t scale up its effort to tackle the rising antimicrobial resistance.\n\nSpeaking to The Hindu from London following the launch of a paper on ‘Infection Prevention, Control and Surveillance’ by the Review on Antimicrobial Resistance that he chairs, he said by 2050, antimicrobial resistance would claim an estimated million lives in India.\n\n“The productivity of the Indian economy will be severely impaired. India will never reap the demographic dividend, which would have been a global advantage for the country,” he said.\n\nU.K. Prime Minister David Cameron had commissioned the Review on Antimicrobial Resistance to address the growing global problem of drug-resistant infections.\n\nFollowing this paper, which explores the role of sanitation, infection prevention and control measures and surveillance in tackling resistance, a final report, which will have a slew of country-specific recommendations, will be presented to Mr Cameron and the wider global community in May 2016.\n\n“We would like to see India play an essential role in joining G20 neighbours and colleagues in helping to implement some of the recommendations my review is making,” said Mr O’Neill, former chief economist with Goldman Sachs and currently Commercial Secretary to the UK Treasury.\n\nHe said the recommendations that will be made in May will be considered by the G20 finance ministers.\n\n“We want G20 to focus on it, push a high-level U.N. agreement on scaling up programmes related to infection control, antibiotic consumption, use of antibiotics in agriculture and surveillance.”\n\nThe paper highlights that diarrhoeal illness in India, Indonesia, Brazil and Nigeria account for consumption of at least 500 million courses of antibiotics currently, a figure that could grow to more than 622 million by 2030.\n\n“India has 395 million cases of diarrhoea, and if the country embarks on a radical improvement in sanitation, by 2030, this figure could drop to 114.”\n\nHe said Prime Minister Narendra Modi’s Clean India campaign was an encouraging sign and that the country should make sure that it is fully implemented.\n\nMr. O’Neill said Mr. Cameron and Mr. Modi had discussed India’s rising burden of antibiotic resistance and there was active cooperation of the Indian Health Ministry in putting it together.\n\nHe described India’s antibiotic resistance problem as complicated.\n\nFor starters, he said there is no accurate data on resistance. And then, India has a billion people and a lot of them live in poverty and need better access to health care.\n\n“A lot of these people use antibiotics when they are ill. We cannot ask people to reduce antibiotics as people need them,” he said. There was a need for more resources, he added, particularly to tackle drug-resistant TB in the country.\n\nLord Jim O’Neill says Narendra Modi’s Clean India campaign is an encouraging sign", 
    "section": "national", 
    "title": "‘Rising antimicrobial resistance, a serious threat to economic growth’", 
    "subsection": "general", 
    "date": "2016-03-25"
}