{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Anand Rai to launch political party, take on the BJP in Madhya Pradesh\n\nAnand Rai says many honest people from various political parties are willing to join him.— File Photo\n\nAnand Rai, a whistleblower in the multi-crore medical admission ‘Vyapam’ scam, believes the Rashtriya Swayamsevak Sangh should have backed him in exposing “corruption” in the BJP-ruled Madhya Pradesh government.\n\n“The RSS has been talking about raising its voice against corruption; in fact they passed a resolution against corruption in their ‘Pratinidhi Sabha’ held in Chitrakoot, but when I pointed at Shiv Raj Chauhan, Chief Minister of Madhya Pradesh, in the Vyapam case, the same RSS didn’t come to my support. They have double standards ... ,” Dr. Rai told The Hindu . An active member with the RSS since 2005, Dr. Rai has felt alienated from the organisation since 2013 and hence has kept away from its activities.\n\nQuits over harassment\n\nDr. Rai, a medical practitioner with the M.P. government, recently quit his job to launch a political outfit, alleging that he has been harassed by the State government.\n\nMr. Rai said: “I was being harassed and repeatedly transferred as I had exposed numerous scams, and hence I have decided to resign and launch a new political party that would take up the challenge to defeat the ruling BJP in Madhya Pradesh in the 2018 Assembly polls.”\n\n“People of Madhya Pradesh are looking for a suitable alternative. My party [name yet to be finalised] will fight against corruption and would take up the cause of Dalits and farmers on priority,” said Dr. Rai, adding that many honest people from various political parties were willing to join him and the party would be launched soon.\n\n“A section of the Aam Aadmi Party’s State unit who are dissatisfied with the AAP are already in touch with me and are willing to join my party,” he said.\n\nThe CBI has registered at least 12 cases so far following the Supreme Court’s direction to probe the Vyapam scam. Irregularities in various professional examinations and tests for government jobs conducted by the Madhya Pradesh Professional Examination Board or ‘Vyapam’ have been unearthed. The scam allegedly involves several State government officials, former ministers and politicians. The Congress has alleged that at least 49 persons associated with the scam have died under “mysterious” circumstances.", 
    "section": "national", 
    "title": "RSS let me down, says Vyapam whistleblower", 
    "subsection": "general", 
    "date": "2016-03-25"
}