{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "In Friday’s edition of the journal Science , researchers J. Craig Venter and Clyde Hutchinson and colleagues at the Venter Institute, California, report the making of a living, replicating and stable cell that uses the minimum number of genes — 473 — to be considered biologically ‘alive.’\n\nIn the natural world, no living organism is ever known to possess fewer than 1000 genes. The knowledge gained from this creation may be foundational to understand how organisms can be created from scratch.\n\nEver since the human genome — the complete sequence of genes that make up human DNA — was deciphered at the turn of the century, researchers have tried to understand the precise functions of these 25,000 genes and the way they network with other pieces of DNA in the cell to keep it functional.\n\nFrom Syn 1.0 to Syn 3.0\n\nIn 2010, Mr. Venter and his team built and booted up the first self-replicating, synthetic bacterial cell (called Syn 1.0) through the sole chromosome (the storehouse of a cell’s DNA) of Mycoplasma mycoides — a bacterium with a relatively small genome — and transplanted it into Mycoplasma capricolum , from which they had previously extracted the DNA.\n\nThe hollowed-out capricolum was re-programmed to behave like a mycoides ; proof that genomes can be designed in the computer, chemically made in the lab, and transplanted into a recipient cell to produce a new, self-replicating cell controlled only by the synthetic genome. For its present work, the team reviewed scientific literature on the functions of each of the genes of Syn 1.0 and tried to remove every gene that didn’t seem essential. That, however, didn’t yield a stable cell.\n\nSimultaneously, another team — through trial and error — sliced and diced the genome of Syn 1.0 and then identified which of its original 901 genes could be done away with.\n\nThe final product of this stable cell with 473 genes is Syn 3.0. Intriguingly, they cannot yet explain why 149 of Syn 3.0’s 473 genes are essential to the survival of their test bacterium.\n\nThis article has been corrected for a factual error.", 
    "section": "national", 
    "title": "Scientists create bacterium with fewest number of genes", 
    "subsection": "general", 
    "date": "2016-03-25"
}