{
    "author": [
        "Staff Reporter"
    ], 
    "text": "(From left), Sriram Panchu, advocate, Madras High Court; Justice K. Chandru, retired Judge of the Madras High Court; A.X. Alexander, retired Director-General of Police, Tamil Nadu; and N. Ravi, Director, Kasturi & Sons Limited, and former Editor-In-Chief, The Hindu , at a panel discussion on free speech and sedition in a democracy, in Chennai on Thursday.— Photo: R. Ragu\n\nFocussing on the recent events that unfolded at Jawaharlal Nehru University in New Delhi, The Hindu Centre for Politics and Public Policy organised a panel discussion on ‘Free Speech and Sedition in a Democracy,’ touching upon the impact of sedition law on freedom of speech, in Chennai on Thursday.\n\nFormer Madras High Court judge K. Chandru, former Director-General of Police A.X. Alexander and senior advocate Sriram Panchu participated in the panel discussion, which was moderated by N. Ravi, former Editor-In-Chief, The Hindu , and Director, Kasturi and Sons Ltd.\n\nIn his opening remarks, Mr. Ravi pointed out that there were three dimensions — political, legal and public discourse — to sedition and free speech.\n\n“In a constitutional democracy and republic, do the interests of the state need such a law? Second is the legal dimension: whether the restrictive legal judicial interpretation is enough of a safeguard and whether allowing the section to remain on the statute book in itself poses the danger of misuse. And the third dimension related to public discourse on sedition and free speech where very often the wrong question is posed: Is free speech of a few more important than the security of the state? The right question should be whether a particular speech of a person poses a real threat to the security,” he said.\n\nJustice Chandru said that sedition law was a ‘political law.’ It was always misused by the political class. “The Supreme Court has clearly said that mere speech doesn’t qualify as sedition. Sedition law is always misused in India. In Tamil Nadu, singer Kovan was booked under sedition for singing against TASMAC shops and the government,” he said, adding, “If a law is likely to be misused, then it is an arbitrary law.”\n\nWhile arguing that the policemen often ‘go by the book’ because there are adequate legal checks, Mr. Alexander said that the sedition law must remain in the penal code, but the ‘vagueness’ in the law must be avoided.\n\n“There is a clamour to remove not just the sedition law, but many other laws, including the blasphemy law, which will open up a Pandora’s box,” he said.\n\nMr. Panchu said only when words incite violence and disturb public order, do they amount to sedition.\n\n“We should see if the speech produces a spark to the powder keg. If it doesn’t, a speech cannot be deemed sedition. So long as one doesn’t contemplate, promote or incite violence, it cannot be deemed seditious,” he said.", 
    "section": "national", 
    "title": "‘Sedition law is political; it is misused in India’", 
    "subsection": "general", 
    "date": "2016-03-25"
}