{
    "author": [
        "Yunus Y"
    ], 
    "text": "March 24, 2016, will go down in the history of Hyderabad as a significant day. The city reached out in solidarity to the students of the University of Hyderabad, who were left without food and water, following a strike by non-teaching staff.\n\nAs news of the students’ plight broke, help started pouring in from all quarters from Wednesday night. While some had managed to cook lunch for themselves at the Shopcom area and in other hostels on Wednesday, students from Osmania University (OU) sent them dinner.\n\nAnd after news of the strike by the non-teaching staff got out, Ashhar Farhan, one of the founders of Lamakaan, a non-profit organisation promoting arts, decided to mobilise help.\n\nUpma, idli and dosas reached the UoH campus by Thursday morning, courtesy Ajay Gandhi and his friends. “Gautami, a UoH student, helped us get food into the campus. And the credit for this goes to Ajay Gandhi,” said Farhan. Bananas and oranges were also sent to the campus by well-wishers.\n\nEven while the non-teaching staff resumed duty on Thursday, the hostel mess started functioning by morning, and water supply was restored, more food kept coming. By lunch time, students, who had been camping at the Shopcom area, had hot chicken biryani delivered to them from an unknown benefactor.\n\nThe situation improved on other fronts as well, with the WiFi services being restored on the campus. Although the police presence was seemingly less compared to Wednesday, the students continued to be wary. Uday Bhanu, who was thrashed by the police on Wednesday when he tried to cook food, has been admitted to a private hospital.\n\nOn Thursday evening, the students conducted a public meeting, and burnt the effigy of Vice-Chancellor Appa Rao.\n\nHelp pours in; upma, idli, dosa\n\nand biryani reach those stranded\n\nat hostel", 
    "section": "national", 
    "title": "Solidarity with students, Hyderabadi style", 
    "subsection": "general", 
    "date": "2016-03-25"
}