{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Bombay High Court on Wednesday asked Maharashtra how it proposed to regulate matrimonial websites which openly sought dowry.\n\nA Division Bench of Justice Abhay Oka and Justice P.D. Naik was hearing a public interest litigation plea by advocate Priscila Samuel.\n\nThe PIL claims that although the Dowry Prohibition Act came into effect in 1961, the State had done little to control the dowry menace, and urged the court to inquire into the “mushrooming illegal business of marriage brokers and marriage service providers.”\n\n‘Violation of law’\n\nThe PIL also points out to advertisements appearing on matrimonial sites seeking dowry, directly violating the law.\n\nThe plea sought orders to the State authorities to regulate the functioning of matrimonial sites.\n\nThe bench remarked: “We don’t how the State government can control them, but the State must control the matrimonial websites.”\n\nThe court also noted that the regulation of marriage bureaus had been left by the State to ward officers of municipal corporations.\n\nThese officers were already overburdened and were not in a position to discharge their duties under the Maharashtra Regulation of Marriage Bureaus and Registration of Marriages Act, 1998.\n\nThe court, therefore, asked the State government to take this aspect into consideration and inform the courtin a month what it proposed to do in this regard.\n\n‘Prosecute violators’\n\nOn newspaper advertisements that indicated demand for dowry, the court directed the State to bring to the notice of newspapers relevant Sections of the law, which prescribe a minimum imprisonment of six months for printing, publishing or circulating any such advertisement, and then take steps to prosecute the violators.\n\nPIL urges court\n\nto inquire into “mushrooming illegal business of marriage brokers”", 
    "section": "national", 
    "title": "State should control matrimonial websites that promote dowry: HC", 
    "subsection": "general", 
    "date": "2016-03-25"
}