{
    "author": [
        "Gautam S Mengle"
    ], 
    "text": "An Egyptian national suspected to be involved in widespread violence and riots in Egypt in 2013 was arrested by the Mumbai police upon his arrival on Thursday, after his name was flagged by a Red Corner Notice issued by Egypt. The suspect is now in the custody of the Extradition Cell of the Mumbai Police Crime Branch.\n\nAccording to police sources, the suspect identified as Hossam Abdelfatah Tawfik Mohamed, was detained after he landed in Mumbai from Qatar early on Thursday. Sources said his papers were being processed at the Immigration counter at the Airport when officials learned that there was an RCN against his name. He was then detained and the Extradition Cell contacted. A team of officials subsequently arrested him.\n\nJoint Commissioner of Police (Crime) Atulchandra Kulkarni, said, “We are now in the process of confirming his identity with the Egyptian authorities.” Sources said that prima facie information indicates that Mohamed was convicted in absentia for a crime he committed on Egyptian soil, after which he went on the run.\n\nMohamed will be produced in the Esplanade Court on Friday, where the Crime Branch will seek his custody.\n\nExtradition\n\nOfficials said that if he is confirmed to be the same person who is wanted in Egypt, the authorities in that country will begin the process of extraditing him. An RCN in the name of ‘Mohamed, Hossam’ on the Interpol website describes the wanted accused as a 49-year-old Egyptian national wanted by the Judicial Authorities of Egypt. The description of the charges against him, in Arabic, mentions ‘weapons’, ‘mob’, and ‘storming of Matay Center’.\n\nThe town of Matay had witnessed widespread riots in 2013 following the ouster of President Mohammed Morsi, and the instances of violence included an attack on a local police station, during which a policeman was lynched to death. The Egyptian prosecutor general later handed down death sentences to 528 accused, many of them being convictedin absentia.\n\nMohamed was convicted in absentia for riots following the ouster of Morsi in 2013", 
    "section": "national", 
    "title": "Suspect in Egypt violence held in Mumbai", 
    "subsection": "general", 
    "date": "2016-03-25"
}