{
    "author": [
        "D Suresh Kumar"
    ], 
    "text": "The four leaders of the People’s Welfare Front exude an unusual bonhomie\n\ngang of four:People's Welfare Front leaders G. Ramakrishnan the CPI(M), R. Mutharasan of the CPI, Vaiko of the MDMK and Thol. Thirumavalavan of the Viduthalai Chiruthaigal Katchi discuss strategy on a morning walk.— Photo: Special Arrangement\n\nIn Tamil Nadu’s personality-centric politics where egos of politicians get easily pricked leading to a parting of the ways, the bonhomie displayed by leaders of the four constituents of the People’s Welfare Front (PWF) over the past eight months stands out as a refreshing development.\n\nThe unusual bonding between Marumalarchi Dravida Munnetra Kazhagam (MDMK) founder Vaiko, Viduthalai Chiruthaigal Katchi (VCK) leader Thol Thirumavalavan, CPI(M) State secretary G. Ramakrishnan and CPI State secretary Mutharasan has resulted in them collectively joining hands with actor Vijayakant’s Desiya Murpoku Dravida Kazhagam (DMDK) to present a seemingly viable alternative to the DMK and the AIADMK that have dominated Tamil Nadu’s politics for 49 years.\n\nWritten off, almost\n\nLast July, when the four parties, along with the Manithaneya Makkal Katchi (MMK), a Muslim outfit, launched the People’s Welfare Cooperative Federation to expose the “anti-people policies” of the Union and the State governments, not many took them seriously. Within two months, the MMK exited the federation, which prompted critics to predict that disintegration was inevitable as birds of different feathers can’t flock together forever.\n\nEventually, when the federation was converted into a political alliance under the banner of the PWF, it was widely seen as an attempt at collective bargaining for more seats in an alliance that would be led by the ruling AIADMK or its principal rival, the DMK. Assertions by Mr. Vaiko, Mr. Thirumavalavan and the Left party leaders that they were serious about electorally challenging the two Dravidian behemoths were not given due weight.\n\nHowever, the four leaders were not disillusioned. To drive across the message to the people and critics that they were inseparable, they functioned as a quartet, going together from region to region addressing one public meeting after another.\n\nNo pretensions\n\nTheir actions in private life too were quite unlike that of the traditional politician.\n\nThe four would go on morning walks wearing sneakers and colourful shirts, sip coconut water together, dine in restaurants and pose for selfies.\n\nAnother factor cemented their relationship — none of the four leaders had qualms about moving freely in public or had any airs of being popular leaders.\n\nSince all these parties more or less shared a similar single-digit voter base, there were no major disagreements between them and consequently none was projected the leader of the grouping, though Mr. Vaiko was chosen its convener.\n\nThe leaders collectively tried to make other similarly placed parties to join their front and refused to project anyone as the chief ministerial candidate until Wednesday when they accepted the leadership of Mr. Vijayakant and declared themselves “kingmakers”.\n\nEven in the seat-sharing accord signed with the DMDK, the four leaders had individually signed as representatives of the PWF and did not mention the names of their respective parties. This is considered a rarity as politicians hardly lose an opportunity to project their outfits above a common cause.\n\nIt would be interesting to watch how these leaders overcome the thorny issue of apportioning the 110 seats among themselves.\n\nThe four leaders defied predictions that their alliance would fall apart\n\nin no time", 
    "section": "national", 
    "title": "Tamil Nadu’s unlikely quartet that sings an equal music", 
    "subsection": "general", 
    "date": "2016-03-25"
}