{
    "author": [
        "Kumar Buradikatti"
    ], 
    "text": "Karnataka says it is using only the share allocated to it and it needs water for power generation\n\nPeople from Telangana trying to remove the sandbags put across Krishna river near Shaktinagar in Karnataka on Monday.— PHOTO: SANTOSH SAGAR\n\nWater shortage for the Raichur Thermal Power Station (RTPS) in Karnataka appears to be turning into an inter-State row with neighbouring Telangana taking exception to the creation of a temporary sandbag protection wall in the Krishna river by RTPS to store water. While Telangana says such a wall will prevent flow of water to the State, Karnataka has made it clear that the RTPS is using only the water that has been legally allocated to it.\n\nAfter five of the eight units of RTPS, which Karnataka is heavily dependent on for its energy needs, suddenly stopped operation due to water shortage, 3000 cusecs of water were released for a week from the Basavasagara reservoir built across the Krishna. Since the live storage at the reservoir was less than a quarter tmcft, the discharge was soon stopped.\n\nAs the Krishna river has almost dried up, the RTPS authorities put up sand bags to create a temporary wall to hold back the released water for power generation. With this, the RTPS units slowly resumed operations.\n\nHowever, even before the generation reached the full potential, residents from about 60 villages in Makthal and Maganoor mandals in Mahbubnagar district of Telangana expressed the concern that putting up such a wall would result in drinking water shortage for them.\n\nThey blocked the Riahcur-Hyderabad national highway for three hours on Tuesday forcing the Mahbubnagar district authorities to inspect the sand wall.\n\nThe Raichur district administration is firm on not clearing the sand wall. Speaking to The Hindu , Deputy Commissioner S. Sasikanth Senthil said RTPS was using its rightful quota of water for generating power. “RTPS is using only the water share allocated to it. If power generation at RTPS is disturbed, it would lead to a power crisis which in turn would trigger a drinking water crisis. So, we won’t clear the sand wall,” he said.\n\n“We are asking water only for drinking purpose as we are facing one of the worst droughts in recent times. Karnataka officials should understand the severity of the situation and release water to downstream on humanitarian ground,” Chittem Ram Mohan Reddy, YSR Congress MLA from Makthal, Telangana, said.", 
    "section": "national", 
    "title": "Telangana objects to Raichur’s sandbag wall on Krishna river", 
    "subsection": "general", 
    "date": "2016-03-25"
}