{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "Environment activists have approached the western zone bench of the National Green Tribunal seeking immediate environmental damages from the Vidarbha Cricket Association (VCA) stadium at Jamtha in Nagpur.\n\nThey claim that despite being in operation since 2008, the ground does not have environmental clearance (EC), a mandatory requirement under the 2006 notification of the Central government.\n\nThe petition has sought a stay on cricket matches and even demanded demolition of the stadium for failing to adhere to the rules. A letter issued by the regional office of the Maharashtra Pollution Control Board (MPCB) on March 9, 2016, to its head office has stated that the VCA had no EC from the State, and consent to operate from the MPCB.\n\n“It has recommended legal action against the VCA,” said the petition, filed by Arun Wankar of Jai Javan Jai Kisan, Ankita Shah, a law student, and Toram Naidu, an RTI activist.\n\n“The VCA stadium has been organising big cricket tournaments since 2008. But, the NOC from the Maharashtra Fire Service Academy was received on October 17, 2015.” Advocate Asim Sarode, who is representing the petitioners, said the total built-up area of the stadium measures as 56,916.58 square metres, and hence it attracts the provisions in the Ministry of Environment and Forest’s notification of 2006, as per which clearance is required for any project with built-up area of more than 20,000 square metres.\n\nThe petition has pointed out discrepancies in the built-up area submitted to the MPCB and the fire department by the VCA.\n\nThe VCA’s total area is 1.28 lakh square metres of which the stadium structure measures at 51,854.58 square metres and club house at 5,057.34 square metres.\n\n“The competent authorities are supposed take over 15 per cent of the open space. The VCA is supposed to pay charges for layout and building plan sanction,” Mr. Sarode argued.\n\nPlea in NGT seeks stay on matches and demolition of arena for not following rules", 
    "section": "national", 
    "title": "Vidarbha cricket stadium does not have environmental clearance, claim activists", 
    "subsection": "general", 
    "date": "2016-03-25"
}