{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Japan to assist in setting up of Rs. 4,070-crore project at Perur to meet drinking water demand\n\nThe desalination plant currently in operation in Nemmili along the East Coast Road.—Photo: B. Jothi Ramalingam\n\nThe ball has been set rolling for Chennai’s fourth desalination plant to be set up at Perur along East Coast Road to meet the increasing drinking water requirements of the city. It is estimated to cost over Rs. 4,000 crore.\n\nA 14-member team from Japan Government’s Funding Agency — Japan International Cooperation Agency (JICA) was here in the city as part of preliminary arrangements relating to the setting up of the plant at Perur village along East Coast Road.\n\nThe team’s visit too was to scrutinise the project and finalise funding, officials told The Hindu.\n\nThere are currently two plants in operation at Nemmeli on ECR near Mamallapuram and Minjur. Each of the plants have a capacity to treat 100 million litres of water a day. A German team had recently inspected the site where the third desalination plant is earmarked at Nemmeli near the existing plant.\n\nThe State government had sought funding under JICA to construct the plant with a capacity to treat 400 million litres a day. A detailed project report prepared to establish the plant at a cost of Rs. 4,070 crore has already been submitted to the Centre.\n\nOn Thursday, the team from JICA visited the city to study the proposal in-depth and extend financial assistance for the project.\n\nChennai Metrowater plans to implement the project within 42 months after they award the contract for building it. The treated water from the plant will serve nearly 23 lakh people in the southern and central parts of the city.\n\nPlans to implement project within 42 months after contract is", 
    "section": "national", 
    "title": "A fourth desalination plant for Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}