{
    "author": [
        "Tiruchi Bureau"
    ], 
    "text": "Road Safety Week celebrated in Thanjavur, Tiruvarur and Pudukottai\n\nIt is essential to maintain constant vigil to remain safe while on the road as the improved infrastructure facilities and modern vehicles allow rapid movement that is being taken advantage of by some unscrupulous sections, Collector M. Mathivanan said on Tuesday.\n\nSpeaking after distributing prizes to winners of various competitions held in connection with the Road Safety Week celebrations at the Pulivalam Government Higher Secondary School near here on Tuesday, he said students need to be vigilant and sensitise their parents and home mates to the cause of road safety.\n\nAdherence to road rules was a must and there should be zero tolerance to violations to bring down accidents. We must not lose life pursuing speed in the current racy world demands, Mr. Mathivanan said.\n\nSpeaking over mobile phone while driving must be avoided at all costs, he added.\n\nUse of helmet by two wheeler riders would greatly reduce the chance of injuries even in the case of road accidents.\n\nYoungsters, from applicable age, must be trained to ride to-wheelers only with their helmet on so that it became a practice as they grow, the Collector said.\n\nMr. Mathivanan gave away prizes to winners of essay, elocution, slogan and painting contests held for students in connection with the event. District Revenue Officer T. Mohanraj, Chief Education Officer Mani, RDO Muthumeenakshi, and District Educational Officer Cholan participated.\n\nIn Thanjavur, Collector N. Subbaiyan gave away prizes to winners of various contests held in connection with the Road Safety Week celebrations at a function held at Sangeetha Mahal when he urged the public to follow road rules, drive with their focus and not indulge in violations of safety norms.\n\nThanjavur MP K. Parasuraman, MLA M. Rengasamy, District Panchayat Chairperson Amudha Rani Ravichandran, and Regional Transport Officer Rajkumar spoke.\n\nEye camp at Pudukottai\n\nDrivers should be aware of vision-related ailments, particularly colour blindness which is hazardous to their profession, said speakers at a function to mark the “free eye camp” organised by the Regional Transport Office, Team Hospitals, and Sri Krishna Eye Hospital here on Monday. The camp formed part of the All India Road Safety Week celebrations.\n\nN. Balagurunathan, Regional Transport Officer, said that drivers were exposed to bright light during their ride at night and hence they were more prone to eye ailments. He advised drivers to check their vision periodically.\n\nThe thrust of the camp was on early detection of colour blindness among drivers.", 
    "section": "national", 
    "title": "Adhere to traffic rules, says Collector", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}