{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Submit petition to district administration demanding settlement of unpaid balance by three sugar mills\n\nA delegation of farmer leaders representing several associations submitted a petition to the district administration on Tuesday demanding settlement of unpaid balance for the last two years by three private sugar mills: Bannari Amman, Sakthi and EID Parry mills.\n\nThe mills owe farmers several crores of rupees in unpaid balance. State-over, sugar mills have not settled Rs. 620 crore accumulated over the last two years: 2013-14 and 2014-15 crushing season, the farmer leaders said in a petition.\n\nThe mills had failed to pay the farmers Rs. 2,650, including transport, per tonne, during 2013-14 when the Fair and Remunerative Price fixed by the Central Government was Rs. 2100 per tonne, and the State Advisory Price was Rs. 550.\n\nIn 2014-15, too, the procurement price was static at Rs. 2,650 per tonne, since though the Central Government had fixed Rs. 2,200 as FRP, the State Government scaled down SAP to Rs. 450.\n\nFor this crushing season, the State Government has increased the SAP to Rs. 550 in addition to the FRP of Rs. 2,300.\n\nYet, the procurement rate was not commensurate with the increasing expenditure incurred on counts of fertiliser, labour costs and other overheads. Going by the recommendation of M.S. Swaminathan Commission recommendation advocating a procurement price calculated on the basis of cost of production plus 50 per cent, Rs. 4,000 ought to be paid by the mills per tonne, the farmers said.\n\nThey called upon the State Governemnt to secure the Rs. 2,850 per tonne promised this year unfailingly from the mills, and at the same time, urged the authorities to waive tax on sugar and alcohol, besides evacuating power from the cogeneration units on a regular basis.\n\nFarmers said the mills were facing the ignominy of paying fines even after deciding to supply power to the grid without getting any returns, the farmers said.\n\nDelegation\n\nThe delegation comprised representatives of Tamil Nadu Sugarcane Growers’ Association, Tamil Nadu Swadeshi Farmers’ Association, Tamizhaga Vivasayigal Sangam (Narayanasamy Naidu), Thadapalli-Arakankottai Paasana Vivasayigal Sangam, Kalingarayan Paasana Vivasayigal Sangam, Tamizhaga Vivasayigal Sangam (K.C.), Bannari Amman Sugar Mill Cane Farmers’ Association, Sakthi Mill Sugarcane Farmers’ Association, Pugazhur EID. Parry Sugar Mill Farmers Association, Tamizhaga Vivasayigal Sangam (Venkatachalam), Tamilnadu Vivasayigal Sangam, Indian Turmeric Farmers’ Association, Mettur Right Canal Ayacut Farmers’ Association, Kurangan Odai Ayacut Farmers' Assocaition, and Keezh Bhavani Paasana Vivasayigal Kootamaippu.\n\nThe mills owe farmers several crores of rupees in unpaid balance", 
    "section": "national", 
    "title": "Cane farmers urge State to secure specified procurement price from mills", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}