{
    "author": [
        "K Manikandan"
    ], 
    "text": "Pensioners irked by last year’s revision; want it revoked\n\nPassengers travelling regularly by long-distance trains are disenchanted with the high ticket cancellation charges.\n\nThe Ministry of Railways hiked the ticket cancellation charges – doubling it in November last year.\n\nPassengers complain they have been losing a lot of money on account of this, whenever they re-schedule their travel plans.\n\nPensioners vexed\n\nRecently, a senior citizen booked two tickets — one for his wife and the other for himself — for a journey from Tirupati to Warangal on January 8.\n\n“I altered my travel plan and cancelled the tickets the same evening. Of the Rs. 535 I paid to buy the tickets, I got back only Rs. 130,” said S. Andrew.\n\nTerming this as unfair, the pensioner said he was a frequent train traveller and this was the first time he was losing such a large sum of money in all his years of travel.\n\nCharges doubled\n\nS. Rama Rao of Traffic and Transportation Forum said that earlier, the charges collected for cancellation of tickets between 48 and 6 hours before the scheduled departure of the train was 25 per cent.\n\nHowever, now, the time has been reduced to between 48 hours and 12 hours, he added.\n\nMr. Rao, who is an activist, said that doubling the cancellation charges, for instance, from Rs. 30 per passenger to Rs. 60 was arbitrary and unjust.\n\nThe revised charges are between Rs. 60 and Rs. 240 (First AC).\n\nActivists said rail passengers had been forced to pay more in the past one year — be it the increase in platform ticket rates or the more recent ticket cancellation.\n\nHoping for relief\n\nThey hoped that at least during the forthcoming Railway Budget, passengers would get some relief and that the cancellation charges will be reduced.\n\nPassengers hope the forthcoming Railway Budget will reduce the charges", 
    "section": "national", 
    "title": "Commuters upset over cancellation charges", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}