{
    "author": [
        "Staff Reporter"
    ], 
    "text": "All India Central Council of Trade Unions stage a protest near the Anna Statue in Puducherry on Tuesday.- Photo: T. Singaravelou\n\nIndustrial workers staged a demonstration on Tuesday in Puducherry demanding the immediate release of eight former employees of Pricol Private Limited in Coimbatore.\n\nThe eight workers – Gunabalan, Manivannan, Rajendran, Ramamurthy, Sampath, Saravanakumar, Sivakumar and Velmurugan – are now serving double life imprisonment.\n\nAssaulted with metal rods\n\nThe company vice president (HR) Roy J George (47) was assaulted with metal rods in his chamber in 2009, who succumbed to injuries.\n\nNearly 25 workers were accused of murder and the Coimbatore trial court sentenced the eight workers to double life imprisonment in 2015.\n\nThe Pricol workers were on protest for more than a year demanding better wages. The failure to recognise the union which the majority of workers support led to the labour unrest.\n\nThis intensified after the dismissal of 42 employees, leading to the death of HR vice president in 2009.\n\nThe 15 trade union representatives in Puducherry under the leadership of All India Central Council of Trade Unions (AICCTU), who participated in the protest near Anna Statute here demanded for democracy in industries. AICCTU president S.Balasubramaniam said that there was no democracy in industries.\n\n“The trade unions are suppressed and anti-labour activities continue at appalling rate. What we need now is industrial democracy,” he said.\n\n‘Workers falsely\n\nimplicated in case’\n\nStating that the workers were falsely implicated in the case, he said: “Despite no evidence to prove that the eight workers were involved in the murder of the vice-president (HR) of the company, the court has given them double life imprisonment. This is unfair and against the justice.”\n\nAdding to this, he said that the industrial unrest should not be considered as a law and order problem. Trade union representations addressing the protesters said:\n\n“The severity of the verdict serves as an assault on India’s working class movement. It is a warning for the workers to comply with the anti-labour laws.”\n\nKnown for anti-union activities\n\nThe representatives of various trade unions said that Pricol, an auto-parts manufacturing company, was popular for various activities such as its anti-union activities, arbitrary dismissal, wage cuts and also employing contractual labour.\n\nEight former employees of Pricol Private Limited are serving double life imprisonment", 
    "section": "national", 
    "title": "Demonstration for release of ex-employees", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}