{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "At present, floodwaters from 1189 sq.km of the Chennai Metropolitan Area drain into the sea at Ennore through the Ennore Creek, near Napier Bridge through the Cooum river, near Foreshore Estate through the Adyar river, and at Kovalam creek.— Photo: K.V. Srinivasan\n\nThere are efforts to revive an old proposal to create a fifth channel in Chennai to drain floodwater into the sea. Following a study of what could have minimised the damage from the recent floods, supervisory officers appointed by the State Government have suggested that the proposal to develop a new channel connecting Okkiyam Madavu to the Injambakkam be given a second chance.\n\nAt present, floodwaters from 1189 sq.km of the Chennai Metropolitan Area drain into the sea at Ennore through the Ennore Creek, near Napier Bridge through the Cooum river, near Foreshore Estate through the Adyar river, and at Kovalam creek.\n\nAccording to one of the suggestions by the supervisory officers, having a fifth channel could be of immense help in draining floodwater during heavy rains.\n\nAccording to these officers, the development of a new 30-metre wide waterway from Okkiyum Maduvu to the sea near Injambakkam could help drain more than 3000 cusec of floodwater during heavy floods.\n\nThis proposal was shelved due to the challenges of land acquisition from East Coast Road (ECR) to the sea. “Acquisition of more than 10,000 sq.m of private land from ECR to the sea was a challenge. While the construction of the waterway was estimated at Rs. 60 crore, land acquisition was estimated at Rs. 200 crore. So, a decision to shelve the project was taken,” said an official.\n\nThe officials had identified a strip of government land from Okkiyam Maduvu to ECR in Injambakkam for the project.\n\nFewer encroachments had been reported along the stretch.\n\nAfter shelving the project, a decision to widen the Buckingham Canal from 30 metres near Okkium maduvu to 100 metres was made. This move was aimed at flood management.\n\nThe 100-metre-wide waterway was designed to drain floodwaters from most neighbourhoods of Rajiv Gandhi Salai and East Coast Road through Muttukadu. But the design proved a failure during the recent floods, prompting a review of the existing infrastructure.\n\nGeometry of waterways\n\nFollowing the floods, civic officials at the local level started collecting data on geometry of waterways, flow conditions of drains, catchment area characteristics, land use plan, catchment plans, obstructions to flow, cross-drainage structure and public utilities near the drains.\n\nThe design of the fifth channel could also be made along a 1.3-metre-long strip of land without affecting the operations of amusement parks in the area.\n\n“A proposal to offer boating services in the channel is also likely to promote tourism. Floodwaters will also recede easily,” said an official.", 
    "section": "national", 
    "title": "Does Chennai need a fifth outlet to drain water?", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}