{
    "author": [
        "Serena Josephine M"
    ], 
    "text": "Manoharan offers free ride in his auto for elderly too\n\nThere have been instances in which auto drivers offer free rides to expectant mothers. For 55-year-old M. Manoharan, an auto driver, a day is not complete without giving a free ride for a differently abled person or a senior citizen.\n\nOn his part, Mr. Manoharan, who has been driving auto for nearly 35 years, wants to help differently abled persons and senior citizens to travel at ease and does not charge them for rides. Two months ago, he put up a banner on the rear side of his vehicle that his auto was free for differently abled and senior citizens along with his phone number.\n\nThe motivating reason behind his gesture – his brother and daughter are speech impaired. “I have seen disability in my family. My brother and daughter are speech impaired, and my brother’s son is physically challenged. So, I wanted to do my bit to help people like them. It is a matter of satisfaction to give free rides for differently abled and senior citizens,” he said.\n\nHe has over 10 regular passengers, who call him on his mobile while going out. “Some differently abled and elderly persons travel in my auto regularly. If I see someone on the road, I offer them a ride to their destination. In case, someone poor wants to go to a hospital, I take them and also wait to pick them up,” he added. At times, differently abled persons and senior citizens request him to accompany them to government offices to receive welfare schemes such as bus pass and pension, he said.\n\nA resident of Vasanthapuram, Mr. Manoharan said he had taken a break from driving auto 10 years ago.\n\n“I was driving autos for 25 years, after which I took up another job for a few years. Then, we used to cook food for 20 poor persons every day. We used to distribute the food to people living on the streets. I took up driving auto again 10 years ago,” he said.\n\nHe earns around Rs. 600 to Rs. 700 a day, of which Rs. 220 goes as daily rent for the auto, he said, adding, “My family supports me in the gesture.” “I am happy that I am able to help them in this way,” he added.", 
    "section": "national", 
    "title": "Doing his bit for differently abled", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}