{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Rajesh Lakhoni, Chief Electoral Officer, at regional training for District Election Officers and Police Officers at Madurai Collectorate on Tuesday.- Photo: S. James\n\nThe Election Commission of India (ECI) is planning to provide an online facility for political parties to submit applications seeking permission for conducting public meetings and vehicle permits during the Assembly election.\n\nChief Electoral Officer Rajesh Lakhoni told reporters here on Tuesday that the online facility could be utilised by parties even for submitting applications seeking permission from the district authorities and police for opening party election offices.\n\nThe EC is also planning to set up a mobile-based complaint monitoring system. The official who receives the SMS would have to respond to the complainant in 24 hours, failing which the SMS would automatically be forwarded to the next higher official.\n\nAnother facility being mulled is online verification of campaign vehicles for which permission have been given to political parties. The officials could verify if permission has been granted by sending the registration number of the vehicle through SMS.\n\nMr. Lakhoni was here in connection with imparting a one-day training programme for District Election Officers and Superintendents of Police from eight southern districts.\n\nCommissioner of Police (Madurai city), Inspector General of Police (South Zone) and Deputy Inspector General of Police were present.\n\nGround work for conduct of election and rules and regulations for polls were discussed during the meeting.\n\nMr. Lakhoni said 82,000 electronic voting machines to be used would be checked by engineers from Bharat Electronics from February 1 to March 10. Most of the machines will be brought from Bihar, Gujarat and Maharashtra. The final electoral roll for all the districts would be published on Wednesday, he said.\n\nDistrict Collectors have been asked to visit colleges and encourage students to make online application for inclusion of their names in the electoral rolls.\n\nA mobile-based complaint monitoring system is also on anvil", 
    "section": "national", 
    "title": "EC to provide parties online facility to seek permission", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}