{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Since July last year, every regional party in Tamil Nadu has jumped on the mobile application bandwagon, hoping to leverage the penetration of smart phone devices in the State. But as trends show, these apps have hit a plateau and do not come anywhere close to the response the parties see on Facebook and Twitter.\n\nWhether it is DMK treasurer M.K. Stalin, DMDK leader Vijayakant or PMK chief ministerial candidate Anbumani Ramadoss, their personality-driven mobile applications have few takers.\n\nSources privy to the social media campaign strategies, point to an inherent problem in the way applications are used for the lacklustre response. “On Twitter and Facebook, you don’t depend on a small team. Lakhs of party supporters come together in support of the leader. And it is almost real time in its response. Though there is the aspect of automation, apps are restricted in content and take time to update,” says a DMK functionary.\n\nNot a single application of these political leaders currently on Google Play has crossed the 50,000 download mark, usually seen as an important milestone to gauge the popularity of the app.\n\nAmong the applications, Mr. Anbumani’s seem to be on a stronger wicket thanks to professionals from EMAHAPOLITICIAN, a social media marketing company based in Mumbai which created the app. The organisation has run campaigns for multiple political parties, including for the Congress in the recent Bihar elections.\n\nCrucial pointers\n\nThe company’s co-founder Vinit Naik, says the applications provide crucial pointers to the politicians on where their base is (like in north Tamil Nadu for Anbumani) and where they need to improve.\n\nMr. Vinit says south India provides a unique challenge since political and general awareness is high. “As the election comes closer, you will see the applications finding more takers. It becomes more crucial as the polls near to have strong application working for you,” he added.\n\nThe DMK, has a unique advantage since it runs two parallel social media campaigns for its president M Karunanidhi and treasurer M K Stalin.", 
    "section": "national", 
    "title": "Facebook, Twitter rule as apps hit plateau", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}