{
    "author": [
        "R Rajaram"
    ], 
    "text": "A separate bio-diesel tank with a storage capacity of 20,000 litres has been established\n\nThe first bio diesel powered diesel locomotive rolling out from the Diesel Loco Shed in Tiruchi.— Photo: B.Velankanni Raj\n\nThe first diesel locomotive powered by bio-diesel rolled out from here on Tuesday.\n\nThe eco-friendly initiative of the railways in using bio-diesel in limited quantity with high speed diesel to power diesel locomotives is expected to cut down oil bill and reduce pollution. With necessary infrastructure facility having been put in place, diesel locomotives that come for refuelling in the Diesel Loco Shed in Tiruchi would be topped up with blended fuel containing limited quantity of bio-diesel and high speed diesel.\n\nA separate bio-diesel tank with a storage capacity of 20,000 litres has been established within the Diesel Loco Shed which maintains a fleet of over 125 diesel locomotives of different types including the 4,400 high horsepower newly manufactured ‘EMD’ locos. Another huge tank to store blended fuel – a mixture of high speed diesel and bio-diesel has been set up with a 2.1 lakh litre storage capacity in the shed premises.\n\nFive per cent of bio-diesel would be used in the diesel locomotives with the remaining being high speed diesel, say railway officials here. The Diesel Loco Shed in Tiruchi has been identified by the Southern Railway to put in place facility for using bio-diesel in diesel locomotives with the other shed being Erode.\n\nDivisional Railway Manager, Tiruchi A.K. Agarwal flagged off the first bio-diesel powered high horsepower EMD diesel loco at a function held at the shed on Tuesday. The Senior Divisional Mechanical Engineer of the shed D. Rajamani said blended fuel containing bio-diesel and high speed diesel would be used in diesel locomotives that come for refuelling to the shed.\n\nThe shed plans to use 1.2 kilo litre of bio-diesel per day and thereby save 438 kilo litre of high speed diesel every year, say officials.", 
    "section": "national", 
    "title": "First bio-diesel powered loco rolls out in Tiruchi", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}