{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Involves students of Vellalar college to talk to hospital staff, patients, and visitors\n\nFunctionaries of Olirum Erodu Foundation accompanied college students to the Government Headquarters Hospital and the Corporation Bus Stand on Tuesday to create awareness on maintaining cleanliness and handling of solid wastes.\n\nJoint Director of Health Kanakachalam, Hospital Superintendent Janaki and Resident Medical Officer Manoharan facilitated the Foundation’s campaign.\n\nThe Foundation had given a facelift to the hospital last year at an investment of Rs. 50 lakh, by way of beautification of the exterior, purchase of dialysis machines and ventilators, besides creation of a park.\n\nSince then, the OEF has been maintaining them periodically.\n\nOn Tuesday, a group of 75 students from Vellalar Group of Institutions were involved by the OEF to clean up the park of plastic wastes.\n\nUnder the guidance of OEF Chairman M. Chinnasamy and Secretary S. Ganesan, the students fanned out in eight teams to the various wards to sensitise the patients, hospital staff and visitors to the ways of disposing of solid wastes such as tea cups, old clothes and medicine bottles.\n\nPamphlets distributed\n\nThe students emphasised on the importance of disposing the wastes in the bins provided for the purpose. They also distributed pamphlets in the hospital as well as the Bus Stand where the cooperation of shopkeepers was solicited.\n\nThe students had found that the shopkeepers had a tendency to shift the onus of maintaining cleanliness on the pavements on to passengers.\n\nHowever, there were many who gave a patient listening to the requests of students, B. Chandrasekaran, Chief Executive Officer of OEF, said.\n\nThe Foundation, he said, would shortly be imparting training in cleanliness to the staff of the private outsourcing company involved in housekeeping in the Government Headquarters Hospital, he said.", 
    "section": "national", 
    "title": "Foundation creates awareness on cleanliness at GH, bus stand", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}