{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Owing to ‘zero maintenance,’ Tirunelveli-Kanyakumari National Highway is causing frequent accidents\n\nCross-over:The median on Tirunelveli Kanyakumari four-lane has been damaged at several places to make way for bikes and even cars to reach the other side. This causes frequent accidents, particularly during nights.— Photo: A. SHAIKMOHIDEEN\n\nThe 85-km four-lane national highway between Tirunelveli and Kanyakumari that ensures speedy commuting for several thousand road-users every day has of late become a ‘death trap’ due to poor maintenance and the damage being caused to the safety systems created along the thoroughfare by antisocial elements.\n\nThe four-lane stretch made driving a pleasurable experience as travellers could reach the southern most tip of the country within 75 minutes from Tirunelveli.\n\nOwing to ‘zero maintenance,’ the road is causing frequent accidents.\n\nThough hefty toll is being collected at the toll plaza near Nanguneri, no step has been taken to rectify the undulations developed on the decade-old highway near Ponnakudi, Moontradaippu Bridge, Karanthaneri, near Toll Plaza and Vaagaikulam among other ‘danger zones.’\n\n“Drivers lose control over speeding vehicles while crossing the undulations, which trigger accidents. In some places, craters have developed, posing serious threats,” said N. Ravindran, a tourist van driver from Palayamkottai.\n\nThe most serious issue to be addressed is water stagnating on the road, especially near the bridges, soon after rains. As vehicles run on stagnant water at high speed, they swerve towards a particular direction to either hit the median or be hit by trailing vehicles.\n\n“This problem alone has so far triggered five major accidents on this stretch in which 23 persons were killed. Even after this problem has been taken up with National Highways Authority of India officials, no step has been taken to rectify it,” a senior police official here said.\n\nThe concrete median has been smashed at several points along the stretch by the villagers for easy crossing of the highway on their bikes as they are not prepared to travel a few kilometres to take a ‘U’ turn. Consequently, speeding vehicles hit these violators, particularly during nights. The metal barricades erected along the median at several villages are also in a badly damaged condition.\n\n“Since the batteries connected to the solar panels in the signals installed at several places have been stolen, the drivers cannot identify the busy and important junctions, particularly in during nights, which also causes frequent accidents, involving bikes,” said a physician from Valliyoor.\n\nExplaining these issues in detail, the police forwarded a letter to the NHAI and have been awaiting a positive reply for the past three months.", 
    "section": "national", 
    "title": "Four-lane stretch turns a danger zone", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}