{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Persons who died were not on the list generated by the Chennai Corporation\n\nollowing the death of four manual scavengers in the city on Tuesday, the National Commission for Safai Karamcharis has called for measures to rehabilitate the affected families. The persons who died were not on the list of manual scavengers generated by the Chennai Corporation.\n\nActivists stressed the need for yet another survey of manual scavengers within the Chennai Metropolitan Area to make rehabilitation work meaningful.\n\nLata Om PrakashMahato, member of the commission, said the families of the diseased should receive Rs.10 lakh as compensation.\n\nCHANGEindia Director A. Narayanan said the government had failed to implement the provisions of the Prohibition of Employment of Manual Scavengers and their Rehabilitation Act, 2013, and the directions of the Supreme Court for compensation to families of manual scavengers.\n\n“At least 200 deaths of manual scavengers have been reported in Tamil Nadu so far; more than 80 of these are from Chennai. The Chennai Corporation has identified 252 manual scavengers. But none of them has been rehabilitated,” said Mr. Narayanan.\n\n“The government has to constitute a monitoring committee. District Collectors are not aware of the law. The survey of manual scavengers has not been done properly,” said Mr. Narayanan.\n\nStatutory provisions\n\nThe Chennai Corporation is yet to create awareness about manual scavenging. A person who employs manual scavengers is liable to be arrested on non-bailable sections immediately, with two years of imprisonment and a fine of Rs. 5 lakh.\n\nThe Chennai Corporation is planning to identify additional manual scavengers in the city to rehabilitate them, creating more awareness on the statutory provisions.", 
    "section": "national", 
    "title": "Fresh survey of manual scavengers sought", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}