{
    "author": [
        "Staff Reporter"
    ], 
    "text": "25,487 beneficiaries received a set of four goats each in Dindigul district, says official\n\nWith care:The shed for goats of a beneficiary at Mangarai village near Dindigul funded by the Animal Husbandry Department.— PHOTO: G. Karthikeyan\n\nDistribution of free goats to farm labourers has not only altered their livelihood activities but has also enhanced their income.\n\nA woman farmer at Ammapatti village in Mangarai Panchayat union managed to make her son an engineering graduate and her daughter a government servant. Goat rearing had become a means of livelihood for several farm labourers owing to lack of farm work.\n\nTo encourage enterprising farm labourers who have multiplied four goats offered by the government, the Department of Animal Husbandry has constructed metallic shed to protect the goats from sun and rain.\n\nNarrating her activities, G. Murugeshwari said she had multiplied four goats in to 20 of which a majority were males. She retained the parent stock for reproduction and sold the grown up kids in the market. “I sold 20 goats to foot the educational expenses of my son, who was pursuing engineering,” she said.\n\n“Later, I sold another batch of goats during last Diwali and Pongal to buy new dresses for my grandchildren. I had earned more than Rs.1.5 lakh through goat sale, she added.\n\nAnother farm labourer P. Ponnathal of Amapatti said that acute drought in her village three years ago made her go jobless. Goat rearing was the only income source. Her sincere efforts to multiply four goats started repaying after a year. “Now I manage to earn Rs.5,000 to Rs.8,000 a month. Traders procure goats from my doorstep. Sometimes, I take them to Oddanchatram or Sempatti cattle markets. Many labourers at our village depend on goats for their survival,” she also added.\n\nWhen contacted, Joint Director of Animal Husbandry V. Rajendran said a total of 25,487 beneficiaries had received a set of four goats each in the district. These goats have been multiplied to two-and-a-half lakh goats in four years.\n\nAbout 246 sheds had been constructed so far. Beneficiaries should provide land for the construction of the shed. “We will construct the shed free of cost. We have achieved cent per cent target in distribution of free goats, cattle, chicken. Even as we achieved the target, we wanted to provide shelters to all successful goat rearers. Fresh proposals have been sent to cover others also,” he added.", 
    "section": "national", 
    "title": "Goats yield rewarding returns", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}