{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Folk artistes and gymnasts from Russia called on music composer Ilayaraja at his home in T. Nagar on Tuesday. They are in the city to perform at the Russian Culture centre.\n\nAround 11 artistes exchanged pleasantries with the legendary composer and even managed to get him sing a few lines from one of his celebrated songs, ‘Poove Sempoove’. The meeting happened just before the artistes were about to perform on stage with the maestro in attendance.\n\nThe music composer had to use a translator to converse with the visiting artistes as they could speak only Russian. After the translator introduced the composer as one of the greatest composers in India, who started composing Communist propaganda songs, the Russian artistes quizzed him about his recent works and how he has managed to hold on to his own even after so many decades.\n\nAnswering a question about how he adapts to the newer trends and technology in field of music, Ilayaraja said that he felt no difference while making music now and then. “No matter what the technology is, we have to make music using the seven notes,” he told the artistes.\n\nHe also spoke fondly about classical Russian composers such as Igor Stravinsky and said that he is very influenced by classical Russian composers. After inviting him to Russia, one of the artistes then told him about how Russian people love Indian films.\n\nIlayaraja asked them to watch Bala’s Thaara Thappattai , which, incidentally, was his thousandth film in his career. When the composer told them that he must have composed more than 5,000 songs, the artistes were surprised.\n\nIlayaraja was slightly taken aback when the artistes insisted on getting into their ballet costumes for a small performance in his home. Unsure, Ilayaraja said that he would come and see their performance the same evening. With the female dancers insisting that they would at least like to take a picture in their costumes, Ilayaraja eventually relented.\n\nPosing for a photo with the maestro, the dancers surprised him by showing off a popular ballet move. Another male artiste, requested Ilayaraja to let him play the piano. As a gracious host, Ilayaraja let him play the notes.\n\nHe later performed one of his famous songs, ‘Poove Sempoove’ to the visiting Russians, which was deeply appreciated.\n\nThe Russian artistes presented him a small gift, which, they said, signifies the familial bond. In return, Ilayaraja presented them with a Ganesha idol.\n\nHe sang, played the piano and posed for a picture", 
    "section": "national", 
    "title": "Ilayaraja enthrals Russian artistes", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}