{
    "author": [
        "Special Correspondent"
    ], 
    "text": "South India Textile Research Association (SITRA), which has a centre of excellence for medical textiles here, will commission an incubation facility in another three months to support new ventures in medical textiles.\n\nPrakash Vasudevan, director of SITRA, told reporters here on Tuesday that the facilities at the centre are now used by 19.\n\nThe dedicated incubation centre for medical textiles (textile products used in the healthcare sector) is set up at a cost of Rs. 2 crore and it can incubate two units at a time for a period of six months to two years.\n\nMedical textiles is growing in the country every year at 13 per cent to 15 per cent. Both, medical and hygiene textiles, are picking up in the country as more hospitals are using disposable products. The centre of excellence here has so far completed 25 projects and three of these products have been commercialised.\n\nIt has also developed standards for medical textiles for the Bureau of Indian Standards.\n\nMr. Vasudevan said the association has tie-ups with some overseas universities for technology and plans more such agreements with universities in Australia, Germany, and Korea.\n\nFocus\n\nSITRA gets non-plan support and plan support (for research and development projects) from the Union Government. It takes up three to five research projects a year. So far, the focus of the association was on the spinning sector. Now it is looking at the other segments – weaving, and processing.\n\n“Just 12 per cent to 13 per cent of our revenue is from government grant. The rest are generated by SITRA. We hope to be self-sustainable in another five years,” he said. Its testing facilities and energy audits are used widely by the industry and there are plans to set up a centre at SIPCOT, Perundurai, to extend technical guidance to textile processing units there.\n\nSITRA has trained 10,000 people in the last three years and plans to impart training to another 25,000 in the next three to four years under the integrated skill development scheme.\n\nDiamond Jubilee celebrations\n\nAccording to D. Krishnamurthy, chairman, council of administration of SITRA, the association’s Diamond Jubilee celebrations will be held on January 22 here. Union Minister for Textiles Santhosh Kumar Gangwar will take part. The association has also organised a CEOs meet on “Prognosticating 2025 – Opportunities and Challenges for the Textile Industry” on the same day.\n\nThe dedicated incubation centre\n\nis set up at a\n\ncost of\n\nRs. 2 crore", 
    "section": "national", 
    "title": "Incubation facility for medical textile sector", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}