{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Aanmeega Jothidam’ by Dr. P.A. Ponniah, Railway Colony, 6.30 p.m.\n\nSri Meenakshi Sundareswarar Temple: Theppa Thiruvizha, eighth-day event, deity procession 9 a.m. and 7 p.m.\n\nSolaimalai Murugan Temple: Thaipusa Thiruvizha, fifth-day event, deity procession, Solaimalai Mandapam, Alagarkoil 10.30 a.m. and 6.30 p.m.\n\nThiruvalluvar Mandram: Discourse on ‘Sekkilar Pillai Tamil,’ by T. Arunachalam, S.S. Colony, 5 p.m.\n\nRamakrishna Math: Aarathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nPaneeru Thirumurai Mandram: Thiruvasagam Mutrodal by M. Balasubramanian, 7 a.m., Thirupugazh Isai, Adi Street, 6 p.m.\n\nGita Bhavanam: 68{+t}{+h}anniversary, 45-day yagna, Kamarajar Salai, 7.30 a.m.\n\nYoung Men’s Brahmins’ Association: Sri Vishnu Sahasranama parayanam and puja, No. 21 Sambandamoorthy Street, 6 p.m.\n\nCULTURE\n\nGandhi Memorial Museum: K.P. Gangadharan, yoga coordinator, conducts, yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nSermathai Vasan College for Women: Meeting on ‘Human rights violation on cyber world,’ by advocate P. Sona Alagesh, conference hall, 2.30 p.m.\n\nE.M. Gopalakrishna Kone Yadava Women’s College: Lecture on ‘Digital communication skills and employability’ by L. Manoj Sitharthan of MKU, Seminar Hall, 2 p.m.\n\nSHEA Immigration Services: Inauguration of new branch, Score High English Academy Madurai branch by Dr. S. Rajaram, Director, Career Guidance Cell, Thiagarajar College of Engineering, MIG 341 4{+t}{+h}floor, Anna Nagar 80 feet road, 9.30 a.m.\n\nLions Club of Madurai North: Annual visit of District Governor S. Ramasubbu, North Indian Welfare Association Hall, 3{+r}{+d}Street, Gomathipuram, 10 a.m. Second zone advisory meeting and inter-club meeting, 12.15 p.m.\n\nAlcoholics Anonymous: Meeting, Dheep Hospital, K. Pudur, 7 p.m.\n\nMELUR\n\nAlcoholics Anonymous: Meeting, A.G. Church, near State Bank, 6.30 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}