{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Under watchful eyes:Police personnel deployed at Sri Ramanathaswamy Temple in Rameswaram on Tuesday ahead of the consecration ceremony scheduled for Wednesday.— Photo: L. Balachandar\n\nPolice threw a massive security cordon, deploying a strong pose of about 1,800 policemen for the ‘mahakumbabishekam’ at the historic Sri Ramanathaswamy temple here on Wednesday as the pilgrim island wore a festive look for the ceremony, being held after 14 years.\n\nTo ensure that the mega event was organised in a peaceful and an orderly manner, the district police, led by Superintendent of Police N. Manivannan, made elaborate security arrangements installing closed circuit television cameras (CCTVs) and watch towers at strategic locations around the temple.\n\nThree Additional Superintendents of Police, 13 Deputy Superintendents of Police (DSPs) and 44 Inspectors of Police have been enlisted to supervise the security arrangements, the SP said adding they would ensure adequate security at the temple, control the crowd, manage the traffic and prevent crime occurrences.\n\nSix companies of Tamil Nadu Special Police, three companies of Armed Reserve Police, five units of Bomb Detection and Disposal Squad and five units of traffic police have been deployed to ensure that there were no untoward incidents during the ceremony, the SP said.\n\nSeven crime teams would be on the move round-the-clock at all places of public congregation to prevent crimes such as pick pocketing and chain snatching, the SP said adding photographs of habitual criminals would be displayed at strategic points to caution the public.\n\nAs large number of devotees and pilgrims were expected to take holy dip at the Agnitheertham seashore, swimmers from the Indian Coast Guard, Indian Navy, Coastal Security Group and Fire and Rescue Services would be stationed at the beach, he said.\n\nSniffer dogs would be pressed into service in the anti-sabotage operation, the SP added.\n\nMeanwhile, the temple authorities said the consecration ceremony would commence with the eighth and final ‘kaala’ puja at 5. 30 a.m.\n\nAfter ‘deepa aradhanai,’ the ‘kadam purapadu’ would take place at 9 a.m. and the much-awaited consecration ceremony would be held between 10. 05 a.m. and 11 a.m., they said.\n\nIn the evening, after the ‘maha abishekam’ at 5 p.m., the celestial wedding of Swamy and Ambal would be held at the newly built Thirukalyana Mandapam near the south entrance at 7 p.m. and the consecration ceremony would draw to a close with the car procession around the four car streets, they said.", 
    "section": "national", 
    "title": "Massive security cordon at Rameswaram", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}