{
    "author": [
        "K Lakshmi"
    ], 
    "text": "It will also provide farmers with weather forecast to help them plan daily agricultural operations\n\nThe Meteorological Department will soon launch two initiatives, one of which is expected to enhance passenger safety at Chennai airport and the other, aimed at providing timely and specific weather forecast for farmers.\n\nThe Airport Meteorological Office (AMO), Meenambakkam, is planning to install a meteorological device on the secondary runway of the airport to facilitate safe landing of flights.\n\nThis device, which is to be installed at the end of the runway, will measure weather parameters like wind direction, speed, temperature and visibility.\n\nP.A.V. Nampoorthiri, director of AMO, said a similar instrument had already been placed on the runway to help safe landing of the flight and provide information on visibility.\n\nThe department is also waiting for Drishti, a sophisticated instrument developed indigenously to assess runway visual range, to be installed at the airport. Drishti will replace an imported device from Australia that is currently in use.\n\nS.B. Thampi, Deputy Director General of Meteorology, Chennai, said Drishti, which was being developed by National Aerospace Laboratories, Bengaluru, would provide inputs on runway visibility and ensure safe landing of flights. The indigenous device is said to be low maintenance.\n\nTo reach out to farmers, the department has recently started offering a free weather forecast service through text messages on mobile phones.\n\nThose who have registered on its website can avail themselves of this service. So far, nearly two lakh farmers from across the State have registered for this agromet service through mobile phones. As of now, farmers receive messages providing information on eight weather parameters, including rainfall, humidity, cloud cover and temperature.\n\nOfficials of the department said the messages were disseminated in the regional language on Tuesdays and Fridays. Farmers get weather forecast for five days through the public-private- partnership initiative.\n\nThey also get to learn about detailed agromet advisory posted online. The information is collated with nine agro meteorology field units and Tamil Nadu Agricultural Units.\n\nFor instance, Madras Veterinary College is the nodal unit to collate information for Chennai and neighbouring districts.\n\nThe advisory provides information to plan daily agricultural operations and effect of weather on specific crops, an official said.", 
    "section": "national", 
    "title": "Met dept. tool to enhance safety at airport", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}