{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Fears of disease outbreaks and epidemics have loomed since the devastating floods in Chennai, but State health authorities have claimed there has been no significant increase or spike in any communicable disease after the floods.\n\nLeptospirosis, an infectious disease that could spread through contaminated food, water and soil (all factors present during and after the floods) for instance, has seen a drop in the number of reported cases in 2015, compared to 2011, said State health secretary J. Radhakrishnan. In 2011, the State saw 3,616 reported cases of leptospirosis, while in 2015, it had actually come down to 1,204 cases, he said. There have been no deaths reported due to leptospirosis in the last six months at least, he said. K. Kolandaisamy, director of Public Health, added that this month, there had been very few cases of leptospirosis reported so far and that all the patients had recovered.\n\nLeptospirosis, according to the World Health Organisation, is an infectious disease caused by pathogenic organisms that are transmitted directly or indirectly from animals to humans. Cattle, buffaloes, horses, goats, pigs, dogs and rodents are some of the common reservoirs of leptospirosis. The disease is mainly found wherever humans come into contact with the urine of infected animals.\n\n“The leptospirosis bacteria is one of the most fragile — it is instantly destroyed in the human body once treated with antibiotics. There is no cause for worry at all,” he said,\n\nMr. Radhakrishnan said Tamil Nadu has a 24x7 fever surveillance programme, which monitors all communicable diseases and the large-scale medical camps held after the floods helped bring down the number of cases. Dr. Kolandaisamy said that apart from clinics and hospitals which reported cases of fever, the State also tracks cases at traditional healers who treat cases of jaundice. “They too have not reported a spike,” he said.\n\nThe State is also well prepared, said Mr. Radhakrishnan, with over one crore capsules of doxycline — effectively used to treat leptospirosis — stocked for use.\n\nAt Rajiv Gandhi Government General Hospital, a tertiary health care and referral centre which treats very ill patients routinely, dean R. Vimala said there had been no deaths due to leptospirosis in 2015. “We make a note every day of the communicable diseases cases and deaths, if any and there have not been any of late,” she said, adding that the hospital sees one or two cases every few weeks, but there has been no rise in the numbers.\n\nHealth authorities say that while residents have no need to panic on this count, they must continue to ensure they drink safe, chlorinated water, and consume hygienic food, avoid walking in stagnant water and frequently wash their hands.\n\nIn case of a fever, residents must not self-medicate but seek help from medical practitioners.\n\nThe Health Secretary said the number of cases of leptospirosis has seen a fall", 
    "section": "national", 
    "title": "No disease outbreak after floods, claim health officials", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}