{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Ramanathapuram gold and silver jewellery merchants’ association staged a candle light agitation, protesting against the Centre’s decision to make PAN card mandatory for gold purchases above Rs. 2 lakh.\n\nIn response to a call given by the Association, about 150 jewellery shop owners in the town lit candles in their shops on Monday evening, urging the Centre to enhance the limit to Rs. 10 lakh as the new regulation seriously affected the sales of gold jewelleries.\n\n“It was more to draw the attention of the Centre about the difficulties faced by the jewellery merchants and express solidarity with the branded players in the trade,” B. Parthiban, Association general secretary said.\n\nThe government order, changing the PAN card regulation, which came into force on January 1 this year, caused practical difficulties as more than 80 per cent of the customers do not have PAN cards. Getting form 60 filled by the customers who do not have PAN cards was all the more difficult as it contained a huge questionnaire, he also said.\n\nThe government which had fixed the limit at Rs. 5 lakh, had lowered it to Rs. 1 lakh and later enhanced it to Rs. 2 lakh following protest, he said adding the merchants would be relieved only if the gold purchase limit was enhanced to Rs. 10 lakh for making PAN cards mandatory.\n\nPointing out that there was a difference between people buying gold jewellery for personal use and those buying gold bars for investment purposes, he said the PAN card regulation on purchase of gold jewellery has hit their sales after it came into force.\n\nThe association presented a memorandum to A. Anwar Raja and urged him to take up the matter with the Centre. It has also given him copies of the memorandum sent to Prime Minister Narendra Modi and Finance Minister Aruj Jaitely in this regard.", 
    "section": "national", 
    "title": "PAN card regulation draws opposition", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}