{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "China further devaluing yuan against dollar a few days back, setting the daily reference rate to the lowest since 2011, has caused jitters among the entrepreneurs in Tirupur knitwear cluster as the trade deficit could possibly widen further.\n\nThe consequent depreciation of the rupee will be deteriorating the export prowess of garment exporters here as production costs goes up and profit margins shrink because the cluster imports large chunk of machinery, raw materials like knitwear printing ink and accessories that provide embellishments to the garments.\n\nThe devaluation of yuan in August primarily contributed to the slide of the rupee from Rs. 63.79 against a dollar during August second week.\n\n“Rupee volatility has been a problem for the last few months. If rupee continues to slide, it can upset the costing of end products as garment orders usually take few months to execute,” said S. Dhananjayan, a trade consultant and chartered accountant.\n\nThe new steep cut in the valuation of yuan will give a further impetus to the garment exports from China as more and more buyers would source the products from there since it could become cheaper.\n\nAlready, China is the leading exporter of textiles and clothing in the world.\n\nExporters here feel that since currency markets could not be controlled, the Union Government should try to help out the exporters by extending export incentives to arrest any further widening of the trade deficit and help them remain competitive.\n\n“Rates of duty drawback and interest subvention can be increased and more sops be given to increase exports to focus markets so as to enable exporters here to increase the market share,” said Raja Shanmugam, an apparel exporter and state committee member of Confederation of Indian Industry.", 
    "section": "national", 
    "title": "Panic among knitwear exporters", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}