{
    "author": [
        "Vasanth Srinivasan"
    ], 
    "text": "Karunanidhi, M.K. Stalin, Dr. Ramadoss and Anbumani are early adopters of social media as a propaganda tool\n\nith Assembly elections just a few months away, major political parties in Tamil Nadu seem to have been bitten by the social media bug.\n\nIt is perhaps the BJP’s resounding victory in the 2014 Parliamentary elections aided in large measure by the slick packaging and delivery of Brand Modi through the social media that has made Facebook, Twitter and WhatsApp an integral part of electioneering.\n\nWhile politicians such as DMK’s Karunanidhi and M.K. Stalin and PMK’s Dr. Ramadoss and Anbumani Ramadoss have been early adopters of social media as a propaganda and outreach tool and are quite active on Facebook and Twitter, even a unconventional politician like DMDK founder Vijayakant is active on Facebook.\n\nBut parties cannot treat social media as just another propaganda tool, says ‘Aspire’ Swaminathan, AIADMK’s IT wing head. “Social media offers tremendous potential for customisation. Only people who understand it well will succeed. For example, we are the only party that has over 5 crore mobile numbers (of people) across the state with the complete profile of the users; and we have about a crore of WhatsApp users,” he claims. “So, if we want to send a message on how many laptops have been distributed in Coimbatore city, we can send it to people in Coimbatore alone. We have always done this ‘guerrilla messaging’. That’s why our social media presence has been subtle yet powerful,” he adds\n\nThe DMK IT wing has managed to keep social media abuzz for months with its coverage of Stalin’s ‘Namakku Namme’ road show.\n\nStrangely the Left parties are yet to tap social media’s full potential. CPM MLA K Balabharathi, who is active on Facebook, acknowledges this but says the party will do everything to reach the people. Political commentator Gnani Sankaran says from the beginning Dravidian parties have been the first to take to the dominant media of the day be it drama, movies or TV. “Therefore, it should not come as a surprise (that they now dominate social media as well). In the case of Left parties, they are not able to make a big impact because of their inability to attract a younger crop of second-line and third-line leaders,” he said.\n\nIt is time that political parties trained all their leaders and cadre on using social media says J. Anbazhagan, DMK MLA. “In my opinion, at least 10% of voters in a constituency are influenced by social media, which will just go up in the coming years. On social media, though I constantly update on party activities, I engage with everyone as I keep holding conversations about things like cinema and sports. Not everyone knows how to do this. But this can be taught,” he says.\n\n‘But parties can't treat social media as another propaganda tool’", 
    "section": "national", 
    "title": "Parties trying to ride social media wave", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}