{
    "author": [
        "L Srikrishna"
    ], 
    "text": "Prices are fixed by farmers themselves and there is no mechanism with any agency to check their correctness, say officials\n\nWeekly shandies or ‘vaara sandais’ are popular among the residents of the city and outskirts. Farmers from Alagarkoil, Alanganallur, Avaniapuram, Kadachanendal and other areas in the district sell their vegetables at locations which give easy access to people.\n\nThough regular visitors to these ‘vaara sandais’ are familiar with the sellers (farmers), they are not sure about the correctness of weights and measures used. However, there is an impression among many buyers that prices are ‘cheap’ in the weekly shandies than in regular markets and vegetable stalls.\n\nAccording to Corporation authorities, there are close to two dozen shandies functioning in the city and peripheries, but the major shandies popular among the consumers are Sunday market at Uchaparambumedu, Monday market at Koodal Nagar, Tuesday markert at Ellis Nagar, etc.\n\nOn an average, 200 to 300 persons come to sell their produce, mainly vegetables and fruits. Local merchants also sell hot ‘bajjis’, potato chips and sugarcane juice at the shandies. A few artisans sell fancy handicraft items and so on. Close to 2,000 persons visit each shandy.\n\nFor Roberts (55) of Ellis Nagar, the shandy has its own advantages and disadvantages. When roads were being laid at Ellis Nagar, the shandy was a big barrier for many residents as the farmers put up their shops on both sides of the roads. However, after the roads were laid and widened, vehicle movement had become easy and the number of farmers putting up shops at the shandy had also gone up, and the shandy had extended up to BSNL office from Tamil Nadu Housing Board office, he noted.\n\nRadhika, a BSNL employee from DSP Nagar, Bypass Road, said that vegetables like onion and carrot were fresh and reasonably priced at the shandy. “It is convenient for me since I buy three or four vegetables once a week and store them in the refrigerator,” she added.\n\nAnother side\n\nHowever, the residents of Rajaji Street in Uchaparambumedu near Iyer Bungalow had a different tale. On Sunday, the market would open at 5 p.m., which meant the farmers would arrive from 2 p.m. The noise and commotion deprived the residents of their post-lunch nap, said Rafiq, who runs a leather business in the city.\n\n“Till about two years ago, the market functioned on the main road, but due to heavy vehicle movement, the farmers have sneaked into our street. The noise pollution is unbearable on Sundays,” he said.\n\nAnother senior citizen of the same street said that Madurai Corporation should not permit sale of eatables on roads. All vegetables were kept open. It was unhygienic since stray dogs and cattle wandered all around and urinated here and there. Since the market was open beyond 6 p.m., the quality of vegetables could not be checked.\n\nOn Konnavayanchalai and Bypass Road, the residents alleged that traffic went for a toss when the markets opened. Already, travel on Bypass Road was risky as vehicle flow was high around 6 p.m. Traffic police at the intersection said that since the pathway was occupied by the farmers for their makeshift shandy, pedestrians had to use the roads. Every week, there were cases of freak accidents due to overcrowding and haphazard parking.\n\nAn official of Corporation Health Department said that the respective sanitary inspectors and teams were entrusted with the task of clearing garbage from the weekly shandies the next day. For instance, a large posse of conservancy workers would be deployed to Uchaparambumedu area on Mondays to clear vegetable wastes which got piled up on both sides of the road, and it applied to other locations as well, she noted.\n\nAgriculture Department officials said that farmers from nearby areas such as Poikaikaraipatti, Kadachanendal, Oomachikulam and parts of Alanganallur brought their produce and sold them here. Prices were fixed by them and there was no mechanism with any agency to check their correctness. The prices would not be certainly lesser than ‘uzhavar sandai’ rates.\n\nAbout a year ago, Labour Department officials, during a raid, found that the weights and measures used in these shandies were not calibrated or those approved by the government. A mere warning was given to the farmers to use electronic scale. The officials did not seize the weights since the farmers pleaded with them to forgive them, an official said.\n\nPolice officers from the respective stations, who used to warn people through mobile public address system to beware of bag lifters and pickpockets till a few months back were not to be seen now, residents of Uchaparambumedu said.\n\nMany residents said that the corporation authorities should study the modalities to regulate the shandies and earmark exclusive space for the farmers. Instead of allowing the farmers to convert roads into makeshift shandies, the officials should provide protected places which would be safe and convenient for the residents, they said.", 
    "section": "national", 
    "title": "Popular weekly shandies need to be regulated", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}