{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘Coldry’ and ‘Matmor’ technologies to be piloted at NLC and NMDC\n\nAshley Moore, MD, ECT, Australia (fourth from left) and P. Selvakumar, Director (Planning & Projects), NLC, sign the MoU. (From left) V. Thangapandian, Director (Power), Rakesh Kumar, Director (Finance), Sarat Kumar Acharya, CMD, NLC, Sean Kelly, Australian Counsel for Southern India, and Glenn Fozard, CMD, ECT, Australia, are in the picture.— Photo: Special Arrangement\n\nPublic Sector Understandings, Neyveli Lignite Corporation (NLC) and National Minerals Development Corporation Limited (NMDC), on Tuesday inked a tripartite agreement with an Australian firm on minimising CO2 emissions while using lignite for generating electricity and steel production.\n\nAustralia’s Environmental Clean Technologies (ECT) Limited signed an agreement with the PSUs at NLC’s corporate office on Tuesday.\n\n“Under the agreement, ECT, NLC and NMDC will jointly build an integrated ‘Coldry’ low-rank coal drying demonstration plant and a ‘Matmor’ pilot iron ore plant as a launch pad for a global commercial rollout of the technology,” an official release from the Australian Consulate in Chennai stated.\n\n‘Coldry’ is a low-cost, low-heat, carbon-neutral drying process, which can reduce the moisture content from 60 per cent to 12 per cent and convert the lignite coal into pellets, making it suitable for high efficiency generation purposes and safe to transport. ‘Matmor’ is a process for producing crude steel using upgraded coal from the Coldry process.\n\nThe project also aims at upgrading some of the Neyveli mine’s 25 million tonne per annum output of low rank coal to support a 2.8GW power station, it said.\n\nThe agreement is a “tangible example” of the scope for Australians to bring their world-class technological innovations to India, adapting technology to suit local requirements and working alongside Indian partners, resonating with Indian Government's ‘Make in India’, Australian Consul-General to South India Sean Kelly was quoted as saying.", 
    "section": "national", 
    "title": "PSUs ink pact with Australian firm on minimising CO2 emissions", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}