{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Candidates from K.V. Kuppam, Katpadi, Arakkonam, Anaicut, Pernambut, Kaniyambadi and Arcot municipalities will be covered today\n\nInterview underway:The process included verification of certificates of applicants. Officials said applicants will be given marks based on a number of parameters.- Photo: C. Venkatachalapathy\n\nThe recruitment process to fill up vacancies in the posts of noon meal organisers in the nutritious meal scheme is underway in the district.\n\nThe district administration has received 6,792 applications for a total of 368 posts.\n\nOfficials said interviews for selection of candidates for the Puratchi Thalaivar MGR Nutritious Meal Programme would be held till January 22.\n\nOn Tuesday, the first day of the interviews, candidates from four blocks – Walajah, Nemili, Kaveripakkam and Arcot, and Vellore Corporation were covered.\n\nThe recruitment process included verification of certificates of the applicants.\n\nOfficials said the applicants will be given marks on a number of parameters. This included women with two girl children, widows and destitutes, and distance of their residence from the anganwadi centre. They should also fulfill certain posting norms,\n\nBooklets to Collector\n\nThe booklets containing the marks awarded to the candidates would be handed over to the Collector.\n\nOfficials said the interviews were being conducted in a transparent manner to avoid any kind of interference, and the bays for verification of certificates and conduct of interviews were barricaded. Only candidates possessing the interview cards were allowed inside.\n\nOn Wednesday, candidates from K.V. Kuppam, Katpadi, Arakkonam, Kaniyambadi, Anaicut, Pernambut, Walajah and Arcot municipalities would be covered.\n\nOn January 21, candidates from several places such as Vellore, Alangayam, Gudiyatham, Thimiri, Madhanur and Gudiyatham Municipality will be interviewed, while those from Jolarpet, Natrampalli, Kandhili, Tirupattur, Ambur Municipality and Vaniyambadi Municipality will attend the interview on January 22.\n\nCollector R. Nanthagopal along with officials inspected the recruitment drive.", 
    "section": "national", 
    "title": "Recruitment on to fill up posts of noon-meal organisers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}