{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "Rehabilitation Centre for Blind Women (RCBW) has expanded its operations in the past year with the installation of a powerloom and two embroidery sewing machines, besides the planned inauguration of a petty shop and eatery on its Mannarpuram premises.\n\nThe weaving unit, which is staffed with both sighted and visually impaired workers, received a large number of orders from relief agencies during the recent floods in Chennai, Mrs. Vimala Moses, honorary superintendent and project director of the centre, told The Hindu . “We were able to send bedsheets, handloom towels, sari petticoats and candles worth Rs. 50,000 through Bishop Heber College and The Hindu ’s relief campaigns,” she said.\n\nThe new loom has the capacity to produce 20-25 double bedspreads in a day. The visually impaired students measure and cut the bedsheets according to the specified requirements from the woven cloth bale, and also pack it for distribution.\n\nThe centre is now looking out for physically challenged workers to operate its nascent embroidery unit. “We would prefer two to three applicants, perhaps those who are already trained in embroidery and sewing. But we can also teach promising candidates ourselves,” said Mrs. Vimala. Applicants with loco-motor, speech and hearing impairments will be considered for the post, she added.\n\nBesides this, the centre’s baked goods section has recently extended the sales of its products like buns, bread, biscuits and puffs among local educational institutions. “We are planning to open a small eatery next to our store, to serve customers from the nearby offices as also visitors to our campus,” said Mrs. Vimala.\n\nBulk orders for private occasions are also undertaken by the home.\n\nEstablished on July 14, 1975 by noted ophthalmologist and philanthropist Dr. Joseph Gnanadickam (founder of Joseph Eye Hospital), the centre trains visually-impaired women in the age group of 18-35 years for professional work.\n\nDetails on the embroidery unit posts may be had from 0431-2422121.", 
    "section": "national", 
    "title": "Rehabilitation centre expands operations", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}