{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Nadigar Sangam president Nasser said representatives of the Tamil film industry will meet Tamil Nadu Chief Minister Jayalalithaa and urge her to expedite release of the seven convicts in Rajiv Gandhi assassination case at a press conference on Monday.\n\n“We are planning to take out a rally in support of the prisoners who have been languishing in jail for the last 25 years. In the centenary year of MGR, we hope the government will show a way for them,” said Nasser, president of Nadigar Sangam.\n\nAsked why the Nadigar Sangam has taken up this issue now, he said, “We also worked during the floods. The issue of the release of seven prisoners is not a political cause at all.”\n\nDirector R.K. Selvamani said the rally will also aim to raise consciousness amongst political class, who, he said, have misread the recent Supreme Court judgement in the case. “We want to highlight the fact that the judgement which prevented the release of the killers underlines that the constitutional powers remain with the State.”.\n\nNoted lyricist Thamarai, who represented the lyricists, said that the idea of punishment must be to reform the convicts and not about making them pay for their act.\n\n“In this case, all seven of them have had unblemished records as prisoners and from a purely humanitarian point of view, they must be released. They have spent almost their entire lives in prison and that’s a lot of time,” she said.\n\nActor Nasser was joined by representatives of other unions and associations.\n\nWhile they said that they are waiting to hear back from chief minister’s office, actor Nasser said that they are taking out a rally so that people of Tamil Nadu will understand the humanitarian side of the demand.\n\nAsked if they would meet the BJP leaders to facilitate smooth release, the office bearers declined to commit.", 
    "section": "national", 
    "title": "Release Rajiv case convicts: Nadigar Sangam", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}