{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Superintendent of Police J.Loganathan (second right)}, Collector K.Vivekanandan (centre) and actor Mayilsamy (right) felicitating the winners of contests in Dharmapuri on Tuesday. (Right) The police distributing sweets to riders wearing helmets in Krishnagiri on Tuesday. —Photos: Special Arrangement and N.Bashkaran\n\nWinners of various contests held in this connection were given prizes\n\nThe 27th Road Safety Week was marked with zest here on Tuesday with focus on the strides made in the helmet rule enforcement with the participation of the public.\n\nSix months ago, when the Madras High Court made it mandatory for two-wheeler riders to wear helmets, the onus of enforcement was laid upon the district police.\n\nIn 2015, the total number of cases registered for helmet rule violation was 52,728. Of these, 44,547 cases were registered from June. The number of cases registered for other traffic violations was 61,189. Of these, 53,008 cases were registered since June, after the helmet rule. The local police had adopted a carrot and stick approach towards its enforcement.\n\nBesides the penalty-based enforcement, the district police had resorted to a novel initiative of contests to engage the youth that constituted the majority of two-wheeler riders. Short film and selfie with helmet contests were conceived to bring on board the public in general and youth in particular.\n\nOn Tuesday, the police had invited the participation of school and college students by way of road safety exhibits in 20 stalls.\n\nOver 3,500 students participated, and the stalls highlighted various aspects of road safety, including hazards of drunken driving, and driving while talking on cell phones, said J. Loganathan, Superintendent of Police, Dharmapuri.\n\nOf the 9 short films received for the contest on wearing helmets, B.Ananthamurthy, of Akila Garden, Bagalur road, Krishnagiri, won the first prize, Tamizharasan, II year student of English, Don Bosco College, Dharmapuri, the second prize and P.Ramadoss, Chinnapuliampatty, Krishnagiri, won the third prize.\n\nSimilarly, for selfie with helmet contest, 12 entries were received and P.Nirosha of Periya Soragai, Mettur taluk, Salem, won the first prize, V.Dandapani, Elakyampatti, Dharmapuri, came second and S.Rajan of Senthil Nagar, Dharmapuri, got the third prize.\n\nHowever, participation to this extent was not expected. Hence, the contests may once again be opened up if more entries keep coming, the SP added.\n\nFilm actor Mayilsamy participated in the function at the special invite of the district police. IG –West Zone C. Sridhar also took part. Winners of the drawing and painting competitions on road safety held last week were also felicitated.", 
    "section": "national", 
    "title": "Road Safety Week observed", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}