{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "It will help residents of areas newly added to Coimbatore Corporation\n\nResidents of new areas added to Coimbatore Corporation have a good news. The Union Government has sanctioned the water supply improvement project under the AMRUT (Atal Mission for Rejuvenation and Urban Transformation) scheme.\n\nAccording to Corporation Commissioner K. Vijayakarthikeyan, the Centre has sanctioned the Rs.-395 crore project that is aimed at improving water supply to residents of Kurichi, Kuniamuthur, Thudiyalur, Vellakinaru, Chinna Vedampatti, Saravanampatti, Vilankurichi, and Kalapatti.\n\nAt present these areas get water at around 60 litres per capita a day. They are supposed to get 135 litres per capita a day according to a Ministry of Urban Development norm.\n\nMr. Vijayakarthikeyan says that the Union Government will contribute one-third of the project cost. The rest will be borne by the State Government, and the civic body.\n\nProject Engineer K. Gnanavel says that using the money the corporation plans to revamp the water distribution network. The corporation will construct three master service reservoirs, 46 tanks, and lay pipelines for over 1,000 km across these areas.\n\nThe new pipelines will be bigger than the existing ones to carry more water. The new tanks will ensure equitable distribution of water.\n\nOf the 1,000 km pipeline, the corporation will replace pipelines for over 600 km. New pipelines will be laid to cover residential colonies that did not have piped water supply connection.\n\nThe scheme will benefit 5.30 lakh people in these areas, and meet their water requirement till 2048.\n\nMr. Vijayakarthikeyan says that the civic body proposes to implement the project in three stages by taking up the work in Kurichi, and Kuniamuthur in the first phase. These area gets water primarily from River Aliyar, and tanks that store Siruvani and Pilloor water.\n\nIn the next phase, the corporation will execute the work in Thudiyalur, Chinna Vedampatti, Vellakinaru, and Saravanampatti.\n\nIn the third phase Vilankurichi, and Kalapatti will be taken up.\n\nMr. Gnanavel says that the State Government has already sanctioned Rs. 103 crore to revamp the distribution network at Kavundampalayam, Vadavalli, and Veerakeralam.", 
    "section": "national", 
    "title": "Rs.-395 crore water supply project approved by Centre", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}