{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Modi to lay foundation for Colachel Port Project by March 8: Nitin Gadkari\n\nUnion Minister for Road Transport and Shipping Nitin Gadkari (middle) laying the foundation for four-lane projects at Marthandam in Kanyakumari district on Tuesday.— Photo: A. SHAIKMOHIDEEN\n\nThe Centre had sanctioned Rs. 50,000 crore for infrastructure projects in the State, said Union Minister of Road Transport, Highways and Shipping Nitin Gadkari.\n\nLaying foundation stone for three four-lane National Highways projects in Kanyakumari, Tirunelveli and Tirupur districts and two flyovers in Marthandam and Parvathipuram, at a total estimated cost of Rs. 2766 crore, in Marthandam, Mr. Gadkari said that Prime Minister Narendra Modi would lay the foundation for Colachal Port Project before March 8, along with Chief Minister Jayalalithaa.\n\nHe said that 39 NH projects, covering a total distance of 1,974 km at an estimated cost of Rs. 12,000 crore, were in progress, and Rs. 12,500 crore had been sanctioned for nine new NH projects to cover a distance of 1,300 km in the State.\n\nThe Minister said that the Centre had sanctioned infrastructure projects worth Rs. 33,000 crore in the State, which included upgradation of eight State Highways into National Highways at an estimated cost of Rs. 7,000 crore, construction of four bridges in Ozhigunesari, Vadaseri, Thuckalay and Chettikulam in Kanyakumari district (Rs. 300 crore), 11 ROBs (Rs. 500 crore) and two major bridges (Rs. 550 crore).\n\nHe said that he had sanctioned an additional amount of Rs. 17,000 crore for undertaking infrastructure projects at the discretion of Union Minister of State for Road Transport, Highways and Shipping Pon. Radhakrishnan. The new National Highways works launched by Mr. Gadkari were: Karaikudi–Pattukkottai–Thanjavur stretch (70 km); Perambalur–Attur (55 km); Salem–Uthangarai–Tirupathur (141 km) Tiruvannamalai–Kallakkurichi (65 km); Thoppur–Mettur–Bhavani–Erode (85 km); Sivilliputhur–Sivakasi–Virudhunagar – Tiruchuzhi – Parthipanoor (105 km); Dindigul–Karaikkudi (109 km) and Valliyoor–Tiruchendur (70 km). Presiding over the function, Mr. Radhakrishnan said that construction of a flyover in Marthandam would take off to ease traffic congestion on Thiruvananthapuram NH.\n\nAbout 40 shops had downed their shutters protesting against the flyover construction in response to a call given by Marthandam Chamber of Commerce and Industry.\n\nRajeev Ranjan, Principal Secretary, Highways and Major Ports, said that the State would extend its cooperation to the Centre for undertaking infrastructure projects.\n\nAlok Dipankar, Chief General Manager, National Highways Authority of India, welcomed the gathering. Chenna Reddy, Regional Officer, NHAI, proposed a vote of thanks.", 
    "section": "national", 
    "title": "“Rs. 50,000 cr. sanctioned for TN infrastructure projects”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}