{
    "author": [
        "Special Correspondent"
    ], 
    "text": "About 900 family members of Nagarathars, the dominant local community congregated in this nondescript village and celebrated ‘Sevvai Pongal,’ the traditional Pongal festival, organised on the first Tuesday of the Tamil month ‘Thai.’\n\nThough a majority of Nagarathars have moved out of the village and settled in different parts of the country and the world, they converged here on Tuesday following the nearly century-long tradition and offered worship at the 18th century Kannathal Temple, famously known as Kannudaya Nayagi Amman temple.\n\nThe Nagarathars also used the occasion to meet their relatives and finalise marriage proposals of their wards. Every year the 20 ‘vagayaras’ of Nagarathars assembled to celebrate ‘Sevvai Pongal’ and meet their relatives at this place.\n\nThis year, the first slot for making Pongal was given to Lakshmanan by a draw of lots. As per the tradition, the family, after a special puja at the temple, cooked Pongal, a rice delicacy in a mud pot followed by others. The family was also given the first honour in the temple. The committee had allotted 900 slots this year, one more than last year.\n\nThe slots were allotted to the families by draw of lots and they were issued tokens in advance to avoid confusion. The festival began at 5. 30 p.m. and went on till late in the evening. Other community people living in the village and surrounding villages were also allowed to take part in the festival but they were allotted slots outside the main arena.\n\nThe District Tourism department had brought about 15 foreign tourists from Germany, Italy and France to witness the Pongal celebration and cultural events. The tourists came in a bullock cart and mingled freely with the local people. The local town panchayat had made arrangements for the festival and provided basic amenities for the visiting Nagarathars.\n\nTown panchayat Chairman Muruganandam, Executive Officer Balasubramanian and Tourism Officer Jayakumar were among others who participated in the festivities. The district police had made elaborate security arrangements.", 
    "section": "national", 
    "title": "‘Sevvai Pongal’ draws Nagarathar families and foreign tourists", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}