{
    "author": [
        "D Madhavan", 
        "B Kolappan"
    ], 
    "text": "The Siva Linga with an early Brahmi inscription found at Nandeshwar temple at Netrumpakkam in Kancheepuram district.\n\nA Siva Linga with an early Brahmi inscription dating back to the first century AD has been found in Nandeshwar temple at Netrumpakkam village in Maduranthakam taluk in Kancheepuram district.\n\nIt could be the oldest Siva Linga in Tamil Nadu. The oldest Siva Linga in the country is in Gudimallum near Tirupati. An old Sivalinga with inscription is in Mathura.\n\nArchaeologist R Nagaswamy said Netrumpakkam itself was very old and the presence of a granite stone belonging to the megalithic period confirmed its antiquity.\n\nAn idol of Durga worshipped as Ponniamman belonging to the Pallava period was unearthed, he said.\n\nThe lingam was found during renovation for the kumbabishekem (consecration) of a temple to be held in January 20. Panchayat president K. Prema Krishnamurthy immediately alerted the archaeologists.\n\nMr. Nagaswamy, who visited the temple on Monday, said the lingam with a square shaped Avudai had an inscription at the bottom reading CE N DA MAAN “Five lotuses were drawn with the middle flower blooming,” he said.\n\nT.G. Loganathan, epigraphist of the State Archaeology Department, said the word might be a name of a sculptor.\n\n“More research will throw light on the subject,” said Mr. Loganathan who along with G. Arjunan, former deputy superintendent archaeologist of the Department, Loganathan decoded the inscription in the Lingam after visiting the Shiva temple.\n\nAs per archaeological records, the inscription at the Sri Kailasanathan temple on ECR belonged to 9{+t}{+h}century.\n\nThe inscription at Nandeshwar temple pushes the Tamil-Brahmi script in Tamil Nadu to a very early period. “The finding of the inscription is significant because it takes the origin of Tamil–Brahmi script in Tamil Nadu several centuries earlier than it was believed so far,” said K. Sridharan, former deputy director, Tamil Nadu Archaeology Department.\n\nArchaeologists had found Tamil–Brahmi inscriptions on bedrocks near caves where Jain monks had settled. Some of the noted Jain settlements are Kongarpuliyankulam in Madurai, Arunkulam near Tirutani in Tiruvallur district, Onambakkam and Perumbakkam in Kancheepuram district.\n\nArchaeologists\n\nsay it could\n\nbe the\n\noldest lingam\n\nin State", 
    "section": "national", 
    "title": "Siva Linga with early Brahmi inscription found", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}