{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "The four ‘rajagopurams’ presented a glistening look, marking the culmination of more than a year-long renovation works as the Sri Ramanathaswamy Temple here got a facelift for ‘Maha Kumbabishekam’ on Wednesday.\n\nThe consecration ceremony, held after 14 years, assumed significance as two new gopurams have been built, adding grandeur to the temple. The temple did not have gopurams at the southern and the northern entrances for several centuries, and the Sringeri Sharada Peetham, which has the ecclesiastical jurisdiction over the temple, built the towers last year.\n\nThis is the second Maha Kumbabishekam — the first one was performed in February 2001. The Maha Kumbabishekams were preceded by three Astabandana Kumbabishekams performed in 1925, 1947 and 1975.\n\nBesides a five-tier 91-foot-tall rajagopuram at the southern entrance, the Sharada Peetham has also constructed full granite mangalagopuram in front of Amman Sannadhi. The rajagopuram at the northern entrance was built by Karpagam College of Engineering.\n\nFor several centuries, the temple had only two towers – the 126-foot-tall nine-tier rajagopuram on the eastern side, and the 76-foot-tall five-tier gopuram at the western entrance.\n\nThe temple authorities have now given a fresh coat of paint for the world famous third corridor, water jet washing at Swamy and Ambal sannadhis in the first corridor and renovated all the 18 ‘vimanams’.\n\nAccording to the temple’s official site, ALAR family of Devakottai had begun the construction of the imposing eastern tower in 1897 and completed it in 1904. The family renovated the sanctum sanctorum and ‘prakara’ (the inner corridor) between 1907 and 1925, replacing the lime stones with black granite and performed Ashtabandana Kumbabishekam in 1925.\n\nRameswaram temple is one of the 12 auspicious ‘jyotirlinga’ sites and four holiest places. The temple has 22 holy theerthams inside the precincts. No pilgrimage would be complete for the Hindus without touching this historic island.\n\nThe temple in the present shape was constructed by Kizhavan Sethupathy, the King of Ramanathapuram during the 17th century.\n\nThe Jaffna Kings of Sethupathy dynasty had also made significant contributions to building the temple. The temple still has a bell donated by the King of Nepal.", 
    "section": "national", 
    "title": "Temple glistens with two new gopurams", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}