{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Textile processors in the district have been encouraged by the Tamil Nadu Pollution Control Board to establish Common Effluent Treatment Plants with promise of 75 per cent funding from Central and State Governments.\n\nThe Central Government has assured to provide 50 per cent funding and the State Government 25 per cent. The rest of the amount must be invested by the units themselves.\n\nThe Rs. 700 crore CETP project for Erode, Karur, Salem and Tirpur districts to be executed by Tamil Nadu Water Investment Corporation must be optimally utilised by the textile units, State Environment Minister Thoppu N.D. Venkatachalam said at a meeting with processors on Monday.\n\nThe technicalities for establishing a CETP at B.P. Agraharam in Erode were analysed during the meeting. On its part, the Erode Textile Processors Association has sought interest-free loan for establishing the proposed CETP.\n\nThe association already has in its possession a 22-acre site for the purpose, against the requirement of just six acres.\n\nAccording to the association president K.S. Thennarasu, there was no cause for any fear of pollution since the about 400 dyeing, bleaching and printing units that were already equipped with Effluent Treatment Plants and Reverse Osmosis systems would get only the sludge treated at the CETP.\n\nThe proposed facility will only handle solid waste, he said, after a petition was submitted to the Minister by PMK State Deputy General Secretary P.V. Arumugam opposing the location for CETP. Mr. Arumugam had expressed apprehensions over contamination of groundwater in the vicinity of River Cauvery.\n\nThe proposed CETP, warranting Rs. 370 crore expenditure, is likely to be established in two phases. In the first phase, bigger units will together see through formation of a CETP at a cost of Rs. 170 crore. The smaller companies will have another such facility in the second phase.\n\nDue to scattered location of the units, officials advised the industries to transport sludge from their units to the proposed CETP through tanker lorries.\n\nOfficials informed that proposals have already been sent to the Government for approval of CETP sites proposed for the clusters in Bhavani, Perundurai and Chennimalai.", 
    "section": "national", 
    "title": "Textile processors encouraged to participate in CETP project", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}