{
    "author": [
        "Staff Reporter"
    ], 
    "text": "When there is no proper road in Thoothukudi how road safety could be stressed in a week-long programme every year, wonder many residents of the city.\n\nRoad users were irked by the inaction of Thoothukudi Corporation authorities as several city roads were awfully bad, M. Ravichandran, a local resident, said here on Tuesday.\n\nVehicle users had been facing hardship while taking Palayamkotai Road, WGC Road, Victoria Extension Road, George Road, Tiruchendur Road and several other roads leading to residential localities.\n\nG. Moses, another resident, said that sand and stones were dumped indiscriminately as a temporary remedial measure on George Road. Vehicle users were also being exposed to unsettled dust on roads that caused respiratory ailments, K. Manimaran, a resident of George Road, said.\n\nMany two-wheelers skidded off Victoria Extension Road and George Road due to the stones left uncovered in recent times, S. Muthukani of Bryant Nagar, said.\n\nEven after the residents staged a hunger strike and demonstrations demanding the corporation authorities to relay roads, nothing happened, M.S. Muthu, district secretary, Democratic Youth Federation of India (DYFI), said.\n\nM. Krishnamurthy, an environmentalist, said that already Thoothukudi had been plagued with air pollution caused by industries. Now with the poor condition of roads, the people had also been exposed to vehicular smoke. The district administration in August last year announced that an air quality monitoring station would be established in the city, but it did not materialise, he added.\n\nRegional Transport Officer K. Anand told The Hindu on Tuesday that 26 accident “black spots” had been identified in Thoothukudi, Srivaikuntam and Ottapidaram, and a proposal for rectifying them with required infrastructure was submitted to Collector M. Ravikumar on the direction of Transport Commissioner Satyabrata Sahoo.\n\nThoothukudi Corporation Commissioner R. Poongodi Arumaikan said that Victoria Extension Road was being relaid and George Road was maintained by Highways Department.", 
    "section": "national", 
    "title": "Thoothukudi roads are still in bad condition, say residents", 
    "subsection": "tamilnadu", 
    "date": "2016-01-20"
}