{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Fifteen Dalit Christians belonging to five families were ‘re-converted’ to Hinduism at a ‘ghar wapsi’ (homecoming) ceremony near Latheri, Katpadi on Tuesday evening.\n\nThe ceremony, organised by Hindu Munnani, Vellore, was conducted at an Amman temple in Chengimottur.\n\nResidents of Adi Dravidar Colony\n\nThe five families were residents of the Adi Dravidar Colony, Chengimottur, Latheri. The families were primarily involved in agriculture.\n\n“This is the first ‘ghar wapsi’ ceremony to be organised in Vellore district. These persons had converted to Christianity nearly eight to 10 years ago. They were re-converted to Hinduism during the ceremony,” said K. Magesh, zonal president, Hindu Munnani, Vellore.\n\nHe disclosed that Hindu Munnani’s branch committee in the area had got in touch with the family members and spoke to them about returning to their “mother” religion. “They also expressed the desire to return to Hinduism. So, we arranged a ritual that was attended by several villagers,” he said.\n\nHindu Munnani’s State organiser K. Bhaktavachalam was present on the occasion.\n\nThe organisation plans to organise more such events across the district.\n\n“We will be going back to the same village as hundreds of them had been converted several years ago. We will organise the rituals in various parts of the district to bring back people to Hinduism,” he added.\n\nMr. Magesh said,“Many are volunteering for re-conversion, while we are also approaching persons who had converted from Hinduism. We had not conducted ‘ghar wapsi’ ceremonies earlier as it caused too much of political controversy,” he said.\n\nHindu Munnani plans to re-convert more persons at Latheri in Katpadi", 
    "section": "national", 
    "title": "15 Dalit Christians ‘re-converted’ in ‘ghar wapsi’ ceremony", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}