{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The number of voters in Kanyakumari district rose to 15,28,516 with the addition of 33,846 voters from September last, said Collector Sajjansingh R. Chavan here on Wednesday.\n\nA total of 33,846 new voters, including 18,241 women and 12 transgenders, were enrolled in Kanyakumari district since September 15, 2015.\n\nReleasing the final electoral rolls at the Collectorate, he said 4,199 voters, including 1985 women, were deleted from the list.\n\nAs per the final voters’ list, the total number of voters in the district has increased to 15,28,516 including 7,64,427 men, 7,63,970 women and 119 transgenders.\n\nNumber of voters in each of the assembly constituencies in the district is: Kanyakumari 2,81,262 (1,40,934 women, 1,40,291 men and 37 transgender); Nagercoil – 2,63,106 (1,32,994 women, 1,30,100 men and 12 transgender); Colachel – 2,60,607 (1,28,281 women, 1,32,311 men and transgender 15); Padmanabhapuram – 2,33,736 (1,15,449 women, 1,18,270 men and transgender 17); Vilavancode – 2,40,547 (1,22,192 women, 1,18,335 men and 20 transgender) and Killiyoor – 2,49,258 (women 1,24,120, men 1,25,120 and transgender 18).\n\nThe highest number of 7,523 voters was included in Kanyakumari constituency and the highest number 1,381 voters were deleted in Padmanabhapuram constituency.\n\nElectors’ Photo Identity Cards printed in colour will be issued to those who had completed 18 years of age through booth-level officers. Those who would complete 18 years on January 1, 2016 should include their names by submitting Form 6. The final voters’ list released on Wednesday was displayed at the office of the Revenue Divisional Officers in Nagercoil and Padmanabhapuram, Commissioners of Municipalities, Offices of the Tahsildhars and the respective polling booths for public view, Mr. Singh said.\n\nHe said that special enrolment camps would be held on January 31 and February 6 in all the polling booths. Those who want to enrol and delete names can apply in respective forms.\n\nCorrections can be done through online also in the election commission website and voters can check their name and address by sending SMS to 1950, he added.\n\nA. Udhayakumar, District Revenue Officer, Nagercoil Revenue Divisional Officer S. Madhiyazhagan, Padmanabhapuram Sub Collector Shreya P. Singh and respective tahsildhars were present.\n\nOn behalf of political parties Leenus Raj of DMK, M. Chandran of AIADMK, Kannan of CPI (M), Selvakumar of Congress, Krishnan of BJP, Varghese of DMDK among others were also present while the draft rolls were released.", 
    "section": "national", 
    "title": "15.29 lakh voters in Kanyakumari district", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}