{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The final number of voters in Erode district is 1,81,954, after inclusions and deletions, accounting for a net increase by 13,504 voters as against the list in the draft rolls.\n\nWomen voters (9,16,782) outnumber males (8,96,060). There are 112 transgenders. Altogether, there have been 49,483 inclusions and 35,979 deletions made to the draft rolls with 1,79,9450 voters.\n\nOf the eight Assembly segements, the largest number of voters are in Erode (West) – 2,55,003, followed by Gobichettipalayam – 2,41,198, Bhavanisagar (SC) – 2,37,600, Bhavani – 2,25,945, Modakurichi – 2,21,957, Erode (East) – 2,14,592, Perundurai – 2,10,871, and Anthiyur – 2,05,788.\n\nThe final rolls will be displayed at the offices of Revenue Divisional Officers, Municipality Commissioners, taluk offices, and polling booths. New voters can apply for inclusion at the specified polling booths from January 21 onwards, said District Collector S. Prabakar after releasing the final voter list in the presence of District Revenue Officer R. Satheesh and other senior officials.\n\nDuring the special camps slated for January 31 and February 6, form - 6 (inclusion), form - 7 (deletion), form - 8 (correction) and form 8A (address change) could be obtained from Booth Level Officers, the Collector said.\n\nThe Collector exhorted new applicants of voter identity cards, and those intending to make changes to names to avail themselves of the utility of Easy Apps, for registration of details on online platform.\n\nThe software used by the Election Commission of India prevents duplication of voter details.\n\nInitiatives would be taken to enrol gypsy community members in Bhavani, Anthiyur, Modakurichi, Kodumudi and VOC Park areas in the voter list, the Collector said.", 
    "section": "national", 
    "title": "1,81,954 voters in Erode district", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}