{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Another 83,872 voters have been added to the electoral roll of Vellore district. This constitutes 39,713 men, 43,872 women and 11 transgender, taking the total number to 30,13,042.\n\nOn Wednesday, the final roll of the Special Summary Revision of electoral rolls was published at the Collector’s office. Women voters continue to outnumber men voters. With new voters added to the list, there are now a total of 14,88,256 men, 15,24,721 women and 65 transgenders in the 13 constituencies of the district.\n\nGudiyatham (reserved) constituency has the highest number of voters with 2,60,612 – 1,28,632 men and 1,31,980 women. It is followed by Sholinghur constituency with 2,54,526 voters. Kilvaithinankuppam (reserved) constituency has the lowest number of voters with 2,04,300.\n\nSholinghur constituency has the highest number of new voters added to the electoral list following the Special Summary Revision. A total of 4,002 men and 4,811 women have been newly added.\n\nThe draft electoral list with photographs of voters was published on September 15 last year. There were 14,58,935 men, 14,89,692 women and 53 transgenders in this electoral roll. This took the total voter count to 29,48,680 in the 13 Assembly constituencies of Vellore district.\n\nThis draft list was put up constituency-wise at 3,439 polling centres, taluk offices and revenue divisional offices from September 15 to October 24, 2015. Public verified their names, photographs, residential address, father/husband names and age on the list.\n\nApplications were received from those who had completed 18 years with January 1, 2016 as qualifying date for inclusion in the electoral roll. Special camps were organised to receive these applications.\n\nA total of 88,035 persons had applied for inclusion in the roll, while 12,801 persons had applied for correction in name, age and photograph, and another 4,709 persons applied for change in address. Another 1,799 applications were received for deletion of names in cases of death/change of place. These applications were scrutinised and the electoral list has been published now.\n\nThis electoral list will be displayed at the respective constituencies at 3,439 polling centres, taluk offices and revenue divisional offices for public view. Public can check the list for their names. In case, their names have not been included, they can submit applications from today. Special camps are also being organised on January 31 and February 6 at 1,645 centres in the district, Collector R. Nanthagopal said in a press release.\n\nThe Collector released the electoral roll in the presence of District Revenue Officer K. Manivannan and Election Tahsildar T. Sreeram.", 
    "section": "national", 
    "title": "83,872 voters added to the electoral rolls", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}