{
    "author": [
        "S Poorvaja"
    ], 
    "text": "CHENNAI: With less than two months to go for the Class 12 Central Board of Secondary Education (CBSE) and State Board final exams, students are into hectic preparation, which includes getting ready for pre-board examinations.\n\nFor the state board students, the half-yearly examinations, which are under way, serve as the first round of revision that tests them on the entire portions in all subjects.\n\n“The half-yearly examinations were originally scheduled to take place before the school shut for Christmas holidays, but were postponed due to the long holidays resulting from the rains and the resultant flooding. Despite the shift, we were given short tests ahead of the half-yearly examinations which have helped us revise,” said Nitika, a student from the city.\n\nThe board examinations for the Class 12 CBSE Students begins on March 1 and March 4 for the State board students.\n\nHectic schedule\n\nWhile State board students have their pre-board examinations, which begin from the first week of February, the schedule given to them is a cause for concern.\n\n“We understand that the schedule has to be kept tight to accommodate practical examinations for the science students before the end of February. But having the physics and chemistry papers back to back will put a lot of pressure on us,” a student observed and said that since it was only an optional examination, he might choose to skip it.\n\nPre-board for a few CBSE Clusters\n\nFor students of the CBSE Stream, a few of the CBSE clusters conduct pre-board examinations such as the Chennai Sahodaya Schools Complex (CSSC) cluster, which have their pre-board examinations from Wednesday. Exams will be conducted across all the member schools. Shweta, a class 12 science student from a CBSE school said that her school had cut down on the number of revision examinations to ensure that the students had adequate time to study.", 
    "section": "national", 
    "title": "A hectic pre-board schedule looms ahead", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}