{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Special pujas, aradhanas performed to main deities\n\nHOLY EVENT:A large number of devotees witnessing the mahakumbabishekam of Sri Abirami Amman Temple in Dindigul on Wednesday.— PHOTO: G. Karthikeyan\n\nThousands of devotees witnessed ‘mahakumbabishekam’ of Sri Abirami Amman Temple here on Wednesday.\n\nThe ceremony began with Vigneswara puja, followed by punyahavajanam. After sixth ‘kaala puja’, a team of gurukkals, led by K. Raja Bhattar and R. Selvam Bhattar, took the kalasams containing the holy water to the main gopuram and vimanams of the main deities and to all Parivaramurthis. During Kumbha lagnam, the mahakumbabishekam was performed to the rajagopuram and all vimanams.\n\nThe kumbabishekam was performed simultaneously to the sannadhis of Sri Siddhivinayagar, Sri Kannimoolaganapathi, Sri Somaskandar, Sri Mahalakshmi, Sri Varadharaja Perumal, Sri Gnanadhandayuthapani, Sri Shanmuganathar, Sri Dhakshinamurthy, Sri Durga, Sri Natarajar, Ambal Palliyarai, Sri Chandigeswarar, Sri Bairavar, Navagrahas, Sri Siva Surian and Sri Siva Chandran and 63 Nayanmargal and dwajasthamba mandapam.\n\nLater, special pujas and aradhanas were performed to the main deities. The temple roof, all streets around the temple, and rooftop and terrace of almost all multi-storey buildings and houses around the temple were filled with devotees.\n\nDevotees sat in Sannadhi Street on the eastern side. Around 1,500 VIPs were allowed to go to the roof of the temple.\n\nEntry into the temple was restricted for others. The entire temple complex was brought under a security blanket. Annadhanam was arranged on St. Mary’s Higher Secondary School campus.Traffic closed\n\nCorporation Road between Periyar statue and Clock Tower, RS Road, Main Bazaar Road between Sri Kottai Mariamman Temple and Clock Tower, and Sannadhi streets were closed for traffic. Schools were closed. Shops on these roads were also closed till afternoon.\n\nSufficient police force was deployed to regulate the crowd, which was restricted at various points to scale down rush around the temple.\n\nHigh-powered sprinklers were installed on all roads around the temple and on Main Bazaar Road to spray the holy water on devotees after the kumbabishekam.", 
    "section": "national", 
    "title": "Abirami Amman temple consecrated", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}