{
    "author": [
        "Annie Philip"
    ], 
    "text": "Bengaluru-based Our Theatre to present the play at Adishakti\n\nA scene from the play, 'Bhima,' by Bengaluru-based Our Theatre, which will be staged at Adishakti near Puducherry.— PHOTO: Special arrangement\n\nBhima from Mahabharata meets ancient Kerala theatre form Koodiyattam in a play to be performed by Bengaluru-based Our Theatre at Adishakti theatre on Saturday.\n\n‘Bhima’ which has been conceived and will be performed by Vivek Vijayakumaran, has music by Sachin Gurjale, who is also a co-performer. The play is a result of a project where Mr. Vijayakumaran undertook training in Koodiyattam in 2012. The experiment explores how an urban contemporary actor can train in a classical form like Koodiyattam to innovate and ‘find a language of expression that is not divorced from the urban’.\n\nWhile Koodiyattam is a form where the essence comes from mythological stories, the play attempts to marry the ideas of Bhima’s story with the theatre form.\n\nThe play will look at the ideas of ‘passion, belonging and individual liberty’ through the character of Bhima, the second of the Pandavas, who is often referred to as the middle one.\n\n“The idea is to keep the essence of Koodiyattam but not be imitative. It is to keep the soul of the form and not the body,” says Mr. Vijayakumaran.\n\nAs such, Koodiyattam is extremely codified, comprising mudras and to showcase the Sanskrit theatre form through the play of ‘Bhima’ makes it more accessible, says Mr. Vijayakumaran.\n\n‘Bhima’ will be largely non-verbal and will use English where necessary.\n\nWhile working with English posed its own challenges, the language was most appropriate for the theatre director-actor and his collaborators, says Mr. Vijayakumaran.\n\nThe play is being supported by The New Voices Arts Project and Shoonya – A Centre for Arts and Somatic Practices.\n\nIt made its premiere in April 2015 and has been performed in Bengaluru and New Delhi. It will travel to Chennai and Colombo this year.\n\n‘Bhima’ will be performed at Sir Ratan Tata Koothukovil at Adishakti campus on Edayanchavady Road near Auroville on January 23 at 7 p.m.\n\nThe play will be largely non-verbal and will use\n\nEnglish where necessary", 
    "section": "national", 
    "title": "‘Bhima’ to be presented in Koodiyattam style", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}