{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Charges were framed against three youth who allegedly murdered a powerloom unit owner and his daughter at Sulur on December 24, 2014. The trio was booked under sections 449 (house-trespass to commit an offence), two counts of 307 (attempt to murder) and two counts of 302 (murder) read with 34 (acts by persons in furtherance of common intention) of the Indian Penal Code.\n\nCopies of the charge-sheets were handed over to the accused A. Udhayakumar (20) and S. Paraman alias Paramasivam (24), of Nanguneri in Tirunelveli district, and M. Syed Abdul Kadhar (24), of Sivagiri in Tirunelveli district, at the Special Court for Bomb Blast Cases here, on Wednesday.\n\nAccording to the police, K. Raakiappan (55), of Kumarapalayam near Sulur, owned a powerloom unit for over 25 years.\n\nIn December 2014, he employed Udhayakumar and the latter had subsequently brought his accomplices Abdul Kadhar and Paraman in the third and forth week of the month. Meanwhile, Udhayakumar was also demanding an advance of Rs. 50,000 from his employer.\n\nSulur Police said that on December 23, Raakiappan, his wife Sarojini and daughters Vinodhini (26) and Usha (23) argued with Udhayakumar, when Paraman was newly brought to work without Rakkiappan’s knowledge. Shortly after 8 p.m. on December 24, the trio picked a quarrel with Rakkiappan at the unit and stabbed him with knives.\n\nThey also attacked Vinodhini who came to her father’s rescue, before stabbing Usha and Sarojini. The attackers fled as people of that locality rushed to the spot on hearing the victim’s cries for help. The four were taken to a private hospital on Avinashi Road but Raakiappan and Vinodhini died on the way. The two others survived.\n\nSulur police arrested the trio, lodged Udhayakumar at the Borstal School in Pollachi as he was only 19-year-old at that time and the two others in the Coimbatore Central Prison. On Wednesday, after framing charges the bomb blast court judge M. Srinivasan posted the case for trial on February 3.", 
    "section": "national", 
    "title": "Charges framed against accused for murdering man, daughter", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}