{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "Mumbai Metro Rail Corporation advised against awarding contract to Mosmetrostroy\n\nThe Chennai Metro Rail authorities have written to Mumbai Metro Rail Corporation (MMRC), advising them against awarding the contract for the Mumbai Metro III project to Russian firm Mosmetrostroy, which had allegedly abandoned the project in Chennai in May 2015.\n\nTop Officials at MMRC said they had taken cognisance of the letter and sought legal opinion on the issue, but the consortium — consisting of Hindustan Construction Company and Mosmetrostroy — had not been disqualified by Japan International Cooperation Agency (JICA) that was partly funding the Rs. 23,000-crore underground Metro Rail project connecting Colaba in South Mumbai with SEEPZ in northern Mumbai.\n\nAccording to officials of Chennai Metro Rail Limited (CMRL), they had sent a letter to MMRC some days ago, briefing them about how the contractor deserted the project and the problems they now faced owing to it. “We wanted to warn them before they awarded the contract to this firm. We have been facing delay in the project and other problems because of this contractor. We do not want them [MMRC] to face a similar situation,” an official said.\n\nMosmetrostroy had entered into a joint venture with Gammon India for the Chennai Metro Rail project and was awarded a contract for Rs. 1,947 crore for the construction of seven underground stations along Anna Salai. But the Russian firm had abandoned the project in May 2015 owing to financial crunch. Months later, CMRL terminated the contract of Gammon India as they were unhappy with the pace of construction. Gammon India too was debarred by Delhi Metro Rail Corporation (DMRC) before CMRL awarded the contract to the firm. But sources here said they had sought legal advice from various quarters before they went ahead with the decision.\n\nAshwini Bhide, managing director of MMRC, told The Hindu : “The consortium is a pre-qualified bidder, and we had already shortlisted the firm in 2013 after which this incident has taken place. We took note of the letter from CMRL, and sought legal opinion. JICA has specific guidelines on who can be debarred from the project, and the agency has allowed their bid.”\n\nMs. Bhide said, “These are international companies, and their selection is done on the basis of their overall track record. If something happens in one project with one agency, we cannot take cognisance of it because we don’t really know who is responsible. JICA has looked at all the facts, and have not debarred them.”\n\nThe Colaba-Bandra-SEEPZ Mumbai Metro III project was divided in seven packages and had received bids from nine different consortiums, including two Russian companies, and five Chinese companies that partnered with Indian infrastructure companies.\n\nThe Moscow Metrostroy-HCC Limited (as the consortium was listed for the Mumbai Metro project) had emerged as the lowest bidder on the stretch between CST and Mumbai Central. Each of the seven packages comprises 4-km to 5-km-long twin tunnels. The bids are presently being evaluated by the MMRC before awarding the final contract for construction. Responding to a questionnaire, Hindustan Construction Company Limited said, “The decision to partner with Moscow Metrostroy was taken by HCC given the strong track-record of the Russian company in building over 300 km of Metro Rail tunnels and several underground stations across Moscow and other places.”\n\nHCC firmed up the consortium with Moscow Metrostroy sometime in September 2013 and the Russian Company’s issues with CMRL began around April-May 2015, it said. “The Moscow Metrostroy issue with Chennai Metro is sub judice and HCC does not wish to comment on the same. HCC, as a lead member of the consortium along with their partners Moscow Metrostroy in Mumbai Metro-III, is committed to successful implementation of the project,” the statement said.\n\nOfficials of Moscow Metrostroy were unavailable for comment.", 
    "section": "national", 
    "title": "CMRL’s word of caution to Mumbai Metro", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}