{
    "author": [], 
    "text": "RELIGION\n\nBalathandayuthabani Swamy Temple: Thaipoosa Thiruvizha, Sukkiravaarappettai, 10 a.m.\n\nSubramaniya Swamy Temple: Thaipoosa Thiruvizha-Thiruveethi Ulaa & Spiritual Discourse,\n\nMarudhamalai, 10 a.m.\n\nAsthiga Samajam: Nama Prachara Vaibhavam, VRG Thirumana Mandapam, Edayarpalayam, 9 a.m.\n\nRathina Vinayakar Temple: Pradosham, R.S. Puram, 4.30 p.m.\n\nGENERAL\n\nKovai Kalaimagal College of Arts and Science: Seminar on ‘Impact is all positive’, CIMAT Auditorium,\n\n2 p.m.\n\nIndian Texpreneurs Federation: Programme on Strategies for growth, Hotel Le Meridian, 6 p.m.\n\nThe Coimbatore Productivity Council: Two-day programme on first aid, Vyshnav Building,\n\nRace Course, 9 a.m.\n\nSankara Institute of Management Science: Online share trading programme,\n\nDhanam Hall, 10.30 a.m.\n\nSree Dharmasastha Matriculation Higher Secondary School: Kids meet, school grounds,\n\n8.30 a.m.\n\nC.M.S. Matriculation Higher Secondary School: Annual Sports Day, school ground,\n\n3.30 p.m.\n\nDermacon 2016: Inaugural function of Dermacon 2016, Codissia Hall A,\n\n6 p.m.\n\nWorld Vision India: Urban Child Protection and Participation Project,\n\nDamodharan Hall, 10 a.m.\n\nCoimbatore Institute of Management and Technology: Certification programme on Mobile Application Development for UG students,\n\nCIMAT Lab, college premises,\n\n9.30 a.m.\n\nPSG Techs Coe Indutech: Inauguration of Centre of Excellence for Industrial/Home Textiles, Le Meridian Hotel, Neelambur, 11.30 a.m.\n\nKalaignar Karunanidhi Institute of Technology: Entrepreneurship awareness camp, KIT Campus, 9 a.m.\n\nKurinji Hospital: Continuing medical education programme,\n\nConference Hall-Kurinji Hospital,\n\n2 p.m.\n\nV.L.B. Janakiammal College of Arts and Science: Lecture on ‘E-Commerce-The Business Mantra’, conference hall, 2 p.m.\n\nSree Narayana Guru College: General health and eye check-up camp for staff members,\n\nconference hall, 10 a.m.\n\nPALLADAM\n\nThe Southern Indian Mills Association: Inauguration of textile workers hostel and apparel manufacturing unit of Bannari Amman Spinning Mills Limited by Union Minister of State Santhosh Kumar Gangwar,\n\nHi-tech Weaving Park,\n\n2.15 p.m.", 
    "section": "national", 
    "title": "Coimbatore today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}