{
    "author": [
        "Special Correspondent"
    ], 
    "text": "An exhibition of indigenous paddy seeds and traditional plough tools, and folk performance by the students marked the Pongal folk festival at Periyar University recently.\n\nMore than 100 indigenous paddy seeds and traditional plough tools used in agricultural practices along with some working animals such as cattle, horse, and goats were displayed at the exhibition. Many native agriculture machinery and equipment used for soil-working, drilling, fertilizing, and harvesting and indigenous paddy seeds were the cynosure of all eyes.\n\nThe Ongole cattle, kattu seval (madras asils), and native goats were some of the animals kept in the exhibition.\n\nThe initiative of this exhibition enabled the student community to learn about ancient life of farmers and farming and more so people’s association with nature and tradition.\n\nThe folk festival was brought up with the objective of conserving and transmitting the prosperities of Tamil culture among students and the public. The students adorned the whole campus with large kolams (Pongal rangoli) with traditional rice flour and a riot of colours.\n\nThe function commenced with the preparation of sweet pongal in large earthen pots. C. Swaminathan, Vice-Chancellor of Periyar University, distributed the pongal to the students and staff.\n\nS. Jayaraman, president, Federation of Salem District Farmers Clubs, was the chief guest.\n\nA three-hour folk arts performance also formed part of the festival. The performances held in Periyar auditorium depicted the rich history of arts in Tamil Nadu. Dance forms such as thappattam, kummi, kaavadiaattam, koelaattam, oyilaattam and folk songs were the highlights of the event.\n\nIn his address, Mr. Swaminathan said that the festival was organised with an aim to conserve the tradition and transmit its richness to the present generation. “Traditional paddy seeds are our future,” he added.", 
    "section": "national", 
    "title": "Exhibition of indigenous paddy seeds held", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}