{
    "author": [
        "Tiruchi Bureau"
    ], 
    "text": "In Thanjavur, Tiruvarur, Nagapattinam, Pudukottai, Perambalur, Ariyalur and Karur districts\n\nThe final electoral rolls were released on Wednesday in the presence of representatives of recognised political parties. The rolls have been prepared with January 1 as the qualifying date.\n\nAs per the revised rolls, while 57,058 electors have been added in Thanjavur district, 21,535 in Tiruvarur district and 35,603 in Nagapattinam district after the summary revision of rolls taken up after September 15 last year.\n\nIn Thanjavur district, there are a total of 18,89,169 voters including 9,56,339 women voters, 9,32,791 men voters and 39 ‘others’ in the eight Assembly constituencies.\n\nTiruvidaimarudur Assembly constituency has 1,18,104 men voters, 1,15,412 women voters and three ‘others’ for a total of 2,33,519 voters. Kumbakonam constituency has 1,22,254 men and 1,23,817 women for a total of 2,46,071. Papanasam constituency has 1,18,172 men, 1,19,943 women and four ‘others’ for a total of 2,38,119 voters. Tiruvaiyaru constituency has 1,22,613 men and 1,25,575 women for a total of 2,48,188 voters.\n\nThanjavur Assembly constituency has 1,29,579 men, 1,36,659 women and five ‘others’ for a total of 2,66,243 voters while Orathanad has 1,11,531 men, 1,14,569 women and four ‘others’ for a total of 2,26,104.\n\nPattukkottai constituency has 1,09,221 men, 1,17,279 women and 18 ‘others’ for a total of 2,26,518 electorate. Peravoorani Assembly constituency has 1,01,317 men, 1,03,085 women and five ‘others’ for a total of 2,04,407 voters, according to the rolls released by Collector N. Subbaiyan.\n\nTiruvarur\n\nAs per the poll rolls released by Collector M. Mathivanan, there are 4,84,297 men voters, 4,84,527 women voters and 17 ‘others’ with a total of electorate of 9,68,841 voters.\n\nIn Tiruthuraipoondi Assembly constituency, there are 1,10,978 men, 1,11,401 women and one in the others category while in Mannargudi constituency there are 1,19,176 men, 1,21,721 women and two ‘others.’ In Tiruvarur constituency, there are 1,25,424 men, 1,27,029 women and 13 ‘others’ even as Nannilam Assembly constituency accounts for 1,28,719 men, 1,24,376 women and one voter in the others category.\n\nNagapattinam\n\nCollector S. Palanisamy released the rolls as per which there are 1251791 voters including 629423 women, 622358 men and 10 ‘others.’\n\nWhile 50215 applications were received for inclusion in rolls under various categories, the officials enlisted 35,603 new voters from out of the 38,633 applications. Women voters outnumber men voters in Nagapattinam, Vedaranyam, Keezhvelur and Sirkali Assembly constituencies.\n\nPudukottai\n\nThe strength of voters in Pudukottai district has gone up by 31,940 following the summary revision of the electoral rolls.\n\nThe district has 12,23,183 voters with men slightly outnumbering women as per the final poll roll released here by S.Ganesh, Collector, in the presence of representatives of political parties. Of the total electors, 6,11,687 were men, 6,11,473 women and 23 others.\n\nPudukottai is the largest of the six Assembly constituencies in the district, in terms of voter strength, with 2,26,029 electors including 1,11,636 men, 1,14,386 women and seven others. The following is the voter strength of the other five constituencies in the district: Aranthangi – 2,11,467 (1,06,286 men, 1,05,178 and three others); Tirumayam – 2,05,506 (1,01,468 men and 1,04,038 women); Viralimalai – 1,99,103 (1,00,114 men, 98986 women and three others); Alangudi – 1,96,502 (98,130 men, 98369 women and three others) and Gandharvakottai SC – 1,84,576 (94,053 men, 90516 women and seven others).\n\nPerambalur\n\nIn Perambalur district, 15,771 eligible voters including 7,495 men, 8,273 women and three others, have been included in the electoral rolls during the summary revision. There were 6,243 deletions in the district.\n\nCollector Darez Ahamed, who released the final roll for the two Assembly constituencies in the district on Wednesday, said the electors strength in the district stood at 5,30,828 including 2,62,123 men, 2,68,681 women and 24 others. Perambalur Assembly constituency had 2,75,932 voters including 1,35,127 men, 1,40,792 women and 13 others and Kunnam constituency had 2,54,896 electors which included 1,26,996 men, 1,27,889 women and 11 others.\n\nApplications for inclusions, deletions and corrections of names and addresses can be submitted at the special camps to be held on January 31 and February 6 at the polling stations.\n\nKarur\n\nThe names of 17,419 voters have been included in the final electoral roll in four Assembly constituencies of the district. As per the final roll, which was released by the Collector S. Jayandhi on Wednesday, the district has 8,40,348 voters with 4,30,416 men, 4,09,902 women and 30 voters in the ‘others’ category.\n\nOf the new voters, 8,414 were men and 9,005 were women. Karur constituency has maximum number of voters among four constituencies in the district. Aravakurichi constituency has lowest number of voters. Women voters outnumber men in all four constituencies in the district.\n\nKarur constituency has 2,31,209 voters with 1,10,871 men and 1,20,336 women. Aravakurichi constituency has 1,98,434 voters. Of them, 96,481 were men and 1,01,953 were women. In Kulithalai constituency, there are 2,07,792 voters. Of them, 1,02,649 are men and 1,05,141 are women. There are 2,02,913 voters in Krishnarayapuram (reserve) constituency with 99,901 men, 1,02,986 women and 26 others.\n\nMs. Jayandhi said eligible voters, who had attained the age of 18 as on January, 2016 could apply for inclusion by submitting form-6 to the officers concerned. The list would be kept for public at the officers of Electoral Registration Officers, Assistant Electoral Registration Officers and revenue offices.\n\nAriyalur\n\nThe voter strength in Ariyalur district stood at 4,97,734 electors including 2,47,004 men and 2,50,730 women. While Ariyalur constituency had 2,47,475 voters, including 1,23,253 men and 1,24,222 women, the Jayamkondam constituency had 2,50,259 voters comprising 1,23,751 men and 1,26,508 women.\n\nCollector E.Saravanavelraj, who released the final voters list here on Wednesday, said EPICs would be distributed to newly added voters through booth level officers at the respective polling stations on January 25.", 
    "section": "national", 
    "title": "Final electoral rolls released", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}