{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Over 25 lakh voters in Madurai district\n\nAs per the final electoral roll released here on Wednesday, there are 25,04,543 voters in Madurai district, with Madurai East and Sholavandan having the highest and lowest number of voters respectively among the district’s 10 Assembly constituencies.\n\nAs has been the trend, the electoral roll, released by Collector L. Subramanian ahead of the Assembly elections, revealed that women voters outnumbered men voters. About 50.4 per cent of the voters were women with a sex ratio of 1,016 women voters for 1,000 men voters. Eighty voters in the district identified themselves in ‘Other’ category.\n\nMr. Subramanian said that 78,842 of the total voters (3.15 per cent) were first time voters in the age group of 18-19 years. He said that after the release of the draft electoral roll in September 2015, 62,886 people had applied for inclusion, of whom 60,768 were added after verification. After deletions, removal of double entries and voters who had moved to other districts, the net addition to the final roll was 58,581, the Collector said.\n\nChanges still possible\n\nThe Collector said that forms for addition to the voters’ list and changes would still be accepted by the district administration.\n\nApart from the voter registration centres where forms could be submitted during working days, two special camps hadbeen arranged on January 31 (Sunday) and February 6 (Saturday) at all polling booths, he said.\n\nOnline facility\n\nMr. Subramanian urged the public, particularly the youngsters, to make use of the online facility (www.elections.tn.gov.in) to apply for addition or changes.\n\nHe said that officials would be available at four places – Office of the Revenue Divisional Officers (RDO) in Madurai and Usilampatti, Deputy Commissioner’s Office in Madurai Corporation and the Election Office at the Collectorate – to facilitate online filing of forms for addition and changes.\n\nMr. Subramanian said that the online facility and toll-free number 1950 could be used for verification of details as well. He said that a special awareness meeting at selected colleges would also be held later this month to encourage youngsters to enrol themselves in the voters’ list.\n\nHe added that a student ambassador would also be selected from every college to create awareness.", 
    "section": "national", 
    "title": "Final electoral roll released", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}