{
    "author": [
        "V S"
    ], 
    "text": "After an elephant trampled a man near Gudalur, Forest Division has chosen to use Whatsapp, three modes of early warning systems\n\nAn early warning system to monitor the movement of wild elephants has been installed in Gudalur forest Division.— Photo: M.Sathyamoorthy\n\nIn addition to the conventional practices, the Forest Department is taking the technology route now to reduce the human-elephant conflict.\n\nAfter an elephant trampled a man near Gudalur in The Nilgiris, the locals have resorted to bandh, picketing and fast in a consistent show of public outrage over the incident.\n\nOn Monday, the services of two kumkis (trained elephants) Mudumalai and Bomman from Theppakadu Elephant camp were used for chasing a 11-member wild elephant herd. The operation did yield some results.\n\nForest officials led by Gudalur DFO S.N. Tejaswi managed to send six of the jumbos across the National Highway and efforts continued on Wednesday for driving the remaining five away from human habitats. Once the herd crosses the road, the kumkis would be in a position to put them back on the migratory track deep into the forests, officials said.\n\nMeanwhile, the Gudalur Forest Division has chosen to use Whatsapp, three modes of early warning systems and map of conflict prone areas and elephant sightings to continuously monitor the movement and behavioural pattern of jumbos that cause frequent trouble.\n\nA Whatsapp group called Gudalur Safeway is very active now in the area especially in Gudalur and Pandalur taluks for dissemination of information relating to elephant movement. The group has DFO, Collector, SP, Rangers, estate managers, village heads and local media representatives as members.\n\nAny information disseminated on the group is also forwarded to the rest of the local community in the form of group or bulk SMS. The information is also taken to more people in the form of scroll in local cable television network, say officials.\n\nIn addition, the NGOs have supplemented the efforts of the Forest Department by training the tribal youth to record elephant sightings and movements and instantly uploading it on to the Google images map which is being handled by the Forest Department. “This helps in tracking the movement of lone tuskers and herds and study their behavioural pattern and to get into a preventive and proactive mode. This has almost become a conflict prone area mapping,” said an official.\n\nBesides, the early warning systems have also become functional.\n\nWhile two of them costing around Rs 30,000 generate SMS besides flash lights and alarm sound in specific areas and terrains, the low cost early warning system that comes at a price of around Rs 6,000 use sensor, solar battery, beacon lights and alarms.\n\nForest Division has chosen to use Whatsapp, three modes of early warning systems", 
    "section": "national", 
    "title": "Forest dept. resorts to technology to curb human-elephant conflict", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}