{
    "author": [
        "B Kolappan"
    ], 
    "text": "Governor K. Rosaiah delivering the customary address to the Assembly at the Secretariat in Chennai on Wednesday. Chief Minister Jayalalithaa looks on. (Right) DMK treasurer M.K. Stalin along with party MLAs entering the Secretariat to attend Assembly session on Wednesday.- Photos: B. Jothi Ramalingam\n\nOpposition stages walkout, faults govt. over delay in releasing water from Chembarambakkam\n\nTamil Nadu government placed a special thrust on the welfare of the Sri Lankan Tamils and Governor K. Rosaiah in his address to the State Assembly urged the Centre to prevail upon the Sri Lankan government to take action against those who had committed crimes against Tamils in the last phase of the civil war.\n\nRecalling the resolution adopted in the State Assembly asking the Centre to take steps to adopt a resolution in the United Nations Human Rights Council (UNHRC) for an international inquiry into the war crimes and violations of the Geneva convention by the Sri Lankan government, he expressed the hope that the Centre would persuade Sri Lanka to restore the Tamil families their lands. “It should ensure equal rights and an opportunity to live peacefully with dignity,” he said.\n\nThe Opposition parties, however, staged a walkout alleging the ruling AIADMK government had failed in all fronts and the delay in releasing water from Chembarambakkam lake caused the floods in Chennai.\n\nThe Governor also condemned the regular attacks on Tamil fishermen and seizure of their boats and nets by the Sri Lankan Navy, saying the reluctance on the part of the Sri Lankan government in releasing fishing boats even after the release of fishermen had caused agony among the fisher folk . “It is our duty to find a lasting and permanent solution to this issue by retrieving Katchatheevu and restoring traditional rights of our fishermen,” he said.\n\nTo reduce the fishing pressure in the Palk Straits and also to expand deep sea fishing capabilities, the Governor wanted the Centre to sanction a comprehensive financial package of Rs.1,520 crore.\n\nMeanwhile, the DMK floor leader M.K. Stalin told reporters that even though his party had demanded a judicial inquiry into the Chembarambakkam water release issue, the State government had not given any proper response so far. The Governor's address also made no reference to the issue.\n\nThe current session of the Assembly will be held till January 23.", 
    "section": "national", 
    "title": "Governor seeks justice for Sri Lankan Tamils", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}