{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Investigating team told to file status report by the second week of April\n\nThe Madras High Court Bench here on Wednesday ordered a Central Bureau of Investigation (CBI) probe into the affairs of an unauthorised girls’ home run by Tiruchi-based Mose Ministries, which claimed to have sourced all its 89 inmates, including 35 minors, from Usilampatti near here after rescuing them from female infanticide since 1994.\n\nPassing interim orders on a public interest litigation petition, Justices V. Ramasubramanian and N. Kirubakaran directed the Joint Director, CBI, Chennai, to depute a team led by an officer in the rank of Deputy Superintendent of Police, specialised in anti-human trafficking issues, to hold “an investigation into allegations of trafficking as well as abuse.”\n\nSuggesting that the investigating team could comprise lady officers to the extent possible, the judges said:\n\n“The team so nominated shall take the assistance of a team of experts from National Institute of Mental Health and Neuro Sciences (NIMHANS), Bangalore, to speak to the children, counsel them and first liberate them from any obsessive mindset if they have.”\n\nThey also ordered that the investigators should make enquiries with doctors and nurses employed at hospitals in Usilampatti to find out the modus operandi adopted by the home for procuring the children besides arranging for DNA test on people who had claimed to be the parents of some of the inmates after the filing of the case.\n\nDirecting the investigating team to file a status report in the court by the second week of April, the judges made it clear that a committee appointed by them under the chairmanship of Tiruchi Collector on December 7, after overthrowing the management led by Pastor Gideon Jacob of Mose Ministries, shall continue to administer the home until further orders.\n\nThey also directed the pastor to deposit Rs.4 lakh, apart from Rs.6 lakh already deposited by him as ordered last month, with the committee for managing the home since he had taken the children in batches to Germany and Poland, using passports obtained through “dubious” methods and on the strength of guardianship certificates issued by some government officials, to raise donations.\n\nThough the pastor had feigned ignorance about the parentage of the inmates and claimed that all of them had been abandoned by their parents on the doorsteps of his institution in Usilampatti, the Tiruchi District Social Welfare claimed that her subordinates had recently laid their hands on a register that contained details of the parents. Hence, the judges directed CBI to utilise those documents.\n\nIn the order passed last month, the judges said that they were not inclined to order immediate closure of the home and shift the inmates to other authorised homes.", 
    "section": "national", 
    "title": "HC orders CBI probe into trafficking in unauthorised girls’ home", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}