{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The forum is meant to enable students to use Tamil as primary language while using computers, mobile phones or other gadgets\n\n‘Kani Tamil Peravai’ (Forum for Tamil Computing), an initiative of the Tamil Nadu Virtual Academy, to encourage use of Tamil in computing, was inaugurated at Agricultural College and Research Institute, The American College and Velammal College of Engineering and Technology on Wednesday.\n\nThe forum, through various skill development initiatives, will enable the students to use Tamil as the primary language while using computers, mobile phones or other gadgets. It will also encourage students to contribute for increasing Tamil content available on the internet.\n\nInaugurating the forum at The American College, Maa. Thamizhpparithi, State coordinator of ‘Kani Tamil Peravai,’ said that many software were now available to enable the users to use Tamil in computing and internet.\n\nHe said that the low percentage of web content currently available on the internet also meant more opportunity for youngsters to pitch in to convert them into Tamil. “Sadly, only around eight per cent of the Tamil Nadu government website contents are available in Tamil,” he said.\n\nPointing out the need for keyboards in Tamil, he said that a proposal had been sent seeking to implement it in the free laptops issued by the State government to students.\n\nDuring the inauguration of the forum at Velammal College of Engineering and Technology, the students launched two mobile applications in Tamil, including one for searching doctors, apart from two websites in Tamil.\n\nAddressing the students during the inauguration at The American College, Principal M. Davamani Christober said thatlanguage was no barrier for obtaining knowledge.\n\nJ. Balasubramanaiam, an Assistant Professor at Madurai Kamaraj University, said that as social media was becoming catalysts for change, it was important for students to actively take part in it. “Language should not be a barrier for using it,” he said.\n\nMr. Thamizhpparithi said that ‘Kani Tamil Peravai’ at the MKU would act as the nodal centre for the forums opened in the three colleges. A seed fund of Rs. 25,000 would be provided by the government for the forums, he said, adding colleges interested in opening the forum could contact Tamil Nadu Virtual Academy atkanitamilperavai@gmail.com", 
    "section": "national", 
    "title": "‘Kani Tamil Peravai’ comes up in three colleges", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}