{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Incidents of strangers injuring residents and robbing houses in broad daylight call for some precautions\n\nIf a stranger walks to your house asking for water or for directions, it is better to answer him/her from behind a grille door. And when alone, it’s better to always have the door closed.\n\nOn Wednesday afternoon, a 30-year-old woman, a resident of Sivapuram in Vanagaram, learnt it the hard way. Around 12.15 p.m., the woman was alone at home, and had left the door ajar, when an unidentified man barged into the house, snatched her chain and fled the spot.\n\nShe was injured and had to be rushed to a hospital.\n\nThe Madhuravoyal police have registered a case and are investigating.\n\nA similar incident happened in Villivakkam on Tuesday, in which Kalavathi, a senior citizen, lost her gold chain. “Under the guise of a salesperson, culprits identify houses where women are alone during the day. They either alert their team members or come another day to rob the house,” says a police inspector.\n\nHe says that though policemen patrol the area, residents have to be careful too. “In an apartment complex, watchmen should be instructed not to entertain salesmen and those who come seeking donations. In independent houses, it is always better to have a grille gate,” says the officer.\n\nMany police officers feel there is always a need to improve the rapport between residents’ associations and policemen.\n\n“There should be a good rapport with the law enforcement agencies. The residents should know beat policemen by their names and have their phone numbers stored,” the officer says.\n\nResidents’ forums and security\n\nThe success of beat patrol teams of the Chennai City police can be partially attributed to socially responsible residents who keep track of the daily attendance of patrol teams.\n\nSome residents and activists committed to the welfare of neighbourhoods help the local police ensure the night patrol system works like a well-oiled machine.\n\nC.R. Ramakanthan, an 83-year-old resident of Baba Nagar in Villivakkam, is well known among local officials of the Rajamangalam police station. For, this resident closely monitors the entries by the patrol team in the ‘Patta’ book and makes his unhappiness known when the team skips its routine.\n\nIn some parts of south Chennai, when it comes to security issues, residents’ welfare associations play a more participatory role. Members of Lakshmi Nagar Residents’ Welfare Association in Nanganallur have been supporting the local police in night patrols for more than 10 years.\n\nR. Rajamani, a member of the association, recalled the days when residents used to patrol along with the police team at night.\n\nA senior official of the City police acknowledged the role of residents’ associations in sustaining the patrol system in the city.\n\n(Reporting by Vivek Narayanan and R. Srikanth)", 
    "section": "national", 
    "title": "Listing out steps to stay safe at home", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}