{
    "author": [
        "P Sudhakar"
    ], 
    "text": "Consumers getting LPG cylinders from Indian Oil Corporation’s Indane in the district have to wait for three weeks since December last for refills reportedly due to short supply.\n\nThough long wait for refills is not uncommon to Indane consumers, especially during the winter, this time it has been very agonising as the waiting time has gone beyond three weeks.\n\nThey have been making repeated requests with the distributors for refills. Even after the Indane consumers registered their protests repeatedly against IOC in the monthly grievance meetings at the Collectorate, the problem still persists. “Instead of getting additional loads, the distributors are now getting only one load every day. Hence, the huge backlog”, a distributor said.\n\nAn official attached to IOC’s LPG division said: “Even as major quantity of our cylinders had to be diverted to the flood-hit northern districts since mid-December, the protest by tanker drivers worsened the situation.”\n\nMost of the Indane distributors here blame senior officials for not taking sincere efforts to clear the backlog.\n\nThough Bharat Petroleum too faced a similar situation in mid-December after its bottling plant at Thoothukudi was shut down owing to unprecedented flooding, its aggressive approach led to increasing the production.\n\n“The workers had to work even on Sundays and we managed to clear the backlog to a greater extent,” a Bharat Petroleum LPG distributor said. “The management, besides increasing production and supply, set a deadline for distributors to clear the backlog and we’d to comply with it.”\n\nAn Indane LPG distributor here said that the oil major’s upcoming bottling plant with better production capacity at Gangaikondan could not be commissioned owing to “legal impediments” though construction was almost over. “If this plant is commissioned, the consumers will enjoy excellent services,” said the distributor.", 
    "section": "national", 
    "title": "Long wait for LPG refill cylinders", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}