{
    "author": [
        "Special Correspondent"
    ], 
    "text": "DEVOTION IN THE AIR:Thousands of devotees witness ‘mahasamprokshanam’ of Sri Nachiar (Andal) Temple in Srivilliputtur on Wednesday.— Photo: R. Ashok\n\nAmidst chanting of Vedic hymns and “Govinda, Govinda,” ‘mahasamprokshanam’ of the famous Sri Nachiar (Andal) Temple was performed on a grand scale here on Wednesday.\n\nWitnessed by thousands of devotees, the glittering “thanga vimanam” (golden tower), covered with gold plates weighing a little over 75 kg, was decorated with flowers and garlands. At 10.15 a.m., the Bhattacharyas, flanked by Jeers and Vedic pundits, sprinkled the holy water on the “vimanam” and performed deeparadhana.\n\nThe “thanga vimanam” of the Andal temple was made as per Agama sastra by a team of sculptors, goldsmiths and pundits, as in Sri Ranganathaswamy Temple in Srirangam and at Tirumala temple, Hindu Religious and Charitable Endowments Department officials said, adding after 15 years the temple witnessed a samprokshanam.\n\nThe HR and CE officials had arranged sprinkling of the holy water through sprayers installed at different locations atop the gopurams for the benefit of the devotees. Prasadam was also distributed to them.\n\nYagasala pujas were performed at the temple for the last five days in which Vedic scholars, led by Vasudeva Bhattacharya, Govindaraja Bhattacharya and Raghurama Bhattacharya, participated. Students from Vedapadasala and pundits from the USA and the UK too attended the yagasala pujas.\n\nSasikala among devotees\n\nThe devotees present at the temple included Chief Minister Jayalalithaa’s confidante Sasikala. Arriving at the venue just 10 minutes prior to the samprokshanam, she offered prayers at the sannidhi and left the temple. A plaque was also unveiled by her on the temple premises.\n\nMany All India Anna Dravida Munnetra Kazhagam functionaries, including Ministers K.T. Rajendra Balaji and R.B. Udhayakumar, from the district were absent as they had to attend the Assembly session in Chennai.\n\nIndustrialist P.R. Ramasubrahamanya Rajha, temple thakkar Ravichandran, ADGP K. Radhakrishnan, Collector V. Rajaraman, DRO C. Muthukumaran and others were present.\n\nVirudhunagar SP Aravindan, who led the team of officers, said that a little over 1,000 personnel were deployed on bandobust duty. Apart from having installed high-rise towers to monitor crowd movement, the police observed pictures captured by the unmanned aerial vehicle.", 
    "section": "national", 
    "title": "Mahasamprokshanam performed at Andal temple", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}