{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Kumbabishekam being performed at Sri Ramanathaswamy Temple in Rameswaram on Wednesday. (Right) Holy water being sprinkled on devotees. — PHOTO: L. BALACHANDAR\n\nConsecration was simultaneously performed at 22 vimanams and four rajagopurams at 10.15 a.m.\n\nTens of thousands of devotees thronged Sri Ramanathaswamy Temple here on Wednesday to witness ‘mahakumbabishekam’ performed after a gap of 14 years and with two rajagopurams at the southern and northern entrances in place.\n\nMore than 5,000 devotees accommodated atop the temple and thousands of devotees gathered in all the four Car streets around the temple offered prayers as the Sivachariars, led by K. Pitchai Sivachariar, the chief priest of Pillayarpatti Vinayakar Temple, performed the consecration with holy water amid chanting of Vedic hymns and mantras.\n\nThe consecration was simultaneously performed at 22 vimanams, four rajagopurams and Mangala Gopuram at 10.15 a.m. after Kavitha, Additional Commissioner of Hindu Religious and Charitable Endowments (HR and CE) Department, accompanied by S. Selvaraj, Joint Commissioner of the temple, signalled the start of the ceremony.\n\nPitchai Sivachariyar performed the consecration atop the ‘Swamy vimanam’, and other Sivachariyars at the four rajagopurams and other vimanams. The devotees were delighted as a flock of ‘garudas’ hovered around the temple – considered an auspicious sign – when the consecration was performed.\n\nThen holy water drawn from ‘Sethumadhava kulam’ was sprinkled on the devotees with powerful sprinklers, installed at nine places atop the gopurams and vimanams, K. Mayilvahanan, Assistant Divisional Engineer of the temple, said.\n\nAfter the consecration, a maha abishekam was performed at Swamy, Ambal and other sannadhis. The day-long ceremony drew to a close in the evening with the celestial wedding of Lord Ramanathaswamy and Goddess Parvathavardhini Ambal and a silver car procession.\n\nThis was the second mahakumbabishekam. The first mahakumbabishekam was performed in February 2001. The mahakumbabishekams were preceded by three astabandana kumbabishekams in 1925, 1947 and 1975.\n\nThe Sringeri Sharada Peetham which built the south rajagoporam was represented by its administrator Gowri Shankar and Karpagam College of Engineering which built the north rajagopuram by its chairman Raja Vasanthakumar.\n\nHigh Court judges, Sri Jayanedra Saraswati of Kanchi mutt, Raja N. Kumaran Sethupathy, Thakkar and Rani R.P.K. Rajeswari Nachiyar of Ramanathapuram Samasthanam and local MP A. Anwar Raja were among the others who visited the temple.\n\nThe district police made elaborate security arrangements and ensured that the event passed off peacefully. “Everything went on well and no single incident was reported,” Superintendent of Police N. Manivannan told The Hindu .", 
    "section": "national", 
    "title": "Mahakumbabishekam draws a sea of devotees to Rameswaram", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}