{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The death of four persons due to asphyxiation while entering a septic tank at a hotel on Tuesday has put the data on the total number of persons engaged in the banned occupation of manual scavenging, collected by the State, under a shadow.\n\nM. Shivanna, Chairman of the National Commission for Safai Karamcharis, told reporters on Wednesday that officials had communicated to him that there were 458 persons involved in manual scavenging in Tamil Nadu. Of them, 252 were in Chennai.\n\nHowever, three of the four victims in Tuesday’s incident who did manual scavenging for a living were not on the list of 458. The Chairman said this “raised some questions” about the data. Corporation officials present at the briefing said the enumeration was on the basis of voluntary disclosure.\n\nAt a meeting with Corporation of Chennai officials on Wednesday, he made it clear that he would recommend cases against officials if another incident of such serious nature happens.\n\nIn the present case, he said the licence had been issued to the hotel despite a flawed design. “The tank was extremely narrow but almost 10 to 15 feet deep,” he said. Police should ensure the arrest of the hotel owner. Also, provisions under the Prevention of Cruelties Act should be invoked along with those under the Manual Scavenging Act, he said. Mr. Shivanna also slammed officials for the delay in conducting the autopsy of the four bodies. “Till 3.30 pm [on Wednesday], they did not conduct the post-mortem. I personally went to the hospital and warned them. I also spoke to the Health Secretary. It was after this that the procedure was started,” he said.\n\nThe hotel was also asked to help the families with expenses towards funeral. The families of those who died will get a compensation of Rs 10 lakh as per the Act and it would be ensured that the lone injured person would get half this amount.\n\nThe Corporation has also been asked to see if a family member could be given a job in the civic body.\n\n“It was heart wrenching to learn that they decided to get into the septic tank for a payment of Rs 1,000 per head. Three of them belonged to the same family,” he pointed out. Meanwhile, Chief Minister Jayalalithaa announced a solatium of Rs 1 lakh to the families of the four persons who died of asphyxiation and Rs 50,000 for the injured from the public relief fund.\n\nCorporation officials say enumeration is carried out on the basis of voluntary disclosure", 
    "section": "national", 
    "title": "Manual scavenging deaths put government data under scanner", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}