{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "National Green Tribunal had given permission; activists are unhappy with decision\n\nith the Principal Bench of National Green Tribunal, New Delhi, giving the green signal to the re-laying of the Marina Loop Road with concrete, the Chennai Corporation has begun the work. At present, it is carrying out the preliminary work, which involving strengthening the road.\n\nIn an order passed last month, the Principal Bench, comprising chairperson Justice Swatenter Singh, judicial member Justice M. S. Nambiar, expert members D.K. Agarwal and Bikram Singh Sajwan, stated that the civic body could execute the project strictly in accordance with the conditions of the clearance under Coastal Regulatory Zone Notification, 2011.\n\nThe Corporation should not engage in any activity other than re-laying of the road with concrete. No beautification work shall be carried out on the seaside.\n\n“Lights of appropriate size would be fixed; it should be ensured there is least light towards the sea and they are put out every day between 11 p.m. and 5 a.m., from December to February every year. There shall be no widening of the road and footpaths and the stormwater drains shall be provided only on the landward side,” said the order.\n\n“Some parts of the road are weak, so we will be filling it up with three layers before laying the concrete road. We will be re-laying the road only within the limits specified in the CRZ. No widening or beautification work will be carried out on the seaside,” said a Corporation official.\n\nExperts said a decision on this issue had been inordinately delayed as it was shifted from one Bench of the tribunal to another and then, finally to the Principal Bench. “It is not enough to lay the road alone. The Corporation should take action against the fish market set up on both sides of road as it causes traffic congestion. The government can either remove the fish market or divert vehicles on the road,” said A. Kumaraguru, advocate, Madras High Court, who impleaded himself.\n\nSome of the residents of the locality said they were happy that no widening would happen on the seaward side. “However, the Corporation should excavate whatever has already been laid on the seaward side. Even while having development work on the roadside, care should be taken that the homes of the fisherfolk or their livelihood are not affected,” said a resident of Nochi Kuppam.\n\nMeanwhile, social activist Nityanand Jayaraman said he was unhappy with the order. “The road lies in the inter-tidal zone. The NGT order is unfortunate as it looks at the human law and disregards the natural law. In the next cyclone, there will be an effect on the road,” he said.", 
    "section": "national", 
    "title": "Marina Loop Road re-laying begins", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}