{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Indian Oil Corporation limited (IOCL) conducted an offsite emergency mock drill and awareness programme along the Chennai-Tiruchi-Madurai underground pipeline at P.Agaram near Tiruchi on Wednesday to test the preparedness of its emergency personnel.\n\nThe drill was organised by the IOCL’s Southern Region Pipelines (SRPL), Tiruchi. The line is the first pipeline project of IOCL in south India. The line, spanning 683 km, runs across 11 districts of Tamil Nadu. The pipeline carries diesel, kerosene and petrol in sequences. The drill was led by S.S. Chourasia, Chief Operations Manager of IOCL, Tiruchi. Speaking on the occasion, Mr. Chourasia stressed the importance of coordination between the district administrations, Fire and Rescue Services, local village administrations and IOCL in handling emergency situations.\n\nVeeramuthu, Chief Operations Manager, explained the importance of identification markers which are installed above ground over the pipeline and urged villagers to safeguard them as they would act as reference points at times of emergencies.\n\nAjith Kumar, Senior Operations and Maintenance Engineer of IOCL, along with the maintenance team, presented a demonstration on pipeline leak arrest, fitting of leak clamp and usage of extinguishers such as dry chemical powder during the drill.\n\nA fire control demonstration was carried out by Fire and Rescue Services personnel from Pullampadi Division, led by Sathyavardhanan, Station Fire Officer. The local branch of St. John’s Ambulance brigade demonstrated first aid measures. Apart from ensuring preparedness of the safety personnel, the drill aimed at raising awareness among the villagers about safety measures to be adopted during an emergency in coordination with the local panchayat leaders, an IOCL press release said.", 
    "section": "national", 
    "title": "Mock drill", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}