{
    "author": [
        "Special Correspondent"
    ], 
    "text": "There is a net addition of 12.33 lakh voters in the final rolls of the revision\n\nThe total electorate in the State stands at 5.79 crore, according to the final electoral rolls of the special summary revision.\n\nThe data show there are more female voters in the rolls. The number of female voters is 2.91 crore, 3 lakh more than the number of male voters.\n\nThere are 4,383 voters in the third gender category. There is a net addition of 12.33 lakh voters in the final rolls of the revision, according to the rolls published on Wednesday.\n\nTest messages are being sent to around eight lakh applicants, who had provided their mobile numbers at the time of applying, according to a release from CEO Rajesh Lakhoni. Electors Photo Identity Cards (EPIC) for new voters are being printed and will be delivered through booth-level officers by February 10.\n\nHighest and lowest\n\nShozhinganallur in Kancheepuram district has the highest number of electors with 5,75,773 electors (male: 2,91.909; female:2,83,819; third gender: 45). This Assembly constituency has also the highest electors in the age group of 18-19 with 12,797 electors. (male:7214; female:5583)\n\nOn the other hand, the lowest number of electors are in Kilvelur (SC) in Nagapattinam district with 1,63,189 electors (male:81,038; female:82,151). The Thirumangalam Assembly constituency in Madurai district has the highest number of service electors with 2,402 service electors.\n\nThe number of overseas electors enrolled is 47, of which 11 are from Singapore, eight from the U.S. and five from Kuwait.\n\n“Indians staying abroad, who have not acquired the citizenship of another country and have completed 18 years of age, can apply using Form 6A to register in the rolls. They can cast their vote in the elections using their passports at the respective polling booth in their constituency,” Mr. Lakhoni said.\n\nVoter guide\n\nAs a special feature of this revision, all the first time electors will be given a ‘Voter Guide’ along with EPIC. It will contain necessary information regarding registration and voting processes which can be comprehended easily. There are a total of 18,14,040 first-time voters in the State, of which 6,14,892 have been added in the recent summary revision.\n\nDuring the special summary revision, 17.10 lakh had applied for inclusion and 16.18 lakh were admitted. There were 3.85 lakh deletions on account of shifting, death and duplicate entries. While 2.67 lakh applied for corrections, 2.56 lakh were accepted.\n\nThe period of continuous revision is in operation now. Eligible persons not finding their names in the electoral rolls could apply for inclusion. People can apply online athttp://elections.tn.gov.in. Corrections in the EPIC too can be made online.", 
    "section": "national", 
    "title": "More women voters in final poll rolls", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}