{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "Getting workers to clean toilets for a paltry sum will be difficult\n\nelcoming the new programme of appointing exclusive workers for maintenance of sanitation facilities in government schools in the State, educationists here have demanded increased allocation for the successful implementation of this scheme.\n\nThe programme will cover all the 1,649 schools - 128 higher secondary schools, 117 high schools, 361 middle schools and 1,043 primary schools - in Salem district.\n\nThe State Rural Development and Panchayat Raj Department, following a Government Order of the School Education Department, allotted special funds to the tune of Rs. 57.63 crore for this project in 2016. The fund is to provide salary to the conservancy workers (Rs. 39.79 crore) employed by the schools for the proper maintenance of toilets and purchase of cleaning materials (Rs. 17.84 crore).\n\nThe government has fixed a salary of Rs. 2,000 for the sanitary worker employed in higher secondary school, Rs. 1,500 for the worker in high school, Rs. 1,000 in the middle school and Rs. 750 in primary school.\n\nThe allotment for the purchase of equipment is: HSS Rs. 1,000, high school Rs. 750, middle school Rs. 500 and primary school Rs. 300.\n\nThe allotment of funds for upkeep of toilets in government schools for the first time has been widely welcomed by all sections of society, particularly the educationists. Even though toilets were present in the government schools, their proper upkeep proved a difficult task for want of funds. In a majority of the cases, the Parent-Teachers Associations have to raise funds to pay wages to the workers. Many PTAs could not afford it due to paucity of funds.\n\nAs per the government norms, the schools should have one urinal for 20 children and one toilet for 50 children. Moreover, the GO wants the toilets to be cleaned both in the mornings and evenings every day.\n\nEvery government higher secondary school functioning in the rural areas account for students strength ranging between 1,000 and 1,500. Getting workers for the paltry monthly payment will prove a very difficult job, observed S. Ranganathan, a parent of Omalur. At many centres, the school authorities will have to once again depend on the PTAs for the payment of higher salary, he adds.\n\nThis is a good move on the part of the government and will put an end to the complaints of students being used for cleaning the toilets, says a retired government school teacher. The government should sustain this scheme and should come forward to allot more funds for its successful implementation, he adds.\n\nHowever, the Education Department sources clarified that the conservancy workers employed with the rural local bodies such as village panchayats and town panchayats could be drafted for this additional work.", 
    "section": "national", 
    "title": "More funds needed", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}