{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "Interested parties can send their expression of interest for buying the entire stake\n\nThe Madras Stock Exchange, one of the oldest stock exchanges in the country, intends to sell off approximately 91 per cent equity stake in its subsidiary company MSE Financial Services Ltd.\n\nAccording to a notification posted by MSE, interested parties can send their expression of interest for buying the entire stake or they can also acquire individual business verticals - trading in BSE and NSE and CDSL DP operations separately.\n\n“The board members felt that the baton should be passed on to some buyer who is interested in this business. The process would be easy if one of our own members by the stake,” said an official at MSE, who wished anonymity. “The company has been registering profits and paying dividend year on year. So people would be keen to buy,” he added.\n\nMSE Financial Services Ltd, which was incorporated in March 2000, is a trading member of Bombay Stock Exchange (BSE) and National Stock Exchange (NSE). The firm is also a Depository Participant (DP) registered with Central Depository Services Limited.\n\nCurrently, MSE Financial Services has a network of around 38 sub brokers and authorised persons and a client base of around 8,000. It has more than 13,000 demat accounts.\n\nMSE is also selling its building at Second Lane Beach and has appointed a consultant for valuation. Real Estate experts say that the building can fetch anywhere between Rs. 30-35 crore. “There has been no activity here for quite sometime. MSE has also pulled its website down as it was redundant. There is a proposal for name change but that has to be approved by the RoC,” said one of the shareholder directors at MSE.\n\nIn 2015, the exchange had sought consent of shareholders for changing the name of the company to MSE Securities Limited, amending the memorandum of association (MOA), and adopting new articles of association (AOA). MOA and AOA are key documents that contain details of a company as well as the rules that govern it.\n\nA veteran who was on the board of MSE, says, “MSE should dispose of its assets and payback the shareholders. Today, there are so many trading firms that have mushroomed. Who would like to buy another brokerage firm,” he asked.\n\nWhen MSE started its journey it had 108 companies listed. In the late 1990s MSE was at it peak with 1,784 firms listed under it.\n\nIn 2012, SEBI passed an order mandating regional stock exchanges to have a minimum net worth of Rs. 100 crore and an annual trading volume of Rs 1,000 crore.\n\nThe market watchdog gave a two-year window period for exchanges to comply or quit. In 2014, the MSE decided to exit.", 
    "section": "national", 
    "title": "MSE to sell 91 per cent equity in subsidiary company", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}