{
    "author": [
        "Tiruchi Bureau"
    ], 
    "text": "48,205 more voters following summary revision of rolls\n\n: Voter’s strength in Tiruchi district, consisting of nine Assembly constituencies, has increased by 48,205 following the summary revision of electoral rolls carried out over the past couple of months.\n\nAs per the final electoral roll, the district has 21,45,201 voters with 10,92,156 women, 10,52,925 men and 120 voters in the ‘others’ category.\n\nAccording to the final rolls released here on Wednesday, 55,295 eligible voters have been included in the electoral rolls during the summary revision.\n\nOf this, 26,117 were men and 29,160 were women. The names of 7,090 voters, including 3,866 men and 3,224 women have been deleted based on applications received and verification on account of death or migration.\n\nThe maximum addition of 9,117 voters has been in Srirangam Assembly constituency. It is followed by 7,024 inclusions in Tiruverumbur; 6,754 in Tiruchi East; 6,649 in Tiruchi West; 6,560 in Manapparai; 5,447 in Manachanallur; 5,051 in Musiri, 5,047 in Lalgudi and 3,646 in Thuraiyur (SC).\n\nThe Srirangam Assembly constituency has the highest number of voters in the district with 2,81,063 electors and Lalgudi has the lowest with 2,01,236. Women outnumber men in all the nine constituencies.\n\nCollector K.S. Palanisamy released the final electoral roll for the district in the presence of representatives of recognised political parties. The voters list would be kept for public verification at the offices of the Electoral Registration Officers and Assistant Electoral Registration Officers in the district. The electoral roll would also be read out in the special grama sabha meetings to be held on January 26.\n\nElectoral Photo Identity Cards (EPIC) would be issued to the new voters on January 25, the National Voters Day, at the respective polling stations.\n\nContinuous updation of the rolls would go on. Eligible voters whose names have not been included and those who had attained the age of 18 as on January 1, 2016, can apply for inclusion of their names in the electoral roll by submitting Form-6 at the offices of the Electoral Registration Officers or Assistant Electoral Registration Officers. Forms for deletions, corrections and address change within Assembly constituencies can also be submitted. The application forms can also be submitted during the special camps to be held on January 31 and February 6 at all polling stations in the district, Mr.Palanisamy said. The applications can also be filed online atwww.elections.tn.gov.in\n\nThanjavur\n\nThe final electoral rolls were released on Wednesday in the presence of representatives of recognised political parties. The rolls have been prepared with January 1 as the qualifying date.\n\nAs per the revised rolls, while 57,058 electors have been added in Thanjavur district, 21,535 in Tiruvarur district and 35,603 in Nagapattinam district after the summary revision of rolls taken up after September 15 last year.\n\nIn Thanjavur district, there are a total of 18,89,169 voters including 9,56,339 women voters, 9,32,791 men voters and 39 ‘others’ in the eight Assembly constituencies.\n\nTiruvidaimarudur Assembly constituency has 1,18,104 men voters, 1,15,412 women voters and three ‘others’ for a total of 2,33,519 voters. Kumbakonam constituency has 1,22,254 men and 1,23,817 women for a total of 2,46,071. Papanasam constituency has 1,18,172 men, 1,19,943 women and four ‘others’ for a total of 2,38,119 voters. Tiruvaiyaru constituency has 1,22,613 men and 1,25,575 women for a total of 2,48,188 voters.\n\nThanjavur Assembly constituency has 1,29,579 men, 1,36,659 women and five ‘others’ for a total of 2,66,243 voters while Orathanad has 1,11,531 men, 1,14,569 women and four ‘others’ for a total of 2,26,104.\n\nPattukkottai constituency has 1,09,221 men, 1,17,279 women and 18 ‘others’ for a total of 2,26,518 electorate. Peravoorani Assembly constituency has 1,01,317 men, 1,03,085 women and five ‘others’ for a total of 2,04,407 voters.", 
    "section": "national", 
    "title": "Number of voters goes up in Tiruchi district", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}