{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Collector Archana Patnaik (second right) releasing the final electoral rolls in the presence of the Coimbatore Corporation Deputy Commissioner P. Gandhimathi (right) and political party representatives at the Coimbatore Collectorate on Wednesday. (right) The Niligiris Collector P. Sankar releasing the electoral rolls in Udhagamandalam. —Photos: S. Siva Saravanan and M. Sathyamoorthy\n\nNumber of voters in 18 – 19 age group in the final list is 67,450\n\nThe final electoral rolls the Coimbatore Collector Archana Patnaik released here on Wednesday for the district has 80,758 new voters. With this the total voters in the district with 10 Assembly constituencies is 28,06,690.\n\nA release from the district administration says that women voters outnumber men – there are 14.08 lakh women voters and 13.97 lakh men voters. And, there are 243 voters who belong to the third gender. The populous Assembly constituency is Kavundampalayam which has 4.06 lakh voters and is closely followed by Singanallur with 3.04 lakh voters.\n\nThe least populous constituency is Valparai with 1.95 lakh voters.\n\nThe release also says that in the recent exercise to add names, make changes and remove names to the voters list, the administration received 1.06 lakh applications and of those it accepted 1.05 lakh applications. In addition to adding the aforementioned new voters to the list, the administration also deleted 36,531 names from the list.\n\nThe number of voters in the 18 – 19 age group in the final list is 67,450 and this includes the 21,759 added in the recent exercise.\n\nThe release also says that that as part of the continuous update of the voters list, the administration will hold special camps on January 31 and February 6. Voters with grievances may reach the District Election Office on 0422-2303786.\n\nIn The Nilgiris, the final electoral rolls released by Collector P. Shankar has seen 68,645 more voters compared to the rolls released ahead of the last Assembly election in 2011. A release says that Udhagamandalam is the most populous of the three constituencies in the district with over two lakh voters and Coonnoor is the least populous with 1.78 lakh voters.\n\nAs in Coimbatore, here too the women voters outnumber men – there are 2.80 lakh women voters and 2.69 lakh men voters.", 
    "section": "national", 
    "title": "Over 80,000 new voters in Coimbatore", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}