{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "More than one lakh first-time voters in Chennai district are expected to exercise their franchise this Assembly elections.\n\nAccording to the electoral rolls 2016 published by District Election Officer Vikram Kapur (since transferred) on Wednesday, as many as 56,135 male voters, 45,338 female voters and 25 others, in the age group of 18-19 have been included in the electoral rolls in the 16 Assembly constituencies in Chennai district.\n\nDr. Radhakrishnan Nagar Assembly Constituency with 6144 male voters, 4901 female voters and four others recorded the highest number in the age group of 18-19.\n\nThe number of male voters in the age group of 20-24, which also includes many first-time voters, is 1.7 lakh in the Chennai district. The number of female voters in the same age group is 1.69 lakh.\n\nAround 38.28 lakh electors have been enrolled in the 16 Assembly constituencies in Chennai.\n\nAs many as 19.03 lakh men, 19.24 lakh women and 786 others are on the electoral rolls. Velachery (with 2.96 lakh voters) remains the Assembly constituency with the largest number of electors in Chennai district.\n\nCompared to the draft electoral rolls published last year, there is a rise in the overall number of electors in Chennai district with a 3.09 percent increase this year.\n\nFor the past few years, the Chennai district election office had been carrying out intense field verification, identifying a large number of multiple entries in the rolls of some constituencies.\n\nSo, there was a dip in the number of electors.\n\nIn 2012, Perambur lost the top position among the 16 Assembly constituencies to Velachery on account of deletion of a large number of electors in many neighbourhoods. This year, Perambur constituency continues to be in the second place with 2,88,901 electors on the rolls. This year, the Chennai District Election Office deleted only 2538 electors from the rolls, fearing criticism by political parties in an election year.", 
    "section": "national", 
    "title": "Over one lakh first-time voters in Chennai district", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}