{
    "author": [
        "R Sivaraman"
    ], 
    "text": "As part of preparatory measures for the Assembly polls, Election Department officials on Wednesday commenced the first level checks on electronic voting machines (EVMs) with assistance of engineers in the presence of representatives of recognised political parties in the Union Territory.\n\nThese checks were conducted at office of Election Department in Puducherry and Karaikal.\n\nS. Kanagaraj, Nodal officer for EVMs said as per the instructions of Election Commission of India (ECI),the first level checking of EVMs is being done by authorised engineers of Bharat Electronics Limited(BEL), Bangalore. These checks are conducted to ensure the EVMs free from errors.\n\nAccording to officials, in the past, it has been noticed that malfunctioning of various switches came to notice soon after the commencement of polls leading to the suspicion that possibly all switches were not properly checked during pre-poll phase. To ensure proper checking of all switches of the EVM, the first level checking is being done in the presence of representative of Chief Electoral Officer or District Election Officer.\n\nThe Election Department officials also check on whether all the 16-candidate buttons in ballot unit are working properly. They also ensure the proper functioning of Off-On switch, set- candidate button, ballot releasing button, close button, total button, result button, buzzer sound with each button.\n\nMr. Kanagaraj said, “We check every ballot unit and control unit thoroughly. A certificate is pasted on lower part of unit without hiding any vital information. If the machine is not in working condition, we will send it to BEL.”\n\nOnce the schedule of polls is announced, another round of tests will be done on the machine. After the announcement candidates’ list published in each constituency, then ballot will be pasted on ballot machines.\n\nThe officials added that a public awareness campaign on the usage of EVMs would be conducted ahead of polls.\n\nThe five-year term of present Legislative Assembly of Puducherry is due to expire on June 2.\n\nBy virtue of its powers, duties and functions under Article 324 read with Article 172 (1) of the Constitution of India and Section 15 of Representation of the People Act, 1951, the Election Commission of India (ECI) is required to hold elections to constitute the new Legislative Assembly in the Union Territory before expiry of its present term.", 
    "section": "national", 
    "title": "Preparations for Assembly polls: EVMs checked", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}