{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Collector K. Nanthakumar releasing final electorall rollin Ramanathapuram on Wednesday. (Below) CollectorS. Malarvizhi releasing the roll in Sivaganga.\n\nMore than 33,000 new voters have enrolled their names in the electoral lists in Ramanathapuram and Sivaganga districts as the Collectors of the two districts released the final electoral rolls on Wednesday.\n\nAfter the draft electoral rolls were published for four Assembly constituencies, each in the two districts, on September 15, special summary revisions were carried out in the last four months with January 1, 2016 as the qualifying date for all eligible voters to include their names in the list.\n\nCollector K Nanthakumar (Ramanathapuram) and Collector S Malarvizhi (Sivaganga) released the draft electoral rolls in the presence of representatives of recognised political parties at the respective Collectorates.\n\nDuring the special summary revision since September 15, 14,681 new voters were included in four assembly segments in Ramanathapuram and 18,660 voters in four assembly segments in Sivaganga district.\n\nIn Ramanathapuram, 22,341 applications were received for inclusion of which, 21,673 were accepted.\n\nAfter deletion of 6,992 voters, including those died, a total of 14,681 new voters were included in the list.\n\nAs per the final electoral roll, the total number of electorate stood at 10,97,183 in Ramanathapuram and 10,73,173 in Sivaganga district.\n\nIn Ramanathapuram, the total voters comprised 5,51,194 men, 5,45,915 women and 74 others (transgender). Mudukulathur assembly segment topped the roll with 2,97,492 voters followed by Ramanathapuram (2,81,563), Tiruvadanai (2,71,962) and Paramakudi 2,46,166).\n\nIn Sivaganga, women voters (5,40,431) marginally exceeded the number of men voters (5,32,727) and the total number of electorate stood at 10,73,173, including 15 transgenders.\n\nKaraikudi topped the list with 2,82,460 voters, followed by Sivaganga (2,71,110), Tirupattur (2,65,915) and Manamadurai (2,53,688). The final electoral rolls would be available with booth level officers in the assembly constituencies in the two districts for the voters for verification, official sources said. The rolls would also be available at designated locations, they said.", 
    "section": "national", 
    "title": "Ramnad district has 10,97,183 voters", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}