{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": ": A meeting between senior leaders of the Tamil Nadu Congress Committee (TNCC) and Congress vice president Rahul Gandhi in New Delhi on Wednesday brought dissension to the fore again as the veterans including former Union Finance Minister P. Chidambaram, expressed their inability to work with TNCC president E.V.K.S. Elangovan. They accused Mr. Elangovan of acting arbitrarily and sought the formation of a committee to run the affairs of the party’s state unit.\n\nHowever, Mr. Gandhi reportedly did not promise to make any changes to the TNCC leadership and instead urged the leaders to bury differences and work together for the ensuing Assembly elections.\n\nSources said after senior leader Su. Thirunavukkarasar met Mr. Gandhi last week and explained the situation prevailing in the TNCC, it was decided hold a discussion with prominent senior leaders.\n\nOn Wednesday, 11 leaders, including Mr. Chidambaram, Mr. Elangovan, Mr. Thirunavukkarasar, former TNCC presidents M. Krishnaswamy and K.V. Thangkabalu and former Union Minister Sudarsana Natchiappan had a meeting with Mr. Gandhi for nearly two hours.\n\nA leader who attended the gathering said one section of seniors asked for the formation of a committee to run the TNCC and alleged Mr. Elangovan was not treating them well.\n\nOn his part, Mr. Elangovan accused the leaders of noncooperation despite his best efforts to bring peace.\n\nSome in the meeting felt Mr. Gandhi's reaction showed Mr. Elangovan may not be changed immediately.\n\nWill respect TNCC sentiments\n\nSources said many expressed their opinion on what kind of alliance the party should enter. The dominant view was to go with the DMK.\n\n“Mr. Gandhi said he would respect the sentiment of the TNCC while making the final decision on alliances but also added that we should wait and see the kind of offers the party gets,” a leader said requesting anonymity.", 
    "section": "national", 
    "title": "Seniors ask Rahul to form committee to run TNCC", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}