{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Neuroscientist demystifies two techniques devised to study, control the organ\n\nTo a thronging audience of scientists, students, engineers and doctors, Karl Deisseroth, a neuroscientist and psychiatrist, demystified two revolutionary techniques that he and his colleagues at Stanford University had devised to study and control the brain: optogenetics and CLARITY.\n\nHis lab uses some “rather unlikely allies” from the natural world – microbial organisms and algae – organisms that are light-sensitive and help “illuminate” the brain to study and control it through optogenetics, he said.\n\n“We can now use certain genetic tricks to deliver genes of interest to regions of interest... We also use anatomical tricks, where, for instance, a virus carrying a gene could be injected deep into brain structure. CLARITY on the other hand creates a “see-through brain” – by removing the lipids that make the brain opaque – without destroying the brain structure with the help of a hydrogel.”\n\nProf. Deisseroth was delivering the Sixth Annual Cell Press-TNQ India Distinguished Lectureship Series titled ‘Illuminating the Brain’ on Wednesday.\n\nThe human brain, “an organ of staggering complexity and beauty”, also poses serious challenges when it comes to psychiatric diseases, which are typically very debilitating, chronic, and hard to treat: “Among all the fields of medicine they are certainly the least understood,” Prof. Deisseroth said.\n\nMore than 200 years ago, the first scientific descriptions of psychiatric disease were starting to emerge, with the identification of the symptom domains of what was called “melancholia”, he said.\n\n“Far, far back, there were scientists who were not psychiatrists, who were not neuroscientists, who were basic biologists studying certain aspects of the natural world and it was their work over decades that created the foundation that we were able to build on.”\n\n‘Hero of neuroscience’\n\n“Breakthrough moments in science, of a transformative kind, build on the work that comes before it, and Prof. Deisseroth has emphasised this,” said N Ram, Chairman, Kasturi and Sons Limited. He described Prof. Deisseroth as “a hero of neuroscience” who focused especially on treatment-resistant depression and autism.\n\nProf. Deisseroth, who was recently awarded the prestigious Life Sciences Breakthrough Prize for 2016, is the D.H. Chen Professor of Bioengineering and of Psychiatry and Behavioural Sciences at Stanford University.", 
    "section": "national", 
    "title": "Shining a light on the brain", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}