{
    "author": [
        "R Sujatha"
    ], 
    "text": "The decision of the Mother Teresa Women’s University to leave out some subjects from the State-level eligibility test (TN SET) this year has upset academicians.\n\nThe University had received permission from the University Grants Commission to conduct the SET, the equivalent of the National Eligibility Test to make way for candidates aspiring to be appointed as assistant professors in colleges.\n\nThe test will be conducted on February 21 and the last date for submitting application is February 10.\n\nWhen candidates checked the website they found that subjects such as library science and women’s studies had been left out.\n\nThe candidates were told by the university that these subjects would be included next year.\n\nAccording to some candidates the tests are generally conducted after an assessment of demand for a subject.\n\n“There are a lot of NET/SET qualified candidates in subjects like Economics, Tamil and Commerce so ideally these subjects could (have been) excluded,” contended S. Swaminathan, founder secretary NET/SET Association.\n\nA. Amudavalli, head of Library Science department of the University of Madras, said a number of vacancies had to be filled and not including the subject would leave interested candidates out.\n\nBharathi Harishankar, head of Women’s Studies department in University of Madras also felt that it was not right to keep out the subject.\n\nMother Teresa University Rgistrar N. Kala, however, said that these subjects would be included in the next round of test as there were not many vacancies.\n\n“When there are less than 10 or 15 vacancies for a subject we can decide not to hold a test in those subjects. We have received permission to conduct the test for three years and will include the subjects that were left out in the next round,” she added.", 
    "section": "national", 
    "title": "Some subjects left out of SET exams", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}