{
    "author": [
        "C Jaisankar"
    ], 
    "text": "Right now there is no proposal to fix meters for agriculture installations\n\nThe Tamil Nadu Generation and Distribution Corporation (Tangedco) has decided to replace 16 lakh Electro Mechanical Meters (EMM) with digital meters, which is known as Static Electric Meters (SEM) for all domestic, commercial, and industrial electricity consumers.\n\nThe plan is in addition to the replacement of all mechanical meters being implemented under the Restructured Accelerated Power Development and Reforms Programme (R-APDRP) in 17 towns, including Tiruchi, Karur, Perambalur, Thanjavur, Nagapattinam, Manaparai, Thuraiyur, Pudukottai, and Tiruvarur.\n\nAccording to information available with the Tangedco, there are 37 lakh services, including 5 lakh non-metered agricultural connections in Delta districts, including Tiruchi and Thanjavur. There is no move to fix meters for agricultural services. Remaining 32 lakh services would have to be fixed with digital meters. In the first phase, 16 lakh Electro Mechanical Meters will be replaced with digital meters.\n\nA senior officer of Tangedco told The Hindu that the drive would cover single phase, three-phase, high-tension and low-tension connections. The digital meter was lightweight and had many value added facilities. It could measure the electricity with precision. He said it could not be tampered with. It would ensure better accuracy in reading the power consumption and fewer defects. The existing electro mechanical meters would not read some electrical equipment that consumed power below certain volts. But the digital meters would even count the devices, including mobiles and mobile power banks. He said it had been noted that the revenue had gone up by about 20 per cent wherever the digital meters were fixed. It would ultimately bring down the revenue loss of Tangedco.\n\nIn Tiruchi and other 16 towns, where R-APDRP scheme was implemented, 3.92 lakh digital meters have been fixed so far. Of them, 3.17 lakh were for single phase connections. Work was on progress fix 91,000 more connections. The drive would be completed by June 2017.", 
    "section": "national", 
    "title": "Tangedco to fix 16 lakh digital meters in Delta region", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}