{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A festive atmosphere prevailed at the ruling AIADMK’s headquarters on Avvai Shanmugam Salai in Royapettah here on Wednesday as hundreds of party ticket aspirants for the coming Assembly elections converged to purchase the application forms on day one. The AIADMK is the first party to issue application forms for the Assembly elections.\n\nOver 800 applications had been sold till 3 p.m. As is the unwritten convention in the AIADMK, many of the ticket aspirants purchased two application forms each and submitted one in the name of party general secretary and Chief Minister Jayalalithaa and another for themselves. Such proxy applications are usually submitted in Jayalalithaa’s name for all constituencies barring those reserved for Scheduled Caste/Tribe candidates.\n\nAIADMK presidium chairman E. Madhusudhanan inaugurated the sale of application forms in the morning and senior leaders, including Finance Minister O. Panneerselvam received the filled-in applications from the ticket aspirants.\n\n“I have been applying for a party ticket for Assembly and Parliamentary elections in the past 10 years and every time, I have filed applications on behalf of Amma (Jayalalithaa) too. If she contests from my constituency, it will be a matter of pride for me and those working in our district,” said a ticket aspirant.\n\nCandidates aspiring to contest from a constituency in Tamil Nadu have to deposit Rs. 11,000 for an Assembly ticket.\n\nFor Puducherry Assembly election, the fee is Rs. 5,000 per seat and for Kerala it is Rs. 2,000 per seat.\n\nThe forms will be available at the party headquarters till February 3 between 10.30 a.m. and 5 p.m. Along with the four-page long application, candidates have to attach two postcard size photos.\n\nMany first-time aspirants, including a retired government official, an advocate and an educator, claimed they wanted to contest as they can serve a larger section of people.\n\n“I have been working in the field of education for several years and now if Amma gives me an opportunity I would like to scale it up,” claimed the educator.", 
    "section": "national", 
    "title": "Ticket aspirants throng AIADMK headquarters", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}