{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Ranganathaswamy Temple, Srirangam : Thai car festival, Namperumal purappadu in thiruvichigai, 6.30 p.m.; reaching Thayar Sannidhi, 8.30 p.m.; reaching kannadi arai, midnight.\n\nArulmigu Mariamman Temple, Samayapuram : Thai poosam festival, Amman thiruveedhi ula in pallakku, 10 a.m.; abishekam, 5 p.m.; maha deeparadhana, 7 p.m.; Amman thiruveedhi ula in Velli Sesha vaganam, 8 p.m.; reaching sanctum sanctorum, 9 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Kattazhagiasingar Sannidhi, Thiruvanaikovil, 6 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama Nama parayanam, 8, I Street, SMESC Colony, 6 p.m.\n\nGovindammal Tamil Mandram :Vadivel Ayya speaks on Periya Puranam, Pappammal Anna Chathram, Keezha Chinthamani, 6.30 p.m.\n\nGENERAL\n\nCentre for Differently Abled Persons of Bharathidasan University : International workshop on ‘Disability management: Integrating Yoga, Therapy and technology,’ V.M.Muthukumar, Vice Chancellor, delivers valedictory address, university campus, 4.15 p.m.\n\nMSME Development Institute and Tiruchi District Tiny and Small Scale Industries Association : Vendor development programme and industrial seminar on exports, Ravi Mini Hall, near Chathram Bus Stand, 10 a.m.\n\nSt.Joseph’s College Department of Business Administration : National conference on Managerial perspectives – issues and challenges in the era of globalisation, G.Jayaprakash, General Manager, SSTP, BHEL, Tiruchi, inaugurates, 9.30 a.m.\n\nSeethalakshmi Ramaswami College Department of Computer Science : Seminar on e-waste management, M.Jayanthi, principal, presides, 10 a.m.\n\nJamal Mohamed College : Valediction of ‘Matho-0-Vision 2016,’A.K.Khaja Nazeemudeen, college correspondent, delivers the valedictory address, 4 p.m.; Citizen Consumer Club: ‘Vivadha Medai,’ T.G.Damodharan, state president, Consumer Consultative Council, and Anthonysamy, chief guests, 3 p.m.\n\nK.Ramakrishnan College of Engineering : Inauguration of ICTACT and faculty development programme on mobile application development, 10 a.m.\n\nSharon and JCI Tiruchi Excel: Road Safety Week, K.Sudhakar, Plant Head, Rane TRW SSL, Viralimalai, chief guest, Nehru Middle School, Muthukulam, 3 p.m.\n\nBishop Heber College Department of Social Work : Awareness programme on government schemes on sanitation, Navalurkuttapattu, 11 a.m.; awareness programme on eye care, Kaikatti, 11.30 a.m.\n\nHoly Cross College Department of Social Work : Programme on ‘Embrace the differences,’ Power Trust, Viralimalai, 11 a.m.\n\nIndian Welding Society, Indian Institute of Metals and Indian Institute of Welding : M.P.Dhanuka, Executive Director (Technical and marketing), GEE Limited, Mumbai, speaks on ‘Development of basic coated electrodes for welding Inconel 800,800H and 800HT,’ Institution buildings, BHEL Township, 5 p.m.\n\nCARE Group of Institutions: Hands-on training on, ‘Expertise your E-creativity in Adobe Photoshop,’ 10 a.m.\n\nDepartment of Information and Public Relations : Government exhibition, St.John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}