{
    "author": [
        "V S"
    ], 
    "text": "Citing inadequate rains in Parambikulam-Aliyar Project basin and resultant poor water realisation in its reservoirs, Tamil Nadu has convinced Kerala that it can only offer four tmcft of water for the remaining period of the water year — January to June. This was the outcome of the 96{+t}{+h}Joint Water Regulatory Board and 35{+t}{+h}Sub-Committee meeting of the Tamil Nadu-Kerala officials held near Pollachi on Tuesday.\n\nThe Parambikulam-Aliyar project envisages a realisation of 28 tmcft of water from July to June.\n\nOf the 28 tmcft, as per the agreement between the two riparian States, Tamil Nadu should release 7.25 tmcft from Aliyar via Manacadavu sluice and 12.30 tmcft from Sholayar reservoir thus entitling Kerala for a share of 19.55 tmcft in every water year.\n\nThere is no distress sharing formula and the States have been resolving the differences through talks .\n\nDuring July to December, Tamil Nadu has so far released eight tmcft of water from Sholayar and four tmcft of water from Aliyar thus providing 12 tmcft of water to Kerala. The talk between two States on Tuesday was in respect of the remaining 7.55 tmcft.\n\nThe Tamil Nadu PWD officials said that the abundant rainfall was only in coastal districts and not in Western Tamil Nadu and pointed out that the water realisation this year was only two thirds (66 per cent) of the envisaged realisation of 28 tmcft. Citing the drinking water needs and irrigation needs of the standing crops, Tamil Nadu assured Kerala that it will release four tmcft of water.\n\nThey have proposed to hold next round of talks in March to decide on the remaining 3.55 tmcft of water due to Kerala. In the event of unexpected showers or summer showers, Tamil Nadu might be in a position to honour its commitment, officials here said.\n\nTamil Nadu was represented by Chief Engineer – Public Works Department E. Tamilarasan, Superintending Engineer of Tangedco K. Nandagopal, Chief Engineer of Water Resources Organisation R. Elangovan and Deputy Chief Engineer S. Sivalingam. Kerala was represented by its Chief Engineer (Inter-State Water) Hari Narayanan and M.N. Lalitha – Chief Engineer of Kerala State Electricity Board.\n\nTN PWD officials say abundant rainfall\n\nwas only in\n\ncoastal districts", 
    "section": "national", 
    "title": "TN to give only four tmcft of water to Kerala", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}