{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Justice Satish K. Agnihotri, the senior most judge of the Madras High Court, has said that vacant posts of judges in the High Court would be filled as early as possible.\n\nIn a brief chat with reporters after inaugurating the ‘Legal literary awareness camp’ here on Wednesday, he said “we will be sending the list and the vacancies will be filled as early as possible, may be before the middle of this year.”\n\nThe judge was responding to a question whether the vacancies, which would touch a record number of about 40 later this year, were a cause of concern when the court was accumulating huge backlog of cases.\n\nJustice Agnihotri, who is the Chairman of the State Legal Services Authority, expressed satisfaction over the functioning of State-level and district-level legal services authorities.\n\n“It’s (legal services authority) doing very well in the State,” he said, and suggested that the media could support the endeavour and create awareness among the people of the free legal services available at Lok Adalats to the weaker sections of society.\n\nTamil Nadu topped the country in rendering justice to the people through the legal services authority, he said, adding during 2015 alone, the authority had cleared 3.50 lakh cases from the 13 lakh pending cases through Lok Adalats, he said.\n\nThe judge, after visiting a photo exhibition, released a book on ‘Acts and welfare schemes for differently abled’. He was accompanied by Justice P. Devadoss, who is the portfolio judge for this district and Justice R. Mahadevan.\n\nThe function was attended among others by Principal District Judge (in-charge) M.P. Ram, Chief Judicial Magistrate J. Chandran, Additional District Judge Sivakadatcham and Judicial Magistrate K.P. Ilavarasi.\n\nChief Administrative Officer S. Venkataraman, Sheristadar M. Merlin Joseph Amuldoss, and Senior Administrative Assistant N. Balasubramanian arranged the awareness camp.", 
    "section": "national", 
    "title": "“Vacant judge posts to be filled soon”", 
    "subsection": "tamilnadu", 
    "date": "2016-01-21"
}