{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "RSS brass to discuss the issue at Jalgaon meet\n\nThe BJP on Tuesday fielded Union Minister of State for Minority Affairs Mukhtar Abbas Naqvi to defend the government’s handling of the Pathankot attack, but senior leaders in the party admitted that it was a difficult proposition for the party and the government to give the situation a rosy hue in propaganda terms. A meeting of the RSS brass, including heads of allied organisations of the Sangh Parivar, will take up the handling of the Pathankot issue at a meeting in Jalgaon in Maharashtra on January 7 and 8.\n\n“Terrorism is an international challenge and the world is fighting against it as one. Amid such a situation, things should not be said that bolster the confidence of terrorists and affect our global war on terrorism,” said Mr. Naqvi in response to the Congress’s trenchant criticism of the government’s handling of the attack.\n\n“They [the Congress] need to introspect and think about their political childishness. They also need to think about what they say during such sensitive times when the nation is standing together,” he said.\n\nSeniors upset\n\nSeniors in the party are noticeably upset over the handling of the attack. On the day of the attack, Environment Minister Prakash Javadekar said that “one incident” could not derail talks between the two countries. as the siege in Pathankot went on, Roads and Highways Minister Nitin Gadkari put out a more combative statement: “We shall respond with strength to this attack on us by Pakistan.”\n\n“How can we express satisfaction over prevailing upon six extremists after four days when we had prior intelligence of the attack,” said a senior office-bearer of the party, the reference was clearly to NSA Ajit Doval’s role.\n\n“The RSS brass and the heads of allied Sangh organisation, 20 to 25 of them, shall be meeting in Jalgaon, and this will be discussed. As of now, the party cannot have a view separate from that of the government, but we cannot have this kind of handling again,” said the source.", 
    "section": "national", 
    "title": "BJP lands in a propaganda muddle", 
    "subsection": "general", 
    "date": "2016-01-06"
}