{
    "author": [
        "P Sujatha Varma"
    ], 
    "text": "Shamed, frisked, hand-cuffed and heaped with racist abuse by the U.S. immigration authorities at New York airport, Vijayawada boy K.M. Kumar is back home. Dejected, he now plans to head to a new destination — Canada.\n\nVijayawada-based Kumar shared his 22-hour-long ordeal at New York airport with The Hindu .\n\nAfter pursuing a course in bio-technology from a local college, he applied for a seat in New England College, Henniker, New Hampshire in the U.S., to pursue Masters in Computer Information Sciences.\n\nOn December 30, he flew to London and from there to New York. Little did he know that the next few hours would change the course of his career plans. “Even as the immigration officer was about to put the stamp, a Customs and Border Protection (CBP) officer came and engaged him in a small talk. As he came to know that I was an Indian, the CBP officer exclaimed: “May be he is the last Indian coming through; I’ll just grab him,” and quickly took away my passport and I-20 from the immigration officer.”\n\nAs Kumar walked along, the CBP officer asked him if he was doing some fraud. He scrutinised his passport and I-20 and asked him if he had paid the college fee and demanded to see the receipt.\n\nThe CBP also asked where he planned to stay in the U.S. and details about his accommodation. “After a while, I was taken to a room, made to face the wall and frisked.”\n\nThe terminal was about to close and so the CBP officer handed him over to two other officers who cuffed his hands in the back. “With my hands cuffed, they made me drag my luggage bag from one terminal to the other,” he says.\n\nThey asked me to wait and this wait lasted for 16 hours. “When I asked them what the problem was, they said I had ‘bought’ my visa. I was made to sit along with 20 other Indian students, all of them were seeking admissions in either Silicon Valley University (SVU) or Northwestern Polytechnic University (NPU) in California,” he said.\n\nThe next day afternoon, an officer named Raymond Nauth from U.S. Department of Homeland Security came to Kumar and asked him to show immigration papers. “After verifying them, he discussed the issue with a female colleague saying the papers are alright and finding ground to stop me may not be possible,” recalls Kumar.\n\nThe officer left the place and returned after a couple of hours. “I pleaded with him to allow me to talk to my mother as she would be anxious to know about me. He agreed and I narrated the sequence to my mother.”\n\nU.S.-bound Vijayawada student narrates his traumatic experience", 
    "section": "national", 
    "title": "Dejected student makes alternative plans", 
    "subsection": "general", 
    "date": "2016-01-06"
}