{
    "author": [
        "Josy Joseph"
    ], 
    "text": "Thousands of troops were stationed near the airbase, but precious time was lost by sending National Security Guard commandos all the way from Delhi\n\nrmy and security circles are bewildered and angry over the way the government kept the Army from the Pathankot terror hunt, especially in the early phase, when Army troops were available in thousands close by. Instead of pressing Army units into immediate action, precious time was lost in sending a few dozen NSG commandos from New Delhi.\n\n“None of us can believe what they did. We have two infantry divisions and two armoured brigades in the vicinity. We have at least three corps headquarters in a couple of hours’ drive, and the Northern Army headquarters too. All of those troops are seasoned in carrying out counter-terror operations,” said a serving Brigadier posted close to Pathankot. “Instead, they wasted time to send a few dozen NSG commandos to the base?”\n\nLieutenant-General Prakash Katoch, a veteran para-commando and leading authority on special forces operations in India, said: “NSG is required for a specific target, it cannot tackle an area target.” He said that in a place such as the Pathankot airbase, the perimeter had to be secured first and combing operations to hunt down terrorists should have been initiated. “The Army is the best for that,” he said.\n\n“There is no harm in sending the NSG, but then you should have a clear command and control. You cannot shove in the BSF, NSG, Army, etc, just like that. Was there a command and control there?” Gen. Katoch said.\n\nGeneral V.P. Malik, former Army chief, told The Hindu : “I don’t know if the NSG was the right one. They came from Delhi. It should be given to a local agency which knows the place.”\n\nFormer IAF chief Air Chief Marshal Fali H.Major said: “Garuds were raised for a different mandate for special Air Force tasks and not anti-terror operations. The DSC personnel are basically re-employed people.”\n\nA serving Army officer said that the Army with its 10 Special Forces units, and at least the one based in Udhampur, would have been in Pathankot in a couple of hours. “We practise all the time for such operations,” he said. “Instead, you send NSG commandos in the night. Who told them that they could defend the 24 sqkm of the base with 160 commandos?”\n\nA senior serving officer said if the government had followed the management principle of “functional foremanship” which advocates the right man for the right job, it would have saved precious lives and ensured quick elimination of terrorists.\n\n“It was not the job of the NSG or the Garuds. It is the job of the infantry,” he told The Hindu . The local Army unit conducts a recce of the entire airbase every six months, but they were not allowed to get in when the situation came, he said.\n\nLt.Gen. Vinod Bhatia, former Director-General of Military Operations, told The Hindu : “The operation was not handled the way it should have been. The fact is, it has gone on for too long. If the Army was called in, they could have a better cordon as they have more strength. There was no unity of command. There has to be a single commander given the wherewithal and authority.”\n\n“The complete infantry of the Indian Army has been fighting counter insurgency for decades,” another officer noted, adding, “This could have been handled much better with fewer casualties.” “How many times has the government airlifted the NSG for operations in the Valley? The infantry has been fighting for a long time and has been doing a good job,” he said.", 
    "section": "national", 
    "title": "Deploying NSG instead of Army was a mistake: experts", 
    "subsection": "general", 
    "date": "2016-01-06"
}