{
    "author": [], 
    "text": "Harper Lee put in many of the characters from her first novel in Go Set a Watchman .— File photo: AFP\n\nHarper Lee's second novel tops 2015 US bestseller list\n\nHarper Lee’s second novel Go Set a Watchman topped the US bestseller list in 2015, selling 1.6 million copies more than half a century after her Pulitzer-winning first book was published.\n\nThe figures were based on US print unit sales reported to Nielsen since the novel was published in July, snapped up by avid fans who for decades thought the reclusive author of To Kill a Mockingbird would never publish another word.\n\nPre-orders turned it into an instant bestseller at many retailers the moment its release was announced by publishers HarperCollins last February.\n\nThe novel features many of the characters of Lee’s 1960 masterpiece, which was turned into an Oscar-winning movie starring Gregory Peck.\n\nConsidered a 20th century classic that defined racial injustice in the Depression-era South of the United States, Mockingbird is standard reading in classrooms across the world.\n\nLee’s second published novel, which earned more mixed reviews, was seemingly discovered in her safe deposit box in still-unclear circumstances. The 89-year-old is now confined to a nursing home, her sight and hearing deeply affected by a stroke, and has given no public interviews for years.\n\nLee wrote the manuscript in the late 1950s, but her then-editor suggested she recast the book from the childhood perspective of Scout, which became Mockingbird .\n\nWhile some reviews have been charitable about its merit in plotting her development as a writer, others have been scathing about the unedited draft, set in the era of the civil rights movement.\n\nSecond and third bestsellers were the latest instalments in Jeff Kinney’s Diary of Wimpy Kid series and British author EL James’ mommy-porn erotica Grey: Fifty Shades of Grey as Told by Christian . Each sold 1.48 million and 1.4 million copies respectively in the United States, according to data compiled by Nielsen. In fourth place was nail-biting thriller The Girl on the Train written by Paula Hawkins, a former journalist based in London.\n\nThe same book topped the list of top 10 Kindle bestsellers on Amazon in 2015, on which Go Set a Watchman came sixth. — AFP\n\n“Go Set a Watchman”\n\nfeatures many of the characters of Lee's 1960 masterpiece", 
    "section": "national", 
    "title": "Harper Lee’s novel tops U.S. bestseller list", 
    "subsection": "general", 
    "date": "2016-01-06"
}