{
    "author": [
        "Nirnimesh Kumar"
    ], 
    "text": "Union Finance Minister Arun Jaitley arrives at the Patiala House Court on Tuesday for deposing in the defamation case against Arvind Kejriwal and others.— Photo: Shanker Chakravarty\n\nUnion Finance Minister Arun Jaitley on Tuesday deposed before a Delhi court that he had not “received a single rupee from the Delhi and District Cricket Association (DDCA) on any account” during his presidential term between 1999 and 2013.\n\nMr. Jaitley recorded the statement before Chief Metropolitan Magistrate (CMM) Sanjay Khanagwal, while examining himself as a witness in a defamation case filed by him against Delhi Chief Minister Arvind Kejriwal and five other AAP leaders.\n\nMr. Jaitley has sought prosecution of Mr. Kejriwal and AAP leaders Ashutosh, Kumar Vishwas, Raghav Chaddha, Deepak Bajpyee and Sanjay Singh for allegedly defaming him and his family by accusing him of taking illegal pecuniary benefit from the DDCA when he was heading it.\n\n“Between December 1999 and December 2013, I was the president of the DDCA. I discharged my functions lawfully and with utmost integrity. I have not received directly or indirectly a single rupee from the DDCA on any account whatsoever. I have not even charged any amount towards expenditure,” Mr. Jaitley said in his evidence.\n\nThe Minister further said that the statements [by Mr. Kejriwal and the other AAP leaders] were aimed at deflecting attention from a CBI investigation against a public servant who was working with accused no. 1 [Mr. Kejriwal] in relation to a complaint filed by a third party.\n\nTalking to reporters on December 15, Mr. Kejriwal had said: “The CBI raided my office to locate files related to corruption in the DDCA. Which file? DDCA files in which Arun Jaitley is in the dock. I was about to order a commission of enquiry…”\n\nQuoting these remarks in his complaint, Mr. Jaitley termed them baseless and defamatory.\n\nReferring to the construction and renovation of the cricket stadium at Ferozeshah Kotla when he was the DDCA president, Mr. Jaitley said the executive committee or the board of directors of the company had authorised a committee to supervise it, of which he was not a member.\n\nHowever, in his capacity as the president, he used to chair the board meetings where only important decisions were put up for approval before the board or the executive committee, the Finance Minister said.\n\nRajat Sharma examined\n\nThe court also examined Rajat Sharma, chairman and editor-in-chief of India TV, as a witness in support of Mr. Jaitley.\n\nJaitley deposes in Delhi court in defamation case against Arvind Kejriwal", 
    "section": "national", 
    "title": "‘I didn’t take a single rupee from DDCA’", 
    "subsection": "general", 
    "date": "2016-01-06"
}