{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "The telephonic conversation between Prime Minister Narendra Modi and his Pakistani counterpart, Nawaz Sharif, on Tuesday over the terrorist attack on the airbase at Pathankot assumes significance as it indicates for the first time that New Delhi is giving Islamabad a chance to prove that it will crack down on the group responsible for the terrorist strike, believed to be the Bahawalpur-based Jaish-e Mohammad.\n\nSignificantly, the government has refrained from officially naming any group, or pointing a finger at the Pakistani establishment. In a speech on Sunday, Prime Minister Modi referred to the terrorists only as “enemies of humanity” who “couldn’t bear to watch India’s growth”.\n\nSpeaking to Mr. Modi, Mr. Sharif reportedly “appreciated the maturity shown by the government of India in its statements,” while conveying his “sadness and grief” over the loss of lives.\n\nOfficials told The Hindu that the next step in engagement depended entirely on what “action on the ground” was taken by Pakistan on the basis of evidence that India had shared. While neither side officially confirmed the details of the leads shared by the two National Security Advisers, sources told The Hindu , they spoke on Tuesday morning and once earlier.\n\nThe leads shared reportedly include details of the calls made by the terrorists to their handlers and families in Pakistan, as well as evidence recovered from their bodies. The fact that India had shared leads on the Pathankot operation, even while it was ongoing, was revealed by the Pakistan Ministry of Foreign Affairs on Monday night in a statement where it confirmed that the government was working on evidence provided by India.\n\nThe close coordination between the two governments and the lack of a belligerent reaction from India as in the past, gives credence to reports that India had received credible intelligence from sources “on the ground” in Pakistan.\n\nWhile officials on both sides did not confirm the reports, a senior intelligence official told The Hindu that a “specific alert” was received in late December from the intelligence agencies of “a third country” around Christmas day.\n\nAccording to sources, it was this alert that allowed the National Security Adviser Ajit Doval to make preparations for the attack on the Pathankot airbase.", 
    "section": "national", 
    "title": "India gives Pakistan a chance to take action", 
    "subsection": "general", 
    "date": "2016-01-06"
}