{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "The Supreme Court on Tuesday sought parity from the government, asking why it should not dump its fleet of five to 10-year-old diesel vehicles and join forces with the citizen who is forgoing his personal comfort to fight pollution in the National Capital.\n\nIn a day-long hearing before a Bench led by Chief Justice of India T.S. Thakur, who himself opted to car pool with a fellow Supreme Court judge to curb pollution, the Supreme Court asked why the government apparatus required differential treatment from the citizen.\n\n“How can the government be a polluter? Is the Government of India willing to phase out five to 10-year-old vehicles running on diesel?” the apex court asked.\n\nFurther tightening its grip on the pollutant traffic inflow into Delhi from outside, the apex court ordered that entry points at National Highways 2, 10, 58 and State Highway 57 should be shut down for heavy commercial traffic not meant for Delhi. It has sought a field report in three weeks.\n\nThis would further limit traffic entering Delhi in addition to the entry restrictions imposed on commercial traffic on national highways 1 and 8 in its December 16 order.\n\nThe court refused to re-think its order giving NCR taxis time till March 31, 2016 to convert to CNG. Instead it suggested more CNG fuel stations be set up and asked the government whether it could leapfrog from the existing Bharat Stage (BS) IV emission norms to BS-VI by 2017.\n\nAware that the odd-even policy implementation has led to cramped commuter space in public transport, the Bench suggested that the Delhi Metro run some special premium coaches. The court further said the Delhi government’s duty to the public did not end with the odd-even policy and extends to helping commuters by increasing the number of buses and routes.\n\nThe Bench directed the Delhi government to comply with its July 27, 1998 order to augment the bus fleet from 5,000 to 10,000 vehicles.\n\nWhen the Delhi government complained that there was no space to park the buses as the DDA was yet to provide over half of the 78 acres allotted for it, the Bench asked Solicitor-General Ranjit Kumar to take instructions and get the land allotted for the purpose.\n\nThe next hearing is scheduled for January 20.\n\nBench asks Centre why its fleet of ageing diesel\n\nvehicles should\n\nnot be scrapped", 
    "section": "national", 
    "title": "Is government not a polluter, asks SC", 
    "subsection": "general", 
    "date": "2016-01-06"
}