{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Two days after Rashtriya Janata Dal chief Lalu Prasad made a surprise inspection of a hospital, provoking the BJP to question his locus standi for such a move, Bihar Health Minister and Mr. Prasad’s elder son, Tej Pratap, on Tuesday spoke out in his defence.\n\n“ My father went to the hospital and observed many discrepancies there. He has issued directives (to take steps to improve the conditions) to us and we’ll abide by them after discussions with the officials.” Mr. Tej Pratap told mediapersons here.\n\nHe said people had given leaders the mandate to work and “we’re working for them”. Mr. Prasad made the surprise visit to the Indira Gandhi Institute of Medical Sciences (IGIMS) hospital, where he received feedback from patients regarding the facilities. He also met the doctors on duty. Mr. Prasad later told mediapersons that he had gone to meet a patient admitted to a private hospital in Raza Bazaar area and only visited the IGIMS to assess its condition. He then apparently advised Mr. Tej Pratap to inspect government hospitals at regular intervals.\n\nFollowing this, 40 nurses on contract services in the Patna Medical College and Hospitals (PMCH) came to meet Mr. Prasad on Monday, demanding regularisation of their jobs. However, Mr. Prasad reportedly refused to meet them.\n\nThe Opposition BJP, however, seized the occasion to question Mr. Prasad’s credentials. “In what capacity did Lalu Prasad go to inspect the government-run hospital and give directions to officials and doctors?” asked senior state BJP leader Sushil Kumar Modi.\n\n‘Two power centres’\n\n“Isn’t it proof enough that Bihar has two power centres? Nitish Kumar is the Chief Minister while Lalu Prasad is running the government,” he added.\n\nReacting to Mr. Tej Pratap’s defence, BJP MLA Nitin Navin asked, “For how long will Tej Pratap be his father’s pampered child? A father can give directions to his son in his home, not in hospitals in his son’s official capacity.”", 
    "section": "national", 
    "title": "Son defends Lalu’s ‘surprise’ hospital check", 
    "subsection": "general", 
    "date": "2016-01-06"
}