{
    "author": [
        "Madhumathi D S"
    ], 
    "text": "It is being readied to take up at least four more launches a year\n\nThe nation’s space launch complex at Sriharikota in coastal Andhra Pradesh, which reached its milestone 50th launch last month, is being readied to take up at least four more launches a year than now.\n\nWork on the second vehicle assembly building (SVAB) began three months ago and is scheduled to be ready by mid-2017. It will enable the Indian Space Research Organisation (ISRO) to do a dozen launches a year compared to about eight at present; this includes both the PSLV and the GSLV vehicles, according to P. Kunhikrishnan, Director of the launch port, Satish Dhawan Space Centre (SDSC).\n\n“Work on the second VAB began in October last year by a team of Indian industries. [VAB2] is a complex project, about three times bigger than the existing one. We expect to get it completed by the first half of 2017 and start using it from the second half onwards,” he said.\n\nIt will handle different types of future launch vehicles that are also in the works at other centres.\n\nSDSC has two launch pads, LP1 and LP2, which are both designed differently. A vehicle assembly bay is attached to LP2 by rail. The second bay will also be connected to LP2 by rail and will increase SDSC’s total launch frequency, Mr. Kunhikrishnan told The Hindu .\n\nISRO is midway through work on the heavy-lift GSLV Mark III vehicle and is working on another 10-tonne-capacity semi-cryogenic launch vehicle. The new VAB is being tailored to these.\n\nLeaving the preparation time between two launches, normally ranging from a month to two, LP1 can now do up to five launches and LP2 up to eight, while focussing on GSLV and MkIII, Mr. Kunhikrishnan said.\n\nLast month, SDSC completed 50 launches since the first flight of 1979. The maiden one, SLV-3 E1, of August 1979 was a failure but marked the country’s first shot at putting satellites in orbit. So far it has put into orbit 42 Indian satellites including communication, navigation and remote sensing (Earth observation) kinds; and 57 small satellites for foreign customers.\n\nThe historic 50{+t}{+h}launch was the December 16 flight of PSLV-C29 carrying six Singapore satellites, ISRO said, noting that SHAR was developed from a barren island into a world class launch pad that meets international demand for launching small and mid-sized satellites ranging from a few kilos up to 1.5 tonnes.", 
    "section": "national", 
    "title": "Sriharikota space port scores 50", 
    "subsection": "general", 
    "date": "2016-01-06"
}