{
    "author": [
        "National Bureau"
    ], 
    "text": "Union Finance Minister Arun Jaitley on Tuesday referred to the lack of impetus to private sector investments in infrastructure.\n\n“Worldwide, the experience has been that when the going is tough, state institutions have to take the lead. When the going is good, the private sector has an important role to play,” he said, speaking at a function to mark 10 years of India Infrastructure Finance Company Limited.\n\nThe resources deployed by the government in national highways, rural roads and the railways brought about a change.\n\n“In the last one year, a lot of stalled highway projects have got moving. As a result of enhanced public investment, even private players, who were bogged down in disputes with the highway authority, have now re-entered the fray.”\n\nFunding a challenge\n\nMr. Jaitley said funding infrastructure projects remained a big challenge, and the government was hopeful of partnering sovereign wealth funds and pension funds that evinced interest in the National Investment and Infrastructure Fund.\n\nMaking an assessment of different infrastructure sectors, Mr. Jaitley said the Railways were on the right track but needed a forward movement.\n\n“Foreign direct investment has been allowed and announced by GE and Alstom in two large manufacturing projects in Bihar. The Ministry will soon come out with bids for redeveloping 400 stations,” he said. The Railways also intended to mobilise international investments and raise funds through tax-free bonds, he said.\n\nPrivate investors, he said, were keen on investing in ports, but called for corporatising major port trusts that faced the risk of being overtaken by ‘minor ports’ in cargo traffic.\n\nAs for airports, he said the government was focusing on improving managerial efficiency as investments had already been made to spruce up many mid-level and smaller airports.\n\n“These can no longer be considered green-field or brown-field projects, so the Civil Aviation Ministry is considering a proposal to bring in management participation [from the private sector].”\n\nWhen the going\n\nis good, private sector has an important role to play, says Jaitley", 
    "section": "national", 
    "title": "‘State institutions must act during slowdown’", 
    "subsection": "general", 
    "date": "2016-01-06"
}