{
    "author": [], 
    "text": "Siddhartha Dhar fled Britain with his wife and four children to join the IS\n\nA protester identified as Siddharta Dhar outside the U.S. embassy in London is believed to be the masked figure in the latest IS video.— PHOTO: Reuters\n\nThe terrorist dubbed “new Jihadi John”, who appeared in a new video released by the Islamic State (IS), threatening attacks on the United Kingdom, is believed to be an Indian origin British Muslim convert, media reports said on Tuesday.\n\nSiddhartha Dhar, also known as Abu Rumaysah, had jumped bail and fled Britain in 2014 with his wife and their four children to join the IS in Syria.\n\nBorn a Hindu, the 32-year-old ran a business renting out bouncy castles in London before converting to Islam and joining the radical Islamist group Al Muhajiroun.\n\nAn official source told the BBC that Dhar is the focus of investigations into the video, which purports to show the killing of five men the IS says were spying for the U.K.\n\nThe video also features a young boy wearing a black bandanna around his head and army-style camouflage clothing, threatening in English to “kill the kaffir (unbelievers) over there”.\n\nBritish intelligence officials are analysing the film. Dhar’s mother and sister have also watched the video, released by the IS on Sunday, and noticed similarities between the voice of the masked terrorist, being referred to as the “new Jihadi John” by the British media.\n\n“I heard the voice, yes, but I don’t know, I’m not sure of the voice. These are the most difficult questions to answer. I just cannot say. I’m not sure within myself whether it is the truth or not,” his mother Sobita Dhar said.\n\nHis sister, Konika Dhar, from north London, said: “I believed the audio to resemble, from what I remember, the voice of my brother, but having viewed the short clip in detail, I wasn’t entirely convinced, which put me at ease.\n\n“I can’t believe it. This is just so shocking for me. I don’t know what the authorities are doing to confirm the identity, but I need to know if it is.”\n\nShe said her brother had converted to Islam more than 10 years ago and her memories of him are from when they were children and teenagers.\n\n“He was a very pleasant boy, and I know it may be hard to believe, but he still is, and I still believe that he still can be that person,” she said.\n\n‘It is Dhar's voice’\n\nOne of Dhar’s former business associates told the BBC he had “no doubt” the voice on the video was that of Dhar, who had been arrested by the British police on the suspicion of encouraging terrorism but was later able to travel to Syria after being bailed.\n\nHis former neighbours from Walthamstow in east London claimed Dhar’s wife was more devout than him and suggested she may have put him on the path to extremism.\n\nIn the months leading up to his arrest, Dhar was accused of calling for the imposition of Sharia law in Britain. — PTI\n\nBorn a Hindu, he converted to Islam and joined the radical group\n\nAl Muhajiroun", 
    "section": "national", 
    "title": "Terrorist may be of Indian origin", 
    "subsection": "general", 
    "date": "2016-01-06"
}