{
    "author": [
        "Mohit M"
    ], 
    "text": "The time is ripe to declare M.M. Hills and Cauvery wildlife sanctuaries as tiger reserves, says expert\n\nAt one point of time, it was the gunshots of brigand Veerappan that rang through the forest ranges of M.M. Hills and Cauvery Wildlife Sanctuaries. Now, it is the roar of tigers that echoes through the forest.\n\nAt least 15 tigers are believed to inhabit the vast scathes of the 2,000-sq km area of the sanctuaries in Chamarajanagar, according to a study by the Nature Conservation Foundation.\n\nClaiming it to be the first time the population of the endangered species has been enumerated in the region, Sanjay Gubbi, conservation biologist who led the camera trapping exercise, says the time is ripe to declare the areas tiger reserves.\n\nAccording to the study, 10 to 12 tigers, along with nine cubs below the age of two, were spotted in M.M. Hills, while the Cauvery Wildlife Sanctuary had two male tigers. “What is encouraging is that sub-adult population, cubs below the age of two, were found in the M.M. Hills park. This means that there is breeding and a healthy population in the area… These big cat numbers are larger than those in most declared tiger reserves,” Mr. Gubbi said.\n\nThe large presence of prey species seen in the camera trap also gives credence to the viable tiger habitats of the parks. Sambars, wild pig and gaur were found in M.M. Hills; while, chital, four-horned antelope and wild pig dotted the Cauvery Wildlife Sanctuaries, making the landscape suitable for the large cats.\n\nFor the tiger, the protected area spread out as verdant, virgin forests. The territory of a large male cat, for instance, was found to be more than 359 sq km, or nearly half the size of Bengaluru.\n\nApart from the tiger, the study captured 27 species of mammals, while around 15 tuskers were spotted, which was a good sign after Veerappan’s gang had poached many elephants in the area.\n\nSmall corridor\n\nM.M. Hills, which borders the BRT Tiger Reserve, can serve as a vital sink to absorb the populations of endangered creatures in the park, the study says. However, the migration between the two protected areas was through a narrow 1-km Doddasampige-Yediyaralli forest patch. It was critical for this patch to be protected and expanded, Mr. Gubbi said.\n\nState treading cautiously\n\nThough the National Tiger Conservation Authority (NTCA) had given an in-principle approval for the declaration of the two sanctuaries as a tiger reserve a year ago, the State government has yet to sign it or give its assent. Senior officials in the Department of Forest, Ecology and Environment said the proposal had been kept on hold with the Cabinet believing it “could become a political issue”. Chamarajanagar district in-charge Minister H.S. Mahadeva Prasad said the opinions of locals would be taken before extending complete support to the proposal.", 
    "section": "national", 
    "title": "Tiger roar grows louder in Karnataka sanctuaries", 
    "subsection": "general", 
    "date": "2016-01-06"
}