{
    "author": [], 
    "text": "The estimated size of the Giganthopithecus or giant gorilla in comparison with a human. , German Professor Friedemann Schrenk shows a molar (type specimen) of the giant gorillas.— Photos: Senckenberg Research Institute/AFP\n\nThe Gigantopithecus disappeared a million years ago due to its inability to adapt to environmental changes\n\nThe largest ape to roam Earth died out 1,00,000 years ago because it failed to tuck into savannah grass after climate change hit its preferred diet of forest fruit, scientists suggest.\n\nGigantopithecus — the closest Nature ever came to producing a real King Kong — weighed five times as much as an adult man and probably stood three metres tall, according to sketchy estimates.\n\nIn its heyday a million years ago, it inhabited semi-tropical forests in southern China and mainland Southeast Asia. Until now, though, almost nothing was known about the giant’s anatomical shape or habits.\n\nFossil records\n\nThe only fossil records are four partial lower jaws, and perhaps a thousand teeth — the first of which turned up in the 1930s in Hong Kong apothecaries where they were sold as “dragon’s teeth.”\n\nThese meagre remains “are clearly insufficient to say if the animal was bipedal or quadrupedal, and what would be its body proportions,” Herve Bocherens, a researcher at Tubingen University in Germany, said.\n\nIts closest modern cousin is the orangutan, but whether Gigantopithecus had the same golden-red hue, or was black like a gorilla is unknown.\n\nAnother mystery: its diet. Was it a meat-eater or a vegetarian? Did it share a taste for bamboo with its neighbour the prehistoric giant panda?\n\nAnswering this riddle might also tell us why a monster that surely had little to fear from other fauna went extinct. That’s where the teeth had a story to tell.\n\nExamining slight variations in carbon isotopes found in tooth enamel, Mr. Bocherens and an international team of scientists showed that the primordial King Kong lived only in the forest, was a strict vegetarian, and probably wasn’t crazy about bamboo.\n\nThese narrow preferences did not pose a problem for Gigantopithecus until Earth was struck by a massive ice age during the Pleistocene Epoch, which stretched from about 2.6 million to 12,000 years ago.\n\nThat’s when Nature, evolution — and perhaps a refusal to try new foods — conspired to doom the giant ape, Mr. Bocherens explained.\n\n“Due to its size, Gigantopithecus presumably depended on a large amount of food,” he said. “When during the Pleistocene, more and more forested area turned into savannah landscapes, there was simply an insufficient food supply,” he added.\n\nSome apes survived\n\nAnd yet, according to the study, other apes and early humans in Africa that had comparable dental gear were able to survive similar transitions by eating the leaves, grass and roots offered by their new environments.\n\nBut for some reason, Asia’s giant ape — which was probably too heavy to climb trees, or swing in their branches — did not make the switch.\n\n“ Gigantopithecus probably did not have the same ecological flexibility and possibly lacked the physiological ability to resist stress and food shortage,” notes the study, which is to be published in a specialist journal, Quaternary International . — AFP", 
    "section": "national", 
    "title": "Why the real King Kong became extinct", 
    "subsection": "general", 
    "date": "2016-01-06"
}