{
    "author": [], 
    "text": "A Chinese woman, surnamed Zhang, posing for photos on an empty flight from Wuhan to Guangzhou, after the China Southern flight was delayed for 10 hours.Other passengers made alternative arrangements due to the delay.— Photo: AFP\n\nA Chinese woman heading home for the holidays had a commercial airline flight all to herself after gruelling delays winnowed down other passengers.\n\nAs nearly 1,00,000 people found themselves stranded at train stations in Guangzhou on Monday, the woman, surnamed Zhang, documented her unique trip to the city on social media. She posted photos showing row after row of empty seats on the China Southern plane as it flew from Wuhan. The flight was delayed for 10 hours, and other passengers departed on earlier flights, leaving Zhang to enjoy personalised attention from the plane’s crew.\n\nThe experience was “tuhao,” she said on her social media feed, using a slang term for the nouveau riche.\n\nChina Southern schedules show the flight is normally operated using a Boeing 737-700 aircraft, which generally seats 137 passengers. Statistics on website Flightradar24 show that a China Southern flight from Wuhan to Guangzhou on Monday was due to leave at 0640 GMT, but did not do until 1639 GMT.\n\nThe huge movement of Chinese travelling home to spend the Lunar New Year with their families is often described as the world’s largest human migration and overcrowded planes, trains and automobiles are the norm.\n\nMany on social media envied Zhang’s good luck in avoiding the enormous crowds. “What a fluke that you went against the big New Year's current,” one comment said, noting that the plane will be completely full on its flight back from Guangzhou, a prosperous city that attracts many economic migrants.\n\nOver the last several days, tens of thousands have been stranded at the city’s trains stations due to weather conditions. But one commenter saw the glass half-empty: “Even under these conditions, they still didn’t upgrade you?” — AFP", 
    "section": "national", 
    "title": "Chinese woman only passenger on Lunar New Year flight", 
    "subsection": "general", 
    "date": "2016-02-04"
}