{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "Dalit students of the Indian Institute of Mass Communication here, upset by campus mate, Utkarsh Singh’s offensive Facebook post, demanded a public apology from Mr. Singh, who defended himself, claiming that it was a matter of his “freedom of expression.”\n\nIn a letter to the director general of IIMC on Monday, the students wrote, “We do not want any punitive action except a public apology and undertaking against the writing or spreading such messages. We would beg to request a slot in the academic timetable to be allocated for the sensitising of all the students by experts in the field of Caste/Tribe reality and affirmative action to promote amicability and inclusivity on campus. This initiative would make us feel human and dignified.”\n\nHowever, alarmed at the support the post was receiving online, the students have made a complaint to the Ministry of Social Justice and Empowerment’s National Commission for Scheduled Castes with attachments of the post.\n\n“The FB post was outright casteist, sexist and racist. It attacks both women and the community and affirmative action for the poorest in India in the most vile manner. If such a mindset becomes part of the discourse of young trainee journalists, both IIMC and the nation are doomed,” a faculty member said.\n\nThe institute comes under the Information and Broadcasting Ministry, the Secretary of which is Sunil Arora.\n\nMr. Arora said he has directed Joint Secretary Mihir Kumar Singh to submit a report by February 10, adding that there would be “zero tolerance” on such matters.\n\n“We have sought several measures like sensitising the campus on issues revolving around gender and caste discrimination,” students said, adding that they were cautioned against the implications of protesting as their “careers were at stake.”\n\nAbout 350 media professionals pass out from the IIMC every year and the institute has around 30 students from the SC/ST communities on its rolls. Last year, it cancelled an invitation to scientist Gauhar Raza for a lecture after the institute discovered that he made a documentary on the Gujarat riots.\n\nAs the institute comes under the watch of the Ministry which appoints the director general, administrators keep a watch on any transgression that might embarrass the government.\n\nIIMC students say they do not want any punitive action except a public apology", 
    "section": "national", 
    "title": "Dalit students complain to Social Justice Ministry", 
    "subsection": "general", 
    "date": "2016-02-04"
}