{
    "author": [
        "Vikas Dhoot"
    ], 
    "text": "The government has drawn up an ambitious plan to scale up the present regime for direct transfer of benefits to the poor under various welfare schemes, by creating a unified national database of beneficiaries that can be updated in real-time and automatically trigger new benefits such as vaccine shots for a newborn baby.\n\nThe blueprint drawn up over the past three months aims to transform the direct benefits transfer (DBT) regime launched in January 2013, into a social security platform linked to the beneficiary database that will have details about the household.\n\n“Once we have the database, and the wherewithal to update it, event-based information from a household can make it possible for departments to activate new benefits from them, such as a vaccine for a baby [once her or his birth is registered], or nutritional support for lactating and expectant mothers,” said Peeyush Kumar, Joint Secretary in charge of DBT at the Cabinet Secretariat.\n\n“There is a need for a social security platform, which we have been looking at for the last 2-3 months. This has been under discussion for some time within the Finance Ministry, and later, in the Cabinet Secretariat,” Mr. Kumar said at a day-long workshop hosted here by the secretariat and the Centre for Digital Financial Inclusion.\n\n“We realised early on that having a bank account alone is not enough. While Aadhaar is a great idea, it doesn’t have any household data and is a portable identity so cannot be linked to the taluka and tehsil levels. So we are looking at a unified beneficiary database that captures and links the bank accounts, Aadhaar number and mobile number with households,” he said.\n\nWhile the trinity of Jan Dhan Yojana, Aadhaar and mobile connectivity, referred to as JAM, would still play a key role, the government believes there are still several operational issues with the three elements that will take time to sort out. For instance, improvement in mobile network coverage and higher enrolments under Aadhaar would take time.\n\n“So we have about 18 months time till these are sorted out. Like a Hindi movie cop, we don’t want to arrive after the event, so we are looking at what could be the shape of government services then, with a social security platform,” Mr. Kumar said.\n\nA committee in the Cabinet Secretariat is also working with the Finance Ministry to create a network of 2 million cash points such as kirana stores, chemists and Grameen Dak Sewaks in 6 lakh villages by March 2017, so that getting the cash in hand isn’t an ordeal for the rural poor.", 
    "section": "national", 
    "title": "DBT regime may evolve into a social security platform", 
    "subsection": "general", 
    "date": "2016-02-04"
}