{
    "author": [
        "Josy Joseph"
    ], 
    "text": "Delay in production, delivery plagues the units enjoying monopoly in defence aerospace sector\n\nThe success of Make in India critically hinges on country’s success in creating a robust aerospace industry, but a vacuum occupies the core of the government-dominated sector. Classified official reports on the state of affairs in defence production and delivery in the aerospace sector present a revealing picture.\n\nOfficial studies have been conducted in recent years into India’s ambition to emerge as a major aerospace manufacturer that can design and build its own aircraft and related systems. All those reports remain confidential, and the government has taken almost negligible action on them to improve the situation, according to an assessment by The Hindu .\n\nThe studies show that the Hindustan Aeronautics Ltd, Bharat Electronics Ltd, Bharat Dynamics Ltd and Mishra Dhatu Nigam Limited (MIDHANI) —all of them enjoying virtual monopoly in defence aerospace sector — have been booking profits over the years not from their businesses. Instead, they take huge advances from the military against future deliveries, earn interest on them, and show them as profits. Then they award a significant part of the so-called profit to their majority shareholder, the government.\n\nWith annual defence budget growing at a healthy rate, and defence forces under pressure to spend them within the financial year, it is now a well-established practice for them to give away significant advances to the defence PSUs, even if there is significant delay in production, and products are not delivered for years. That cycle is adding to what is plaguing the DPSUs, the reports point out.\n\n“Although, the profits have been increasing, a major portion of the profit has been from ‘other income’ not related to aircraft repair, maintenance, manufacture/overhaul. Significant portion of the other income comprises the ‘negative’ financing cost due to the interest accrual on advances from Defence Customer for the huge order book,” says the latest report on aerospace sector, submitted in April 2014 and written by a team of officers led by Air Marshal M. Matheswaran.\n\n“HAL is an engineering company in the aerospace sector. It should, by and large, make profits from manufacturing and sale of aeronautical products and allied services in MRO … HAL has very little incentive to create profits through quantity, quality and innovation,” the report says.\n\nHow it makes profit is an eye-opener. The HAL receives advance from the military, almost three times its annual turnover. In 2010-11, the financial turnover was a bit over Rs. 13,000 crore, but the order book was Rs. 68,265 crore, against which HAL took advance of Rs. 35,146 crore from its customers. On that advance, it earned an interest income of over Rs. 2,200 crore, and booked a profit after tax of Rs. 2,114 crore. That year, HAL paid the government, its majority shareholder, a dividend of Rs. 423.12 crore.\n\n“HAL is not a financial institution that makes money from money; it is meant to be an aeronautics engineering company,” the Matheswaran report points out.\n\nIt points to “large scale contribution [more than 70 per cent] of other income [interest on advances etc.] in the profitability of the company. The company’s income has been rising mainly from non-core activities. In the last ten years, other income from interest etc. has grown nearly eight times whereas the net profit after tax has appreciated only 2.8 times,” the report says.\n\nWith a captive customer base, and no government demand on performance improvement, HAL has become an predominant assembler of systems for the Indian military. Its exports have remained negligible: In 2012-13 it exported just Rs. 382 crore worth of systems, the report points out.\n\nThe huge advances against future orders are collected at a time when DPSUs have order books that extend beyond 15 to 20 years. “In theory, at current rates of production and overhaul, HAL would need several decades just to meet the current order book,” the report says, even as it highlights the fact that HAL has stopped indicating its order books since 2010-11 in public reports.\n\nBharat Electronics Ltd\n\nWith over 10,000 employees, BDL is a Navratna DPSU since June 2007 and has nine production units and 31 manufacturing divisions. It produces electronic warfare systems, avionics components etc. for aircraft.\n\n“Like HAL, Bharat Electronics Ltd also enjoys assured orders and large advances from MoD. Its sales/turnover have been rising consistently along with profits,” the report points out. More than 70 per cent of its income has been coming mainly from non-core activities. The report points out that BEL’s income from other sources, especially against advance taken from the military, almost doubled between 2010 and 2013. In 2012-13, other income of BEL stood at Rs. 723.35 crore.\n\nBharat Dynamics Ltd\n\nA manufacturing base for guided weapons systems, BDL has been the prime production agency for the Integrated Guided Missile Development Programme.\n\n“Like other DPSUs, the profitability of the company is mainly due to heavy advances received from MoD. In fact, other income of BDL has been more than the profit of the company.”\n\nThe report points out that the company has been making losses in its core activities and “has been showing profit only due to large order book & advances received from the Government.”\n\nIn 2013, the company had a turnover of Rs. 1,074.71 crore, had taken an advance of Rs. 4,899 crore from the government and earned almost Rs. 522 crore on it, and booked it as other income.\n\nIt also says that BDL is overbooked far beyond its capacity with the requirement of ATGM (anti-tank guided missile) and SAMs (surface to air missiles). It almost enjoys a monopoly in missiles production within India due to government restrictions. Against an annual turnover of just Rs. 1,100 crore the total value of AON (acceptance of necessity) with the company was over Rs. 35,000 crore.\n\nMishra Dhatu\n\nNigam Limited\n\nMIDHANI is equipped for metallurgical facilities to make super-alloys, titanium, special purpose steels etc. for aerospace, defence, atomic energy etc. “The financial analysis of the company for the last two financial years indicates increase in sales revenue and net profit. The profitability of MIDHANI like other DPSUs has a significant contribution of other income generated by the interest accrued on advances received from its customers,” the Matheswaran report says.\n\n(Tomorrow: Part 2 — The secret recipe for success for Indian aerospace majors)", 
    "section": "national", 
    "title": "Defence PSUs: profiting on advances", 
    "subsection": "general", 
    "date": "2016-02-04"
}