{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "A Facebook post by a student of the Indian Institute of Mass Communication (IIMC) here targeting Dalits has led to disquiet in the campus with administrative authorities eager to hush up the matter as the institute prepares for its 48th convocation ceremony.\n\nThe post comes in the wake of the suicide of research scholar Rohith Vemula and subsequent unrest in the University of Hyderabad.\n\nAt IIMC, the chain of events started when three faculty members and students organised a protest to express solidarity with Vemula, who took the extreme step on January 17, and to mark the day with discussions on discrimination. On January 18, Utkarsh Singh, who is pursuing a diploma in Hindi journalism, lashed out at the group with his Facebook post containing derogatory and insulting remarks against the protesting students, a majority of whom belonged to the Scheduled Castes and Scheduled Tribes.\n\nAbout 30 of the SC students who complained to the administrative authorities on January 29 were reportedly told that there was no redress mechanism in the campus.\n\nHowever, under pressure, a committee was formed under a faculty member to examine the issue.\n\nAccording to the students, they demanded a public apology from Mr. Singh, who defended himself, claiming that it was a matter of his “freedom of expression.”\n\nIn a letter to the director general of IIMC on Monday, the students wrote, “We do not want any punitive action except a public apology and undertaking against the writing or spreading such messages. We would beg to request a slot in the academic timetable to be allocated for the sensitising of all the students by experts in the field of Caste/Tribe reality and affirmative action to promote amicability and inclusivity on campus. This initiative would make us feel human and dignified.”\n\nHowever, alarmed at the support the post was receiving online, the students have made a complaint to the Ministry of Social Justice and Empowerment’s National Commission for Scheduled Castes with attachments of the Facebook post.\n\n“The FB post was outright casteist, sexist and racist. It attacks both women and the community and affirmative action for the poorest in India in the most vile manner. If such a mindset becomes part of the discourse of young trainee journalists, both IIMC and the nation are doomed,” a faculty member said.\n\nThe institute comes under the Information and Broadcasting Ministry, the Secretary of which is Sunil Arora.\n\nMr. Arora said he has directed Joint Secretary Mihir Kumar Singh to submit a report on the issue by February 10, adding that there would be “zero-tolerance” on such matters.\n\n“We have sought several measures like sensitising the campus on issues revolving around gender and caste discrimination,” students said, adding that they were cautioned against the implications of protesting as their “careers were at stake.”\n\nAbout 350 media professionals pass out from the IIMC every year and the institute has around 30 students from the SC/ST communities on its rolls.", 
    "section": "national", 
    "title": "IIMC student’s FB post against Dalits stirs disquiet", 
    "subsection": "general", 
    "date": "2016-02-04"
}