{
    "author": [
        "Ignatius Pereira"
    ], 
    "text": "Even rapists manage out-of-court settlements at Kottarakara in Kollam district of Kerala\n\nThe large number of acquittals that the Scheduled Castes and Scheduled Tribes Special Court at Kottarakara pronounced on grounds of “lack of evidence” is turning into a huge cause for concern for the most disempowered section of the State’s population, despite the stringent laws in force.\n\nThe court, tasked with trying cases under the SC/ST (Prevention of Atrocities) Act, 1989, has so far pronounced no conviction in any of the 10 rape cases it has tried. Of the 90-odd cases under the Act that the court has so far decided, there have been only two convictions.\n\n“I have ample grounds to fear that out-of-court compromises are being reached, by either threatening the victims or by paying them hush money,” Dheeraj Ravi, prosecutor of the special court, told The Hindu . Justice is also being sabotaged by unexplained delays on the part of the police in filing the First Information Reports, and by not including the relevant clauses of the Act in the FIR, despite the victims belonging to the SCs and the STs.\n\nUnder the Act, it is mandatory that each revenue district have a special courtto try cases registered under it. But for more than 20 years, no such court was set up in Kerala. It was the district and sessions courts that also officiated as special courts for the purpose.\n\nIt was only three years ago that the first of two such courts came up in Kerala, one in Mananthavady (Wayanad) in February 2013 and the other at Manjeri (Malappuram) the next month. The court for Kollam district was established in June last year at Kottarakara.\n\nOffences under the Act are non-bailable and non-compoundable, but in most of the cases coming up before the court, the SC and ST victims backtrack once the trial begins. These include cases of rape, in which some traumatised victims even tried to kill themselves, or gave birth to babies born out of the rape.\n\nMr. Ravi said in the 10-odd rape cases that were decided by this court so far, none of the accused was convicted, because “compromises” were managed out of court. The only two convictions that the court has so far ordered were for the far lesser charge of outraging the modesty of women, in which the victims stood by their complaints even after the witnesses “mysteriously’’ turned hostile. The prosecutor disclosed to The Hindu that the verdict, in all of the 10 rape cases that the court had tried, were given within a matter of days because the victims abruptly opted out.\n\nOnly one case on trial\n\nCurrently, a solitary rape case is on trial at this court. Most of the witnesses in this case too have turned hostile.\n\nMost victims turning up at the court are daily wage labourers. Besides, a situation is being allegedly created for them to feel harassed when appearing before the court, according to Mr. Ravi. That apart, the victims do not get even the security of their prosecutor because the prosecutor himself does not have even an office. This was in spite of the Kerala High Court intervening and sanctioning an office, which never materialised. So the prosecutor meets and briefs the victims on trial days on the open verandah of the court.\n\nIronically, since this court understandably has very little backlog of cases, there are now moves to give it the additional charge of hearing abkari-related cases.", 
    "section": "national", 
    "title": "Justice a far cry for SC/ST victims here", 
    "subsection": "general", 
    "date": "2016-02-04"
}