{
    "author": [], 
    "text": "Colouring workshops for adults offer a platform for adults to make new friends, beat stress and share their work with family and on social media\n\nColouring to combat stress? You’re not alone.\n\nIntricate colouring books are the latest lifestyle craze to grip the United States, generating millions of fans, booming sales and libraries falling over themselves to host workshops.\n\nWalk into any New York bookstore, and you’ll find them artfully laid out on tables or filling entire shelves. Buyers can choose from Sanskrit patterns, urban landscapes, butterflies and flowers all offering “stress relieving patterns.” The latest fashion? The swear word version.\n\nAmazon sells hundreds of them, including nine on the top 20 bestseller list. Fans post their finished designs and swap tips on Facebook or Pinterest.\n\nDover Publications, which prints dozens of colouring books, decreed August 2 as National Colouring Book Day, sponsoring parties and hosting an online group discussion board for tips on how to throw a successful bash at home.\n\n“It calms us down to be colouring,” Linda Turner, a licensed creative arts psychotherapist in Manhattan, explained of the trend born in Europe. “If you are really with it, if you are really in the presence of colouring the colours and just being with the art, it is a wonderful way to support calming and presence and relaxation,” she said.\n\nMs. Turner said while children are willing to explore and experiment, adults are not necessarily so comfortable with their creativity.\n\n“These colouring books, they look adult, they look sophisticated... and they are going to create, and they are going to be present in the moment and have fun... In ways that are safe for them,” she added.\n\nSince October, 19 branches of the New York Public Library in Manhattan, the Bronx and Staten Island have run colouring workshops, some on a weekly basis.\n\n“We are providing the space and the material and that allows the patrons to socialise with their friends, or meet people that they would never have met before, or do an art work as a group,” said Kelly Yim-Foulke, programming specialist at the New York Public Library.\n\nShe says colouring is easy to do, requires no particular talent and brings back “very fond memories” of being a child.\n\nMost of those who take part are senior citizens and women, but colouring lends itself to inter-generational projects that bring together adults, teenagers and children, she said.\n\nYim-Foulke is thinking about extending the programme and including music, or perhaps putting on an exhibition. “For patrons, it’s low-key, you don’t need a high level of skills to participate. It is also a great opportunity for inter-generational programmes... and it doesn’t cost a lot of money for the library to host, which is excellent.”\n\nMs. Turner is thinking about getting together with colleagues to create “pop-up bars” — temporary spaces where people can colour for free and meet art therapists.\n\n“There is a healing and therapeutic value, because when you are in the process of doing this creation, you are relaxing and de-stressing,” she said.\n\n“It makes you feel more open and more alive, so the stress reduction aspect of it is therapeutic, but it is not therapy,” she added.\n\nThe trend has extended beyond America’s entertainment capital. In Petoskey, a small town in Michigan, the library has just launched a weekly colouring session on Tuesday evenings.\n\n“We thought it could be fun to attract people to the library doing different things,” director Val Meyerson said.\n\nIt is not the first time the United States has fallen in love with colouring books.\n\nThe first of these, The Executive Coloring Book , came out in 1961. It was followed by The John Birch Society Colouring Book and other satirical titles, mocking the world of work, or president John Kennedy. — AFP", 
    "section": "national", 
    "title": "Keep calm and colour on", 
    "subsection": "general", 
    "date": "2016-02-04"
}