{
    "author": [
        "Ben Sisario"
    ], 
    "text": "It will probably last six or seven minutes, and cover at least three or four songs\n\nLady Gaga will pay tribute to David Bowie in a special segment at the Grammy Awards, the organisers of the show announced on Tuesday.\n\nAfter Bowie died last month, speculation in the music industry immediately turned to how his songs and influence would be recognised at the awards show. Would it be a huge revue or a solo performance? An honour paid by fellow legends from Bowie’s generation, or something showing his impact on younger artists?\n\nKen Ehrlich, the long-time producer of the Grammys, said in an interview that Lady Gaga had already been booked for the show before Bowie died. But as soon as the news emerged, Ehrlich said, he began discussing a possible tribute with the singer and her manager. Over the next week, Ehrlich added, he was contacted by numerous other artists who wanted to participate — “some of whom might have made sense; the vast majority didn’t,” he said — but he stuck to the idea of Lady Gaga solo.\n\nIn an interview with The Hollywood Reporter that was conducted before Bowie’s death on January 10, Lady Gaga said: “When I fell in love with David Bowie, when I was living on the Lower East Side, I always felt that his glamour was something he was using to express a message to people that was very healing for their souls.”\n\nHer performance at the Grammys will not be the opening number for the show, but it will probably last six or seven minutes, Ehrlich said, and cover “at least three or four” songs. Nile Rodgers will be the segment’s musical director. The show, on February 15, will be broadcast live by CBS; previously announced performers include Adele, Kendrick Lamar, the Weeknd, Carrie Underwood and Sam Hunt. There will also be a tribute to Lionel Richie, who is the Recording Academy’s 2016 MusiCares person of the year.\n\nLady Gaga’s performance, Ehrlich said, “is going to be a true homage to who David was, particularly musically, but not ignoring his influence on fashion and pop culture in a broader way.”\n\nEhrlich, who has been involved with the Grammys since 1980, said it was always a rush to book the performances for the show in the couple of months between the nominations and the broadcast. But this year has been particularly difficult with the deaths of so many music figures over the last few weeks, including Lemmy Kilmister of Motorhead, Natalie Cole, Glenn Frey of the Eagles and Paul Kantner of Jefferson Airplane. — New York Times News Service", 
    "section": "national", 
    "title": "Lady Gaga to pay tribute to Bowie at Grammys", 
    "subsection": "general", 
    "date": "2016-02-04"
}