{
    "author": [
        "Roli Srivastava"
    ], 
    "text": "The cancer screening technique has limited efficacy in the younger age band: IARC\n\nWhen the International Agency for Research on Cancer (IARC) publishes its handbook on breast cancer screening for the year 2016, it will not include the popular screening technique of mammography for women in the under 50 age-group. Mammography has gained popularity globally, as well as in India, over the years with the rising incidence of breast cancer.\n\nThe IARC, the specialised cancer agency of the World Health Organisation, recommends mammography for women aged over 50 as now there is scientific evidence that it is effective in reducing breast cancer mortality for women in the 50–69 age-group, but has limited efficacy in the younger age band of 40 to 49. It states that the benefit of reduced mortality extends to women screened at age 70–74.\n\nThe IARC publishes handbooks for various cancer types and it is referred to by clinicians across the globe.\n\n“If you look at all the published evidence, except mammography, no other screening has worked and mammography works only for 50-plus women. As a diagnostic tool, it should be offered only to women above the age of 50 or post-menopausal women. With younger women, there could be harm of over-diagnosis and over treatment,” said Surendra Shastri, head of preventive oncology, Tata Memorial Hospital.\n\nDr. Shastri, who heads the WHO Collaborating Division for Cancer Prevention, Screening and Early Detection, said that even women who had crossed 50 should undergo a mammography if good diagnostic and treatment facilities were available. In a special report published in The New England Journal of Medicine , in which Dr. Shastri was a contributor, the IARC working group has noted that screening for breast cancer aims to reduce mortality and morbidity associated with the advanced stages of the disease, through early detection in asymptomatic women. However, there is “inadequate” evidence to prove that breast self-examination reduces mortality even when practised competently and regularly. In the case of mammography, it notes that “the most important harms associated with early detection of breast cancer through mammographic screening are false positive results, over-diagnosis, and possibly radiation-induced cancer.”\n\nSelf-examination vital\n\nDr. Shastri said that women in the lower age groups should continue to do breast self-examination and undergo a clinical breast examination once a year, but there was no evidence to prove so far that it had helped in bringing down breast cancer mortality.\n\nThe WHO too, in its press statement on IARC’s handbook, states that clinical breast examination or breast self-examination are both relatively simple and inexpensive.\n\nIt states: “Evaluation of the current literature showed that there is sufficient evidence that clinical breast examination is associated with the detection of smaller and earlier-stage tumours. However, no data were yet available for an evaluation of the effect of this screening technique on breast cancer mortality.”\n\n“There is risk\n\nof false positive results, over-diagnosis, and possibly radiation-induced cancer”", 
    "section": "national", 
    "title": "No mammography needed for women under 50: WHO", 
    "subsection": "general", 
    "date": "2016-02-04"
}