{
    "author": [
        "Raghava M"
    ], 
    "text": "Gowda moved to Sampaje Reserve Forest after his land was auctioned\n\nChandrashekar Gowda, from Sullia in Karnataka’s Dakshina Kannada district, was 30 when he moved into the forest in his Bengaluru-registered car.— Photo: Special Arrangement\n\nForty-three-year-old Chandrashekar Gowda has been chased by leopards thrice in the last few days. Getting a peaceful night’s sleep is not easy in his rickety car, with elephant herds close by. Yet, Mr. Gowda has decided that his stationary car in the forest, 120 km from Mangaluru, is his home. It has been so for the last 13 years.\n\nDakshina Kannada Deputy Commissioner A.B. Ibrahim, after learning about him, managed to bring him to Mangaluru on January 29. Mr. Ibrahim asked him to stay in the city and offered him legal assistance in a property-related case, besides offering help by a counsellor.\n\n‘No thanks’\n\nHowever, Mr. Gowda flatly refused his offer and went back to the forest. Mr. Ibrahim is now making efforts through his officers to convince Mr. Gowda to move out of the forest area.\n\n“I am hopeful of a positive response from him,” Mr. Ibrahim says.\n\nMr. Gowda was 30 when he moved into the Sampaje Reserve Forest area with his Bengaluru-registered car. “I had no other place to stay after my land was auctioned [for recovery of crop loan in 2002]. The only thing in my name is the car and it is with me,” he says.\n\nIt was in 2002 that the Nelluru Kemraje Cooperative Society auctioned his land for recovering Rs. 50,400 towards a short-term loan and two crop loans taken in 1999.\n\nNot in touch with family\n\nHaving lost his parents several years ago, Mr. Gowda severed his connections with his three brothers and two sisters. His home is the car that is parked in a shade by the side of the road passing through the forest.\n\nBasket weaver\n\nMr. Gowda ekes out a living by selling the baskets he weaves, in Sullia market . He earns around Rs. 180 a week. He does not accept any service free of cost. When a revenue official recently arranged for a health check-up and food, Mr. Gowda promptly gave him his baskets for the cost that was incurred.", 
    "section": "national", 
    "title": "Safe in the woods, in a ‘car house’", 
    "subsection": "general", 
    "date": "2016-02-04"
}