{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "The existing security arrangements were found inadequate, says an official\n\nUnion Human Resource Development Minister Smriti Irani, with Ministers of State Jitender Singh, Piyush Goyal, and Narendra Singh Tomar, after a Cabinet meeting inNew Delhi on Wednesday.— PHOTO: SHANKER CHAKRAVARTY\n\nThe Union Home Ministry is set to upgrade the security of Human Resource Development Minister Smriti Irani after student protests against her escalated following the suicide of the Dalit student Rohith Vemula at the University of Hyderabad last month.\n\nBeing a Cabinet Minister, Ms. Irani is now entitled to Y-category security. The government is planning to upgrade her security to the Z category, under which 20 security men will guard her at any given point of time.\n\nA top government official told The Hindu : “There have been reports that her security was found to be inadequate due to the sudden protests by students, and some miscreants may take advantage of these protests and try to harm her.”\n\nAt present, only a few Cabinet Ministers and Ministers of State enjoy either Z or Z-plus security. Those who have Z-plus security are Home Minister Rajnath Singh, Finance Minister Arun Jaitley, Road Transport Minister Nitin Gadkari and Ministers of State Kiren Rijiju and Jitendra Singh. National Security Adviser Ajit Doval, RSS chief Mohan Bhagwat and BJP president Amit Shah also enjoy Z-plus security.\n\n“VIP security is granted on the basis of threat perception. Amid reports that the HRD Minister’s cordon could be compromised, we are considering to extend Z-category security to her,” another official said.\n\nThe official said that every other day, there was a protest outside Shastri Bhavan, the office of the HRD Minister.\n\nVIP security is said to be a prestige issue for several politicians, with many visiting the office of Mr. Rajnath Singh to request for it. Two committees decide on the security level.\n\nOne is the Protection Review Group and the other is the Security Categorisation Committee. Both are headed by the Home Secretary and include officials of the Intelligence Bureau.\n\nAround five months ago, a Cabinet Minister gave several representations to the Home Minister about the threat to her life. However, an assessment by intelligence agencies found no credible threat, and her request was rejected.", 
    "section": "national", 
    "title": "Smriti may get ‘Z’ category security", 
    "subsection": "general", 
    "date": "2016-02-04"
}