{
    "author": [
        "National Bureau"
    ], 
    "text": "The Union government swung into action on Wednesday evening to contain the fallout of the appalling case of a 21-year-old Tanzanian student, allegedly stripped and paraded by a mob in Bengaluru on Sunday.\n\nExternal Affairs Minister Sushma Swaraj called up Karnataka Chief Minister Siddaramaiah on Wednesday demanding stringent punishment for the guilty and security for all foreign students in the State.\n\n“I have asked for immediate report from the Government of Karnataka,” Ms. Swaraj tweeted.\n\n“We are deeply pained over the shameful incident with a Tanzanian girl in Bengaluru,” Ms. Swaraj said in a series of tweets even as the High Commission of Tanzania sent a Note Verbale, a diplomatic communication prepared in third party to register protest, about reported attacks on their students in Bengaluru.\n\nUpdating the MEA on the developments of Sunday evening, the High Commission detailed the harrowing experience of the young Tanzanian student, whose car was also set on fire. The protest note is also believed to have detailed the harassment faced by other students who had rushed to the site where a Sudanese medical student had knocked down a local resident and her husband.\n\nThe Note Verbale requests the Government of India to follow up on this matter and take necessary legal action against those involved in such attacks and to ensure safety and security of all Tanzanian students in India.\n\nMEA sources said the Joint Secretary (East &South Africa) spoke to the High Commissioner of Tanzania as the details of the horrifying incident began to emerge. He expressed India’s regret at the unfortunate incident and assured him that the Ministry is in regular touch with the authorities in Bengaluru and that the State authorities have assured the MEA that they have taken action to prevent any recurrence of such untoward incidents.", 
    "section": "national", 
    "title": "Sushma Swaraj demands action on Bengaluru incident", 
    "subsection": "general", 
    "date": "2016-02-04"
}