{
    "author": [
        "M K"
    ], 
    "text": "Solar scam accused Saritha Nair on Wednesday alleged that threats to her life have increased after she “exposed” Chief Minister Oommen Chandy and a few others before an inquiry panel last week.\n\nShe was here to appear before the Judicial Magistrate – VI, in the Coimbatore Court complex, in connection with a windmill scam in which and she and her accomplices have been accused of swindling several lakh rupees from two firms in 2008.\n\nMs. Saritha denied instigations by vested elements against the present Kerala government. She claimed that over the years she soft pedalled as far as Mr. Chandy was concerned as she was promised by the mediators that the money she gave will be returned.\n\n“But despite knowing how much I have suffered they have not returned it. So I exposed the politicians involved in the scam, including the Chief Minister,” she claimed.\n\nMore scams\n\nShe added that she will expose more about the scam and the persons involved in it, but only if she was provided more security.\n\nShe said that she will be producing a few more names in a sealed cover along with digital copies of conversation recordings of her interaction with persons including politicians pertaining to the scam.\n\nDenies claim\n\nSaritha, however, said that the claims made by her accomplice in the scam, Biju Radhakrishnan, that he had evidence of a relationship between her and the Chief Minister of Kerala was not true and added that his (Oommen Chandy) behaviour and decency in interacting with women cannot be questioned.\n\nWhen asked about the attention and criticisms the Kerala government had attracted after she named the Chief Minister in the scam, she said that she was not looking into the political angles behind it.\n\nHandwriting sample\n\nOn Wednesday, her counsel K. Damodharan gave a reply to the petition filed by the police in December, last year, asking her handwriting and signature samples.\n\n“It is for comparing with the letter which the police claim that she wrote to them when she was under judicial custody in 2009 in the alleged windmills scam.” her counsel said.", 
    "section": "national", 
    "title": "Threats to life have increased: Saritha", 
    "subsection": "general", 
    "date": "2016-02-04"
}