{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Jammu and Kashmir Governor N.N. Vohra’s prodding of both the People’s Democratic Party (PDP) and the BJP has not resulted in any kind of time table with regard to government formation in the State. It did, however, lead to PDP leader Mehbooba Mufti succinctly articulating what has been keeping her from taking oath as the Chief Minister of the State, after weeks of alluding to it indirectly.\n\n“In Jammu and Kashmir, there are several forces which need to be tackled. We need the Centre to be fully with us. I don’t have that vision which Mufti Mohammed Sayeed had, neither have I the experience right now. Before the formation of a new Jammu and Kashmir government, I want the Central government to take some confidence building measures for the region,” she had said soon after meeting Mr.Vohra.\n\nThe subtext of what she said needs to be decoded by the BJP if it wants to have a government in this, ideologically one of its most important States. Ms.Sayeed made a distinction between her and her father, late Chief Minister Mufti Mohammad Sayeed, in her statement. That works on two levels. The late Mufti had a long career in politics, as a Congressman, then in the socialist camp, where he fought elections from Uttar Pradesh and later as the chief of the PDP, a party, he had confided to this reporter a couple of months before his death, that his daughter “had nurtured and built, distinct from me.”\n\nMs.Sayeed’s statement is a pointer to both these things. That, while the Mufti had the right political image to carry off an alliance with the BJP and its ideological mothership, the RSS; his daughter, quite clearly wants to tread more gingerly into the breach. Her connect with PDP workers is of a different kind. She has built up the party organisation and is less ready to battle with its core beliefs, and doesn’t trust that she will be able to transcend it long enough to triumph in the next polls while continuing in this alliance.\n\nHelping her along is the fact that the BJP has not exactly conducted itself with tact. Both the personal and political nuances of holding an alliance together were neglected, from nobody senior visiting the ailing Mufti while he was hospitalised in Delhi, to a Public Interest Litigation against the separate flag of the State being filed by those sympathetic to the BJP, while he was ill.\n\nCongress leader and former Chief Minister Ghulam Nabi Azad has ruled out any realignment in the Valley’s politics in the current state of the legislature. “The PDP and the BJP have to decide when they will or won’t form the government,” he said.\n\nThe way out was also suggested by Ms. Sayeed in her statement on Tuesday, by asking for confidence building measures between her and her ally, the BJP.", 
    "section": "national", 
    "title": "Trust deficit prolongs J&K uncertainty", 
    "subsection": "general", 
    "date": "2016-02-04"
}