{
    "author": [
        "Jayant Sriram"
    ], 
    "text": "San Francisco-based pathologist, Dr. Eric Suba, who pioneered a Pap smear programme in Vietnam in 1994, and has been a vocal critic of three studies conducted in India, said here on Wednesday that there were multiple flaws and flouting of ethical principles in these U.S.-funded randomised controlled trials.\n\nSpeaking to The Hindu , Dr. Suba said, of the 3,00,000 women who were recruited as volunteers for the studies, 1,40,000 were placed in “non-screening arms” and were deprived of established screening methods. This subject would be taken up at the Eighth Krishna Raj memorial lecture at the KEM Hospital in Parel on Thursday.\n\nSpeaking on one of the major screenings at the Tata Memorial Hospital (TMH), he said adequate informed consent was not taken from those in the unscreened group and that at least 254 women in the “no screening” control groups had died.\n\nThe TMH study had claimed that cervical cancer, which accounts for about 70,000 deaths among women in India per year, need not be screened by Pap smears or Human Papillomavirus (HPV) tests, but a simpler method – VIA – can be used in which vinegar is applied to the cervix to detect pre-cancerous lesions.\n\n“My dialogue with Tata Memorial started when they first published the results of their study in 2010. When I saw their funding was from the U.S. National Cancer Institute, I realised that I could lodge a formal complaint with the U.S. government,” he said. In 2011, Dr. Suba lodged a complaint with the U.S. Office of Human Research Protection. “They launched an investigation which confirmed my allegations. The study was unethical because the participants had not been given enough information to make an informed choice,” he said.\n\nThe results of the Tata Memorial Hospital study were supported by similar studies conducted among women from slum areas in Maharashtra (Osmanabad) and Dindigul in Tamil Nadu, but over the years, several experts have questioned the ethical principles behind each of the studies.\n\nThough he has been a long-time critic of the research conducted by the Tata Memorial Hospital, often expressed as a stream of views and counter-views in academic papers, this will be the first time that he will speak at an event where officials from Tata Memorial Hospital will also be present to present their point of view.\n\nTata Memorial Hospital officials told The Hindu that women in the control arm were under surveillance and Dr. Suba’s allegations were unfounded.\n\n“An overview committee had even come down and reviewed all our records and cleared it [the study]. The final clearance too came from them about six months ago, where they said there was no problem with the study,” said Rajendra Badwe, director, Tata Memorial Centre. He said the paper on the randomised controlled trials at TMH that Dr. Suba has referred to, was presented and well received as a plenary paper at the American Society of Clinical Oncology and was now published in the Journal of the National Cancer Institute , U.S.\n\nDr. Badwe said cervical cancer incidence was reducing in India – without a screening or a vaccine. “If the incidence in U.S. is 5 per 100,000, as per the Bombay Cancer Registry, it is 8 per 100,000,” said Dr. Badwe, reasoning that an inexpensive technique of VIA and the improving hygiene practices had possibly brought down the figure in India.\n\n“It is proven in randomised setting that VIA can save 22,000 lives in India annually and 78,000 across the globe in the developing world. And it is at one-tenth the cost of a Pap smear.”\n\nDr. Eric Suba alleges multiple flaws and flouting of ethical principles in randomised trials", 
    "section": "national", 
    "title": "U.S. expert faults Indian studies on cervical cancer", 
    "subsection": "general", 
    "date": "2016-02-04"
}