{
    "author": [], 
    "text": "The Vatican is disputing a U.S. film studio’s claim that the Pope is making his movie debut, saying no scenes were shot for the venture and that the Pope “is not an actor”.\n\nLos Angeles-based AMBI Pictures headlined its press release: “Film will mark first ever big screen participation role for the leader of the worldwide Catholic church.”\n\nMonsignor Dario Vigano, the head of the Vatican’s communications operation, said no scenes were filmed for the purpose. However, he acknowledged that the film-makers may have got hold of some video clips of the Pope. Monsignor Vigano disputed the AMBI press release that claimed that the Pope would “play himself” in the film Beyond the Sun . AMBI described the film as “a family adventure story where children from different cultures emulate the apostles while searching for Jesus in the world around them.”\n\nAMBI Pictures has produced a handful of releases, including Barry Levinson’s The Humbling , with Al Pacino, and an upcoming John Steinbeck adaptation by James Franco. In November, it drew headlines when it said it would remake Christopher Nolan’s Memento .\n\nThe company said Beyond the Sun initiated with Pope Francis asking the film-makers to make a movie for children that communicates Christ’s message. The press release was accompanied by photos of the Pope with the film-makers.\n\nThe Vatican works hard to control the Pope’s image, enforcing tough copyright restrictions on all visual media, and Monsignor Vigano’s reaction was a clear sign that the Vatican didn’t appreciate the hype. But Pope Francis has been known to go his own way on occasion, allowing friends to shoot video of him to convey messages to private gatherings. Monsignor Vigano’s comment that he couldn’t exclude that the film-makers had some footage suggested that they might have secured some video of the Pope in the privacy of his hotel reception rooms. AMBI has said all profits from the film will go to two Argentina-based charities that help children. — AP", 
    "section": "national", 
    "title": "Vatican disputes film claim, says Pope is not an actor", 
    "subsection": "general", 
    "date": "2016-02-04"
}