{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "Green tribunal told to complete the hearing in six weeks\n\nThe Supreme Court on Wednesday lifted the stay on the proceedings before the National Green Tribunal (NGT) on pleas seeking withdrawal of environment clearances granted to the multipurpose deep-seaport project at Vizhinjam, developed by the Adani Group in Kerala.\n\nThe apex court's decision comes a day after a Bench led by Chief Justice T.S Thakur remarked that a huge project like this is expected to ruffle some feathers.\n\nThe Bench, also comprising Justices A.K. Sikri and R. Banumathi, asked the top green tribunal to complete the proceedings in six weeks' time, giving no room for any adjournments.\n\nNo interim orders\n\nThe apex court further asked the tribunal not to pass any interim orders till it gives its final verdict.\n\nThe direction came on the appeals filed by Vizhinjam International Seaport Ltd (VISL) and the Kerala government against a decision of the Principal Bench of the NGT to review the environmental clearances given to the Rs.6,000-crore project.\n\nSupreme Court stay\n\nIn January 2015, the Supreme Court had stayed a judgment of the Principal Bench of the National Green Tribunal to review the constitutionality of a 2011 Coastal Regulation Zone notification which exempted coastal areas of “outstanding natural beauty” like the Vizhinjam-Kovalam sector in Kerala from protection.\n\nThe July verdict of the tribunal Bench led by NGT chairperson Justice Swatanter Kumar had spelt trouble for the project. A three-judge Bench led by Chief Justice of India H.L. Dattu on January 21 passed the stay order on a plea by the project proponents against the tribunal decision. The NGT had claimed that it has the “complete and comprehensive trappings of a court” to exercise the “limited power of judicial review to examine the constitutional validity/vires of the subordinate legislation”.\n\nThe NGT order was based on an application by two Thiruvananthapuram-based environmental activists, Wilfred J. and V. Marydasan, asking the tribunal to direct that coastal areas throughout the country, including the Vizhinjam coast, be “preserved and no activity be undertaken which would damage such areas”.", 
    "section": "national", 
    "title": "Vizhinjam: apex court lifts stay on NGT proceedings", 
    "subsection": "general", 
    "date": "2016-02-04"
}