{
    "author": [
        "Special Correspondent"
    ], 
    "text": "After walking away from the pre-poll alliance talks for the Assembly elections in Assam last month, the BJP and the Asom Gana Parishad (AGP) came back to the negotiating table and said they would, in fact, be fighting polls together.\n\n“We have decided to fight the polls together,” AGP leader and former Chief Minister Prafulla Mahanta said.\n\nTop sources told The Hindu that seat adjustments were settled, through marathon meetings on Tuesday, at BJP general secretary Ram Madhav’s residence and at BJP president Amit Shah’s home here on Wednesday.\n\nAGP president Atul Bora, who under pressure from the party earlier announced that it would go it alone, was present at both meetings. Mr. Mahanta was called for a meeting with Mr. Shah.\n\nFormal announcement\n\n“The number of seats is not as important as the kind of seats we have decided on,” said a top source present at the meeting. He did, however, confirm that the number of seats left for the AGP in the 126-member House, was “in the vicinity of 20, maybe one or two seats here and there.” A formal announcement is likely on Thursday.\n\nThe State unit of the BJP had been opposed to the tie-up and the AGP had been upset at the paltry number of seats (14) offered by the BJP earlier. “The BJP was also annoyed that Mr. Mahanta had been trying to apply pressure through go-betweens for a better deal,” the source said.\n\nThe BJP termed the alliance a “victory” in the stitching up of a rainbow coalition in the politically complicated State.\n\n“We have tie-ups with the Bodos [the Bodo People’s Front] and the Rahas and Tiwas [ethnic tribal groups]. This will be a formidable alliance, now that the State’s biggest party, AGP, is also with us,” the source said.", 
    "section": "national", 
    "title": "AGP, after walking away earlier, clinches deal with BJP", 
    "subsection": "general", 
    "date": "2016-03-03"
}