{
    "author": [
        "R Ramabhadran Pillai"
    ], 
    "text": "The Rs. 1.7-crore boat, 20 metre long and 7 metre wide, will not make any noise or cause pollution, unlike the diesel-powered ones. It will have an alternative power system to meet emergencies.— Photo: Special Arrangement\n\nA 75-seater solar-powered passenger ferry, the first of its kind in the country, is quietly taking shape at Aroor in Alappuzha district. The boat is expected to be commissioned within the next three months.\n\nThe boat is being built by NavAlt, a Kochi-based joint venture, in collaboration with a French company. “Construction of the hull has been completed and the superstructure is being worked on now. The battery and motor console, which have undergone testing, are to be flown in from France”, said Sandith Thandasherry, a marine architect who heads the enterprise.\n\nThe 20 metre long, 7 metre wide boat, with a maximum cruising speed of 7.5 knots, is to be deployed in the backwaters of Alappuzha by the Kerala State Water Transport Department (KSWTD).\n\nThe Rs.1.7-crore boat will make no noise or cause any pollution, unlike the diesel powered ones. It may work out to be a cheaper option too. An ordinary boat, made of steel and with a carrying capacity of 75 passengers, may cost around Rs.1.9 crore.\n\nThe cost of diesel fuel for operating it will be around Rs. 25 lakh. But the solar powered boat, obviously, will cost nothing to operate for most part, Mr. Thandasherry pointed out.\n\nThe solar boat will also be eligible for subsidy from the Union Ministry of New and Renewable Energy. The boat will be capable of plying the waters for 5-6 hours on normal sunny days. It will have an alternative power system to meet emergencies.\n\nIts battery will be charged by plugging on to the normal electric circuit at the end of the day’s journey.\n\nThe KSWTD plans to operate the boat in the 2.5 km-long Vaikkom-Thavanakkadavu route. The crew will be trained to handle the boat as the operating system is slightly different from conventional diesel-powered ones. The company has already made a 20-seater solar powered boat for a tourism operator in Bhatinda in Punjab.\n\nPowerful propeller needed\n\nBut the much larger, 75-seater, ferry boat will need more powerful propulsion. The engine will have 40 kW power. The Lithium battery pack, which is seven times costlier than lead battery, is to be used in the ferry.\n\n“There is scope for building more solar powered boats for the KSWTD or for tourism operators; Maharashtra has shown interest in these boats,” Mr. Thandasherry said.\n\nEven houseboats could be solar-powered if their conventional shape is tweaked to make the boat lighter and to accommodate the solar panels, he said.\n\nThe 20 metre long, 7 metre wide boat will have an alternative power system to meet emergencies", 
    "section": "national", 
    "title": "Alappuzha backwaters to get India’s first solar ferry", 
    "subsection": "general", 
    "date": "2016-03-03"
}