{
    "author": [
        "Aditya Bharadwaj", 
        "K V"
    ], 
    "text": "Sceptical husband says Prabha had no enemies in the family or outside\n\nThe spot in Sydney park where Prabha Arun Kumar was stabbed to death in 2015.—PHOTO AFP\n\nIn less than a week, it would be a year since Prabha Arun Kumar, a techie from Bengaluru, was stabbed to death by an unidentified assailant in a Sydney suburb.\n\nBut her family in India is confused by the leads that investigators have found in the case as reported in the Australian media.\n\nWhat was initially thought of as a random attack in 2015 is now reportedly being probed by the New South Wales police in Australia as a possible planned murder.\n\n“We have considered the possibility that an offender had helped [commit or been involved with] this crime outside of Australia,” Detective Sergeant Ritchie Sim leading the probe is quoted as saying in The Sydney Morning Herald .\n\nReacting to these reports, Prabha’s husband, Arun Kumar, an auto consultant in the city, has expressed scepticism over the line of investigation leading to India.\n\n“My wife was a normal woman and she had no enemies either in the family or among friends here. I don’t think it is possible for a person in India to organise her killing in Australia. Moreover, I am dumbfounded by this theory as I find no motive for anybody known to us to murder her this way. We don’t want any innocents to be targeted,” he told The Hindu on Wednesday.\n\nMr. Kumar said he had told the New South Wales police about two incidents that Prabha shared with him, that occurred during her work stay in Australia. However, he declined to disclose details of these incidents as they might hamper the probe.\n\n“The police haven’t been in touch with the family. The last time I spoke to them was in November 2015 when I had been to Australia to inaugurate a memorial plaque for my wife in Parramatta Park,” he said.\n\nAn e-mail query to New South Wales Police from The Hindu went unanswered.\n\nPolice want to visit India\n\nThe homicide detectives probing the case have been quoted by the Australian media as saying they will visit India soon. “There are aspects of Mrs. Kumar’s life that need to be explored further,” the detectives have been quoted in a report in The Sydney Morning Herald .\n\nFamily coming to\n\nterms with loss\n\nPrabha’s family is slowly coming to terms with the loss. The most hit though is her daughter, now 12 years old, preparing for her Class 6 exams.\n\nArun Kumar said it was tragic she lost her mother at a time most daughters need a mother to guide them. “Prabha and I had dreamt of a future for her and now my only goal in life is to make that dream a reality,” he said.\n\nMr. Kumar recounted the horror of the night when Prabha was stabbed to death even as he was speaking to her over phone.\n\n“That has been the toughest day of my life and I have never felt as helpless as that. I could hear her being attacked, scream for help and later breathe for around 20 minutes on the phone. It was like she was suffering before me, but I couldn’t do anything,” he said.", 
    "section": "national", 
    "title": "Australian police suggest it could have been planned in India", 
    "subsection": "general", 
    "date": "2016-03-03"
}