{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "The court agreed with bar owners’ suggestion to have a three-foot railing between the dancers and the audience.\n\nTrimming the Maharashtra government’s newfound enthusiasm to keep a close watch on bar dance performances, the Supreme Court on Wednesday modified its endeavour to have CCTV cameras trained on dance floors beaming live feed to the local police control room.\n\nA Bench led by Justice Dipak Misra, which said “dance is an art,” gave the Maharashtra government no room to manoeuvre in its order which plainly said “the authorities shall act in accordance with the command of this Court and not venture to deviate.”\n\nThe Bench ordered that CCTV cameras shall be fixed at the entrance of the premises and not in the restaurant or the permit area or the performance area.\n\nInstead of a non-transparent partition as wanted by the State, the Supreme Court agreed with the suggestion of the bar owners for a three-foot high railing between dancers and the audience.\n\nThe government had restricted the number of dancers to four, but the court modified this to say that while four dancers can perform on the stage at one time, there can be other artists in the premises.\n\nThe court however said it is “imperative” that the antecedents of employees be verified.\n\nIt said the premises of the establishment cannot be altered without the permission of the competent authority. In case of any grievance in this regard, the Bench allowed bar owners to directly approach the Supreme Court.\n\nIt agreed with the suggestion of the bar owners to have a green room, provided the space is used in the manner in which it is understood in the “classical sense”.\n\nThe Bench ordered the modified conditions to be complied within three days. Licences should be issued within ten days after compliance.", 
    "section": "national", 
    "title": "CCTVs only at entrance of dance bars, says Supreme Court", 
    "subsection": "general", 
    "date": "2016-03-03"
}