{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "In an attempt to make up for the losses suffered by people in Haryana during the recent Jat agitation, the State government on Wednesday decided in principle to give relief in the Value Added Tax (VAT) to traders and businessmen.\n\n“Traders and businessmen who have suffered losses in the recent Jat agitation will be given relief in VAT,” a government spokesperson said. The decision was taken at the Cabinet meeting held under the chairmanship of Chief Minister Manohar Lal Khattar in Chandigarh.\n\n“The Cabinet also decided that the Excise and Taxation department would formulate the modalities with regard to relief in VAT and other taxes, if any,” the spokesperson added.\n\nCM under fire\n\nUnder hammer for not being able to control the situation during the violent Jat agitation, Mr. Khattar has been attempting to appease people who suffered losses, by announcing relief measures.\n\nMr. Khattar had reportedly even broken down at a recent meeting of State BJP legislators while discussing the alleged incidents of violence, arson and rape.\n\nSources said Mr. Khattar, who was apparently peeved at the violent incidents, had expressed pain. The Cabinet also approved the State’s excise policy for 2016-17.\n\n“VAT on liquor has been increased from 8 per cent to 10 per cent while the maximum retail price of popular Indian Made Foreign Liquor (IMFL) and beer brands or styles has been rationalised as per market trends,” the spokesperson said adding that the government had introduced the facility of online passes and permits for transportation of liquor.\n\nThe spokesperson said the excise duty remained unchanged except on draught beer and ready-to-drink beverage where it has been brought on a par with mild beer.\n\nManohar Lal Khattar has been trying to appease those who\n\nsuffered losses", 
    "section": "national", 
    "title": "Haryana traders hit by Jat agitation to receive VAT relief", 
    "subsection": "general", 
    "date": "2016-03-03"
}