{
    "author": [
        "Omar Rashid"
    ], 
    "text": "The V-C says he is part of the RSS but is not imposing its agenda on anyone\n\nSince his appointment as Vice-Chancellor of Banaras Hindu University, G.C. Tripathi has been accused of pursuing an “RSS agenda” on the campus and filling administrative and academic posts with those affiliated to the organisation.\n\nIn an interview to The Hindu , Mr. Tripathi was candid about his four-decade-old association with the RSS, but asserted that “universities don’t belong to any ideology,” adding that he was following the mandate given to him by the government.\n\nAmid the controversy at Jawaharlal Nehru University over what is “anti-national,” Mr. Tripathi, a former Allahabad University professor, said he would never allow his university to conduct events on “controversial and sensitive” issues such as the hanging of Afzal Guru, Kashmir’s ‘independence’ or beef. There were attempts to rake up similar issues at the university, but its “100-year-old culture and tradition” and his administrative alertness prevented the institution from going the JNU way, he said.\n\n“JNU has always embodied opposition to the system. Its culture divides polity into two groups: the rulers and the ruled. Once the government is formed, JNU automatically puts itself in the opposition… That is its sanskriti [culture],” Mr. Tripathi said.\n\nStudents should have training and education in democracy, but universities “should not become practising platforms,” he said.\n\nRecently, IIT-BHU dismissed Magsaysay award winner Sandeep Pandey on the charge that he was indulging in “anti-national” activities and was a Naxalite.\n\nDr. Pandey, who has taken the battle to court, alleged that his dismissal was due to ideological differences with the “RSS-minded Vice-Chancellor.”\n\nMr. Tripathi said Dr. Pandey was attempting to rake up “controversial and sensitive” issues at the university, such as beef and Kashmir’s ‘independence.’ However, he would not challenge the court order if it favoured his re-installation.\n\nMr. Tripathi was proud of his “deep engagement with the RSS thought” and was not shy of calling himself a “man of the RSS.” But he was not working to impose its agenda.\n\n“I am part of the RSS. Don’t RSS people have a right to stay in this country? If I am running an agenda here, tell me. Have I told anyone to attend a shakha [a daily meeting of the RSS] in the morning?”\n\nG.C. Tripathi says he is part of the RSS but is not imposing its agenda on anyone", 
    "section": "national", 
    "title": "Have prevented BHU from going the JNU way: Tripathi", 
    "subsection": "general", 
    "date": "2016-03-03"
}