{
    "author": [], 
    "text": "U.S. astronaut Scott Kelly reacts shortly after landing in Kazakhstan on Wednesday. (Below) Russian cosmonaut Mikhail Kornienko.\n\nU.S. astronaut Scott Kelly and Russian cosmonaut Mikhail Kornienko returned to Earth on Wednesday after spending almost a year in space in a ground-breaking experiment foreshadowing a potential manned mission to Mars.\n\nThe 340-day mission saw Mr. Kelly break the record for the longest single stay in space by a U.S. astronaut, while Mr. Kornienko is now fifth on the list for lengthiest mission by a Russian cosmonaut.\n\n“We have landing,” Russian Mission Control confirmed after the trio touched down southeast of the settlement of Dzhezkazgan in central Kazakhstan at around 0430 GMT.\n\nAfter returning from his lengthy stint in space Mr. Kelly was clearly in high spirits as he was lowered to the ground by burly Russian rescue workers at the landing site. “The air out here feels great. I’ve no idea why you guys are so bundled up,” NASA TV reported him as saying as he sat upright in a chair on the steppe in temperatures just below zero.\n\nMr. Kelly and Mr. Kornienko returned with Russia’s Sergei Volkov, who was stationed at the ISS for over five months and was met upon landing by his father, retired cosmonaut Aleksandr Volkov.\n\nThe “one-year crew” mission — which began on March 27 last year — was the longest by any astronauts aboard the ISS and seen as a vital chance to measure the effects of a prolonged period in space on the human body. They have been subjected to a battery of tests and other experiments in preparation for a future manned mission to Mars and beyond.\n\nWeightlessness reduces muscle mass and bone density and is believed to diminish eyesight by increasing cerebrospinal fluid around the optic nerve.\n\nMr. Kelly, 52, was also part of an experiment comparing his development and changes in space with his identical twin brother — Mark — back on Earth.\n\n‘Interstellar gorilla’\n\nIn his year aboard the space station Mr. Kelly has been an avid Internet poster, capturing stunning views on his Instagram page and tweeting regularly to nearly a million followers while travelling some 230 million kilometres.\n\nIn one particularly eye-catching stunt the bald-headed astronaut posted a short video of himself dressed up in a gorilla suit and floating through the ISS in pursuit of a colleague. “Needed a little humour to lighten up a year in space,” he wrote on Twitter on February 23, when he posted the video.\n\nOne image Mr. Kelly tweeted captured the economic divide between North and South Korea as visible from space, with the South aglow with electric lights and the North cast in a blanket of darkness.\n\nAnother impressive shot was one of the Milky Way which Mr. Kelly described as “old, dusty, gassy and warped. But beautiful.”\n\n“Spaceflight is the biggest team sport there is, and it’s incredibly important that we all work together to make what is seemingly impossible possible,” Mr. Kelly said when handing over command of the ISS to fellow NASA astronaut Tim Kopra on Monday.\n\nMr. Kelly, Mr. Kornienko and Mr. Volkov leave behind Kopra, Russian cosmonaut Yuri Malenchenko and the European Space Agency’s British astronaut Tim Peake.\n\nNASA’s Jeff Williams and Roscosmos’ Oleg Skriprochka and Alexey Ovchinin, will join them following a launch from Baikonur later this month. — AFP\n\nScott Kelly now holds the record for the longest single stay in space by a U.S. astronaut", 
    "section": "national", 
    "title": "ISS crew return to Earth after one year in space", 
    "subsection": "general", 
    "date": "2016-03-03"
}