{
    "author": [
        "Special Correspondent"
    ], 
    "text": "After knocking on the doors of the Prime Minister’s Office, the Department of Economic Affairs (DEA) under the Union Finance Ministry, and the Ministry of External Affairs, an applicant under the Right to Information Act here has found that none of them was in a position to provide him details of foreign investments attracted during several State visits by Prime Minister Narendra Modi.\n\nIt was on July 20 last that Madurai based advocate A. Mohamed Yusuff made an application to the PMO seeking brief details of the foreign investments and their worth. Replying to it on July 31, Under Secretary P.K. Sharma stated that the application had been transferred by him to the DEA and the MEA, and advised the applicant to approach the public information officers in those Ministries for further details.\n\nOn August 8, Rohit Rathish, Deputy Chief of Protocol, MEA, informed the applicant that the information sought for was not available with his Division and hence he was forwarding the application to Joint Secretaries of 10 other Divisions in the Ministry. However, when none of those 10 officers replied to him, the applicant preferred an appeal before the Chief Protocol Officer on September 23.\n\nThe Chief of Protocol Jaideep Mazumdar disposed of the appeal stating that the Deputy Chief of Protocol was not the custodian of information sought for by the applicant. Subsequently, the applicant received three communications from different officials of MEA between October 1 and 28 asking him to visit its website for information regarding MoUs signed during the PM’s foreign visits.\n\nManu J. Vettickan, Deputy Director (External Markets), DEA, also informed the applicant on August 11 that the information sought for was not available with his section. A statutory appeal preferred against this reply also met the same fate as it did with the MEA’s protocol division.", 
    "section": "national", 
    "title": "Madurai RTI activist moves from door to door but draws a blank", 
    "subsection": "general", 
    "date": "2016-03-03"
}