{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "Tribal activist and the Aam Aadmi Party (AAP) leader Soni Sori’s relatives have alleged that they were being “harassed and intimidated” by Bastar police in the name of investigation. Soni Sori’s nephew Lingaram Kodopi went on to allege that the police were also trying to “implicate” her relatives in the case.\n\n“We fear that the police might implicate me or Soni Sori’s cousin Ajay Markam in the case of an attack on her. Since the formation of the Special Investigation Team (SIT), I have been asked to come to the police station thrice. Every time they ask us the same questions and we are being given disrespectful treatment,” Mr. Kodopi told The Hindu .\n\n“Ajay Markam was also called to the police station for enquiry. Ajay Markam was told that he, along with me and Sanjay Pant, were involved in the attack on Soni Sori,” he claimed.\n\nThis was not the first time Mr. Kodopi, the only Tribal journalist in Bastar, was being targeted by the authorities. A few years ago, Mr. Kodopi was implicated along with Soni Sori in an alleged case of a corporate house pay off to the Maoists.\n\nAccording to him, he was inhumanly tortured in the custody and a petrochemical liquid was put in his rectum for which he is still undergoing treatment.\n\nDespite bad health, Mr. Kodopi has been the main support for Soni Sori, who has emerged the face of Tribal protest in Bastar in the past few years.\n\nThe nephew of Soni Sori also accused the police of “pressurising” AAP leader Arvind Gupta to take back the police complaint which he filed against unknown persons after the attack on Soni Sori on February 19.\n\nBastar range Inspector General of police SRP Kalluri was unavailable for comments.\n\nThey allege that they were being “harassed and intimidated” by\n\nthe Bastar police", 
    "section": "national", 
    "title": "Police trying to implicate us in Soni Sori attack: relatives", 
    "subsection": "general", 
    "date": "2016-03-03"
}