{
    "author": [
        "Amber Jamieson"
    ], 
    "text": "From Katy Perry to David Bowie, the songs chosen by presidential candidates reflect their political personalities\n\nEven before voters get inside a Hillary Clinton campaign event, they’re confronted with Katy Perry.\n\nMs. Clinton’s team blasts the candidate’s official playlist of mostly female-led pop ballad bangers — such as Perry’s Roar and Stronger by Kelly Clarkson — so loudly it can easily be heard by those waiting outside venues.\n\n“It’s hard to talk or even hear yourself think,” said Lauren Gambino, a Guardian reporter who has attended over 40 Clinton events this election.\n\nPop for politics is nothing new — Bill Clinton used Fleetwood Mac’s Don’t Stop , and Barack Obama used will.i.am’s Yes We Can , for instance — and candidates consider music a key element for establishing their personality and inspiring followers.\n\n“Music, as I see it, is the candidate’s attempt to constitute their identity in sound,” explained Dana Gorzelany-Mostak, an assistant professor in music at Georgia College.\n\n“To sonically construct themselves in a way that appeals to the voters but also offers insight to who they are and what they stand for,” she said.\n\nMs. Gorzelany-Mostak is creator and co-editor of ‘Trax on the Trail’, a research project examining the music in the 2016 election, from Bernie Sanders’ folksy 1960s tunes of revolution to Marco Rubio’s love of electronic dance music, aka EDM.\n\nRepublican frontrunner Donald Trump’s campaign songs burst out of speakers with virtually no links between them: there’s the Rolling Stones’ Brown Sugar to the Phantom of the Opera to the Hulk Hogan theme song, Real American .\n\nMr. Trump himself struts onto the stage to Nessun Dorma, a booming and aggressive Puccini aria, sung in Italian by Luciano Pavarotti.\n\n“It’s unrepentantly fascist,” said Dan Roberts, the Guardian ’s Washington bureau chief, likening it to attending at Benito Mussolini rally.\n\nMr. Trump’s eclectic mix, supposedly all chosen by him according to his love for the songs, is not typical presidential campaign picks. But they do reflect the unpredictably of the candidate.\n\n“Trump’s entire reputation is sort of built upon this idea of a candidate taking up unpopular positions,” said Ms. Gorzelany-Mostak.\n\nMarco Rubio’s beats reflect a young Latino man who grew up in Miami more than they do a conservative Republican, with Flo Rida, the Black Eyed Peas and Calvin Harris all on regular rotation. Lately, Mr. Rubio bounces out onto stage to AC/DC’s Thunderstruck and leaves to Greater , by Christian pop group Mercy Me.\n\nMr. Rubio has spoken to CNN about his love for EDM, denying he had ever been to a rave but saying he grew up listening to 90s west coast hip hop, and now enjoys dance music. But he was careful to note that his favourites were country songs laid over electronic music — meaning the lyrics were clean. The country music is also “a nod to the people he is campaigning in front of,” said Sabrina Siddiqui, a journalist who has trailed the senator’s campaign.\n\nConservative tones\n\nTed Cruz, the hard-line evangelical candidate from Texas, plays country and Christian pop, including Stars and Stripes and the Eagle Fly by Aaron Tippin and tunes from the Christian band Newsboys. But his music doesn’t garner much attention, since his few tracks often repeat, and they clearly meld with his image as a conservative and deeply religious southerner.\n\nBernie Sander’s music, like his politics, revolves around revolution: Power to the People by John Lennon, Talkin’ Bout a Revolution by Tracy Chapman, The Revolution Starts Now by Steve Earle.\n\nBut ever since David Bowie’s death in January, Mr. Sanders has left the stage to the strains of Bowie’s Starman : “There’s a starman waiting in the sky / He’d like to come and meet us / But he thinks he’d blow our minds”.\n\nIt’s a strategic pick. “Bowie: he’s a rebel, a revolutionary, a radical, all wrapped in one charismatic man,” Ms. Gorzelany—Mostak said, asking “Can Sanders channel some of that star magic?”\n\nMs. Clinton’s crowd is mainly middle-aged women, and not exactly the typical audience for a pop-star playlist of top 20 hits circa 2016, a list exemplified by Ms. Clinton’s carefully curated Spotify playlist, which clearly targets younger people. — © Guardian Newspapers Limited, 2016", 
    "section": "national", 
    "title": "Pop for politics: How candidates use music for branding", 
    "subsection": "general", 
    "date": "2016-03-03"
}