{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The body of Thukjay Gysket being recovered from a crevasse on the Siachen glacier on Wednesday.— PHOTO: Special Arrangement\n\nAfter a five-day rescue operation, the Army on Wednesday recovered the body of Thukjay Gysket, a civilian porter, who had accidentally fallen into a crevasse at 19,000 feet on the northern Siachen Glacier.\n\nGysket was part of a team to bridge new crevasses. The snow scooter on which he was with his friend slipped while crossing the bridge on an old crevasse on the afternoon of February 27. Gysket fell into the crevasse, which was six feet long and 2-4 feet wide.\n\nArmy officers said rescue operations by specialised teams were launched immediately, with five officers, 40 soldiers and 13 porters.\n\nThe operations continued round-the-clock. Using 20 types of equipment, rescuers reached a depth of 130ft where the body was located, an officer said. However, the operations were very slow because the width of the crevasse had to be widened by cutting the blue ice.\n\nThe Army employs porters in large numbers, who are from the Ladakh region and familiar with the terrain.\n\nThe body was sent in a helicopter to the field hospital at Hunder for the wreath-laying ceremony, officials said.\n\nThe incident comes after the death of 10 soldiers of 19 Madras Regiment in an avalanche that buried the Sonam base post at 19,600 feet last month. While nine soldiers were killed, Lance Naik Hanamanthappa Koppad was found alive after six days under 35 feet of snow. However, he died of multiple organ failure in an Army hospital in Delhi.\n\nTough task\n\nEven after locating Gysket’s body, it was a tough task for the rescuers to retrieve it. Rescue teams first anchored and stabilised the mortal remains to prevent it from descending deeper following which it was pulled up to the glacier floor.\n\nIndia dominates the icy peaks on the Soltoro ridge which it occupied in April 1984.\n\nSoldiers conduct patrols at heights of 21,000 feet where the temperature plummets to minus 55 degrees.\n\nOver the years, the casualties have come down significantly with improved training and provisions.\n\nHowever, 2016 has been particularly bad for the Army and the nation as 15 lives were lost on the glacier in just two months.\n\nThukjay Gysket, a civilian porter, was part of a team bridging new crevasses", 
    "section": "national", 
    "title": "Porter’s body recovered from Siachen", 
    "subsection": "general", 
    "date": "2016-03-03"
}