{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "As Congress vice-president Rahul Gandhi chaired a strategy meeting on Wednesday for the coming Assembly elections in Uttar Pradesh, all eyes were on one person — Prashant Kishor.\n\nA celebrity pollster who played a key role in the landslide victory of the BJP in Lok Sabha elections and then scripted Bihar Chief Minister Nitish Kumar’s recent electoral triumph, Mr.Kishor sat in the meeting to listen to advices and suggestions of senior Congress leaders.\n\n“He did not speak a word but he took notes,” said Zubair Khan, a Congress secretary for Uttar Pradesh, who was present at the meeting.\n\nLast week, Mr. Kishor had a two-hour long conversation with Mr.Gandhi, in which he negotiated his role as a campaign strategist for Uttar Pradesh. According to Congress sources, Mr.Kishor raised his concern over the parochial attitude of some party leaders saying that it would hinder his work. On that, sources said, Mr.Gandhi assured him that he would have a “free hand” and no one would come in his way.\n\nAt the meeting Mr.Gandhi spoke about the importance of regaining the confidence of those voters that have either turned to the Bahujan Samaj Party or the Samajwadi Party. “Rahulji said the Congress is not a cadre based party, it is a party of people, so we will have to meet them and win them back,” said Bhagwati Chaudhary, the chief of party’s Schedule Caste cell in UP.\n\nThough the Congress high command is upbeat to have Mr.Kishor on their side, the party rank and file in Uttar Pradesh is unaware whether the general secretary in-charge and other senior office bearers will have to report to him.\n\nA senior Congress leader in U.P. said that the State leadership was curious to know whether Mr.Kishor’s role was confined to scripting “catchy election slogans” or he would have a significant say on ticket distribution. If it’s both, the leader said, the party high command will have to deal with internal rifts.", 
    "section": "national", 
    "title": "Prashant Kishor attends Cong. meet", 
    "subsection": "general", 
    "date": "2016-03-03"
}