{
    "author": [
        "National Bureau"
    ], 
    "text": "“We aren’t influenced by the stand of the earlier govt.”\n\n“We have no holy cows who will be spared,” Finance Minister Arun Jaitley told the Lok Sabha on Wednesday.- Photo: PTI\n\nFinance Minister Arun Jaitley told the Lok Sabha on Wednesday that that government will not spare anyone found guilty in the Aircel-Maxis deal.\n\n“We have no holy cows who will be spared,” Mr. Jaitley said during the discussion. It followed protests by the AIADMK which raised the alleged role of former Finance Minister P. Chidambaram’s son Karti Chidambaram in the scam. Reports have alleged that he had made huge investments purportedly linked to the “payoffs” from this deal.\n\nMr. Karti Chidambaram had issued a statement on Tuesday saying he and his business were “fully compliant with all laws and regulations.”\n\nHe denied the money laundering charges.\n\n‘Probe not slow’\n\nMr. Jaitley was unsparing, though he did not take names. “We aren’t influenced by the stand of the earlier government. Investigative agencies are free to take action against whoever is found guilty. An FIR has been filed, the case will go to trial,” he said. “Someone suggested that investigative agencies were going slow. That is incorrect. Charge sheets have been filed and the CBI is conducting its investigations. Law will take its own course and the guilty will face justice.”\n\nEarlier, AIADMK members had displayed copies of a newspaper which reported that Mr. Karti Chidambaram invested in real estate in various countries citing investigations by the Enforcement Directorate and Income Tax authorities.\n\nCongress members rushed to the well of the House protesting the Speaker’s decision to allow discussion on the issue.", 
    "section": "national", 
    "title": "Scam-accused will not be spared, Jaitley tells Parliament", 
    "subsection": "general", 
    "date": "2016-03-03"
}