{
    "author": [], 
    "text": "Six heavily armed terrorists among 9 killed in Jalalabad\n\nIn the fourth attack since 2007, heavily-armed terrorists, including suicide bombers, struck the Indian consulate in Afghanistan’s Jalalabad city on Wednesday, killing nine persons, including an Afghan security person and causing damage to the chancery.\n\nThe External Affairs Ministry in New Delhi said all Indians in the mission were safe and six terrorists, who carried out the attack, were dead. While two terrorists blew themselves up, four militants were killed by the Afghan police. Two civilans were also killed in the crossfire. — PTI\n\nKarzai points finger at Pakistan\n\nSuhasini Haidar reports from New Delhi:\n\nThe attack on the Indian consulate was part of a trend of such operations launched from Pakistan, said former Afghanistan President Hamid Karzai on Wednesday.\n\n“They are simply attacking India’s presence in Afghanistan, whenever they get the opportunity. The whole spectrum of the India-Afghan relations, the relationship itself, is the target of the attacks”, Mr. Karzai told The Hindu in an exclusive interview in New Delhi hours after the attack in Jalalabad. The area was targeted on January 13 as well when nine persons were killed and 12 injured after a suicide bomber struck the diplomatic area. Since the Pakistani consulate was closest to the site of the attack, officials had said it was unclear which embassy was the target.\n\nThe attack on Wednesday is also the third such major strike on an Indian mission since May 2014, with the last attack on January 3 this year in Mazar i Sharif. In that incident, the ITBP and Afghan forces had fought off the gunmen after battling them for nearly a day as they launched rocket attacks on the mission.\n\n“What is there in the relationship between India and Afghanistan that would irk someone so much that they would come and attack the Indian consulates, or attack Afghanistan”, asked Mr. Karzai during the interview, adding that terror emanating from Pakistan was the single reason for problems between Afghanistan and Pakistan as well.\n\n“Each of those attacks has originated from Pakistan. That’s where the origin of this trouble is: the Lashkar-e-Taiba is from there, the Lashkar-e-Jhangvi, Jaish-e-Mohammad, all these outfits are from Pakistan. So, the training grounds, the financial factors and the motivating factors are all inside Pakistan, and come from across the border”, Mr. Karzai said.\n\nHe said there was no possibility of Afghans attacking Indian missions due to India’s popularity there. “There will never be an Afghan-motivated, Afghan-financed attack on Indian interests in Afghanistan. There never was and there can never be, because India is seen as the greatest friend of Afghanistan, historically and today,” he said.", 
    "section": "national", 
    "title": "Suicide bombers hit Indian consulate", 
    "subsection": "general", 
    "date": "2016-03-03"
}