{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "The United States continues to push India towards joint naval patrols and multilateral groupings in the Indo-Pacific region.\n\nA senior U.S. Admiral on Wednesday called upon to convert the increasingly complex naval exercises between the two countries into coordinated patrols.\n\nStating that India has an advanced military across all domains and the Indian Navy has a long history of capability on the high seas Admiral Harry Harris, U.S. Pacific Commander said: “We should be exercising together and we should be turning those exercises into coordinated operations.”\n\n“On joint patrols the U.S. Ambassador and I have advocated working together,” he said in response to a question from The Hindu while speaking at the Raisina dialogue jointly organised by the Ministry of External Affairs and Observer Research Foundation.\n\nHowever, he did not specify where the patrols would be conducted. Whether those operations are in the Indian Ocean, be it in the Northern or Eastern part, or Pacific Ocean, Admiral Harris said: “that’s left to our leaders to decide”.\n\nHe echoed U.S. Ambassador Richard Verma’s vision: “In the not too distant future, American and Indian Navy vessels steaming together will become a common and welcome sight throughout Indo-Asia-Pacific waters, as we work together to maintain freedom of the seas for all nations.”\n\nAdmiral Harris revealed that in the first ever trilateral dialogue between India, Japan and Australia held last year, the three sides discussed “maritime security — including freedom of navigation patrols — and trilateral cooperation” in the Indian and Pacific Oceans.\n\nThis development is significant as all three countries have been traditionally reluctant to take any measures that could antagonise China.\n\nQuadrilateral format\n\nIn this he added that the trilateral should be expanded to a quadrilateral format.\n\n“An idea to consider is perhaps expanding this trilateral to a quadrilateral venue between India-Japan-Australia and the United States,” he said adding that “we are all united in supporting the international rules-based order.”\n\nThe Malabar bilateral naval exercises have been last year expanded to trilateral format including Japan.\n\nU.S. Admiral Harry Harris says India has an advanced military across all domains", 
    "section": "national", 
    "title": "U.S. push for joint patrols in Indo-Pacific region", 
    "subsection": "general", 
    "date": "2016-03-03"
}