{
    "author": [
        "P V"
    ], 
    "text": "The administration has declared 100 panchayats as open defecation-free here in the district as of January 1.\n\nThe Swacch Krishnagiri Mission, a take off from the Swacch Bharath Mission, has grown in strength with incremental addition to the ODF-Krishnagiri campaign, taking the total number of ODF panchayats to 100. The campaign itself took off in August last, with focus on severely toilet-deficit panchayats as the target areas. In August, 15 panchayats were declared ODF-panchayats.; followed by 35 more panchayats added in October.\n\nThe intervening months since has seen an additional 50 panchayats taking the place of ODF – panchayats increasing the total count to 100.According to Collector T.P.Rajesh, the recent rain has had a significant effect on behavioural norms as far as sanitation was concerned. “The rain pushed people to use the newly constructed toilets. Whatever was constructed was fully put to use and the shift was also caused by necessity” says Mr. Rajesh.\n\nAlso, each panchayat brought on ‘Swacch Krishnagiri’ mode is being monitored by vigilance and monitoring squads called “Swacch squads”.\n\nThese “Swacch squads constituted by teachers, school students, local volunteers, with sirens and whistles will whistle away open defecators in the small hours of the morning. “The initial resistance has slowly giving way to behaviour chance,” Mr. Rajesh told The Hindu .\n\nThe administration is soon planning on taking the Swacch Krishnagiri campaign to 101st panchayat, with the hope that the remaining 233 panchayats in the district will be brought under total sanitation ODF cover at the earliest.\n\nTo track the progress of the mission here, a dedicated website www.swacchkrishngirimission.com was launched in October.", 
    "section": "national", 
    "title": "100 panchayats in Krishnagiri district declared open defecation-free", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}