{
    "author": [
        "S Ganesan"
    ], 
    "text": "From Mukthisvaram Temple at Purthikoyil near Manapparai\n\nEighteen inscriptions of Pandyas and kings of Vijayanagar were discovered from Mukthisvaram Temple at Purthikoyil, five kilometres from Manapparai, by research scholars of Dr. M. Rajamanikkanar Centre for Historical Research, Tiruchi.\n\nThe inscriptions along with a few damaged sculptures were found by R. Akila, Assistant Professor, Department of History, Aringar Anna Government Arts College, Musiri, and M. Nalini, Head, Department of History, Seethalakshmi Ramaswami College, during an explorative study at the temple based on information provided by P. Balasubramanian, founder, Natural Therapeutics Centre, Thiruvanaikovil.\n\nR. Kalaikkovan, Director, Dr. M. Rajamanikkanar Centre for Historical Research, said that though some of the inscriptions were partially damaged or buried the epigraphists were able to copy most of them but for a few lines which were not readable.\n\nInscriptions found on the southern wall of a larger mandapam were comparatively in better shape than the ones that are found inside the front mandapam.\n\nThick coating of lime on the north side of the shrine had caused much damage to the records that are inscribed there, he said.\n\nThe major chunk of the copied records belongs to two important kings of the Second Pandya Empire, Maravarman Kulasekara and Jatavarman Sundara Pandya. Though many records speak of gift of large tracts of land by the kings and the administrators of the local assemblies to the temple, minute details such as the boundaries of the gifted villages, irrigational facilities and the technicalities dealt in writing the documents are fascinating, he said.\n\nA record of Kulasekara Pandya mentions the name of the temple as Thirumukthisvaram and names the village where it is situated as Kaduvankudi.\n\nThis record declares the gift of Alakiyasemanallur including its taxes towards the services of the temple by one Semandan.\n\nAnother inscription registers the gift of a piece of land along with a well at Gopalakkudi by two devotees who were residing in the temple quarters.\n\nAnother inscription of Kulasekara Pandya copied from the front mandapa registers a gift of 30 kalanju of gold by the Urar of Kaduvankudi as ‘thirueluchipadi’ to the temple for conducting early morning services. Kodalakudi, a village bounded by Upayakudi, Semangalam, Akalanganallur and Kodumbalur was gifted by the nattavar of north Konadu and Muthiyakudi nadu as tax-free ‘thirunamatukani’ in the name of the presiding deity to cover the daily expenses of the temple.\n\nAn inscription of Sundara Pandya throws light on several villages that formed the boundaries of the gifted land to the temple by the urar of Melai Kaduvankudi that was included under Muthiyakudi nadu. Vijayapancharanallur a fertile village was gifted jointly by the administrators of three villages namely Kilaikaduvankudi Melaikaduvankudi and Poykaiyur to meet the expenses of certain festivals.\n\nA partly damaged and built in record of Sundara Pandya throws light on an agreement reached between two priests who held rights of conducting services at Thirumukthisvaram on sharing their days of work.\n\nDamaged sculptures of Vishnu, Chandesvara and two other deities were found amidst the bushes in the temples, Dr.Kalaikkovan said.", 
    "section": "national", 
    "title": "18 inscriptions of Pandyas, Vijayanagar kings discovered", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}