{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In a pre-dawn operation, Special Branch police and Forest Department officials seized about 300 kg of sea cucumbers, an endangered species protected under Schedule I of the Wildlife Protection Act, 1972.\n\nActing on a tip-off, the Special Branch team seized raw sea cucumbers, kept in five boxes at Vedalai seashore near here on Wednesday morning, but a smuggler, identified as Z. Allah Pitchai (42), who came to procure the contraband managed to escape, the police said.\n\nPursuing the lead, Forest Watchers from Mandapam range launched a search, and seized raw sea cucumber hidden in a nearby coconut grove, S. Ganesalingam, Forest Ranger, said.\n\nAdditional Superintendent of Police (Headquarters) Inbamani visited the seashore and conducted an enquiry. The police detained two persons, suspecting their involvement in illegal fishing of sea cucumbers, but let them off after enquiry, police sources said.\n\nAfter completing the enquiry, the police handed over 300 kg of sea cucumbers, kept in 18 boxes, to the Forest Department officials. The forest personnel produced the seized sea cucumbers before Tiruvadanai Judicial Magistrate Court, and destroyed them after obtaining court order, Mr. Ganesalingam said.\n\nIn June last, the Marine Police of the Coastal Security Group (CSG) seized about 1,000 kg of sea cucumbers when they were transported in a van for smuggling. Smugglers who had nexus with fishermen indulging in illegal fishing of the endangered species, procured raw sea cucumbers and sell or smuggle them after processing, the police said.\n\nThe Forest and Fisheries Departments had advised the fishermen to let sea cucumbers back into the sea if they inadvertently caught them while fishing, but some fishermen sold them to smugglers to make easy money, the police said.\n\nSmuggler, who came to purchase them, escaped\n\nfrom police", 
    "section": "national", 
    "title": "300 kg of sea cucumbers seized near Mandapam", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}