{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Bull owners seek legislation for the race which is an integral part of Pongal festivities in Vellore district\n\nLike “jallikattu” in southern parts of Tamil Nadu, “eruthu vidum vizha” (bull race) has been an integral part of Pongal festivities for nearly a century in Vellore district.\n\nWith the festival of harvest round the corner, bull owners and enthusiasts have urged the State government to act quickly to restore life to the traditional sport by bringing in legislation.\n\nThe ban on “jallikattu” brought to hold the race for bulls. Bull owners said no cruelty is done to the animals participating in the race.\n\nOn Thursday, members of the Tamil Nadu Eruthu Vidum Vilaiyaatu Paadhukaapu Sangam, Vellore district, submitted a petition to the Collector seeking steps for the conduct of the race this year.\n\n“Without ‘eruthu vidum vizha,’ it will be a black Pongal for all of us. We are planning to surrender our ration cards and voter identity cards next week if the race is not permitted in the district,” R. Soundarajan, president of the association, said.\n\nThere are 750 bull owners across the district rearing at least 2,000 bulls exclusively for the race. The race is an integral part of the festival of harvest and the following months in over 350 villages.\n\n“The sport is over 110 years old in Kalnarasampatti village of Pudupettai, Tirupattur. Until the ban came into place, the race was being held on January 15, and is conducted for four to five months during temple festivals at these 350 villages,” he said.\n\n“At least 250 to 300 bulls are gathered in a village for the race. Each bull is made to run for 100 metres and the time is noted. The bull that had covered the distance in the shortest time is declared winner. Where is the question of cruelty to the animal,” Mr. Soundarajan said.\n\nThe entire area where is the race is conducted is barricaded to prevent spectators from getting injured.\n\n“The legal tangles started in 2011, and regulations were brought in that mandated deposits of Rs. two lakh and medical verification. Pongal celebrations have lost their flavour owing to these stringent rules, and the ban brought the race to a standstill,” he said.\n\nL.B. Babu, secretary of the association, is rearing 10 bulls for the race at Latheri.\n\n“We did not conduct the race for the last three years, and this has definitely played spoilsport. We are keeping track of news every day hoping that the ban would be lifted,” he said.\n\nEvery bull owner spends at least Rs. 300 to Rs. 500 per bull for healthy food. “We feed the animals with eggs, milk, chana, wheat and soup. We take utmost care that the bulls are free from diseases,” Mr. Babu said.\n\nMr. Soundarajan said the State government can bring in legislation like Karnataka and Andhra Pradesh governments to facilitate conduct of the traditional sport.", 
    "section": "national", 
    "title": "A century-old sport awaits clearance", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}