{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The police team tracking social media has taken to WhatsApp to counter hoaxes that spread like wildfire\n\nThe Chennai police has an added responsibility – scotching rumours that spread through social media.\n\nA team of 60 police personnel work round the clock, in shifts, to monitor and counter hoax messages.\n\nDuring the recent flood, there was panic among residents as social media was rife with rumours about breaching of reservoirs and crocodiles at large.\n\n“On Tuesday, the bomb scare spread like wildfire, assisted by social media,” said a police officer.\n\nTo tackle this menace, personnel in the city police’s control room have now started sending messages to counter such rumours.\n\n“We first check whether the message is true with the help of police personnel on the field. Based on our findings, we send out the WhatsApp messages through different groups,” said a police officer.\n\nThough the city police force has a dedicated team to track social media, it started countering the hoax messages mainly during the floods.\n\n“The police control room was flooded with calls at that time. Many were to confirm if the messages they received were true. It was then we started using WhatsApp messages,” said an officer.\n\nHeightening security\n\nIn certain parts of Chennai and its suburbs, policemen on patrol duty in residential areas regularly take persons roaming around in a locality in a ‘suspicious’ manner into the patrol vehicles to ascertain their identity.\n\nA senior official of the Chennai City Police said the reason some persons are taken to police stations by patrolmen is to prevent crimes and also to instill a sense of fear in miscreants.\n\nIn recent days, in a residential area in Velachery, policemen in patrol vehicles have been regularly stopping and questioning groups of people from other areas who arouse suspicion.\n\nA few who were unable to give convincing answers when questioned were taken to the police station.\n\nA police official of the Velachery Police Station said it was a routine security measure adopted to prevent crime.\n\nSuch steps have helped solve several old crime cases. Once the person is able to prove his identity, he is let free, the official added.\n\n(Reporting by\n\nVivek Narayanan and\n\nR. Srikanth)", 
    "section": "national", 
    "title": "A dedicated task force to scotch rumours", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}