{
    "author": [
        "S Annamalai"
    ], 
    "text": "Blindness caused by fungal keratitis completely preventable: ophthalmologist\n\nIf the eye is red, do not presume it to be ‘Madras Eye.’ It could be fungal infection, warn ophthalmologists. The growing incidence of loss of vision, especially among those involved in agricultural and allied activities, due to ulceration of the cornea is threatening to become a major health issue.\n\n“Till recently, our focus was on management of cataract. Now, we come across more cases of loss of vision caused by ulceration. It was M. Srinivasan of Aravind Eye Hospital who first identified fungus as the blindness-causing agent than bacteria in the region,” says N. Venkatesh Prajna, Director, Academics, Aravind Eye Care System.\n\nMost of the injuries are caused in the field while threshing paddy, drying onion or handling produce in godowns.\n\n“Many of the patients with fungal keratitis are workers in onion and groundnut godowns. The onion flake is sharp and cuts the eye and plants a fungus,” says Dr. Prajna. Whenever there is irritation of the eye caused by dust, the eye should be irrigated with clean water. Since a foreign body in a farm is laden with fungus, irritation of the eye should not be ignored.\n\n“If the irritation persists, the person should visit the nearest primary health centre where ophthalmic technicians are available.\n\nHe should not buy over-the-counter medicines,” says Dr. Prajna.\n\nAs farm workers do not use adequate protective gear, their eyes are exposed to dust. An eye hospital in West Bengal places sets of glasses near the paddy thresher for the use of farmers during harvest time.\n\n“Blindness caused by fungal keratitis is completely preventable. The fungal infection is curable if the affected person visits an ophthalmologist within seven days of the incident,” says Dr. Prajna.", 
    "section": "national", 
    "title": "A silent stealer of vision", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}