{
    "author": [
        "S Abraham Mills"
    ], 
    "text": "The public are habitually dissatisfied with the civic infrastructure and its upkeep. But some of the good jobs the State machinery executes go unnoticed.\n\nOne such exercise is the work undertaken through Domestic Breeding Checkers (DBC) in the 141 villages of Tirupparankundram block by the departments of Public Health and Rural Development and Panchayati Raj. After the dengue scare in 2013, the government appointed the DBCs on a pay of Rs. 249 per day, to prevent dengue and water-borne diseases by eradicating Aedis mosquitoes.\n\nThe all-women group of the DBCs divide into two teams of 10 each and go to a particular village and visit every house as per a schedule. Since they have to check indoors, they wear uniform saris and sport identity cards.\n\nAccording to Block Health Supervisor P. Thangasamy, they check for mosquito larva in water tanks, vessels, cans and drums, old tyres, coconut shells, containers behind the fridge, water outlet of air-conditioners and unused grinding stones. They put them upside down. These women even climb atop overhead tanks and sanitise the water.\n\nThey are armed with torchlights, bleaching powder, a ladle and temephose, a chemical concentrate, which is mixed beforehand at 2 ml per litre.\n\nHealth Inspector M. Balakrishnan said that when larva was found, the water would be emptied to kill them. “Bleaching powder is used wherever possible and if the water could not be drained, temephose is poured. Since an oily layer is formed on the surface, the larvae die of suffocation,” he said.\n\nMr. Thangasamy said that since eggs were too small and could be detected only under a microscope, the larva and pupa stage were the right stages for eradication and fogging was done in the case of adult mosquitoes.\n\nM. Jeyaseelan, Block Development Officer, said that though 21 suspected dengue cases were detected in 2013, 17 in 2014 and 11 in 2015, there was no fatality.\n\nAchampathu-Erkudi panchayat president C. Sadasivam said that the civic body took all efforts to keep the surroundings clean but the residents must cooperate by not dumping garbage in public places.", 
    "section": "national", 
    "title": "Adept at killing Aedis mosquitoes", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}