{
    "author": [
        "Madura Bureau"
    ], 
    "text": "(Top) Bank employees staging a demonstration in Palayamkottai, and (above) Tuticorin on Thursday.— Photos: M. Lakshmi Arun and N. Rajesh\n\n(Top) Bank employees staging a demonstration in Palayamkottai, and (above) Tuticorin on Thursday.— Photos: M. Lakshmi Arun and N. Rajesh\n\nCondemning the move to enforce rules and regulations applicable for State Bank of India on its subsidiary banks, a group of bank employees staged demonstration at Palayamkottai on Thursday ahead of their proposed one-day strike on Friday.\n\nThe protesting bank employees said the SBI administration was adopting “anti-worker policies” by enforcing the rules and regulations applicable for SBI on employees of subsidiary banks like State Bank of Travancore, State Bank of Mysore, State Bank of Patiala, State Bank of Hyderabad and State Bank of Bikanir.\n\nCondemning it, the bankers had decided to go on a one-day nationwide strike on Friday (January 8), the protestors said.\n\nThe bankers organised a similar protest in front Canara Bank’s Beach Road branch in Tuticorin.\n\nNagercoil\n\nThe strike call given by All India Bank Employees Association (AIBEA) on Friday is likely to hit banking operations.\n\nAn office-bearer of the striking union told The Hindu that the strike call has been given in protest against the violation of bilateral settlement by five associate banks of State Bank of India and their attempt to force unilateral service conditions on the employees. It is expected that except State Bank of India, the banking operations in other commercial banks including the associate banks of SBI will be affected on Friday, the sources said.\n\nBanking operations would be hit in over 100 branches and over 1,000 bank employees were expected to take part in the strike.\n\nThe AIBEA has planned to stage a demonstration in front of the regional office of the State Bank of Travancore near Head Post Office in Nagercoil on Friday, the sources said.", 
    "section": "national", 
    "title": "Bank staff stage demonstration", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}