{
    "author": [
        "B Aravind Kumar"
    ], 
    "text": "Ruling the State alternatively, the DMK and the AIADMK have been expanding the \"welfare schemes\" but have not been able to hold on to power for successive terms\n\ns the ruling party begins trumpeting its achievements in the run-up to the elections, it will be banking on the government’s flagship scheme – of free mixies grinders and fans, targeting 1.85 crore families.\n\nBy this month-end, the government would have spent a staggering Rs 8,800 crore for this popular package aimed at relieving women of the domestic drudgery and improve their lives.\n\nNow the facts: Female voters outnumber male voters in Tamil Nadu as per the draft electoral rolls. The AIADMK’s traditional vote base comprises mostly women. The party is led by a woman leader in Jayalalithaa. And the party founder MGR’s charisma and the ‘two leaves’ symbol still get votes in rural areas.\n\nIf the Jayalalithaa government has, as promised, relieved 1.54 crore women of drudgery till now, will it fetch the ruling party votes enabling it to recapture power?\n\nInteraction with women voters in a few localities in the city revealed that the women are happy with the freebies. The women admit that the freebies, each worth about Rs. 5,000, have certainly improved their lives. And they have no problem with the working of the mixies and grinders, which they received three years ago.\n\nMallika, a resident of Otteri, is a house help and the head of a large family, says: “The mixie and grinder are of immense help,”\n\nAsk her and her neighbours if they will vote for the ruling party in return, you only get chuckles. “My husband is a great fan of Kalaignar [Karunanidhi],” she says.\n\nMeena, a house help from Chindadripet, said she found the freebies to be of much help and is all praise for the present government. She also has in her house a colour TV and a gas stove given during the DMK regime.\n\nBut many others lost their household items, including the freebies, in the recent floods. Their essential concern lies in rehabilitation and beneficial schemes that will help them in the long run. “We can’t say if freebies will influence our voting choice. As long as they are all useful products, we are happy,” says her neighbour.\n\nSaraswathi of Doomingkuppam in Santhome said that since her ration card was not listed she was unable to get the freebies, though most of her neighbours did get them. She also won’t say if she will vote for or against the government.\n\nTill last year, 1.54 crore families with rice ration card were covered for the free mixie, grinder and fan scheme. “We were unable to finish it on schedule due to the rains in the flood-hit districts. We hope to do this by Pongal,” said a senior civil supplies official.\n\nLike the present government, the previous DMK regime had distributed 1.60 crore colour television sets by spending Rs. 4,000 crore. To top it, the then deputy chief minister M.K. Stalin was banking heavily on Self Help Groups (SHGs) as officials made him believe that the SHGs were a trusted vote bank. Mr. Stalin gave enormous thrust to the SHG movement. None of it worked. The DMK lost even the Opposition leader post in the Assembly.\n\nGame changer\n\n“Freebies really have not won elections. It was MGR who last won successive elections. The previous DMK’s Re-1 rice scheme was launched [in 2006] and it was a game changer. It changed the political economy of food and agrarian relation by taking away the control over food. Still, the DMK lost the [2011] elections,” points out J. Jeyranjan, a developmental economist.\n\n“The Dravidian parties ruling the State alternatively, however, continue to expand the populist schemes. The voters, though, like to keep them guessing. Recent political history shows they vote for the ruling party in by-elections, but vote it out in the Assembly elections,” he says.\n\n(Additional reporting by Anjana Shekar and Abrar Sultana)\n\nBeneficiaries of the free mixie, grinder and fan scheme admit it to be of help", 
    "section": "national", 
    "title": "Banking on populist policies", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}