{
    "author": [
        "Special Correspondent"
    ], 
    "text": "With its experience, contemporary technology and state-of-the-art manufacturing facilities, Bharat Heavy Electricals Limited (BHEL), is better placed to supply power plant equipment to meet the stringent environmental norms, said S.Gopinath, Executive Director, BHEL, Tiruchi, here on Thursday.\n\nInaugurating BHEL’s southern region customer meet and a workshop on spares and renovation and modernization of boilers and auxiliaries here, he said that the public sector major was fully geared up to meet the customers’ demands.\n\nHe emphasised the need for shifting towards preventive and predictive maintenance of the power plants rather than break down maintenance.\n\nC. Radhakrishna, Director, Projects, Telangana State Power Generation Corporation Limited (TSGENCO), said the Corporation has placed order for 6,000 MW of coal based thermal power plants with BHEL.\n\nDelay in land acquisition and environmental clearances were the major factors contributing to project over runs in the power sector. He called for improving the storage management and supply schedule to meet the commissioning deadlines.\n\nRajeev Srivastava, Executive Director, Spares and Services Business Group, BHEL, said BHEL was fully equipped with its line of spares to meet the contemporary emission standards with respect to thermal power plants.\n\nEfforts were being taken to retrofit the existing plants with necessary equipment.\n\nK.Sivaprakasam, Director, Generation, Tangedco, commended BHEL’s contributions to the power sector.\n\nEarlier, presentations were made on current business scenario, products and services, boiler auxiliaries, fluidized bed combustion and heat recovery steam generator technology, valves, control and instrumentation, tube failures and remedies, seamless steel tubes and various improvement initiatives in terms of spares and retrofits, a BHEL press release said.", 
    "section": "national", 
    "title": "BHEL ready to meet demands of customers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}