{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Say revenue generated through by-products should be much more than the price of sugar\n\nOver 100 cane farmers affiliated to Tamil Nadu Cane Growers’ Association were arrested on Thursday when they tried to lay siege to the Collectorate pressing for a charter of demands, including fixation of procurement price of Rs. 4,000 a tonne for sugar cane.\n\nAssociation president N. Palanisamy said that in the present practice of fixing price, only the recovery rate of sugar from the cane was taken into consideration. However, farmers were not compensated for its other by-products and procedures such as molasses, ethanol, power generation and paper production. “Revenue generated through them should be much more than the price of sugar. However, not even a single paisa of profit made from by-products is shared with farmers by the sugar factories,” he said. If the sugar factories take all these into consideration, they could very well pay the farmers more than Rs. 4,000 a tonne, he said. Mr. Palanisamy sought a CBI probe into the alleged irregularities in the 14 cooperative sugar mills and two government sugar factories in the State.\n\nHe complained that only because of mismanagement in procurement of machineries and other raw materials and irregularities in selling by-products, the cooperative and government mills were facing loss. “The loss is artificially created. Hence, a CBI probe should be ordered to bring out the facts,” he said.\n\nTamil Nadu Vivasayigal Sangam leader K. Devaraj said that the State and the Centre were not ready to fix a decent price taking into account the increasing farming cost of cane though private sugar mills were making huge profits. “Renowned scientist M.S. Swaminathan had suggested that the price of cane should be fixed 50 per cent more than the cost of growing cane but his suggestion was not considered by the government,” he said.\n\nThe association also demanded the State government to absorb the Rs. 1,800-crore debts of cooperative sugar mills.\n\nAs many as 108 farmers were picked up by the police when they tried to lay siege to the Collectorate. They were later let off.", 
    "section": "national", 
    "title": "Cane farmers demand Rs. 4,000 a tonne", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}