{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Alagappa University has proposed to establish ‘Centre for Thirukural Studies’ to propagate the greatness of the couplets of Saint Poet Thiruvalluvar by promoting research works and organising international workshops and lectures, Vice Chancellor S’. Subbiah has said.\n\nAddressing ‘TAMIL ICON 2016,’ a three-day international conference on Thirukural, jointly organised by the university and Sree Sevugan Annamalai College here on Thursday, he said the proposed centre would encourage students to take up research work on Sangam literature and honour scholars who translated the couplets in other languages and brought out commentaries.\n\nThe proposed centre would conduct seminars, conferences, workshops and lectures on Thirukural to propagate the greatness of the work at national and international levels, he said. He said the university would also establish a ‘Centre for Tamil Cultural Studies’ to protect the Tamil tradition and culture and propagate them among the younger generation who had little knowledge of the richness and values of Tamil culture and aped the west.\n\nAddressing the conference, Tamil scholar Kundrakudi Ponnambala Adigalgar, who hailed Thirukural as ‘Tamil Veda,’ said the ancient literature eloquently touched upon all aspects of human character and behaviour and that was why its immortality and universality became unquestionable even after centuries.\n\nThe greatness of Thirukural was that its values were applicable to all religions, all countries and all times, he said adding no wonder, it became the only literature to be translated in more number of languages after The Bible. A galaxy of Tamil scholars from foreign countries including Prof. K. Sivagurunatha Pillai (London), Prof. S. Sachithanandam and Vasek (France), Prof. Ulrik Nicholas (Germany), Prof. Anagan Babu (Australia), S.V.Lingam (Malaysia), Subashini Tremmal (Germany), R. Vimalan and V. R. Manickam (Singapore) attended the conference. Prof K. Gnanasambandan and Kavignar Thangam Murthy also addressed the gathering.", 
    "section": "national", 
    "title": "Centre for Thirukural Studies to be set up", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}