{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "Twenty-six-year old M. Haripriya had to take a break from her career after the birth of her child as the company she worked for refused her leave beyond three months.\n\n“Twelve weeks is not enough for mothers to nurse their young. Is not raising a child a social responsibility? Do people in power even think about our support systems? Women sacrifice a lot after child birth,” she says.\n\nWith reports of the Centre increasing maternity leave from 12 weeks to 26 weeks, there has been an overwhelming response from women who are welcoming the Centre’s move.\n\nSenior lawyer Geeta Ramaseshan says mothers today have less have support systems as extended families are no longer as supportive as they used to be in the past.\n\nShe says that this welfare legislation cannot be seen as interference in their autonomy by private companies. “The State has the obligation to bring in such legislation to address the needs of employees,” she says.\n\nK. Purushothaman of NASSCOM says they have been conducting programmes to talk about maternity benefits. “Most software companies have a large workforce, hence the extension of leave will not be seen as creating a negative impact on the firm,” he added.\n\nMs. Ramaseshan says there should be regulatory body which should act as a redressal forum in case a person is denied six months of paid leave or removed from her work.\n\nBut Ms. Haripriya says, “We have policies on paper. Even if we are granted the said period’s leave, the employee suffers in several indirect ways like losing out on issues like seniority and promotion. Do we have a mechanism to sort that problem?” K. Pichammal of All India Democratic Women’s Association (AIDWA) says that while on the one hand we encourage breastfeeding, if mothers do not get additional paid leave up to six months, it will be unfair.", 
    "section": "national", 
    "title": "Centre to extend leave to 26 weeks", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}