{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Taking a giant leap in restoration of water bodies with the participation of the general public, and to protect the environment, a project to clean a public well in the city was inaugurated here on Thursday.\n\nArtist and one of the trustees of Agaram Foundation, Karthi, along with Salem Citizen’s Forum, took up the work at Pallapatti. After the works are over, the well would help recharge the ground water level. The forum has sought permission from the administration to renovate the Pallapatti Lake spread across 44 acres. The lake is filled with sewage, and water hyacinths.\n\nEarlier in the day Karthi along with forum’s convenor Piyush Manush visited the Mookaneri Lake and had a coracle ride where the actor was briefed on the various works done in the last years. The lake, which was once a dry water body, was renovated by the forum.\n\nKarthi planted saplings near the lake. He lauded their efforts in preserving the body and stressed its importance.\n\nHe visited the Golden Gates Matriculation Higher Secondary School on the Yercaud foothills where the correspondent Meena Sethu briefed him on the eco-activities carried out by students.\n\nHe visited 400-year-old Longley Tank in Arisipalayam in the city that was renovated by the forum with the participation of the general public. Karthi said that the purpose of his visit is to observe the water body restoration works carried out in the city so as to implement it across the State by the foundation.\n\nRecently, the foundation along with The Hindu , and Puthiya Thalaimurai organised a conference, ‘Yadhum Oore - Enaivom…Enaipoum’ in Chennai where environment conservation.Dharmapuri\n\nKarthi visited the Elakkyampatty Lake in Dharmapuri, which was recently renovated by Dharmapuri Makkal Mandram, and Thalir.\n\nShunning plastics, and carrying out segregation of wastes at source were essential to save water bodies. He said that he would use his movies to carry the message against flex banners, and plastics too.", 
    "section": "national", 
    "title": "Cleaning of well at Pallapatti begins", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}