{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A souvenir is being released at the conference on Crowdfunding, organised by the Department of Commerce of Sri Krishna Arts and Science College in Coimbatore on Thursday.\n\nCrowdfunding pattern in the country was going through a transformation with people looking to new ventures and start-ups, said Sudha P Rao, Chief Economic Advisor, Government of India.\n\nShe was speaking at the two-day conference on Crowdfunding 2016 organised by the Department of Commerce of Sri Krishna College of Arts and Science on Thursday. The session was chaired by S. Mazharvizhi, chairperson and managing trustee of Sri Krishna Institutions.\n\nShe said that there were three ways of drawing funds such as donation/ reward crowdfunding, debt crowdfunding and equity crowdfunding. The first donation model was not so serious whereas for the other two, there had to be some regulations in place in peer-to-peer lending. The RBI was bringing out a discussion paper on crowdfunding and SEBI had set up a committee under Infosys founder Narayanamurthy. The report was expected any time this month, she added.\n\nResponding to a query later, she said, “the Ministry of Rural Development has still not thought of crowdfunding to raise money for rural projects/ development.”\n\n“Crowdfunding will outlive many parts of the financial system,” said Scott McIntyre, president, Crowdfunding Professional Association (CFPA). He asserted that transparency and the historic nature of raising money was more critical in crowdfunding. McIntyre accompanied the president and Provost of Clayton State University, Atlanta – Tim Hynes and Kevin Demmit.\n\nS. Siddartha, senior vice-president, Global Banking and Financial Services, HCL Business Services, said that crowdfunding in India was like the telecom revolution. “We have an opportunity to leverage; most of it at present is about small ticket investment.”", 
    "section": "national", 
    "title": "‘Crowdfunding going through transformation in India’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}