{
    "author": [
        "Special Correspondent"
    ], 
    "text": "V.P. Pandi alias ‘Attack’ Pandi, prime accused in the 2007 Dinakaran newspaper office attack case, has claimed that he was unaware of an appeal preferred by Central Bureau of Investigation in 2010 and pending in the Madras High Court Bench here since then against the acquittal of all 17 accused by Principal District and Sessions Court here on December 9, 2009.\n\nWhen the appeal came up for hearing before a Division Bench of Justices P.R. Shivakumar and V.S. Ravi on Thursday, a Legal Aid counsel, N. Ananthakumar, appointed by the court on August 19 for most of the accused who had not engaged their own advocates, informed the court that Pandi had written a letter to him from the central prison here stating that he knew nothing about the CBI appeal.\n\nMr. Ananthakumar told the court that he had written a letter to Pandi informing about his appointment as suggested by the court during the last hearing of the appeal.\n\n‘No court notice’\n\nReplying to it, he claimed that he had not received any court notice so far despite the appeal having been pending for more than five years. He also expressed his willingness to appoint a separate lawyer to represent him.\n\nHowever, irked over the claim made by the accused, Mr. Justice Shivakumar said that it appeared to be a tactics to prolong the hearing on the appeal and adjourned the case till Tuesday with a direction to the accused to appoint a counsel by then.\n\nThe newspaper office in Madurai was attacked on May 9, 2007 following publication of the results of a survey in which Dravida Munnetra Kazhagam president M. Karunanidhi’s younger son M.K. Stalin reportedly emerged as the preferred choice to be his political heir than his elder son M.K. Alagiri.\n\nJustice Shivakumar said that it appeared to be a tactics to prolong the hearing on the appeal and adjourned the case", 
    "section": "national", 
    "title": "Dinakaran case: ‘Attack’ Pandi claims ignorance about CBI appeal", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}