{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Goodies:(From top) Tirunelveli Collector M. Karunakaran and Tuticorin Collector M. Ravikumar distributing Pongal gift hampers to women at Manur and Kovilpatti on Thursday.\n\nGoodies:(From top) Tirunelveli Collector M. Karunakaran and Tuticorin Collector M. Ravikumar distributing Pongal gift hampers to women at Manur and Kovilpatti on Thursday.\n\nCollector M. Karunakaran inaugurated the distribution of special Pongal gift hamper to 8.33 lakh beneficiaries in the district on Thursday.\n\nInaugurating the distribution at the Tirunelveli Super Market ration shop, Dr. Karunakaran said 8.29 lakh ration cardholders, families of 3,175 policemen and 849 Sri Lankan refugees would receive the special Pongal gift hampers, each containing one kg raw rice, 1 kg jaggery, 2-foot-long sugarcane and Rs. 100 in cash through the 1,430 ration shops across the district.\n\nRajya Sabha MP Vijila Sathyananth, MLAs Nainar Nagenthran and S. Muthuselvi, District Supplies Officer P. Sekar were present.\n\nIn the neighbouring Tuticorin district, Collector M. Ravikumar inaugurated the distribution of the gift hamper at Inam Maniyachi near Kovilpatti in the presence of MLA Kadambur S. Raju.\n\nThe Collector said 4.45 lakh ration cardholders, families of 1,431 policemen and 469 Sri Lankan refugee families would receive the Pongal gift hampers.\n\nNagercoil\n\nAs many as 5,47,478 ration cardholders buying rice from PDS shops will be given Pongal gift hampers in Kanyakumari district.\n\nThe gift hampers would be distributed through ration shops run by cooperative institutions and government, said District Revenue Officer A. Udhayakumar.\n\nInaugurating the distribution of the gift pack in the presence of former minister N. Thalavai Sundaram and Nagercoil MLA A. Nanjil Murugesan, the DRO said 5,44,986 ration cardholders, families of 2,073 policemen and 419 Sri Lankan Tamil refugee families living in four camps across the district would get the Pongal gift.\n\nNagercoil DRO S. Madhiyazhagan, chairman of the district panchayat M.S. Sarathamani, District Supply Officer T. Chinnammal, Member of Tamil Nadu Minority Commission A. Justin Selvaraj, President of Aralvoimozhi Primary Agriculture Cooperative Society S. Krishnakumar were present", 
    "section": "national", 
    "title": "Distribution of Pongal gift hamper commences", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}