{
    "author": [
        "M Balaganessin"
    ], 
    "text": "Farmers blame it on excess rain during north-east monsoon\n\nExcess rain during the north-east monsoon has resulted in fall in the quality and quantity of black gram in parts of the district causing heavy loss to farmers who have been raising it as an inter-crop along with other horticultural plants.\n\nA number of farmers on the T. Pazhuvur-Ariyalur segment, particularly those at Pudupalayam village panchayat and those in Sendurai belt say that the yield had been reduced drastically. Sekar, a farmer of Nerunjikorai near Pudupalayam says that he had raised the crop during November on 20 cents. Although he expected 100 kg, he could harvest just 10 to 15 kg. He attributed the fall in yield to incessant rain in early December. This year, in the absence of surplus production, the harvested produce was sufficient for domestic consumption and he would not be able to sell it to wholesale dealers. Many farmers were seen thrashing their produce by spreading it on the Tiruchi – Ariyalur highway.\n\nAgriculture Department officials say that black gram was being raised in two different seasons in the district – during the Kharif and Rabi seasons. This year’s showers during the monsoon was quite an unexpected one and, black gram cultivators who had raised the crop during November were the worst-hit, he said indicating that farmers who had raised the crop a little earlier would register higher yield.\n\nThe district accounted for 2,500 hectares under pulses including black gram and the Agriculture Department encouraged black gram cultivation by special incentives of Rs.30 a kg for increasing the area and also for augmenting yield under black gram cultivation.\n\nThe official said that most farmers resorted to raising black gram cultivation as an intercrop along with cashew and other horticultural varieties.\n\n“The crop is raised on smaller landholdings, as most farmers were inclined towards just domestic consumption,” the official said adding that the department has been motivating farmers to go in for pulses. “The sudden rise in the prices of thoor dhal has created some awareness among the farmers about the profitability of pulses and we have been cashing in on this trend to motivate the farmers to switch over to pulses as a main crop,” he said. Most farmers raised ‘Vamban 2’ or ‘Vamban 5’ variety in this district, the source told The Hindu on Wednesday.", 
    "section": "national", 
    "title": "Drop in black gram yield", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}