{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A farmers’ welfare forum has sought the authorities to conduct a public hearing before preparing land use map by the Puducherry Planning Authority (PPA).\n\nThe PPA has notified the Draft Existing Land Use Map and Register for public perusal ahead of finalising the Comprehensive Development Plan.\n\nThe draft Land Use Map and Register with data, maps and details of land use for the entire Puducherry region (covering a total area of 293.77 sq.km.) has been uploaded on the website of the Department of Town and Country Planning inviting suggestions for improvement and registering objections. The draft copy has also been kept for inspection at the office of the PPA.\n\nIn violation\n\nV. Chandrasekhar, president, Bangaaru Vaickal Neeraadhara Koottamaippu, said the process initiated by the PPA was in violation of the 72nd and 73rd amendment, which clearly call for the involvement of the local bodies in plan making.\n\nWaterbodies lost\n\n“Also being active in the Bahour Commune, we never were consulted in any of the processes. We are aware that whenever the government brings out such maps as was done in the 1969 resurvey maps, vast areas of waterbodies were illegally converted into private lands which then becomes legalisation process for appropriation of government lands for private purposes.\n\n“A classic example is the Kirumambakkam twin tanks of Periya Eri (Big tank) and the Chinna Eri (small tank). The Periya Eri has got reduced to a thin small tank and the Chinna Eri is a bigger tank. So also is the case of the Bahour tank, where pattas have been shown inside the waterbody,” members of forum said.\n\n“There must be a public consultation process in each of the communes based on physical maps. Only then can we all ensure that the existing land use maps reflect reality on the ground,” said Mr. Chandrasekar.", 
    "section": "national", 
    "title": "Forum seeks public consultation on preparing land use map by PPAs", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}