{
    "author": [
        "R Rajaram"
    ], 
    "text": "Travel and trade circles plan to raise a host of issues during a meeting with him\n\nA strong pitch is proposed to be made on a slew of issues connected with Tiruchi international airport by travel and trade industry during the two-day visit of the Civil Aviation Minister P. Ashok Gajapathy Raju here.\n\nBeing the maiden visit to the city, Mr. Raju is scheduled to hold meetings with different stakeholders starting Friday. His visit comes at a time when Tiruchi, a unique airport with more foreign operations than domestic, has been witnessing an upswing in passenger and freight movements owing to steady increase in number of overseas flights over the years.\n\nNevertheless, there have been certain key issues that have been pending for long notwithstanding several rounds of official discussions and repeated representations and demands from public welfare bodies. One of the major issues hanging fire for long is the expansion of the runway that would eventually pave the way for operation of wide-bodied aircrafts from and to this fast growing non-metro airport.\n\nThe runway expansion requires 510.30 acres of land of which over 160 acres belongs to the defence. Although the defence ministry had accorded “in-principle” approval for providing about 168.4 acres of its land adjoining the airport, it had sought alternative land of equal value in exchange. Despite several rounds of meetings involving the district administration, runway expansion work is yet to take off. This key issue is expected to figure prominently in the meetings to be held with the Minister.\n\nEven as the number of foreign flights from Tiruchi airport had increased, it has remained only to select overseas destinations. The absence of direct connectivity to key Middle East destinations has been hugely felt by the travel industry and other public welfare bodies who have persistently raised this issue on many occasions.\n\nTiruchi has direct connectivity to Dubai thanks to Air India Express. There is a large chunk of labour force from central and southern districts employed in various Middle East destinations.\n\nTravel industry circles say there is substantial movement to West Asian destinations including Kuwait, Riyadh, Damam, Jeddah, Abu Dhabi and Doha from Tiruchi. The absence of direct connectivity to these Middle East destinations forces passengers to travel via Chennai or go via Colombo by taking the Sri Lankan Airlines from here.\n\nNon-inclusion of Tiruchi airport as a point of call under the Bi Lateral Air Services Agreement (BASA) has restricted operations to West Asian destinations by many overseas carriers. Given the rising air passenger traffic and the demand, time has come for the Ministry of Civil Aviation to include Tiruchi airport as a point of call under the BASA which would enable new carriers to operate flights to more West Asian destinations, says Mr M. Sekaran, president, Air, Rail and Road Travellers Federation.\n\nThis would not only address the long pending passengers’ demand, but also enhance overseas cargo movement from Tiruchi airport thereby augmenting revenue for the Airports Authority of India, adds Mr. Sekaran. Stakeholders have planned to raise the BASA issue during their interaction with the Minister.\n\nOver two years have passed since a notification allowing international courier operations through Tiruchi airport was issued in mid-2013. However, courier shipments are yet to take off from the Tiruchi airport which has seen an upswing in overseas cargo movement.\n\nThere is a strong expectation that the facility would be launched in 2016. Although the Airports Authority of India and the Customs have held discussion on this issue, international courier operation continues to remain on paper.\n\nIt is felt that launch of courier operations would change the profile of overseas freight shipments from Tiruchi - majority of which are perishable commodities exported to several foreign countries.\n\nWISH LIST\n\nAirport runway expansion hanging fire\n\nInternational courier operations yet to take off", 
    "section": "national", 
    "title": "Great expectations over Civil Aviation Minister’s visit", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}