{
    "author": [
        "T Madhavan"
    ], 
    "text": "Desilting and deepening the 20 lakes that drain into the Adyar will help avoid flooding —Photo: G. Krishnaswamy\n\nResidents and activists want the State government to revive and implement a multi-purpose reservoir scheme, proposed as early as 2002. The Chennai Metropolitan Development Authority took a decision to appoint a consultant for the Thiruneermalai multi-purpose reservoir scheme to harness surplus water from Adyar river draining into Bay of Bengal.\n\n“Since the early 1990s, we have been campaigning for harnessing water from Adyar river in Tiruneermalai, where space is not a constraint. The Adyar river receives water from as many as 20 lakes in the region. The Public Works Department should have desilted and deepened these lakes to store more water during the monsoon,” said S.Narasimhan of Communist Party of India (Marxist).\n\nThis will help avoid flooding of residential localities along the river and also recharge ground water in the adjoining areas of Pallavaram, Chromepet and Tambaram.\n\n“There is already a check dam across the river in Manapakkam. If a scheme to harness water from Adyar in Tiruneermalai is executed, it will also take care of the drinking water needs of several local bodies”, said S. Arumugam of Anakaputhur. Activists have for long urged the State government to construct similar check dams downstream of the river to harness water, he said.\n\nThe Adyar River originates at Adhanur near Guduvanchery in Kancheepuram district and gets its flow during the monsoons. The location of Tiruneermalai holds significance as it receives water from Guudvanchery, Padappai, Manimangalam and Somangalam, accounting for 80 per cent of its total catchment area of 800 square kilometres, an official said.\n\nBesides, the surplus channel of Chembarampakkam lake joins the river just a few kilometres away from Kundrathur in Sriperumbudur taluk to make it a biggest draining system for southern parts of the city, they added.", 
    "section": "national", 
    "title": "Harness water in Adyar river, demand activists", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}