{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here on Thursday dismissed two public interest litigation petitions filed against conducting the consecration of Ramanathaswamy Temple at Rameswaram on January 20. The court said the judiciary could not intervene in such matters even if an inauspicious date had been fixed for the consecration to suit the powers that be as claimed by the petitioners.\n\nRejecting the petitions filed by S. Pakshi Sivarajan and K. Ramamoorthy, both residents of Rameswaram and devotees of the deity, a Division Bench of Justices V. Ramasubramanian and N. Kirubakaran said: “Assuming that a date for the performance of the consecration has been fixed only to suit the rulers, even then we do not know how judicial intervention is possible.\n\n“A peep into the history of Tamil Nadu would show that several temples were constructed and consecrated by kings not necessarily with a view to bring prosperity to the ruled but also to ensure that their dynasty continued to rule forever. Some temples were actually constructed and consecrated for the purpose of ensuring victory for the ruler in times of war.\n\n“After democracy replaced monarchy, elections have taken the place of wars and the tradition of propitiating certain Gods and Goddesses for the purpose of winning appears to have continued. Perhaps, if a country is ruled by non-believers, they may leave it entirely to the wisdom of the persons in management of temples to decide all these matters.”\n\nAlso rejecting the argument that the day was astrologically inauspicious, the judges said: “We do not know for whom January 20, 2016 is inauspicious. Theists believe that God transcends all dimensions including time and space… Therefore for the One who transcends time, space and all limitations within which the universe functions, no date and time could be inauspicious.\n\n“For mortals, what is auspicious for one is inauspicious for another and vice versa. Many a time, no two astrologers, like lawyers and doctors, agree with each other. Therefore, apart from the fact that it is beyond the call of our duty under Article 226 of the Constitution to examine astrological questions, it is also beyond our comprehension to decide whether a particular date is auspicious or inauspicious.” They, however, directed the temple Executive Officer to either repair the damaged idol of Ambal Parvathavarthini, consort of Lord Ramanathaswamy, or cover the damaged portion with a golden Kavacham, as promised by him to the court in another case in 2011, before the consecration.\n\nSays courts cannot interfere even if an inauspicious date has been fixed", 
    "section": "national", 
    "title": "HC not to interfere with temple consecration", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}