{
    "author": [
        "Special Correspondent", 
        "V S"
    ], 
    "text": "RELIGION\n\nShree Pattatharasiamman Temple : Thiruppavai chant, Kasturipalayam Road, Periyanayakanpalayam, 5 a.m.\n\nThiruvenkatavan Charitable Society: Margazhi Mahotsavam, Sri Venugopalaswamy and Sri KalyanaVenkatesa Perumal Swamy temple, 5.20 a.m.\n\nBakthi Sorpozhivu Mandram: Villibharatham Discourse, Kongu Nadu Arts and Science College, 6.30 p.m.\n\nCULTURE\n\nAmrithavarshini Fine Arts: Carnatic vocal recital, Hotel Midland Residency, 4.30 p.m.\n\nGENERAL\n\nDr. N.G.P. College of Arts and Science NSS unit: Camping, Kalapatti, Veeriampalayam and Karupparayanpalayam, 9 a.m.\n\nDr. R.V. Arts and Science College: Tamil association meeting, Seminar hall, 3 p.m.\n\nDr. N.G.P. College of Arts and Science: Guest lecture, Conference hall.\n\nTamil Nadu Agricultural University: Farmer’s day function, Convocation hall, 9.30 a.m.\n\nBharatiya Vidya Bhavan School: Kinter Garten & primary day, School premises, 5.30 p.m.\n\nThe Coimbatore productivity council: Food safety management systems, Vyshnav buildings, Race course, 9.30 a.m.\n\nRajasthani Sangh : Dengu preventive medicine, R.S.Puram, 2.30. p.m.\n\nNature Conservation Society: State level wildlife photography exhibition and workshop, P.K.Das Auditorium, Nehru Arts and Science College, 10.30 a.m.\n\nMSME Development Institute and COTMA: National level vendor development programme, Suguna Kalyana Mandapam, 11 a.m.\n\nAvinashilingam Educational Trust: Annai Vizha, Thiruchitrambalam Auditiroum, 6 a.m.\n\nDr. N.G.P. College of Arts and Science: Self defence training, Conference hall, 10 a.m.\n\nSri Ramakarisna Polytechnic college: NSS camp, Sri Aranganathar temple, 4 p.m.\n\nThe Coimbatore District Small Industries Association: Counselling and Guidance to Entrepreneurs, 3 p.m.\n\nSankara Institute of Management Science: Get invigorated session, SIMS Elite hall, 10.30 a.m.", 
    "section": "national", 
    "title": "In Coimbatore Today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}