{
    "author": [
        "Syed Muthahar Saqaf"
    ], 
    "text": "At least half a dozen trains could be re-routed via Namakkal; only five trips of passenger train services are operated in this section throughout the day\n\nThe decision of the railways to continue to run a majority of long distance trains from the central and southern districts via the circuitous Karur – Erode – Salem section, even after the completion of the short distance Karur – Namakkal – Salem route, is affecting commuters.\n\nThe routing of these trains via Karur – Namakkal – Salem section will definitely enable passengers save at least an hour, besides giving Namakkal a direct connectivity to North India.\n\nThe commuters of Karur, Namakkal, and Salem districts have been regularly complaining about the underutilisation of the Salem – Namakkal – Karur section commissioned a few years ago.\n\nOnly five trips of passenger train services are operated in this section throughout the day. There is no night trains as of now.\n\nThe Palani – Chennai Central, and Nagercoil – Bengaluru night trains are operated on the Karur – Namakkal – Salem section. The weekly Nagercoil – Kacheguda Express too runs through this sector. Passengers want the Mysore – Mayiladuthurai Express to be diverted through Namakkal. Even after commissioning of the track, the railways have not diverted the train. The diversion of this train will in no way affect the people of Erode, as they already have the Tuticorin – Mysuru express train along the route. Besides, a good number of trains are run via Erode to South Tamil Nadu.\n\nThe commuters of Salem and Namakkal want the Tirunelveli – Jammu Tawi Express too to be run through this route. Another train that could be diverted through Namakkal is the Nagercoil – Mumbai CST Express. There are several trains to Mumbai via Erode. After the laying of railway track to Karaikal, the railways introduced the Karaikal – Chennai Egmore Express via Tiruvarur – Thanjavur – Mayiladuthurai, a circuitous route, a few years ago. After the completion of the gauge conversion works along the Tiruvarur – Mayiladuthurai section, the train was diverted via Namakkal, which enabled in saving a couple of hours of travelling time. Till date Salem is not connected to Madurai via Karur and Dindigul during the day time, says Janata M.P. Velusamy, president, Mohanur Rail Commuters Welfare Association.", 
    "section": "national", 
    "title": "Karur-Salem route yet to be fully used", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}