{
    "author": [
        "S Prasad"
    ], 
    "text": "The paintings, dating back to 3,000 B.C., are being vandalised by miscreants and anti-socials\n\nPrehistoric rock paintings discovered in Kilvalai, a nondescript village near Villupuram is facing severe threat due to rampant illegal mining and vandalism. The paintings in red ochre are found in clusters on three rocks at Kilvalai.\n\nThough the site is maintained by the State Department of Archaeology it has now become highly vulnerable with the paintings damaged by miscreants and anti-socials due to unrestricted entry and faces the threat of fading away.\n\nThe paintings dating back to 3,000 B.C. throw light on the culture and history of people in prehistoric time in this region. A majority of etchings by pre-historic human beings on rocks had been covered with red ochre and lost their details due to discoloration.\n\n“The rock art sites are a treasure trove of the country’s remarkable heritage, culture and history and must be protected in all aspects. Similar such rock art paintings are found in large numbers in cave shelters in India and are the main sources to unlock the mystery of human life. The symbols in the paintings are similar to those found in the Indus Valley civilisation,” archaeo-symbolist T.L. Subash Chandira Bose told The Hindu .\n\nOne painting depicts three persons with a man mounted on a horse, another pulling that horse with a rope fastened to the animal while the third man is depicted with stretched hands welcoming others, he said.\n\nMr. Bose claimed that rock arts are the first form of scripts of writing system of “Maraieil eeru” or Upanishad which get manifested in a sacred soil, which is said to be the soil of satyaputra.\n\nDespite the extensive recorded presence of rock art paintings in Kilvalai and Siruvalai villages illegal mining and vandalism has annihilated these paintings that nature had preserved for nearly 3,000 years.\n\nMiscreants had disfigured some of the paintings without recognising their value and only a minute examination could reveal the original drawings. Similar such rock paintings have also been found at Siruvalai another pre-historic site in Villupuram district, C. Veeraraghavan, an epigraphist said.\n\nThough the site is under the control of the State Department of Archaeology no staff are deployed to either protect the paintings or guide the visitors.\n\nThe site has also yielded Neolithic tools and pottery ware and is in urgent need of protection, Mr. Veeraraghavan added.\n\nThe 19th Congress of Rock Art Society of India organised by the Archaeological Survey of India and Department of History at Pondicherry University in 2014 had discussed various dimensions of rock art, its documentation, preservation and conservation techniques adopted in various parts of the country and the world.\n\nThe symbols in the paintings are similar to those found in the Indus Valley civilisation", 
    "section": "national", 
    "title": "Kilvalai rock paintings face threat of fading away", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}