{
    "author": [], 
    "text": "RELIGION\n\nRamakrishna Mutt: Arathi, Reserve Line, New Natham Road, 6.30 p.m.\n\nGita Bhavanam: 68{+t}{+h}anniversary, 45-day yagna, Kamarajar Salai, 7.30 a.m.\n\nThiruvalluvar Mandram: Discourse on Avvai Kural by A.K.S. Thirumavalavan, S.S. Colony, 5 p.m.\n\nThiruvalluvar Kazhagam: Oratorical competition for college students in ‘Thirukural,’ North Adi Street, Meenakshi Sundareswarar Temple, 5 p.m.\n\nPanniru Thirumurai Mandram: Abirami Anthathi Parayanam, mutrodal, Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nYoung Men’s Brahmins’ Association: Sri Vishnu Sahasranama Parayanam and puja, No. 21 Sambandamoorthy Street, 6 p.m.\n\nSreemath Bhagavath Geetha Siravana Samajam: 85{+t}{+h}year sreemath gita siravana, Gita upanyasam, Govinda Dasa Seva Samajam, Mahal Sixth Street, 6 p.m.\n\nTirupavai Tiruvembavai Isaipalli: Devotional songs, 6 a.m.; Paavai songs and devotional songs, Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nMadurai Srimad Venkatramana Bhagavada Seva Samajam: 235{+t}{+h}jayanthi celebrations of Venkatramana Bhagavadar, ganapathi homam, 6.30 a.m.; ‘Isai Vizha,’ Union Minister Pon. Radhakrishnan, chief guest, 10 a.m.; nadha sangamam, 12 noon; Carnatic music, Sourashtra Sabai Sri Ranga Mahal, No. 13 South Krishnan Temple Street, South Masi Street, 4 p.m.\n\nCULTURE\n\nSri Sathguru Sangeetha Samajam: 64{+t}{+h}music and arts festival, vocal concert by Sikkil C. Gurucharan, Lakshmi Sundaram Hall, 6 p.m.\n\nGandhi Memorial Museum: K.P. Gangadharan conducts, yoga classes, 6 a.m., 10.30 a.m. and 5 p.m.\n\nTamil Isai Sangam: Swami Sivayogananda talks on ‘Role of Arjuna in Mahabharatha,’ Rajah Muthiah Mandram, 6.30 p.m.\n\nRama Samajam: Discourse on Ramayanam by R. Hariji, Sringeri Sri Saradambal Sannidhi, Bypass Road, 6.30 p.m.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre: Yoga training by S. Yoganand, Department of Philosophy, The Madura College, 6.30 a.m.\n\nGENERAL\n\nYadava College: Workshop on ‘Quality enhancement for survival of Indian industries -the need of the hour’ by R.S. Mani of VIT, Vellore Rajendranar Auditorium, 2 p.m.; Department of Commerce, lecture on ‘Self-development,’ by K. Ramamurthi and K.T. Vijay Karthigeyan of Coimbatore Institute of Management and Technology, Smart Class Room, 10.30 a.m.\n\nThiagarajar College: Lecture on ‘A new look at economics and economy’ by A. Christober Dhas of The American College, Diamond Jubilee Hall, 11.30 a.m.; Department of Commerce, lecture on ‘Statistical tools for decision making’ by M. Manoharan of CPA College, Bodi, Smart Class Room, 11.30 a.m.\n\nSourashtra College: Fifth session of Nature Cure Association, MCA Class Room, 1 p.m.\n\nINTACH and Thiagarajar College: Clean monument campaign and poster making competition, B. George of Madurai Kamaraj University College, chief guest, Gandhi Memorial Museum, 9.30 a.m.\n\nMannar Thirumalai Naicker College: Department of English screens short film, G. Sundararajan Seminar Hall, 11.45 a.m.\n\nMadurai District Tiny and Small Scale Industries Association: Opportunities for neo-entrepreneurs by T. Jothimurugan, Director, KLN Engineering College, L. Murari, president, presides, Maditssia Hall, 5 p.m.\n\nAmutha Surabi Kalai Mandram: Pongal celebrations by students, Mayor V.V. Rajan Chellappa, chief guest, Tamukkum Grounds, 10 a.m.\n\nRam Psychiatry Hospital: 30{+t}{+h}year anniversary, Continuing Medical Education programme, V.D. Krishnaram, chairman, presides, Mohan Isaac, consultant psychiatrist, University of Western Australia, speaks on ‘How can evidence based medicine be practised in psychiatry,’ Hotel Fortune Pandian, 8 p.m.\n\nMNU Jayaraj Nadar School: 59{+t}{+h}Annual Day celebration, A. Kaliamurthi, former Superintendent of Police, chief guest, S.K. Mohan, general secretary, presides, K.P.S.V.R. Gurusami Grounds, 5 p.m.\n\nOur Lady Matriculation Higher Secondary School: Free medical camp in association with Lion Club of Madurai Vaigai and Meenakshi Mission Hospital, 9.30 a.m.\n\nVoluntary Association for People Service: Valedictory function of micro enterprise development programme on jute bag making, S. Santhakumar, General Manager, District Industries Centre, addresses, No. 39 Besant Road, Chokkikulam, 11.30 a.m.\n\nAlcoholics Anonymous: Meeting, Rosary Church, Town Hall Road, 7 p.m.\n\nSPORTS\n\nK.L.N. College of Information Technology: Two-day first State-level inter-school boys kabaddi and girls volleyball tournament, K.N.K. Ganesh, correspondent, presides, 10.30 a.m.\n\nMELUR\n\nAlcoholics Anonymous: Meeting, R.C. School, Sivaganga Road, 6.30 p.m.", 
    "section": "national", 
    "title": "Madurai Today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}