{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Doctors and women working for private sectors call it positive legislation\n\noctors in the city have welcomed reports on the move to increase maternity leave for women employed in the private sector.\n\n“Most organisations, including hospitals, only offer three months’ maternity leave. The recommended period for exclusive breastfeeding is six months and so, many women employees find it difficult to cope. Some of them are forced to introduce solids to their infants early or take extended unpaid leave. In many cases, women simply have to quit their jobs,” says S. Subramanian, neonatologist and one of the founders of the Mothers’ and Infants’ Lactation/Breastfeeding Care Centre in Mylapore.\n\nDr. Subramanian, who sees at least 30 working mothers every month, adds that workplaces should also look at creating facilities for breastfeeding mothers and allow them time in between work to feed.\n\n“The extension of leave is a positive step,” he said.\n\nWith anaemia still affecting a large number of Indian women and with lifestyles changing and increasingly stressful jobs, six months is now needed to ensure better recovery for the mother and nutritional health of the child, says Priya Selvaraj, assistant director, GG Hospital. “Other countries have this, so why not India,” she said.\n\nBreastfeeding\n\nFor a large number of poor women, bottle feeding is expensive, says Sumana Manohar, consultant obstetrician and gynaecologist at Apollo Hospitals. “Breastfeeding is cheaper and a lot of working women suffer when they have to go back to work. Breastfeeding is also important for the bonding of the mother and the child,” she said.\n\nSays Sangeetha Anpazhagan, working a private e-learning company: “I went back to work immediately after my three months’ leave. It was very difficult but I had the support of my family. For those without support, it will be nearly impossible to go back in just three months.”", 
    "section": "national", 
    "title": "Maternity leave extension: a welcome move", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}