{
    "author": [
        "Special Correspondent"
    ], 
    "text": "They will clean the toilets thrice a day; heads of institutions to review their work\n\nKeeping the promise she had recently made to the heads of Corporation schools, Mayor E. Bhuvaneshwari posted sanitary workers at all educational institutions under the control of the urban civic body to clean the toilets thrice a day.\n\nWhen a meeting of heads of Corporation schools was organised by Mayor E. Bhuvaneshwari here on December 16 last, the insanitary condition prevailing on the premises of the educational institutions owing to sheer neglect by the civic body was brought to light.\n\nMost of the participants at this meeting complained that the toilets in their schools could not be used as there was no sanitary worker to clean them. Right from safe drinking water facility to toilets, infrastructure in the schools were in a pathetic condition. The toilets could not be used by students and teachers, they complained.\n\nA teacher from Kallanai Corporation Higher Secondary School, with the strength of over 4,600 girl students, said that the 10 toilets in her school, which were in a bad shape due to lack of maintenance, were inadequate. She also appealed to the Mayor to ensure construction of more toilets and deployment of sanitary workers to clean the toilets.\n\nWhen similar appeals were made by almost all teachers, Ms. Bhuvaneshwari assured them that adequate toilet facilities would be created and sanitary workers deployed there to clean them thrice a day.\n\nKeeping her promise, the Mayor deployed four sanitary workers each to the schools with high student strength and two workers to schools with lesser number of students.\n\n“Of the 200 temporary sanitary workers handpicked for this job, 50 have been deployed to each ward and tothe schools in these wards. The sanitary workers, after signing in the registers kept in the schools, will clean the toilets thrice a day and the heads of the institutions will monitor the quality of their work and forward a report to the Mayor once a week,” Ms. Bhuvaneshwari said.\n\nShe also hoped that the latest the addition of 200 sanitary workers would take the strength to 655, including the 100 permanent workers. “Hence we believe that we can render a better service to the city with five lakh population,” the Mayor said.", 
    "section": "national", 
    "title": "Mayor posts sanitary workers in Corporation schools", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}