{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Students being served their mid-day meals in a government school in Puducherry on Thursday; a central kitchen that supplies mid-day meals, seen closed —Photo: T. Singaravelou\n\nSection of staff go on protest, but supply to schools remain normal, says Education Department\n\nAll central kitchens which supply mid-day meal to school children are functioning normally in spite of the strike called by a section of employees, claimed the officials of School Education Department.\n\nCentral Kitchens at Lawspet, Kurichikuppam, Shanmugapuram, Ariyankuppam, Kirumampakkam, Emblam, Kalmandapam, Thondamanatham and Pillaichavadi are among the earliest ones set up to drive the Mid Day Meal (MDM) programme.\n\nDue to strike called by a few daily rated staff, the supply was disrupted from the central kitchen at Kurichikuppam for last few days.\n\nAn official said all central kitchens have been functioning normally. There were disruptions in the supply from one of the central kitchens and that has been sorted out, he added.\n\nThe Mid Day Meal Programme is being implemented in the Union Territory since 1930. The Government has taken steps to prepare food under MDM Programme in central kitchens which have modern facilities for preparation of food.\n\nThe food is transported to schools in covered vessels. The teachers have been instructed to ensure that the food meant for children is tasted before it is distributed. The department also procures diet articles from Government Organisations which supply only branded items.\n\nThe State level Monitoring Committee with Chief Secretary as Chairman reviews the Mid-Day Meals Programme every three months. Also, a toll free number is installed to facilitate lodging complaints by the public.\n\nThough food is prepared by experienced cooks, it is proposed to engage professional Catering Assistants to enhance the quality of the food being served to the students, officials said.\n\nThe Government has extended the Mid Day Meal scheme upto Higher Secondary which has reflected in better enrolment and reduction in the dropout rate, especially in the Secondary and Higher Secondary level in Puducherry.\n\nThe Government is now exploring the possibility of extending explore the possibility of extending the financial assistance under MDM upto class XII.", 
    "section": "national", 
    "title": "Mid-day meals ready despite strike", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}