{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Move to create a bus-shelter on a piece of land owned by Department of Hindu Religious and Charitable Endowment at Murugankurichi in Palayamkottai on Thursday was given up at the last moment as the HR and CE officials withdrew their permission for construction of the shelter.\n\nAfter a piece of land belonging to HR and CE Department, measuring about 8 cents near Mary Sargent Higher Secondary School, was about to be encroached upon by an individual, the attempt was thwarted a couple of years ago and the retrieved property was fenced. Since the land remained unused, it was decided to create a bus-shelter on this land and mandatory permission from HR and CE department was obtained.\n\nEven as work on constructing the bus-shelter was about to be commenced in the presence of HR and CE officials including Assistant Commissioner Kannadasan on Thursday morning, a group of people affiliated to a few Hindu outfits picked up heated arguments with the officials and the police there.\n\nDeputy Commissioner of Police (Crime and Traffic), Tirunelveli City, Rajan, who was present at the spot, warned them to leave the place as the construction of bus shelter had been taken up only after getting the consent of the HR and CE Department.\n\nA local office-bearer of one of the Hindu outfits, who was present at the spot to register his resistance, said they had come to the “disputed site” only after being alerted by a senior official attached to the HR and CE department to save the land from being used for a purpose not related to Hinduism.\n\nEven as the argument was going on, the existing bus shelter located about 50 metres away was razed down with an earthmover, forcing the students of nearby schools to stand on the road.\n\nAgainst this backdrop, the HR and CE officials, led by Mr. Kannadasan, fenced the property again in the evening. “Though permission was sought for constructing the bus shelter on this property in the interest of the public, a comprehensive probe by us showed involvement of some people from other religion with a hidden agenda… Hence we denied permission and took over the property,” Mr. Kannadasan said.", 
    "section": "national", 
    "title": "Move to create bus shelter triggers opposition", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}