{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Sarat Kumar Acharya, CMD NLC, planting a sapling of a rare tree variety in a park developed on the reclaimed area of Neyveli Second Mine —Photo: Special Arrangement\n\nThe Neyveli Lignite Corporation (NLC) has opened a species park to house diverse tree varieties on its second mine.\n\nSarat Kumar Acharya, Chairman and Managing Director, NLC opened the species park on a reclaimed (de-coaled) expanse of land on Mine-II.\n\nTrees grown in different parts of the country has been brought under a single stretch, for which, the modern park has been developed.\n\nThe park is set to boast of trees of all varieties, including those found in deserts, dense forests, rainfall areas and in temperate zones.\n\nNLC is ensuring adequate care to maintain the required climatic conditions for their growth.\n\nAs a first step, Mr. Acharya launched the planting of around 200 varieties, including the White Gungilium (Botanical Name : Veteroa Indica), Kal Aalan (Phycus Misuransus), Parkia (Pharkiya), Mahadhani (Mahagani Macro Philla) and Thali Chandra (Thabhubia Thalichandra).\n\nApart from the rare species of trees, the park also features a boat bay on an artificial lake which has been developed over 25-acre area. NLC has also put in place arrangements for visitors to enjoy boat rides.\n\nNLC Directors Subir Das and P. Selvakumar and Chief Vigilance Officer, Shiv Raj Singh, were among senior officials who participated in the launch of the facilities.\n\nAccording to the NLC, among the three mines at Neyveli, Mine-II has capacity to produce lignite of 15 Million tonnes per annum (MTPA).\n\nThe excavated lignite from this unit caters the need of Thermal Power Station-II and Thermal Power Station-II Expansion to produce power.\n\nAfter mining out lignite, the area will be filled with soil to bring back the area to its original state.\n\nThis barren land with no nutritious value is prepared by adopting various techniques and rendered fit for cultivation.\n\nIn this area various cultivation activities are being taken up, the NLC said.\n\nThe park will boast of trees found in deserts, temperate zones, rainfall areas and dense forests", 
    "section": "national", 
    "title": "NLC opens species park to house diverse trees", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}