{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Theni needs 1.25 lakh sugar canes to cover 3.8 lakh cardholders\n\nEven as sugar cane growers welcomed the government’s decision to distribute sugar cane pieces in Pongal gift hamper, officials face tough time in procuring and distributing sugar canes to all beneficiaries in Theni and Dindigul districts.\n\nTheni district needed around 1.25 lakh sugar canes to cover 3.8 lakh card holders before Pongal. At present, 2,000 bundles of 10 sugar canes each could be harvested from one acre, officials said. On an average, sugar canes grown on eight to nine acres were needed to meet the total cane demand. The total expenditure for procurement of sugar cane would be around Rs. 25 lakh as the procurement price for this season was hovering between Rs. 160 and Rs. 180 a bundle. But it could go up further in the days to come, they said.\n\nTo finalise the procurement, the district administration had decided to constitute a committee, comprising the Collector, Joint Registrar of Cooperatives and Joint Director of Agriculture as per government guidelines.\n\nThe officials were thinking over whether to procure sugar canes from one place or many places. Procuring sugar canes from one place and sending them to all ration shops in the district would involve huge freight charges. Quality, thickness and length of canes would vary from field to field, and it would mar distribution of sugar canes of uniform size and quality.\n\nWhen Theni district administration launched distribution of Pongal gift hampers containing sugar cane pieces among other things at Kodangipatti on Thursday, the officials managed to procure sugar canes from farms in Chinnamanur. The committee would decide on procurement, the officials added.\n\nDindigul district administration too has been facing a similar problem. It has to distribute sugar canes to 6.01 lakh card holders in eight blocks.", 
    "section": "national", 
    "title": "Officials in a dilemma over sugar cane procurement", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}