{
    "author": [
        "Dennis S"
    ], 
    "text": "In yet another case of officials in various government departments passing the buck when information has been sought under the RTI Act, the district administration in Tirunelveli district and the Nuclear Power Corporation of India Limited (NPCIL) have forwarded to each other queries on the implementation of the National Disaster Management Authority (NDMA) Guidelines in the district.\n\nG. Sundarrajan of Poovulagin Nanbargal, an environmental forum had sought to know whether the NDMA Guidelines on Nuclear and Radiological Emergencies released in 2009 had been implemented in the district.\n\nHe also sought information on the infrastructure such as hospitals identified to treat radiological emergencies as per the guidelines.\n\nThe Public Information Officer (PIO) in Tirunelveli Collectorate, in his reply to the applicant, stated that the request was being forwarded to his counterpart in Kudankulam Nuclear Power Plant, as the latter was the officer concerned for the details sought for.\n\nThe Public Information Officer at Kudankulam Nuclear Power Plant of NPCIL on December 29 replied contending it was the District Management Authority, which was the authority concerned and returned the queries to the PIO of Tirunelveli Collectorate.\n\nMr. Sundarrajan said, “The Supreme Court was, in 2013, informed that all precautionary measures were taken and now they are denying information on the details of the implementation. This is anti-constitutional, anti-people and illegal. They cannot deny or point at each other when asked for information.”\n\nTirunelveli District Collector M. Karunakaran told The Hindu , “The applicant has not sent the queries to the right person, i.e., the DRDA, which deals with the information and the PIO in Collectorate would not have the information. If information is sought from the right person, it would have been provided.” When contacted by The Hindu , an NPCIL official said, on condition of anonymity, “There has been some misunderstanding among officials in some departments of the district administration on this issue. We complied with the implementation of the guidelines on our part.”\n\nInfo sought under RTI Act whether suggestions\n\non nuclear emergencies were implemented", 
    "section": "national", 
    "title": "Officials pass the buck on RTI queries on NDMA guidelines", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}