{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Vashishta Johri (right), General Manager, Southern Railway, inspecting the Salem Railway Junction on Thursday. Shubhranshu, (second right), Divisional Railway Manager, Salem Railway Division, is in the picture. —PHOTO: E. LAKSHMI NARAYANAN\n\nVashishta Johri, General Manager, Southern Railway, accompanied by principal heads of all the departments, conducted inspection of Salem Railway Junction and all other railway stations in the Salem – Namakkal – Karur section on Thursday.\n\nShubhranshu, Divisional Railway Manager, Salem, and other senior officials of the division, were also present during the inspection.\n\nAfter inspecting the facilities on platform number 3 at the Salem Junction, the official team inspected the subway and the main entrance.\n\nLater, they visited the Railway Hospital near the divisional office and made enquiries about various facilities for the benefit of the railway staff and their family members and the availability of lifesaving drugs.\n\nLater, Mr. Johri set on in an inspection special. He inspected the entire track, railway level-crossing, rail over-bridges etc as part of annual inspection exercise. The team then travelled in an inspection special from Salem to Karur. At Mallur Railway Station, Mr. Johri and team inspected the foot over-bride, waiting hall, staff colony, toilet. The official was stopped at the level-crossing gate near the Mallur station when the GM inspected the condition of the gate. Later at Rasipuram Railway Station, the officials inspected the subways, functioning of mini reverse osmosis drinking water plant, and seating arrangements.\n\nAt Namakkal Railway Station, the officials inspected the road over-bridge in the vicinity of the station and other development works in progress, separate dustbins for depositing bio-degradable wastes and non bio-degradable wastes outside the station, computerised reservation centre etc. The team also inspected the facilities at Mohanur Railway Station, before heading towards Karur Junction. The officials and staff of different departments inspected the railway infrastructure, condition of the equipment, building premises etc of their respective departments. At all the railway stations, the officials inspected the various passenger amenities and also the safety aspects. The GM also listened to the grievances of the commuters and also received petitions from commuters and various organisations.\n\nS. Anantharaman, Chief Operating Manager, Southern Railway, and S.S. Gupta, Principal Chief Engineer, Sothern Railway, were among the senior officials who accompanied the GM. The members of the Southern Railway Mazdoor Union, led by M. Pandian, Salem Railway Divisional president, and M. Govindan, divisional secretary, received the GM.", 
    "section": "national", 
    "title": "Officials visit railway stations in Salem – Karur section", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}