{
    "author": [], 
    "text": "The State government has informed the Madras High Court that only three out of the 22 State universities have adopted the University Grants Commission (UGC) guidelines in respect of appointment of Vice-Chancellors.\n\nThe government itself was yet to adopt the UGC Regulations of 2010 which comprehensively deal with qualifications for appointment of teachers and Vice-Chancellors in universities.\n\nThe government made these submissions before the First Bench of Chief Justice S.K. Kaul and Justice Pushpa Sathyanarayana on a public interest litigation (PIL) petition moved by former Anna University Vice-Chancellor M. Anandakrishnan and Change India, a voluntary organisation. The petitioners approached the court challenging a notification given by the Madurai Kamaraj University to fill the post of Vice-Chancellor, in which they did not prescribe the eligibility norms for candidates as per the UGC regulations.\n\nThe petitioners alleged that since largescale corruptions were taking place in various universities, to prevent scandals universities must follow the UGC Regulations so that credible persons were appointed to the post of Vice Chancellor.\n\nThe court had directed the State to file an affidavit explaining the position of all 22 universities in respect of adopting the UGC guidelines.\n\nOn Thursday, the government submitted that only three universities had “partially” adopted these guidelines.\n\nObjecting to this, the UGC counsel said when the universities received huge financial grants from the UGC they are bound by its regulations.\n\nThe judges then questioned the UGC counsel if the apex regulatory body had any powers to take action against erring universities and if so, whether it has acted against any institution so far.\n\nDefending the Madurai Kamaraj University notification, its counsel contended: “The universities are mandated to follow the norms of the UGC only after the guidelines are adopted by the respective State governments. But in the given case, the norms are yet to be adopted by the government.”\n\nMoreover, he contended that the Vice-Chancellor is not a teaching staff but an academic head and principal executive officer of the university.\n\nThe UGC norms would be applicable only in the appointment of teaching staff, counsel argued.\n\nCountering this, counsel for the petitioners contended that, “Since the Vice-Chancellor is the academic head, the norms are applicable to such appointments also.”\n\nDefending the eligibility criteria prescribed by the search committee which says that both professors and associate professors with an experience of 10 plus years can apply for the post of Vice-Chancellor, university’s counsel said: “Most of the affiliated colleges of the university do not have a designated post of professor. Such post is available only at the university level. Hence, to avoid narrowing down the eligibility criteria, the committee decided to include associate professors with over 10 years of experience.”\n\nRecording the submissions, the Bench directed the respective counsel to file a synopsis of their arguments in not more than three pages and posted the matter to January 25 for further hearing.\n\n‘Govt. yet to adopt the regulations which deal with qualifications for appointment of teachers, V-Cs’", 
    "section": "national", 
    "title": "Only 3 TN varsities adopted UGC norms on V-C selection, says govt.", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}