{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Hands over appointment orders to candidates selected for the post of UDCs\n\nChief Minister N.Rangasamy on Thursday said over 2,000 posts would be filled soon in various government departments in the Union Territory.\n\nHer was handing over the appointment orders to the candidates who were selected for the post of Upper Division Clerks (UDC) at his chamber in Legislative Assembly complex.\n\nThe Department of Personnel and Administrative Reforms conducted examination for the recruitment of UDCs in October last.\n\nAs many as 503 persons were selected for the posts and their certificates were verified. The Chief Minister formally handed over the appointment orders to a few candidates who were among 352 selected in the first phase.\n\nSpeaker V. Sabapathy alias Kothandaraman, Member of Parliament (Lok Sabha) R. Radhakrishnan, Secretary of Personnel and Administrative Reforms S.Sundaravadivelu and other officials were present.\n\nLater talking to reporters, Mr. Rangasamy said that for the first time, over 500 posts have been filled through the Department of Personnel and Administrative Reforms by conducting examinations in a fair manner.\n\nAs announced earlier, all vacant posts would be filled soon. Teachers are being recruited and all vacancies would be filled by the month end.\n\nMr. Rangasamy also pointed out that posts of constables and home guards had already been filled and new recruits were undergoing training. Stating that his government demanded additional amount towards rain relief, Mr. Rangasamy pointed out that the Central team had inspected the Union Territory a second time to assess the damage. He expressed the hope that the Centre would release the amount Puducherry has been expecting.\n\nMr. Rangasamy said his government had taken steps for the release of Karaikal fishermen who were arrested by the Sri Lankan Navy. He had already written to Union Ministries of Home and External Affairs in this regard.", 
    "section": "national", 
    "title": "Over 2,000 govt. vacancies will be filled soon, says CM", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}