{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here on Thursday rejected the plea of advocate W. Peter Ramesh Kumar, now under suspension and facing suo motu contempt of court proceedings “for challenging the court to take action against him if it had guts,” to permit him to cross examine eyewitnesses without insisting on a reply to the show cause notice issued to him by the court.\n\nA Division Bench of Justices V. Ramasubramanian and N. Kirubakaran said that they could not permit him to cross examine the witnesses without filing a reply to the show cause notice either accepting or denying the charge levelled against him.\n\nThe judges said that after he replies to the notice, the court would frame charges and then permit the cross-examination of eyewitnesses to the incident.\n\n“Without the contemnor either refuting or accepting the allegations or explaining his stance in response to the show cause notice, any further proceeding would be open to challenge by him later on as vitiated. It appears that the contemnor wants exactly this to happen,” the judges said in their interim order besides observing that his intention was to prolong the issue, confront the court and aggravate the contempt.\n\nPointing out that they had adjourned the case at his request on three occasions since October 30, the judges said that during the last hearing on December 10, they had even granted audience to him in their chamber, also at his request, with magnanimity and goodwill.\n\n“In the chamber, he pleaded that he wanted to plead guilty and express apology in private and that to do so in public in open court will be humiliating for him. But we made it clear that is not possible for us to allow a person to sully this court in public and express regret in private and that whatever he wanted to say should be said in open court.\n\n“However, today, he has taken a different posture… He has stated that he cannot be asked to commit anything in writing. The tone and tenor of the contemnor exhibit that there is no sense of remorse. At one stage, he questioned us as to why the present contempt proceedings should not be transferred to Karnataka just as the disciplinary proceedings before Bar Council had been transferred.\n\n“When we told him that such a transfer cannot be ordered except by the Supreme Court, the contemnor stated that if the (High Court) Registry is directed to pay him the costs of his travel to Delhi, he would go to Supreme Court and seek a transfer,” the judges observed and adjourned the hearing to January 19 for filing a reply to the show cause notice.\n\nThe notice had been issued on November 4 for challenging a Division Bench of Justices R. Sudhakar and V.M. Velumani on September 16 when the lawyer wanted other advocates to boycott the court in support of 12 lawyers who were arrested for indulging in a sit-in inside Chief Justice’s court hall in Chennai demanding declaration of Tamil as the official language of the court.\n\nHe wanted to\n\ncross examine eyewitnesses before replying\n\nto notice", 
    "section": "national", 
    "title": "Plea of advocate facing contempt charges rejected", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}