{
    "author": [
        "Tiruchi Bureau"
    ], 
    "text": "A section of women returning home with Pongal gift collected at a function in Tiruchi on Thursday.— Photo: A.Muralitharan\n\nAn estimated 7.30 lakh ration card holders, including 932 Sri Lankan refugees, would get the Pongal gift packs in the district.\n\nDistribution of the gift packs to beneficiaries began on Thursday with R.Manoharan, Government Chief Whip, inaugurating the process at the Amaravathi Cooperative Wholesale Stores in the city in the presence of T.Rathinavel, MP, N.R.Sivapathi, T.Indira Gandhi and C.Valarmathi, MLAs, and K.S.Palanisamy, Collector.\n\nThe gift packs contain one kg each rice and sugar, Rs.100 in cash and two feet sugarcane. The gift packs are to be distributed through the ration shops over the next few days.\n\nTHANJAVUR: Distribution of ‘Pongal’ gift to cardholders belonging to economically weaker sections, commenced in all the districts in the central region on Thursday. In Thanjavur district, 6,25,914 people get the ‘Pongal’ gift.\n\nCollector N. Subbaiyan inaugurated the distribution of the gift at the Cauvery Supermarket. He said all the eligible beneficiaries would get the gift pack before the festival. Every day, 300 card-holders would get the pack.\n\nTIRUVARUR: In Tiruvarur district, 3,43,614 cardholders will benefit. M. Madhivanan, District Collector, inaugurated the distribution at a fair price shop on East Street.\n\nT. Mohanraj, District Revenue Officer, Alagirisamy, Senior Regional Manager, Tamil Nadu Civil Supplies Corporation, were present.\n\nPERAMBALUR: S. Meenakshi, District Revenue Officer, inaugurated the distribution at a fair price shop in Thuraimangalam.\n\nA release said 1,68,629 cardholders belonging to economically weaker section would benefit. The beneficiaries included 70 families of Sri Lankan refugees.\n\nR. P. Maruthairaja, Member of Parliament, was present.\n\nPUDUKOTTAI: Collector S. Ganesh inaugurated the distribution at a fair price shop of the Urban Cooperative Society here. He said that 4,27,909 beneficiaries would get the gift.\n\nS. Marimuthu, District Revenue Officer, and Balavadivu, Joint Registrar of Co-operatives (In-charge), said that all arrangements had been made for the timely distribution of the gift to the targeted beneficiaries.", 
    "section": "national", 
    "title": "‘Pongal’ gift pack distribution begins", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}