{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Festival goodies:Collector N. Venkatachalam distributing Pongal gift hamper to a beneficiary at Kodangipatti near Bodi in Theni district on Thursday; (below) Collector K Nanthakumar distributing the gift pack at Pattinamkathan panchayat in Ramanathapruam.\n\nFestival goodies:Collector N. Venkatachalam distributing Pongal gift hamper to a beneficiary at Kodangipatti near Bodi in Theni district on Thursday; (below) Collector K Nanthakumar distributing the gift pack at Pattinamkathan panchayat in Ramanathapruam.\n\nDistribution of Pongal gift to ration card holders commenced in Dindigul and Theni districts on Thursday.\n\nDistributing the gift at Kodangipatti in Bodi block, Collector N. Venkatachalam said that the gift hamper containing one kg of sugar, one kg of rice, two-foot-long sugar cane piece and Rs. 100 would be given 3,91,049 card holders and 1,524 police families.\n\nThe distribution would commence simultaneously at 514 ration shops, including 399 full-time fair price shops, 87 part time fair price shops, and 29 fair price shops manned by women self-help groups, he added.\n\nTheni MP R. Parthiban, District Revenue Officer S. Ponnammal and elected representatives of local bodies, and officials from cooperative and revenue departments took part.\n\nDindigul\n\nCollector T.N. Hariharan distributed gift hampers to 104 family card holders at Abirami Cooperative Society in Dindigul. A total of 6.01 lakh card holders in the district would benefit from the scheme. Arrangements had been made for quick distribution of gift packs, he added.\n\nRamanathapuram\n\nCollector K. Nanthakumar and his Sivangaga counterpart S. Malarvizhi launched distribution of ‘Pongal gift hampers’ to ration cardholders in the two districts respectively on Thursday, a day after Chief Minister Jayalalithaa announced the gift comprising one kg of raw rice, one kg sugar, two-feet sugarcane piece and a cash of Rs. 100. Mr. Nanthakumar launched the distribution at Pattinamkathan and Ms. Malarvizhi at Paganeri. Ramanathapuram MP A. Anwhar Raajhaa and Sivaganga MP P.R. Senthilnathan were present in the respective places. Official sources said that the packs would be distributed to holders of family cards, police cards and Sri Lankan Tamils living in refugee camps before Pongal festival. There were about 3.80 lakh ration cardholders in Ramanathapuram district.\n\nTirunelveli\n\nCollector M. Karunakaran inaugurated the distribution of special Pongal gift hamper to 8.33 lakh beneficiaries in the district on Thursday.\n\nInaugurating the distribution at the Tirunelveli Super Market ration shop, Dr. Karunakaran said 8.29 lakh ration cardholders, families of 3,175 policemen and 849 Sri Lankan refugees would receive the special Pongal gift hampers, each containing one kg raw rice, 1 kg jaggery, 2-foot-long sugarcane and Rs. 100 in cash through the 1,430 ration shops across the district.\n\nIn the neighbouring Tuticorin district, Collector M. Ravikumar inaugurated the distribution of the gift hamper at Inam Maniyachi near Kovilpatti.", 
    "section": "national", 
    "title": "Pongal gift hamper distribution begins", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}