{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "It will be held from January 13 to 24 at YMCA, Royapettah\n\nIt is not the regular, popular Chennai Book Fair, but a number of publishers and booksellers have got together to organise a similar event from January 13 to 24 – the Chennai Pongal Book Fair 2016.\n\nThis book fair, to be conducted under the banner of the Tamil Nadu Book Sales and Promotions Association, will have about 225 book stalls and will be held at YMCA in Royapettah, said K. Nagarajan, publisher of Bharathi Puthakalayam, one of the organisers.\n\nA habit formed over years\n\n“The Chennai Book Fair, which is usually held in January, has been postponed to April because of the flood. While some publishers have been affected, many of them depend on the revenue they get at the book fair – about 50 per cent of their cash sales for the year are done here. New books get published just before the book fair and a lot of debts are due to be paid around this time. Further, people are used to buying books around Pongal – it is a habit that has been formed over several years,” said Mr. Nagarajan.\n\nR. S. Shanmugam, of Sri Shenbaga Pathippagam, another organiser, said: “Many visitors from various countries come to Chennai around Pongal in time for the book fair. We have had many calls from customers. People like to buy books now and many publishers and booksellers cannot wait till April,” he said. The proceeds from tickets sales will be donated for flood relief, he said.\n\nThe April fest\n\nThose participating in this fair will also participate in the Chennai Book Fair in April that is being organised by The Booksellers’ and Publishers’ Association of South India (BAPASI). “We too are members of BAPASI,” said Mr. Nagarajan, adding this event will not affect Chennai Book Fair, but only help people in the trade.\n\nK.S. Pugazhenthi, general secretary of BAPASI, said the dates of Chennai Book Fair will be announced once the Assembly election schedule is notified. “Work is on in full swing for Chennai Book Fair and the event promotion will start soon,” he said.\n\nIt is being organised by TN Book Sales and Promotions Association. Ticket proceeds will go to flood relief", 
    "section": "national", 
    "title": "Pongal Book Fair will have over 200 stalls", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}