{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Public Sector Undertakings (PSUs) should organise vendor development programmes to get suppliers who specialise in the products that are required by the PSUs, S. Panikkaserry, director of MSME-Development Institute, Chennai said on Thursday.\n\nHe inaugurated a two-day vendor development programme organised here jointly by the Micro, Small and Medium Enterprises Development Institute (MSME DI) and Coimbatore Tirupur District Tiny and Micro Enterprises Association (COTMA).\n\nMr. Panikkaserry said the institute has been conducting vendor development programmes for several years now.\n\nAfter the announcement of the public procurement policy by the Central Government, these events got a boost. Now, the PSUs need to identify the MSMEs that can be suppliers and also the products that these units can manufacture. Hence, the annual procurement should be well-planned. The PSUs need to organise such vendor development events on their premises or at MSME clusters so that it is focused for a group of MSMEs.\n\nThe PSUs taken up national-level and international projects and quality and schedule of delivery of the components is critical. The vendors should take steps to meet these requirements, he said.\n\nS. Asokan, general manager of District Industries Centre, said Coimbatore has entrepreneurship and technology. The banks here lend more than Rs. 5,000 crore a year to MSMEs. About 85,000 MSMEs in the district make thousands of products and the industries here require assistance for a market that offers continuous opportunities.\n\nAccording to S. Ravikumar, president of COTMA, the association organised a similar event in 2013 and 23 MSMEs had become vendors to PSUs after that. Now, with the Union Government making the public procurement policy mandatory, there are opportunities for more number of units. There are PSUs that purchase components from other countries or the northern States. They are looking for local suppliers to bring down the cost and delivery schedule.\n\nK. Jayanchandiran, deputy director of MSME-DI, said the aim of the event is for the public sector units and the MSMEs to know each other and the business opportunities.", 
    "section": "national", 
    "title": "PSUs asked to organise vendor development programmes", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}