{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Irai Anbu says science alone can bridge the gap between land and laboratory\n\nThe charm of pure science courses has not faded away; pure sciences and humanities would have a great future, V. Irai Anbu, Principal Secretary, Department of Economics and Statistics, said here on Thursday.\n\nDelivering 41{+s}{+t}graduation day address at Seethalakshmi Ramaswami College here, he said although the spurt in Information and Technology lured a section of young generation, the demand for pure science courses has not gone down. The world had been facing many challenges. It had to find solutions to various problems and challenges faced by the mankind. Pure science had answers to many of the issues. There would be great demand for pure science graduates. But they needed to excel in their subjects to make a difference.\n\nMr. Anbu said that outstanding scientists had a great role to play in finding solutions to various issues. They could bridge the gap between land and laboratory. There was a need to make the technology cost-effective and accessible to everyone. The scholars, who could devise apt technology emanating from the soil, were the need of the hour. They should create an environment for the meeting of minds and marriage of thoughts.\n\nThe technology should not only be beneficial in the short run but also compatible with native resources.\n\nAdvocating the young graduates to opt for civil services, he said the role of policies and projects of governments occupied a major position in harnessing the ill-effects of poverty and penury. The country required men of impeccable integrity with zeal, zest, and dynamism to dispel the darkness, which had descended over a period of time. If everyone wanted to shirk the responsibility of running the bureaucracy, it would lead to a situation where substandard professionals would man the government. Those who had passion and commitment could definitely crack the civil services examinations.\n\nKannan Panchapakesan, Director-Academics, M. Jayanthi, Principal, and V. Gayathiri, Associate Professor, spoke.", 
    "section": "national", 
    "title": "Pure sciences offer a good career growth for youth", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}