{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The quality of life mattered more than longevity and one’s metabolic age was more important than chronological age, said Ravi Mantha, health guru, while addressing a meeting organised by the Madurai chapter of Confederation of Indian Industry (CII), Young Indians and Yuva at Thiagarajar College of Engineering here on Thursday.\n\nMr. Ravi, whose book, ‘The Baby Elephant Diet,’ was released on the occasion by S. Gurushankar, vice-chairman, Meenakshi Mission Hospital and Research Centre, said that the easiest way to improve one’s health was to watch “what you eat.” “Your body is your temple and food is an offering.”\n\nPrescribing a fibre-rich diet for keeping one’s body agile and fit, Mr. Ravi cautioned that a lot of junk food was masquerading as health food in the market. People should decide between a ‘passive’ and ‘active’ life, he said, elaborating that being active meant that one should not accept anything at face value. He reminded the audience that man was the fastest animal on land beyond a distance of 30 miles and he was followed by elephant and camel. “You are optimised to be a long-distance runner and it is up to you to decide whether you are going to lead a healthy life all through or a long life, spending the last 10 years in a wheel chair with diapers,” he said. It would be possible to gain control over life by increasing the level of being active by 10 per cent.\n\nWhile insisting that vegetarian diet provided the necessary strength and energy, Mr. Ravi said, “Vegetarians in India do not eat vegetables.” According to him, a rich diet should have more of vegetables, pulses and fruits, with rice sprinkled on them. Two things — heart beat and percentage of body fat — mattered for a healthy body and “the moment you start working on them you will feel younger.”\n\nFit people not only looked younger but were really younger metabolically, he said and wanted the participants to look at the body as a sustainable eco system in which good bacteria thrived. Warning against the use of antibiotics, Mr. Ravi said that one of the worst health issues — obesity — was a result of overdose of antibiotics.\n\nDr. Gurushankar explained how the present medical infrastructure was inadequate to cater to the health care needs of the future, and said that prevention was the best way to avoid going to a hospital. K. Hari Thiagarajan, chairperson, Young Indians, and SM. Manikandan of Yuva received the first copy.\n\n“A rich diet should have more of vegetables, pulses and fruits, with rice sprinkled on them”", 
    "section": "national", 
    "title": "‘Quality of life, not longevity, matters’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}