{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Routine functioning of revenue offices paralysed affecting the public\n\nIn protest:The Tuticorin Taluk Office wears a deserted look on Thursday as employees go on mass casual leave.— Photo: N. Rajesh\n\nFunctioning of revenue offices across the district was completely paralysed on Thursday as employees attached to this all-important department went on mass casual leave to highlight their demands.\n\nAs 540 revenue officials in the district went on mass casual leave, the routine functioning of the revenue offices was affected much to the agony of the public who visited these offices for getting various certificates.\n\nThe protesting revenue employees said the contributory pension scheme should be withdrawn and existing vacancies filled up as it would provide employment to thousands of unemployed youths. Seniority-based promotions should be given to revenue employees.\n\nThough the Revenue Minister had assured them that all these demands would be considered positively, he failed to keep up his promise and hence the protest, the revenue officials said.\n\nIn neighbouring Tuticorin district, 355 revenue employees went on mass causal leave on Thursday as part of the protest.\n\nNagercoil\n\nOver 85 per cent members of the Tamil Nadu Revenue Officers Association went on mass casual leave in Kanyakumari district pressing for their 23-point charter of demands, said V. Kannan, District President here on Thursday.\n\nOffices of the revenue department wore a deserted look in the Collectorate, taluk and other offices in the district. Their demands included giving up direct appointment of Deputy Tahsildars, filling up of vacancies in the ranks of District Revenue Officer and, Deputy Collector by offering promotions, setting up of a special centre for land survey training in every region and regularising the services of temporary employees in election and special programme implementation sections.\n\nMr. Kannan said the association was pressing for a compensation of Rs. 10 lakh for those affected during raids to check smuggling of ration rice and river sand.\n\nHe regretted that the government had not issued a GO even on the demands that were accepted by it and announced in the assembly.\n\nOut of the total 312 revenue officials from the ranks of Office Assistants to Tahsildhars, 265 went on mass casual leave and 20 officials were on long leave.", 
    "section": "national", 
    "title": "Revenue department staff go on mass casual leave", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}