{
    "author": [
        "S P"
    ], 
    "text": "The City Municipal Corporation’s announcement of ring road project in its budget presented on March 28, 2012 remains only in papers as the city roads continue to be congested thereby hampering its growth potential.\n\nPresently, three National Highways, Bengaluru to Madurai NH 44, Salem to Ulundurpet NH 79 and Salem to Coimbatore NH 544 pass through the city. Apart from this the city has arterial roads, including Omalur Main Road, Sarada College Road, Bretts Road, Meyyanur Main Road and roads that lead to Ammapet and Udayapatti.\n\nMost of these roads witness traffic congestion through out the day and road users face the hardship.\n\nThe city’s population is more than 8.5 lakh and there is a sharp increase in movement of villagers to the city. The vehicle population has increased three-fold time in the past five years. However, no new roads were proposed or effective steps taken to decongest the city roads.\n\nIf a road user needs to reach Ammapet from the city’s entry point at Mamangam, he or she has to pass through the congested roads in the city to cover the 10 km. that would take at least 45 minutes. If one takes the Salem – Ulundurpet NH, it would take 35 minutes to cover the 18 km. stretch. If ring road was present between Mamangam and Ammapet, one could cover the distance in less than 10 minutes.\n\nThe need for having ring roads in the city was a long demand for the residents, traders, industries and travellers. However, no steps have been taken in the past four years for giving shape to the project, said Secretary of Salem Citizens Welfare Association P. Arulmani.\n\nThe Confederation of Indian Industry (CII) in its District Development Plan 2015 said that construction of ring road would not only decongest city roads, but also help in development. It proposed around 60 km length ring road project connecting Arabic College, Uthamasolapuram, Panamarathupatty and Seshanchavadi, all located on the outskirts of the city on National Highways. But the project did not take off and ring road remains as distant dream for the people.", 
    "section": "national", 
    "title": "Ring road project, a distant dream for Salem city", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}