{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Recovery will be the highest in sugarcane crop raised under Sustainable Sugarcane Initiative\n\nDESIRED IMPACT:Drip irrigation and fertigation under Sustainable Sugarcane Initiative has enhanced crop productivity at a farm in Velampalayam in Erode district.— PHOTO: M. GOVARTHAN\n\nSustainable Sugarcane Initiative through drip irrigation and fertigation reflecting in lesser water usage of higher productivity is gradually gaining roots in the district.\n\nEvery year, 50 to 100 farmers are initiated into SSI in each block, according to official sources.\n\nWith each clump accounting for a minimum of 10 stalks of robust girth, farmers are able to reap richer harvests.\n\nFarmers enjoy high subsidy on loans for drip irrigation.\n\nOn the recommendation of the Agriculture Department, Nationalised banks promptly release funds to identified beneficiaries for installation of drip irrigation system.\n\nOn their part, farmers invest more in additional paraphernalia such as sand filter and valves.\n\nV. Chellakumarasamy of Velampalayam village in Modakurichi block, for instance, has availed himself of a subsidy benefit of Rs. 75,000, but has invested Rs. 1.10 lakh more for covering his 2.5 acre farm under drip irrigation and fertigation under SSI.\n\nHe planted 6,000 saplings in 1.2 metre gaps, and in the fifth month, finds the crop promising.\n\nThere are five more months to go for harvest and the crop appears full-grown already. Recovery will be the highest in the sugarcane crop raised under SSI.\n\nAs much as 65 tonnes of sugarcane could be harvested from the farm, said Kulandaivelu, Assistant Agriculture Officer, Modakurichi block.\n\nAccording to the farmer, water usage has been optimised through drip fertigation since the fertilisers are taken through the tubes directly to the roots; the growth of the crop has been rapid.\n\nReturns will be more in the coming years as the ratoon crop could be raised and harvested for for 10 consecutive years, Mr. Kulandaivelu said.\n\nProductivity\n\nBy raising nurseries using single-budded chips, and planting young seedlings directly in wide spacing in the main field, the desired productivity could be achieved, he said.\n\nThe tillering is increased and height and girth of individual canes is also more, reflecting in much higher productivity when compared to the produce in fields under conventional cultivation method.", 
    "section": "national", 
    "title": "Sugarcane growers, a happy lot", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}