{
    "author": [
        "Pankaja Srinivasan"
    ], 
    "text": "Air Marshal Jasbir Walia, the Air Officer Commander-in-Chief of Southern Air Command formally hands over the newly inducted Mi 17 V5 helicopters to Wing Commander Ashok Kumar, Commanding Officer of 109 HU (left). Seen is Air Commodore S. Kumar, Air Office Commanding of Air Force Station Sulur (right).\n\nTwo helicopters in a warrior formation rat-a-tatted into sight, swung around, and hovered rock steady as a rope snaked out. Garud Commandos slithered down and ran to take their places a few meters away.\n\nThe rope was hauled in and the helicopters took off again.\n\nThey came in for a formation landing, one behind the other, and as they taxied to a stop, crash tenders parked on either side directed a shower of water on them – a ritual to welcome new entrants to the fleet.\n\n“The helicopters that are being formally inducted today have already had their baptism, through water,” said Air Marshal Jasbir Walia, VM VSM, the Air Officer Commander-in-Chief of Southern Air Command, who was present on the occasion.\n\nHe was at the Sulur Air Base on Thursday to formally hand over the helicopters to the Commanding Officer of 109 Helicopter Unit, Wg Cdr Ashok Kumar, VM.\n\nThe Air Marshal was referring to the fact that four of these helicopters took part in the recent relief and rescue operations during the Chennai floods. Wing Commander Ashok Kumar who flew many of those sorties explained how unexpectedly they flew the Prime Minister too on a recce. “It was a test for the helicopters that performed so well in bad weather.”\n\nThe new Mi-17 V5 helicopters had state-of-the-art avionics, travelled at a speed of 250 kmph, could carry 36 armed troops and fly five hours at a stretch.\n\nThey are one of the best armed helicopters of modern times.\n\nThese new helicopters replace the Mi-8 helicopters 109 HU has been flying so far.\n\nThe 109 HU\n\n109 HU, that calls itself The Knights, is one of the oldest helicopter units in the IAF. It acts as one of the first line of defence against external aggression for the southern front.\n\nIt was raised in 1961 at Chandigarh with MI-4 helicopters. Since then, has taken part in operations that include the Liberation of Goa, the Chinese Aggression of 1962, the Mizo Hill operations, the Indo-Pak wars and various humanitarian operations including relief operations during the Bhopal Gas tragedy.\n\n“The unit has taken part in operations from the Siachen to Sri Lanka,” said Wing Commander Ashok Kumar. The unit moved to Sulur in 1987 and played a significant role in Op Pawan, the IPKF operations in Sri Lanka. It was declared the Best Helicopter Unit in 1989 and was awarded the Presidential Standard in 1991. 109 HU has an impressive tally of honours and awards including four Vir Chakras, one Shaurya Chakra, one Yudh Seva Medal, eight Vayu Sena Medals, two Vashisht Seva Medals besides many Commendation cards.", 
    "section": "national", 
    "title": "Sulur Air Base gets modern helicopters", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}