{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "15 workers each deputed to clean up bus stands and commercial areas\n\nCorporation sources say that it has put up 300 hoardings of eight feet by eight feet at vantage locations in the city to create awareness about the Prime Minister’s Swachh Bharat Mission. The hoardings carry in bold letters, emblems of the Government of Tamil Nadu, Coimbatore Corporation and Government of India along with pictures of Chief Minister Jayalalithaa and Prime Minister Narendra Modi. The civic body erected the hoardings a couple of days ago just before a Swachh Bharat assessment team landed in the city on January 5 (Tuesday).\n\nThe civic body hurriedly put up the hoardings, say the sources, as awareness creation is a factor under the ‘Information, Education and Communication’ component that the assessment team will consider for ranking the city.\n\nWhile the Prime Minister launched the project more than a year ago, the Corporation had done very little to implement it. It was only in the last three months that the civic body swung into action and that too after some nudging from the Central Government.\n\nThe Corporation has also deputed 15 workers each to clean up the Ukkadam, Singanallur and Gandhipuram bus stands and the commercial areas including Oppanakara Street, 100 Feet Road, Cross Cut Road and Big Bazaar Street. The Corporation has, in the last two days, has also speeded up the individual household toilet construction. In Ambedkar Nagar in Ganapathy, it has asked a few beneficiaries to start construction of septic tanks. The sources say that the sudden flurry of activity is suspicious as it comes just before the assessment team’s visit.\n\nOfficials admitted to the delay on the part of the Corporation in implementing programmes under Swachh Bharat, but denied that the recent developments have anything to do with the impending visit.\n\nMeanwhile, the team on Wednesday visited approved and unapproved layouts, religious establishments, Coimbatore railway junction, Kavundampalayam, Thudiyalur, P.N. Pudur and a few other areas.", 
    "section": "national", 
    "title": "Swachh Bharat hoardings mushroom in city", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}