{
    "author": [
        "Rajalakshmi Padmanabhan"
    ], 
    "text": "Bala Nandakumar of Layakshethra performing Bharatanrithyam at the 64th Music and Arts festival of Sri Sathguru Sangeetha Samajam in Madurai.— Photo: R. Ashok\n\nAll seven dancers of guru Bala Nandakumar of Layakshethra, Madurai, joined hands to worship ‘Oothukadu’ Venkatasubbaiyer’s Vezha mugathu Vinayakar to bless them in their presentation of Bharathanrityam on the third day of Samajam’s 64th anniversary celebrations. The dancers mimed the movement of feathers of a peacock in the background, as Lord muruga flew dramatically on its wings for Bharathi’s ‘Muruga Muruga.’\n\nThey then took turns to prove their ability at producing a variety of facial expressions in traditional portrayals such as goddess Tripurasundari, mother Yashoda, naughty Krishna, as well as for the modern theme of Nandanar (ably played by Aishwarya Jagannath) who invokes the panchaboothams in his quest to have darshan of the Lord. In particular, the tableau drawn by dancers of Shiva riding a chariot pulled by horses made a good impression on the audience.\n\nUsha Nandini petted and played with Bharathiyar’s little Kannamma for “Chinnanjiru Kiliye” and “Asai muham.” Nivetha Mohan and Harini Nagesh matched their steps for a fast number on mother goddess. Aparna Raja excelled in producing the sringara rasa for “Valli kanavan.”\n\nThe grace of Vishnu as Nrisimha and as Krishna, the saviour of Draupadi was next depicted on stage. Anu Priya Desigan and Priyadarshini joined the team for a ‘kolattam’ that was also well received.\n\nThe last item on the agenda was a ‘tillana’ dedicated to the saint of Kanchi, in celebration of his star Anusham.\n\nNattuvangam was in the capable hands of guru Bala Nandakumar, while Soundarya Nandakumar and P. Avantharaj lent their voices to the songs.\n\nThe orchestra comprised violin play by Chennai K.R. Suresh, mridangam by ‘Arcot’ S. Balaji and flute by ‘Chennai’ A. Mohan Raj.\n\nRAJALAKSHMI PADMANABHAN", 
    "section": "national", 
    "title": "The face tells it all", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}