{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Vellore Mayor P Karthiyayini hands over ISO certification to SHG members who are managing Amma Unavagams, on Thursday. B. Karthikeyan, director of Quest Certification, and Janaki Raveendran, Corporation Commissioner, are in the picture.— PHOTO: VM. MANINATHAN\n\nThree Amma Unavagams in Vellore Corporation have received ISO 9001: 2008 certification.\n\nThe unavagams near the Collector’s office, Member of Legislative Assembly office and Dharapadavedu have been certified after the canteens fulfilled the norms stipulated by the certifying agency. There are 10 Amma Unavagams in the Corporation limit.\n\nVasanth Diwakar, health officer of the Corporation, said the certifying agency, Quest Certification (P) Limited, had inspected the canteens six months ago, and selected the three centres.\n\n“A few modifications and corrections were outlined, and time was granted for rectification. A review was conducted again, following which the three Amma Unavagams have been certified,” he said.\n\nP. Karthiyayini, Mayor of the Corporation, pointed out that some of the aspects that were scrutinised included quality of food, taste and hygienic surroundings of the unavagams.\n\nWith standardisation put in place, she urged the women self-help group members who run the canteens to continue to maintain the present quality.\n\nB. Karthikeyan, director of Quest Certification (P) Limited, said the certification ensures that there is no dilution in the system of running the Amma Unavagams.\n\n“We see that there is consistency in quality of food served, maintenance of equipment such as reverse osmosis plant, maintenance of stock register and personal hygiene of staff as mandated by food industry,” he explained.\n\nStandardisation helps in maintaining quality levels, he said, adding that a delegation from the Ministry of Trade and Industry, Egypt, had visited the Amma Unavagam at Rajiv Gandhi Government General Hospital, Chennai.\n\n“They wanted to see how the Amma Unavagam is functioning in rural areas. We can bring such a delegation to Vellore Corporation,” he added.\n\nThe certification was awarded after the three unavagams adhered to the stipulated criteria. . He presented the certificates to the Mayor on Thursday.\n\nJanaki Raveendran, the Corporation’s Commissioner, said steps will be taken to improve the standard of the remaining Amma Unavagams in the local body.\n\nCertifying agency, Quest Certification (P) Limited, had inspected them\n\nsix months ago", 
    "section": "national", 
    "title": "Three Amma Unavagams get ISO certification", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}