{
    "author": [], 
    "text": "RELIGION\n\nSri Sanjeeevana Anjaneyar Trust, Srirangam : Sri Hanuman Jayanthi, Sweetha Ramar thirukalyana mahotsavam, South Chithrai Street, Srirangam, 7 a.m.; vocal by Srirangam Karpaga Vinayagar Bhajan Mandali, 5 p.m.; violin concert by T.H.Vasantha and party, 7 p.m.\n\nSri Varadsiddhi Vinayagar Temple, Ganapathy Nagar : Raghu-kethu peyarchi, archanai, 5.30 p.m.\n\nSri Andavan Ashram, Srirangam : Discourse on Thirupaavai by Sri Aravamudachariar, Sri Vedanta Desikan Sannidhi, North Chithra Street, Srirangam, 7 a.m.\n\nSri Ramanuja Siddandha Sabha : Discourse on Thirupaavai by Andal Rajan, Sri Kamalavalli Nachiar Temple, Woraiyur, 6.45 p.m.\n\nSri Bashyakarar Kainkarya Sabha and Thirumala Thirupathi Devasthanam: Discourse on Thirupaavai by Sri Rama Badrachariar, Sri Venkatachalapathi Temple, BHEL Township, 6.30 p.m.\n\nSri Ananthakrishna Varatharaja Perumal Temple, Angarai : Dhanur masa bhajans, 5.30 a.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sri Vishnu Sahasranama parayanam, Vinayagar Temple, Sri Vignesh Paradise, Melur Road, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam : Sri Hanumath Jayanthi mahotsavam, Akanda Rama Nama parayanam, Siddhi Vinayagar Temple, SMESC Colony, 7 a.m.\n\nGENERAL\n\nNational Institute of Technology : Interaction with P.Ashok Gajapathi Raju, Union Minister for Civil Aviation, 4.30 p.m.\n\nConfederation of Real Estate Developers Associations of India : Fairpro 2016 – property show, G.Ravindranath, General Manager, State Bank of India, Chennai, inaugurates, Hotel Sangam, 10 a.m.\n\nSt.Joseph’s College Department of Botany: International conference on Frontiers in life science,10 a.m.; valedictory address by V.S.Christina of University of Nottingham, Malaysia, 3.30 p.m.; Department of Mathematics: National conference on Advacements in mathematical sciences, 9 a.m.; valedictory address by M.Marudai, Head, Department of Mathematics, Bharathidasan University, 3.30 p.m.\n\nHoly Cross College Department of Chemistry : Chem Expo, N.Sathyamoorthy, teacher, E.R.Higher Secondary School, chief guest,9 a.m.; English Literary Association: Workshop on Theatre Arts, K.Ganesh,Head, Department of English, Madras Christian College, chief guest, 10 a.m.\n\nNational College Department of English : National conference on Translation vs New Writing and Discovery, Prema Nandakumar, writer, speaks, 9.30 a.m.; valediction, C.Santhosh Kumar, associate professor, Annamalai University, chief guest, 3.30 p.m.\n\nSaranathan College of Engineering and Yokogawa India Ltd : Workshop on DCS and FF Overview, Udhayakumar and Ramkumar, resource persons, 9.30 a.m.\n\nM.A.M.College of Engineering : Faculty development programme, 9.30 a.m.\n\nDhanalakshmi Srinivasan Institute of Technology, Samayapuram : Faculty development programme, Jayaprakash Narian, former director, NITTR, chief guest, 10 a.m.\n\nAIMAN College of Arts and Science for Women : K.Sitheswaran, Head, Department of Training and Placement, MIET Group of Institutions, speaks on ‘You can,’ noon.\n\nImayam Arts and Science College for Women : Free eye screening camp, 9.30 a.m.\n\nSRV Matriculation Higher Secondary School, Samayapuram : Vistas – 10{+t}{+h}annual day, V.Irai Anbu, Principal Secretary, Economics and Statistics, inaugurates, 3 p.m.\n\nBharathidasan University Placement and Training Cell : Employability skills training programme, Khajamalai campus, 10 a.m.\n\nTamil Nadu Traders Federation: Interaction with P.Ashok Gajapathi Raju, Union Minister for Civil Aviation, Hotel Sangam, 2.30 p.m.\n\nHoly Cross College : Programme on ‘Way to smart city,’ 2 p.m.\n\nArivalayam Special School and Rehabilitation Centre : Annual day, S.Karuthiah Pandian, Director, Bharathidasan Institute of Management, chief guest, S.Gopinath, Executive Director, BHEL, Tiruchi, presides, MD Auditorium, BHEL complex, 5.30 p.m.\n\nJ.R.Polytechnic College, Alundur and SRF Foundation : Inter-school kabaddi meet, 9 a.m.\n\nDepartment of Information and Public Relations: Government exhibition, St.John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}