{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "When the announcement was made in April last year that DMK president M. Karunanidhi would be penning the script for a biographical series on the revered Vaishnavite philosopher Ramanuja, critics raised questions on the possible distortion of history by the former Chief Minister who is an avowed atheist.\n\nBut the series received a boost on Wednesday from unexpected quarters. Ostensibly impressed by the programme and the response it has received, the Tirumala Tirupati Devasthanams (TTD) has requested Mr. Karunanidhi to allow the telecast of the show in Telugu.\n\nParty sources said the TTD was willing to do the dubbing into Telugu on its own for its Sri Venkateswara Bhakti Channel. But since Kalaignar TV owns the rights for the series, TTD officials met Mr. Karunanidhi on Wednesday to facilitate the process.\n\nAlmost immediately after the meeting, which involved TTD president Chadalavada Krishnamurthy, the official Facebook page of Mr. Karunanidhi uploaded pictures of priests holding garlands and prasadams from the Tirupati temple before the DMK president at his residence in Gopalapuram.\n\nA senior DMK leader said the meeting was clearly a positive development. “This is the strongest answer to our critics who said we will distort the biography of Ramanuja. If the TTD wants to telecast the show, it has to be accepted that the script was clearly objective without any mischief,” the leader said.\n\nIn an interview to The Hindu last April, Mr. Karunanidhi said he chose to write the script as the philosopher-saint was a revolutionary who broke caste barriers. “He showed through his life that the oppressed and backward communities were not those to be hated and sidelined,” Mr. Karunanidhi said.\n\nKalaignar TV sources said the request by TTD was yet to be communicated to the channel.\n\n“There won’t be any difficulty. It would just be a matter of entering into an agreement with the TTD,” an official said, adding that the ‘Ramanujar’ serial, which began on June 1, has crossed 160 episodes.", 
    "section": "national", 
    "title": "TTD boost to Karunanidhi’s ‘Ramanujar’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}