{
    "author": [
        "V S"
    ], 
    "text": "A wild elephant entering the Thekkampatti rejuvenation camp. (right) People taking selfie at the camp .Photos: J. Manoharan and PTI\n\nMinor distraction at the inauguration of 48-day relaxation camp for temple elephants\n\nAhead of the inauguration of 48-day-long elephant rejuvenation camp for temple and math elephants on Thursday, a lone tusker from the wild decided to check out the visitors from the country moving around in its natural habitat.\n\nEven as the arrangements were going on for the inauguration of the eighth rejuvenation camp at Thekkampatti along the banks of Bhavani river near Mettuppalayam, a coracle rider raised an alarm to alert those in the camp about the wild elephant crossing the river.\n\nAs the adult elephant entered the camp site, the mahouts of the temple and mutt elephants scurried them to safety. Forest personnel burst crackers to chase the wild elephant out of the camp site.\n\nThe bursting of crackers continued for more than half-an-hour. With the wild elephant’s entry on day-one, officials plan to step up vigil along the camp site especially from dusk to dawn.\n\nHalf-an-hour later, a galaxy of Ministers and officials inaugurated the camp.\n\nMinisters R. Kamaraj (Hindu Religious Charitable Endowments Board); M.S.M. Anandan (Forests); S.P. Velumani (Municipal Administration and Water Supply); District Collector Archana Patnaik; Conservator of Forests I. Anwardeen; District Forest Officer C.H. Padma; Joint Commissioners of HR & CE A. Ilamparithi; took part in the inaugural. The camp began with a Ganapathy homam.So far, 30 elephants including those from various temples in Tamil Nadu and two from Puducherry have reached the camp site.Elephants from Nachiar temple in Srivillputhur and Ramanathaswamy temple in Rameswaram will join later after completing the Kumbabishegam of the temple scheduled for the second week of January.\n\nThe diet included ashtachoornam, chayavanprash, LIV 52, bio-boosters, vitamin, and mineral mixtures, protein supplements, dates, sugarcane, carrot, beetroot, turmeric powder mixed in rice, horse gram, green gram, ragi, and salt.\n\nThe camp will help elephants lose weight and the anaemic ones to gain weight. It will tone up their physiological conditions and revive their liver, and functioning of other organs, said forest officials.\n\nA team of veterinarians – seven every week – will help in cleaning up their feet with medicated water and administering medicines. The camp site has a medical centre for taking care of the health of the animal handlers too.\n\nStar attraction\n\nElephants that play mouth organ and keep dancing all the time proved to be star attractions for visitors.\n\nThe juniors – Sundaravalli Thayar from Azhagarkoil, Deivanai from Thirupparankundram, both aged eight, Lakshmi from Erattai Thirupathi in Srivaikundam, and Abhirami from Thirukkadaiyur – attracted a lot of visitors.\n\nThe camp site is equipped with 16 CCTV cameras, four watchtowers, solar fencing for 5 km, 20 forest personnel and private security guards.Officials have provided showers along the banks of river Bhavani to enable the elephants enjoy their bath.\n\nThe schedule includes a morning walk for 4 km, a shower, and then puja followed by breakfast and complete rest.\n\nIt was for mahouts to either take the animals again for an evening walk or to split the 4-km walk between morning and evening.\n\nAt the elephant camp at Chadivayal on the foothills of the Nilgiris, Pari (36) and Sujay (47) took part in the camp along with eight-year-old Masini, who was brought from Mudumalai and is now on training and acclimatisation of the climate in the plains as she had been assigned to the Samayapuram Mariamman temple in Tiruchirapalli.\n\nCamps for tamed elephants\n\nSpecial Correspondent\n\nSix female elephants, two makhna elephants (male without tusker), 16 male elephants took part in the elephant rejuvenation camp at Theppakadu in Mudumalai Tiger Reserve. Chief Wildlife Warden, V.K. Melkhani, Additional Principal Chief Conservator of Forests (Project Tiger) Raghuram Singh, Field Director Srinivas R. Reddy took part.\n\nAt the Anamalai Tiger Reserve, as many as 22 elephants including 12 male and ten female including a calf took part in the camp inaugurated by Field Director V.T. Kandasamy, Deputy Directors A. Periasamy and V. Asokan. As a result of the rejuvenation camp, beginning Thursday, the elephant safari remains suspended in both the sanctuaries for a period of 48-days.\n\nAt the elephant camp at Chadivayal in the foothills of the Nilgiris, Pari (36) and Sujay (47) took part in the camp along with eight year old Masini. Masini was brought from Mudumalai and is now on a training and acclimatisation of the climate in the plains as she had been assigned to the Samayapuram Mariamman temple in Tiruchirapalli.", 
    "section": "national", 
    "title": "Wild tusker strays into rejuvenation camp", 
    "subsection": "tamilnadu", 
    "date": "2016-01-08"
}