{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Mehbooba Mufti had said that her party and the BJP were back to negotiations on government formation.\n\nTalks between the senior leadership of the Bharatiya Janata Party and the Peoples Democratic Party (PDP) are continuing on government formation, with specific issues being flagged on both sides for an agreement.\n\nTop sources from both parties confirmed to The Hindu that the handover of two power projects currently under the National Hydro electric Power Corporation (NHPC) in Uri and Dulhasti has almost been agreed upon between the two parties, with the Centre agreeing to facilitate a stake sale from the NHPC to the Jammu and Kashmir government for a controlling interest in the power projects.\n\n“The other major issue is the re-notification of Army-held land near Jammu airport and Tattoo Ground in Srinagar,” said a top source. “Negotiations are on in this matter,” the source added.\n\nPDP leaders also confirmed that the former Finance Minister in the Mufti Mohammad Sayeed-led BJP-PDP government, Haseeb Drabu and adviser to the Mufti government, Dr. Amitabh Mattoo have been reaching out to Kashmiri students in universities in Delhi following the controversy in Jawaharlal Nehru University (JNU).\n\nReaches out to students\n\n“The party has reached out to students individually, and the alliance partners have expressed their anxieties on this count to each other as well,” said a source.\n\nOn Sunday, PDP leader Mehbooba Mufti had given the strongest indication yet that her party and the BJP were back at the negotiating table over government formation, after the State slipped into Governor’s rule following the death of Sayeed in January.\n\nAddressing a party convention in Srinagar on Sunday, Ms. Mufti had said that she had “faith in Allah and the decisions of Mufti Saheb” when it came to the alliance.\n\n“When Mufti-sahib formed the [State] government with the BJP, he thought that if you can convince a leader who has come with such a [huge] mandate that India and Pakistan’s reconciliation is important to take Jammu and Kashmir out of this mess, he can do something because he has the power [numbers in Parliament] at his back,” she had said.", 
    "section": "national", 
    "title": "BJP, PDP continue talks on key issues", 
    "subsection": "general", 
    "date": "2016-02-24"
}