{
    "author": [], 
    "text": "It may sound unappealing, but insects added to the flour are pushing up the demand for this French artisanal pasta\n\nAn artisanal pasta-maker in northeastern France is struggling to meet demand after adding a crunchy, protein-rich ingredient to the noodles: insects.\n\n“The name of the ingredient may be a turn-off, but it’s really delicious, especially with game meat,” smiles Alain Limon as he spreads cricket-flavoured fusilli on a drying rack.\n\nMr. Limon, 52, is the only employee at the Atelier a Pates (Pasta Workshop) in Thiefosse, northeastern France.\n\nHis boss Stephanie Richard began her homemade pasta business in 2012, and is now hiring again thanks to the success of her latest creations made from insect flour.\n\n“The insect is the protein of the future,” Ms. Richard says. “It’s protein of high quality that is well digested by the body.”\n\nIn fact, a 2013 by the UN Food and Agriculture Organisation (FAO) noted the “huge potential” of insects, for feeding not only people but also livestock.\n\nInsects are already a common food in many developing countries across Asia, Africa, Latin America and Oceania.\n\nSome European cheeses also contain or use insects, like France’s mimolette, whose grey crust is the result of cheese mites intentionally introduced to add flavour, or the Sardinian casu marzu, which contains live insect larvae.\n\nFor Ms. Richard’s unique pastas, she uses pulverised crickets and grasshoppers, sometimes mixing the two.\n\nShe was developing a high-protein pasta for athletes when an insect distributor in eastern Lyon contacted her. Sold on the idea, she began producing pasta made from insect flour in time for the December holidays, and around 500 packages flew off her shelves.\n\n“The product piqued the curiosity and had great success,” says Ms. Richard, who is also a part-time French teacher.\n\nWhole eggs are added to a mixture of seven per cent insect flour to 93 per cent organic spelt wheat flour, producing a brownish pasta that is shaped into radiatori, fusilli, spaghetti and penne.\n\nAt first Ms. Richard made plain fresh egg pasta before diversifying her production while keeping it strictly within the culinary traditions of the Lorraine region, using wild garlic, nettles and safran, for example.\n\nAll of her ingredients were from Lorraine except durum semolina, which Ms. Richard says is incompatible with the climate.\n\nFour years on with the addition of insect flour to the mix, “it’s working so well that we will soon be able to hire a second person,” Ms. Richard says, proud of her weekly production now at some 400 kilos (880 pounds).\n\nAnd she does not plan to stop there: she is working on a new recipe using Maroilles cheese from northern France, and plans to start making stuffed pastas.\n\nAt a little over six euros (Rs. 450) for a 250 grams package, insect flour pastas are more expensive than standard kinds, but Ms. Richard notes that they can replace meat for vegetarians — or for people who prefer crickets. — AFP", 
    "section": "national", 
    "title": "Bugs, a recipe for success", 
    "subsection": "general", 
    "date": "2016-02-24"
}