{
    "author": [
        "Nistula Hebbar"
    ], 
    "text": "Prime Minister Modi says the controversy is being used to ‘distract’ the government\n\nLending his support:Congress leader Rahul Gandhi addresses students during a solidarity march in connection with the JNU stir and the suicide of scholar Rohith Vemula, in New Delhi on Tuesday.— Photo: AP\n\nPrime Minister Narendra Modi on Tuesday exhorted his party and National Democratic Alliance (NDA) constituents to remain united and aggressive in the face of the Opposition’s attack on the government’s handling of the Jawaharlal Nehru University (JNU) issue, terming it an attempt to “distract” the government.\n\nOn the first day of the Budget session of Parliament, Mr. Modi met with his party’s parliamentary executive and NDA leaders as the Rajya Sabha is scheduled to take up the JNU issue and the death of Dalit scholar Rohith Vemula on Wednesday.\n\nTop sources who were present at the meeting said Mr. Modi praised the work of his own government, and said the JNU issue was being used as a “distraction” by the Opposition to attack it.\n\n“He also made comments on the common cause being made by the Congress and the Left on this issue, terming Congress vice-president Rahul Gandhi as being politically unwise in the matter,” said a senior Minister present at the meeting.\n\n“Prime Minister Modi said the Left was interested in keeping the issue alive as it had to face elections in West Bengal and Kerala, where it has a stake, but that the Congress had nothing to gain from it,” said the source.\n\nFinance Minister Arun Jaitley also spoke at the meeting briefing the senior leaders of the alliance on the issue. He gave details of the JNU incident of February 9 and the controversy surrounding it.\n\nMeenakshi Lekhi, MP, has moved a notice in the Lok Sabha to discuss the issue.", 
    "section": "national", 
    "title": "Centre aggressive, Opposition not to budge on JNU issue", 
    "subsection": "general", 
    "date": "2016-02-24"
}