{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "Criticising the government for using archaic laws to suppress dissent, Amnesty International, in its report for 2015-16, has included India among countries that have failed to match up to the “international standard” of freedom of expression and civil liberties.\n\nThe report especially noted that over the past year, crackdown on freedom of expression by majoritarian groups linked to the government had intensified, and said, “Censorship and attacks on freedom of expression by hardline Hindu groups grew. Scores of artists, writers and scientists returned national honours in protest against what they said was a climate of growing intolerance”.\n\nThe annual report said India held at least 3,200 prisoners in various prisons without trial under executive order. The report said the country had failed to prevent “hundreds” of communal and ethnic riots in the past one year.\n\n“Some politicians contributed to religious tensions by making speeches justifying discrimination and violence,” said the report, while noting that incidents of non-vegetarianism and cow slaughter had often been cited as justification for communal and mob violence. It criticised India for a negative gender justice environment, and for violating international legal obligations for the recent modifications in the juvenile justice system which “allows children aged 16 to 18 to be treated as adults in cases of serious crimes”.\n\nHowever, praising the collective spirit of resistance in India, the report also said “growing intolerance” had faced tough opposition from the people who contested the majoritarian attempts to curtail freedom.\n\nThe report also made a special mention of Tripura, which was the first State to withdraw the Armed Forces Special Powers Act.\n\nCensorship by hardline Hindu groups has grown, says Amnesty", 
    "section": "national", 
    "title": "‘Civil liberties in danger, but India fighting back’", 
    "subsection": "general", 
    "date": "2016-02-24"
}