{
    "author": [
        "Somesh Jha"
    ], 
    "text": "Ministry for Labour and Employment has proposed a nearly four-fold increase in the housing subsidy for beedi workers and miners employed in non-coal mines, to align the benefits with Prime Minister Narendra Modi’s ambitious ‘Housing for All’ scheme.\n\nFor the current subsidy of Rs. 40,000 to such employees, the Ministry has mooted an increase to Rs. 1.5 lakh under the present Revised Integrated Housing Scheme of 2007.\n\n“We want to bring the housing scheme for beedi and mine workers in line with the National Housing Scheme. Workers who have their own land are given subsidies under this scheme,” a senior Ministry official said.\n\nAs per the Revised Integrated Housing Scheme of 2007, a worker gets Rs. 40,000 as assistance from the Central government to build a house on his own land with an area of at least 60 square yards. Workers engaged in the beedi industry for at least a year and earning up to Rs. 6,500 per month can avail the subsidy to construct a house. Also, non-coal mine workers working in iron ore, manganese ore, lime stone ore, dolomite ore, mica ore mines earning up to Rs. 10,000 can avail these benefits.\n\nFurther, co-operative society for construction of group housing colony for workers may also get the subsidy amount of Rs. 40,000 a tenement per worker.\n\nThe subsidy amount will be released in two instalments. The first instalment of Rs. 20,000 will be given after a worker contributes Rs. 5,000 towards the construction of the house. When the construction of the house reaches roof level, the second instalment of Rs. 20,000 along with the workers’ contribution of Rs. 5,000 will be given by the Director General of Labour Welfare.\n\nIn 2014-15, the government constructed 16,552 houses for beedi and non-coal mine workers, according to a reply given by Labour Minister Bandaru Dattatreya in the Rajya Sabha on July 29 last year.\n\nThe government’s ambitious ‘Housing for All’ project aims to build 2 crore houses in five phases till 2021-22. Under the scheme, a Central grant of Rs. 1 lakh would be available for a house under the slum rehabilitation programme and Central assistance of Rs. 1.5 lakh will be provided to economically weaker sections category households.\n\nThe objective is to give them benefits under the Prime Minister’s ‘Housing for All’ scheme", 
    "section": "national", 
    "title": "Govt. to hike housing subsidy for beedi workers & miners", 
    "subsection": "general", 
    "date": "2016-02-24"
}