{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "Even as the government demands more accountability from non-governmental organisations (NGOs) that receive foreign funding, and activists who go on trips funded by foreign governments and agencies, a new notification by the Finance Ministry is more than willing to allow government officials to go on such trips.\n\nThe office memorandum (No.4(4)/E.Coord/2015) has raised eyebrows in the Ministry of Home Affairs that has to clear such trips. The O.M., as it is called, was issued on January 5 this year detailing instructions for foreign visits of government officers, as part of a cost-cutting exercise. On Monday The Hindu had reported on the inter-ministerial war with the Ministry of External Affairs over restrictions on travel in the report.\n\nNow, MHA sources say that the language of the memorandum when it comes to allowing foreign governments/agencies to pay for officers’ international travel is also “problematic” and can expose them to “being courted” by those agencies.\n\nIn particular, Section 19 says “There shall be no objection in accepting international air travel costs and hospitality from an international body of which India is a member, if the visit abroad is covered under bilateral/multilateral agreement or under a regular exchange programme.”\n\nThe big worry, say Home Ministry officials, is if an international lobby firm, NGO, or health or education agency that has a vested interest in Indian projects, could use this clause to “reach out to” or “lobby with” Indian officials through a foreign government programme.\n\n“It is strange that the government is trying to be very strict on NGOs in this regard, and demanding accountability, while liberalising foreign-sponsored travel for government officials themselves,” says a retired officer, who calls the notification a complete reversal of previous policies that discouraged such arrangements.\n\n“I think they are being short-sighted when they encourage officers to travel abroad on trips paid for by foreign sponsors,” says former expenditure secretary Dhiren Swarup, who is now Chairperson of the Financial Redressal Task Force Agency, and has drafted the policy in the past, adding that accepting hospitality except directly from bilateral or multilateral organisations “could easily constitute a conflict of interest.”\n\n“If you were to look at the total budget of the Central government, the amount spent on foreign travel by ministries not including the MEA, that needs to travel much more, the figure is paltry, so it isn’t worth it,” Mr. Swarup says, rejecting the Finance Ministry explanation that this will help cut expenditure.\n\nAccording to officials in the Home Ministry that has in the past few years shut down more than 10,000 NGOs for a lack of accountability on foreign funding, the January 5 O.M. is troubling because for the first time it puts in explicit language that “Cash allowance and other allowances” could be accepted as offered by the “foreign government/sponsors.” While Finance Ministry officials explain this as a way of ensuring the government doesn’t have to reimburse officials especially where Indian allowances are higher than those of say the IMF/World Bank or UN agencies, the language of the new notification is in stark contrast to the past.\n\nOn Sunday during a public rally in Odisha, Prime Minister Narendra Modi had said he was being targeted for making NGOs accountable for foreign money coming in. “Doesn’t India deserve to know how foreign agencies are spending money in India?” he asked.\n\nOfficials say the new notification from the Finance Ministry runs counter to Mr. Modi’s words.\n\nMHA worries that lobbying firms\n\nor agencies could influence Indian officials", 
    "section": "national", 
    "title": "Govt. softens stand on foreign trips by officials", 
    "subsection": "general", 
    "date": "2016-02-24"
}