{
    "author": [], 
    "text": "Li-Fi systems by start-up Oledcomm can revolutionise communication in the future.— Photo: AFP\n\nConnecting your smartphone to the web with just a lamp — that is the promise of Li-Fi, featuring Internet access 100 times faster than Wi-Fi with revolutionary wireless technology.\n\nFrench start-up Oledcomm demonstrated the technology at the Mobile World Congress, the world’s biggest mobile fair, in Barcelona. As soon as a smartphone was placed under an office lamp, it started playing a video.\n\nThe big advantage of Li-Fi, short for “light fidelity”, is its lightning speed.\n\nLaboratory tests have shown theoretical speeds of over 200 Gbps — fast enough to “download the equivalent of 23 DVDs in one second”, the founder and head of Oledcomm, Suat Topsu, said.\n\n“Li-Fi allows speeds that are 100 times faster than Wi-Fi” which uses radio waves to transmit data, he added.\n\nA ‘digital Morse code’\n\nThe technology uses the frequencies generated by LED bulbs — which flicker on and off imperceptibly thousands of times a second — to beam information through the air, leading it to be dubbed the “digital equivalent of Morse Code”.\n\nIt started making its way out of laboratories in 2015 to be tested in everyday settings in France, a Li-Fi pioneer, such as a museums and shopping malls. It has also seen test runs in Belgium, Estonia and India.\n\nDutch medical equipment and lighting group Philips is reportedly interested in the technology and Apple may integrate it in its next smartphone, the iPhone7, due out at the end of the year, according to tech media.\n\nWith analysts predicting the number of objects that are connected to the Internet soaring to 50 million by 2020 and the spectrum for radio waves used by Wi-Fi in short supply, Li-Fi offers a viable alternative, according to its promoters.\n\n“We are going to connect our coffee machine, our washing machine, our tooth brush. But you can’t have more than ten objects connected in Bluetooth or Wi-Fi without interference,” said Mr. Topsu.\n\nDeepak Solanki, the founder and chief executive of Estonian firm Velmenni which tested Li-fi in an industrial space last year, said he expected that “two years down the line the technology can be commercialised and people can see its use at different levels.” Analysts said it was still hard to say if Li-Fi will become the new Wi-Fi.\n\nStill in the works\n\n“It is still a laboratory technology,” said Frederic Sarrat, an analyst and consultancy firm PwC.\n\nMuch will depend on how Wi-Fi evolves in the coming years, said Gartner chief analyst Jim Tully.\n\n“Wi-Fi has shown a capability to continuously increase its communication speed with each successive generation of the technology,” he said.\n\nLi-fi has its drawbacks — it only works if a smartphone or other device is placed directly in the light and it cannot travel through walls.\n\nThis restricts its use to smaller spaces, but Mr. Tully said this could limit the risk of data theft. — AFP", 
    "section": "national", 
    "title": "Internet by light promises to leave Wi-Fi in the shade", 
    "subsection": "general", 
    "date": "2016-02-24"
}