{
    "author": [
        "Abdul Latheef Naha"
    ], 
    "text": "CISF soldier Jose, who hailed from Malappuram, is believed to have died after falling off a train in Odisha on February 10\n\nFor about a week, the body of head constable Jose P. Joseph, a serving jawan of the Central Industrial Security Force (CISF) hailing from Malappuram, lay putrefying and exposed to the elements near the Balugaon railway station in the Khordha district of Odisha, claim the Kerala police.\n\nThe jawan is believed to have fallen off a train. The body was barely 200 metres from the railway station, yet no one cared to even remove it, say police officers from Malappuram who went there to retrieve the body. .\n\nThey claim that neither the railway authorities nor the CISF cared to launch a search for the missing jawan in spite of the Kerala police triangulating his mobile phone signals and conveying his location to them, adding that Malappuram Sub Inspector of Police Richard Varghese and civil police officer K.K. Udayaraj went to Balugaon after tracing his mobile trail to find his decomposed body there.\n\nJose, presumed to have fallen off the train on February 10, was lying there until February 16, Mr. Richard told The Hindu. That apart, Mr. Richard said he and his colleague had to bribe the Odisha policemen to get the body removed and a post-mortem conducted, which was mandatory before they could bring it to Kerala.\n\n“It was a strange post-mortem. The doctor merely walked up and signed a paper, standing at quite a distance from the corpse,” said Jose’s brother who accompanied the police team from here.\n\nMr. Richard and Mr. Udayaraj said they were astounded by more of what they faced there. “They [Odisha police] did not even allow us in the police station, saying we had touched the putrefying body and had become defiled,” said Mr. Richard.\n\nThe Malappuram police officials, he said, were made to sign the FIR standing on a septic tank behind the police station.\n\nNo help\n\nAccording to Mr. Richard, the Odisha police did not even help in getting an ambulance to carry the body.\n\nThe Kerala policemen were made to hunt for a vehicle themselves, after the decomposed body was handed over to them in a plastic bag.\n\nIt was a Malayali group at Visakhapatnam that helped the Kerala policemen to get an ambulance with a freezer, which carried the body to Malappuram for burial, he said.\n\nDistrict Collector T. Bhaskaran, P. Ubaidulla, MLA were among those present.", 
    "section": "national", 
    "title": "Jawan’s body left to rot: Kerala police", 
    "subsection": "general", 
    "date": "2016-02-24"
}