{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Kerala-wide Digital Empowerment Campaign, which seeks to bridge the digital divide and maximise the potential of ICT (Information and Communication Technology) in day-to-day life, is all set to be rolled out on Saturday.\n\nStudent police cadets from as many as 280 schools in all 14 districts will be enlisted for the campaign, which is expected to help 3 million people in the State.\n\nEquipped with tablets preloaded with special software, the students will train at least one member in each family in the catchment area of a school extending up to a radius of 3 km.\n\nPresident Pranab Mukherjee is scheduled to launch the campaign on February 27 during his visit to the State.\n\nThe Kerala State IT Mission (KSITM), the nodal agency for the project, is readying as many as 5600 tablets to be distributed to the cadets.\n\nInterestingly, one can monitor the training process on real time basis using the software. A programme monitoring unit will also be set up at KSITM.\n\nMore than 10 lakh people will be digitally empowered in the first phase of the campaign over a period of four months.\n\nThe initiative is aimed at making them capable of using e-mail, accessing online government services, making online utility payments and bank transfers and doing online shopping.\n\nThe training will also cover mobile services and information security. The second phase will utilise the services of both NSS volunteers and NCC cadets to reach out to more citizens.\n\nTaken up under the Digital India initiative, the campaign seeks to build on the achievements registered through Akshaya and IT@School projects. KSITM Director K. Mohammed Y. Safirulla told The Hindu that high mobile penetration, internet subscription base, optic fibre network coverage, e-governance initiatives and the rise in e-commerce activities justified a higher level of digital empowerment in Kerala.\n\nAssuming that 50 per cent of the State’s population in the age group of 30 to 60 years has already been digitally empowered through Akshaya and IT@School programmes, the campaign seeks to reach out to the remaining 60 lakh people.\n\n“We estimate that if half the target population (30 lakh) is covered, the other half will be digitally enabled through family members or peer-to-peer interaction,” Mr. Mohammed said.\n\nThe pilot phase of the campaign last year had utilised student police cadets from 10 schools in Thiruvananthapuram to train 10,000 citizens.\n\nThe President is also expected to declare Kerala a ‘Digital State’ on the strength of its digital infrastructure and e-governance initiatives.", 
    "section": "national", 
    "title": "Kerala students to take digital literacy to the masses", 
    "subsection": "general", 
    "date": "2016-02-24"
}