{
    "author": [], 
    "text": "NASA has made public the recording of the mysterious ‘outer-space music’ that Apollo 10 mission astronauts heard as their spacecraft flew around the far side of the Moon in 1969.\n\nThe transcript of the conversation between Apollo 10 astronauts Eugene Cernan and John Young mentioning the strange sound and the crew’s response to the phenomenon were released in 2008. However, the audio of the discussion and the sounds that the astronauts were referring to has just been made public. Out of radio contact with Earth and all alone on the far side of the Moon, the astronauts had not expected to hear anything on their instruments.\n\n“You hear that? That whistling sound? Whoooooo,” Mr. Cernan is heard saying in the recording. The astronauts then mention that it sounds like “outer-space type music.”\n\nAccording to a new TV series “NASA’s Unexplained Files” on Discovery , the astronauts debated whether or not to mention it to their superiors at NASA, out of fear that it could cast doubt on their suitability for future spaceflight.\n\nHowever, Mr. Cernan himself cast doubt on this claim. “It was probably just radio interference. Had we thought it was something other than that we would have briefed everyone after the flight,” he said.\n\nA NASA technician on the TV show supports Mr. Cernan’s assessment that the “radios in the two spacecraft [the lunar module and the command module] were interfering with each other.”\n\nHowever, this explanation is disputed by astronaut Al Worden, who said that “logic tells me that if there was something recorded on there, then there is something there.”\n\nMichael Collins, the pilot of Apollo 11 and the first person to fly around the far side of the Moon by himself, also recalled hearing strange sounds, but did not think too much of it. Mr. Collins explained that the noise began when the radios in the two vehicles were both turned on and in close proximity to each other. — PTI", 
    "section": "national", 
    "title": "NASA makes Apollo ‘moon music’ public", 
    "subsection": "general", 
    "date": "2016-02-24"
}