{
    "author": [
        "Josy Joseph"
    ], 
    "text": "Military officers oppose throwing open strategic forward base to probe team\n\nIndia should not allow Pakistan’s Special Investigation Team into the Pathankot airbase, said serving and retired military officers, even as reports claimed that India could give the team access to the forward airbase.\n\nAll the officers whom The Hindu spoke to said it was symbolically bad and tactically could end up being a blunder.\n\nA section in the Indian establishment and several Pakistani media reports have been saying that the six-member Pakistani team will visit India in March and may be given access to the airbase.\n\nHowever, Defence Minister Manohar Parrikar said, “No one can enter them [defence installations] without the permission of the Defence Ministry,” hinting clearly about who should have the final call about permitting the Pakistani team. “The incident has happened here and we will investigate what has happened here. What we are asking them to investigate is the role of their people in their country,” Mr. Parrikar said.\n\nMr. Parrikar’s comments were in line with the thinking in the military circles.\n\n“What do you gain by letting them enter the base?” asked a senior Air Force officer. “It is a forward airbase specifically meant for Pakistan operations, and what is the guarantee that after the visit they wouldn’t claim there is no evidence in Pathankot that terrorists from Pakistan were behind it.”\n\n“It is a stupid idea,” said a just retired Air Marshal. “What would a Pakistani team find in Pathankot that our investigators have not figured out. They should have faith in our investigation agencies, and accept what we have to offer. In that sense, permitting them into Pathankot is a vote of no confidence on Indian agencies.”\n\nOpposing the move, former Navy Chief Admiral Sushil Kumar said, “When you allow a person who is inimical to your interest you are setting a wrong precedent.” “It could all be farcical, their double-crossing instincts are well known,” he said, charging that the latest flare-up in violence in Kashmir was a sign that the Pakistan deep state was at work against India.\n\nAdmiral Kumar said the main problem is that we still do not know who is calling the shots in Pakistan.\n\n“You may think you are dealing with a harmless government, but it may not be because it could be a mere puppet,” he said.\n\nNew Delhi seems to be happy about the progress made in Pakistan over the Pathankot attack investigation.\n\nSartaj Aziz, adviser to Pakistan Prime Minister on Foreign Affairs, said in an interview that the SIT would need access to some parts of Pathankot airbase as part of their investigation. He also claimed that Jaish-e-Mohammed founder Masood Azhar had been under police custody since January 14, information that Indian officials were not confirming.", 
    "section": "national", 
    "title": "No access for Pak. SIT: Parrikar", 
    "subsection": "general", 
    "date": "2016-02-24"
}