{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Pampore attack, which left nine persons dead, including five security personnel, was the first such deadly strike in six years in and around Srinagar.- Photo: Nissar Ahmad\n\nThe Pampore fidayeen (suicide) attack, which left nine persons dead, including five security personnel, was the first such deadly strike in six years in and around Srinagar since the 2010 Lal Chowk attack when militants took over a hotel in the commercial hub.\n\nThe attack, on the outskirts of the nearby Pulwama district’s Sempora area, just 16 km from Srinagar and 12 km from the Army’s 15 Corps headquarters, witnessed heavily armed militants determined to engage the security agencies in a long-drawn operation.\n\nAround 4 p.m. on Saturday last, three militants, one wearing a long Kashmiri cloak pheran , emerged on the Srinagar-Jammu National Highway, which is patrolled by security forces’ convoys all day, and opened fire on a CRPF bus, which was at the tail end of a convoy. Two CRPF jawans were killed and nine others injured in the attack.\n\nThe militants could have easily taken advantage of the narrow alleys or the nearby open fields to flee from the spot, but chose to walk down to the Entrepreneurial Development Institute (EDI) building to draw the forces into a prolonged battle.\n\nThe first to challenge the militants at the EDI were CRPF personnel who held fire to evacuate 129 stranded civilians from the premises in a one-and-a-half-hour rescue operation. By the time, the militants, who had also asked the civilians to vacate the building, positioned themselves to take on the CRPF.\n\nThe advance of the security force was halted by a volley of grenades lobbed by the militants. The CRPF alerted the Army’s elite 9 and 10 para forces to take on the heavily armed militants, with the police and the CRPF backing the operation.\n\nCaptain Pawan Kumar (23) volunteered to storm the building in the wee hours of Sunday as the night-long stand-off failed to subdue the militants. In the following operation, however, Capt. Kumar was killed after being hit by a volley of bullets followed by explosions.\n\n“The lobby on the ground floor was open and grenades tossed from the top would easily reach the ground floor, making it difficult to enter the building and take over the floor ”, said a police officer.\n\nConstructed in 1997, the EDI building is a structure with rooms within rooms and a canteen at the top, which could have helped the militants to survive and battle the forces for more than 48 hours.\n\nWith the militants quickly changing positions, a second assault was launched by Captain Tushar Mahajan, in which he and Lance Naik Om Prakash were killed, but only after managing to force the militants to the third floor.\n\nCapt. Mahajan’s operation allowed other personnel to enter and take position on the ground floor on day two. However, owing to explosions, the second and third floors caught fire.\n\n“This slowed down the operation”, said the police officer.\n\nOn Monday morning, the Army was able to locate the position of the militants hiding in the third and fourth floors and plan a joint action. “We cleared the building room by room. Several grenades were used to sanitise a floor as there were rooms within a room”, said the police officer.\n\nIt was around 3 p.m. that the Army engaged the militants in a face-to-face gun battle. The operation came to an end by 4 p.m. The Pampore attack may signal the start of a new strategy by LeT of launching attacks in the urban pockets in Srinagar unlike in the past when it operated mostly in rural areas.", 
    "section": "national", 
    "title": "Pampore strike signals changing strategy by militants", 
    "subsection": "general", 
    "date": "2016-02-24"
}