{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Madras HC judge says he was disturbed as some fellow judges “ridiculed” him\n\nMadras High Court judge Justice C.S. Karnan on Tuesday wrote to the Chief Justice of India, acknowledging that he passed an “erroneous order” due to his mental frustration resulting in “loss of mental balance”.\n\nThe letter, also addressed to Justices J.S. Khehar and Justice R. Banumathi said he had been disturbed since some fellow judges had “ridiculed” him. He did not, however, name these judges.\n\nJustice Karnan, who has been recommended for transfer to the Calcutta High Court by Chief Justice of India T.S. Thakur, had responded in an unprecedented fashion on February 15 by suo motu staying his transfer and asking the Chief Justice to explain the reason behind such a recommendation in a written statement.\n\nOn a plea by the Madras High Court, a Bench led by Justice Khehar had stayed all orders issued by Justice Karnan from February 12 — the date on which he received the transfer recommendation.\n\nThe Supreme Court had further authorised the Madras High Court Chief Justice to pull him out of judicial work till further notice. The series of events led to Justice Karnan's recent personal visit to the Supreme Court to meet Chief Justice Thakur.\n\n“On February 15, 2016, I had sent an erroneous order due to my mental frustration resulting in loss of mental balance since I was disturbed through various incidents,” Justice Karnan wrote in this latest letter.\n\nHe gave the assurance that in future he would foster a “harmonious attitude to one and all”.\n\nIn his letter, Justice Karnan gave two instances of “ridicule” he had suffered at the hands of some judges, mentioning that he had complained to the Chairman of the National Commission for Scheduled Castes and Scheduled Tribes and other high dignitaries three years ago.\n\nHe said he had never revealed the names of the judges who “indulged in such ugly pranks.” He wanted to uphold the “sanctity of the judiciary and maintain communal harmony”.\n\nHe assures the\n\nCJI he will foster a harmonious attitude towards one\n\nand all in future", 
    "section": "national", 
    "title": "Passed erroneous order due to mental frustration: Karnan", 
    "subsection": "general", 
    "date": "2016-02-24"
}