{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "In what could be a worrying factor for the People’s Democratic Party (PDP), many of the party cadres in its south Kashmir bastion are joining the ranks of militants.\n\nPulwama district, where militants attacked the Entrepreneurial Development Institute building, is fast emerging as a springboard for militancy, with 14 youths joining militant outfits in the past two months.\n\nAccording to police sources, a PDP supporter, its polling agent and a poll campaigner have joined the militants.\n\nSources said Rashid Ahmad, a resident of Pulwama’s Tahab area, and who worked as a campaigner for the PDP in the 2014 Assembly elections, has been slapped with a case for his alleged involvement in a weapon snatching incident.\n\nSimilarly, Showkat Ahmad, another Pulwama resident, who worked for the party as a polling agent, too has left home and joined the militants after the PDP formed a coalition government in the State in association with the BJP.\n\nThe youths are mainly joining the Hizbul Mujahideen and the Lashkar-e-Toiba (LeT), said police sources.\n\nTop police sources told The Hindu that Naseer Ahmad Pandit (29), a constable in the State police, who was a PDP supporter, had joined the militants in March last year. Pandit was posted in Srinagar as the personal security officer for former Public Works Department Minister and PDP leader Altaf Bukhari. The constable fled with two service rifles to join the Hizbul Mujahideen.\n\nMany PDP leaders admit that the party’s failure to deliver on the political and development fronts was costing it the “young” and “hard-earned” constituency in south Kashmir.\n\nPDP youth president Waheed Parra said, “I myself am shocked over the way the Pulwama youth is behaving. It’s unusual for the party. It’s true the youth voted for change and the peace process. However, we have hit a dead-end in the past nine months on taking any political measures or working towards any reconciliation. People have huge expectations from the PDP on many counts, including the continuation of the peace process”.\n\nA local resident said, “Pulwama has become a springboard for militancy. There is anxiety among the youth after the BJP-PDP government was formed”.", 
    "section": "national", 
    "title": "PDP worried over cadres in party bastion joining militants", 
    "subsection": "general", 
    "date": "2016-02-24"
}