{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "He wants only relevant schemes processed\n\nConducting a comprehensive review of defence procurements cleared in the last two years, Defence Minister Manohar Parrikar has directed the armed forces to identify procurement projects of “contemporary relevance” in the next few months. He made these observations on Tuesday while chairing a meeting of the Defence Acquisition Council (DAC).\n\n“The DAC focussed primarily on reviewing the overall status of defence acquisitions over the last two years,” officials said after the meeting. The review comes as the Defence Ministry is in the final stages of formulating the new Defence Procurement Procedure (DPP) expected to be released in the next couple of months. A contemporary review is particularly relevant as a large number of defence proposals in the pipeline have been pending for several years and even over a decade in many cases and are now irrelevant due to change in requirements of the forces and advancement in technology.\n\nDue to this, the three Services were asked to review their pending acquisition proposals which have not fructified for a long time. Mr. Parrikar apparently noted that only relevant schemes should be processed.\n\nObserving that despite concerted efforts to expedite procurements, Mr. Parrikar noted that there still remain 314 cases which have not yet fructified. Out of these 86 schemes worth approximately Rs. 1.5 lakh crore are close to final stage of approval, a senior defence official said.\n\nThe official said Mr. Parrikar directed that all concerned should make concerted efforts to get these cases cleared in the next 4-5 months so as to get the projects approved in the first quarter of the next financial year.\n\nThe DAC accorded approval for the procurement of 619 High Mobility Vehicles worth Rs. 457 crore from Tata. This is a repeat order exercising the optional clause in the original deal signed earlier.\n\nDespite concerted efforts to expedite procurements, 314 cases still remain, says Parrikar", 
    "section": "national", 
    "title": "Services asked to identify projects of contemporary relevance", 
    "subsection": "general", 
    "date": "2016-02-24"
}