{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "Tribal activist and Aam Aadmi Party leader Soni Sori was provided ‘Y’ category security cover by the Chhattisgarh government on Tuesday, three days after she was attacked by unknown persons in the Bastar region.\n\n“The State government has decided to provide ‘Y’ category security cover to Ms. Sori considering the threat to her life after the recent attack on her. The required police personnel would be deployed for her security as soon as possible,” said a press communiqué from the Chhattisgarh police headquarters.\n\nSome unknown persons had thrown an “acid-like” chemical on her face on the night of February 20 when she was returning to her home in Geedam town of Dantewada district on a motorcycle.\n\nThe AAP leader — who has been raising her voice against the alleged human rights violations by the security forces in Bastar — would now enjoy the security cover of 11 police men round the clock.\n\nShe is recovering: hospital\n\nMs. Sori, who is being treated at the Indraprastha Apollo Hospitals in Delhi for her injuries, “is recovering,” according to a senior official at the hospital on Tuesday. A day after she was brought to the hospital, doctors noted that though they were unable to identify the exact product/chemical which was used to injure her, treatment is under way and “that the patient is responding well to the intervention.”\n\nMeanwhile, top Chhattisgarh officials visited the hospital and enquired about Ms. Soni’s health. State’s Resident Commissioner B.V. Umadevi and others visited the hospital and met doctors. They said the condition of the tribal activist was stable, a State government release said. The police have registered an FIR and a search is on to nab the culprits, it said.\n\n(With inputs from Bindu Shajan Perappadan in New Delhi)", 
    "section": "national", 
    "title": "Soni Sori gets ‘Y’ category security", 
    "subsection": "general", 
    "date": "2016-02-24"
}