{
    "author": [
        "Special Correspondent"
    ], 
    "text": "BJP MPs summoned for meet today on Jat quota issue\n\nThe Venkaiah Naidu committee looking into the issue of Jat reservation in Haryana, an agitation that left 18 persons dead and scores wounded, had its second meeting, this time in the presence of Haryana Chief Minister M.L. Khattar.\n\nThe meeting went into several socio-economic and legal issues concerning granting quota for Jats in the State, including how the past Bhupinder Singh Hooda government had dealt with the issue in courts, since the reservation had been thrown out by courts last year.\n\nThe committee has also summoned BJP MP Raj Kumar Saini who had created a controversy by fiercely advocating denial of reservation to Jats, and using offensive language against the community. Other party MPs from Haryana have also been asked to meet the committee on Wednesday. The BJP has seven MPs from the State.\n\n“The committee realises that it has to tread a very fine line on this matter, not just because of the violence of the agitation, but also the complicated legalese involved in it and the fact that there were threats of demonstrations by other 35 non-Jat communities in the State, against Jat reservations,” said a source present at the meeting.\n\nSources also said Mr. Khattar would continue as Chief Minister as “the party realises that there was a conspiracy to destabilise his government by the Congress, as evident from certain audio tapes.” Senior leaders of the party refused to confirm whether it feared that some of the sabotage could be internal. Jats account for nearly 30 per cent of the State’s population, but unlike in western Uttar Pradesh, they preferred to back the Indian National Lok Dal and the Congress rather than the BJP in Haryana in both the 2014 Lok Sabha polls and the Assembly polls subsequently, according to figures available with the Centre for the Study of Developing Societies.", 
    "section": "national", 
    "title": "Venkaiah panel meets Haryana CM", 
    "subsection": "general", 
    "date": "2016-02-24"
}