{
    "author": [], 
    "text": "No Indian city in top 100; Hyderabad and Pune in 139th and 144th positions\n\nA view of the Vienna Philharmonic Orchestra. The city’s 17 lakh residents benefit from the city’s cafe culture and museums, theatres and operas. — File Photo: Reuters\n\nAustria’s capital Vienna is the best place in the world to live, according to an international survey on quality of life that has no Indian city in the top 100.\n\nAccording to the 18th Mercer Quality of Life study which examined socioeconomic conditions of 230 global cities, Vienna, a city of nearly 1.8 million people, is the world’s best city, followed by Zurich, Auckland, Munich and Vancouver.\n\nWhile famous cities such as London, Paris and New York failed to make a cut even in the top 30s, Baghdad was named the worst city in the world.\n\nAmong Indian cities, Hyderabad topped the rankings at 139th position, followed by Pune at 144, Bangalore at 145, Chennai at 150, Mumbai at 152, Kolkata at 160 and New Delhi at 161.\n\nThe study examined social and economic conditions, health, education, housing and the environment and is used by big companies to assess where they should locate and how much they should pay staff, The Guardian reported on Tuesday.\n\nGerman-speaking cities dominate the rankings, with Vienna joined by Zurich, Munich, Dusseldorf and Frankfurt in the top seven.\n\nAffordable housing\n\n“I live in a 100 sq-metre turn-of-the-century apartment in the city centre. But my rent is just €800 a month,” said Viennese-born Helena Hartlauer, adding that she was not surprised at her city’s top position.\n\nShe said the social democratic government has a long tradition of investing in high-quality social housing, making Vienna almost uniquely affordable among major cities. According to the World Bank, Austria has one of the highest figures for GDP per head in the world, just behind the U.S. and ahead of Germany and Britain, the report said.\n\n“There are more students in Vienna than any other German-speaking city. It’s a very fast growing, young and lively city...You don’t realise how safe Vienna is until you head abroad,” Ms. Hartlauer said.\n\nThe European migrant crisis, which has seen large numbers of refugees and asylum seekers pass through Vienna en route to Germany, has had little impact on the city. — PTI", 
    "section": "national", 
    "title": "Vienna is world’s best city: survey", 
    "subsection": "general", 
    "date": "2016-02-24"
}