{
    "author": [
        "Vivek Narayanan", 
        "R Aditi"
    ], 
    "text": "Tense moments prevailed in a fishing hamlet on East Coast Road (ECR) on Tuesday morning, after residents protested demanding the removal of a woman working at an anganwadi, after her 15-year-old grandson allegedly abused a six-year-old in the anganwadi. The police arrested the boy under Protection of Children from Sexual Offences Act (POCSO), 2012.\n\nAccording to police, the boy’s grandmother works in the anganwadi functioning in a Chennai Corporation building. Many children from the locality are left at the centre by parents who are daily wage labourers. “The woman often leaves the centre under the care of her grandson. A few weeks ago, when she left for some work, the boy misbehaved with the six-year-old child. When the girl complained of pain, the parents thought she was suffering from a urinary infection. Later, they found out that the boy had sexually abused her,” said a police officer.\n\nOnce the news broke out, many gathered in front of the anganwadi, demanding the dismissal of the woman. The boy has been sent to a juvenile home.\n\nA senior official from the Child Welfare Committee said, “Cases of children abusing children need to be brought to light, as it will help dealing with the issue better,” she said.\n\nAdding to this, child welfare experts say that children and parents both need to be sensitised and educated on sexual behaviour of children.\n\n“The boy might have done it either to explore or on purpose. Putting him in the observation home alone won’t help, he needs to be guided and oriented on acceptable forms of behaviour and treated to see if he has any addiction problem,” said Girija Kumar Babu, Joint Secretary of Indian Council for Child Welfare (ICCW).\n\n“Many countries have applied such holistic practices. Sadly, we do not have such a facility here,” she added.", 
    "section": "national", 
    "title": "15-year-old sexually abuses 6-year-old girl in anganwadi", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}