{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The boy allegedly informed the girl’s father about the crime and fled\n\nAn 18-year-old girl pursuing engineering course was murdered by a youth in a tiled house surrounded by farm lands at Vijayapuram near Arumbavur in the district on Monday night.\n\nBoth the victim and the accused belong to Dalit community.\n\nThe victim, A. Kanimozhi of Alampadi village, was studying second-year civil engineering in a private college near Tiruchi.\n\nThe accused S. Prakash (25) is reported to be absconding. The two were neighbours at Alampadi village.\n\nAccording to police, the two were in love and the girl’s parents are said to have got wind of their daughter’s affair. The girl returned in the evening from college and alighted from the bus at Perambalur.\n\nPrakash, who was waiting, took her on a motorcycle to Vijayapuram about 20 km from Perambalur under the pretext of wanting to speak to her, the police said.\n\nA farmer by profession, Prakash had taken on lease a piece of land and used to stay put sometimes in the tiled house surrounded by farm lands.\n\nThe accused took the girl to the tiled house where they are suspected to have quarrelled. In a fit of rage,\n\nPrakash, according to police, allegedly strangulated the girl with the dupatta.\n\nPrakash called the girl’s father S. Ayyavu on his mobile phone in the late night hours and allegedly told him that he had murdered Kanimozhi in the tiled house at Vijayapuram and fled the spot.\n\nThe girl’s father along with some other residents of the village went to the spot and found her body inside the tiled house. On receipt of information, police personnel inspected the crime scene and conducted inquiries. The Arumbavur police have registered a case of murder.\n\nSpecial teams have been formed to apprehend Prakash who is at large.\n\nThe sources said what exactly transpired between the girl and Prakash moments before the murder was committed and the exact reason for the crime would be known after apprehending the accused.\n\nThe accused was staying with his grandmother at Alampadi village while his parents resided at Valparai near Pollachi.", 
    "section": "national", 
    "title": "18-year-old BE student murdered, hunt on for killer", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}