{
    "author": [
        "Special Correspondent"
    ], 
    "text": "With the model code of conduct (MCC) for the upcoming Assembly election in force and seizure of cash and other items without proper documents in full swing, the police have started booking poll violation cases across the Central Zone encompassing eight districts.\n\nA little over 200 poll violation cases against various political parties for flouting Election Commission norms had been booked so far.\n\nThe cases had been registered against the ruling AIADMK, its arch rival Dravida Munnetra Kazhagam, Bharatiya Janata Party, Naam Tamizhar Katchi, Tamil Maanila Congress, and so on.\n\nAccording to police sources here, Thanjavur district tops in the zone in respect of booking of poll violation cases with the figures being 83.\n\nThis is followed by Tiruvarur district (60) and Nagapattinam (45). The cases were booked among others for wall writing and non-removal of banners. A few cases have been booked in Pudukottai and Karur districts. Police sources said the Election Commission had directed that Ministers travelling to districts could not be provided with pilot cars with beacon lights in view of the model code of conduct being in force. It said based on threat perception assessment, security could be provided and even in those cases the escort vehicle should not have siren or beacon lights. The Election Commission’s directive was being strictly adhered to by the police, said the sources.\n\nSeized\n\nMeanwhile, a Flying Squad seized Rs. 1.29 lakh cash while conducting checks at Ponnampalampatti check post near Vaiyampatti in Tiruchi district on Tuesday.\n\nThe team seized the money from a motorist who was carrying cash without proper documents.\n\nThe motorist informed the team that he was on his way from Dindigul apparently to buy goat skins at Veerapur. The cash was deposited in the sub treasury.", 
    "section": "national", 
    "title": "200 poll code violation cases booked", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}