{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Students writing the SSLC examination in Thanjavur on first day on Tuesday.— PHOTO: R.M. RAJARATHINAM\n\nA total of 36,790 students are taking their SSLC examinations that commenced in Thanjavur on Tuesday.\n\nThey include 1,218 private candidates.\n\nSpeaking after inspecting the progress of the examinations at St. Anthony's Higher Secondary School here, District Collector N. Subbaiyan said the exams were conducted in 112 centres across the district. This year 17,837 boys, and 17,735 girls were appearing for the exams under the regular school category while another 740 boys and 478 girls were appearing in three separate private candidates examination centres for 36,790 students. T\n\nhey included 108 student with disabilities. A total of 2,523 officials have been pressed into service to monitor the exams, Dr. Subbaiyan said.\n\nChief Education Officer R. Thiruvalarselvi accompanied the Collector during the inspection.\n\nTIRUVARUR: In Tiruvarur, District Collector M. Mathivanan inspected the progress of the examinations at the Government Higher Secondary School Ammayappan and directed that all facilities be provided to the appearing candidates with regard to smooth conduct of the exams.\n\nMr. Mathivanan said that 18,096 students, including 9,259 girls, were appearing for the SSLC exams in 58 centres across Tiruvarur district. A total of 1,351 officials, including 83 members, in flying squads have been deputed to monitor the exams.\n\nChief Education Officer Mani, District Revenue Officer T. Mohanraj, and Tiruvarur RDO Muthumeenakshi accompanied the Collector.\n\nNAGAPATTINAM: In Nagapattinam, District Collector S. Palanisamy visited the Municipal Girls Higher Secondary School and the Government Higher Secondary School, Akkaraipettai, to see first hand the progress of the SSLC exams in the district.\n\nMr. Palanisamy said that 23,379 candidates including 12,049 girls were appearing for the SSLC exams in 78 centres in the district.\n\nAmong the candidates, 808 were appearing privately. Chief Education Officer A. Kasthuribai and other officials from the Department of School Education accompanied the Collector.", 
    "section": "national", 
    "title": "36,790 write SSLC exam in Thanjavur on first day", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}