{
    "author": [
        "R Rajaram"
    ], 
    "text": "A team of officials handed over question papers to prison officials\n\nJail Superintendent A. Murugesan distributing the question paper among the prisoners who wrote the SSLC examination in Tiruchi on Tuesday.\n\nExamination fever gripped Tiruchi Central Prison as a group of convicts sat for the SSLC examination that commenced on Tuesday.\n\nNecessary arrangements were made inside the Central Prison, accommodating over 1,000 prisoners, for the select batch of convicts taking the exam.\n\nIn all, 58 prisoners appeared for the examination of which 53 were from the Tiruchi Central Prison and the remaining five from the Pudukottai Borstal School which accommodates young offenders in the age group 18 to 21.\n\nA team of Education Department officials came to the Central Prison well ahead of the specified time of the start of the examination and handed over the question papers that were sealed in a cover.\n\nThe school building situated in the third block inside the sprawling Central Prison premises was the examination venue for the inmates. The examination was monitored by a team of officials.\n\nPrison authorities told The Hindu that the examination started at the specified time beginning with Tamil-I language paper. This would be followed by Tamil–II, English-I, English - II, Maths, Science, and Social Science in the days to come. The prisoners who appeared for the examination were from different age groups.\n\nThose inmates from the Pudukottai Borstal School who were appearing for the exam would be lodged in the Tiruchi Prison. They would be sent back to Borstal School after the conclusion of the examination next month, the authorities said.\n\nA senior official said reading material, notes, and books were provided free of cost to the select inmates taking the exam.\n\nThe material were sponsored by a non-governmental organisation. Weekend classes were arranged for the prisoners inside the jail by engaging teachers from certain private schools.\n\nThe official said the lunch was arranged for the prisoners at the venue after the conclusion of the examination.", 
    "section": "national", 
    "title": "58 prisoners write SSLC exam", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}