{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Department of French, Pondicherry University, hosts a seminar on the theme\n\nFrench Consul General Philippe Janvier-Kamiyama (second from left) at a seminar on 'Marginalisation and Resistance: Rethinking the Woman' hosted recently by the French Department of Pondicherry University.— Photo: Special Arrangement\n\nAcademics debated on the theme, ‘Marginalisation and Resistance: Rethinking the Woman’ at a recent seminar hosted by the Department of French of the Pondicherry University.\n\nA stand-out paper, among the 85-odd presentations made at the three-day event, was one by Prof. Patricia Reynaud from Georgetown University, Qatar, on ‘Counter-Gender: Subversion in Maghrebin Cinema’ (the Maghreb includes Algeria, Tunisia, Morocco).\n\nThe author analysed the causes of symbolic and real violence subjugating women, substantiating her arguments with pertinent examples from recent Francophone films such as ‘La source des femmes’, ‘La fille de Keltoum’ and ‘L’enfant endormi’.\n\nAnd, in what was a bonus for the delegates, the film ‘La fille de Keltoum’ was also screened.\n\nAccording to Prof. Nalini J. Thampi, Professor and Head, Department of French and also the first woman Dean of the School of Humanities, the fact that the University was headed by a woman—the Vice Chancellor (i/c) Prof. Anisa Basheer Khan —or that the proportion of women in the Pondicherry University has crossed 200, was an unmistakeable sign that women had carved an academic niche for themselves in this University.\n\nThe French Consul General Philippe Janvier-Kamiyama, a staunch advocate of women’s rights, was one of the dignitaries at the inaugural session.\n\nThe French Department at the University was the first in India to be granted a UGC SAP Project. The seminar was organised under the second phase of this project, Prof. Thampi said. Though it was a national seminar, quite a few abstracts were submitted from academics in overseas institutions.\n\n“A successful woman is one who can build a firm foundation with the bricks others have thrown at her.” And women have amply proved that they can and they will survive, despite the brickbats or the threats,” said Prof. Thampi.\n\nOn the occasion, entrepreneur Shobhana Srikanth of DHARTI was felicitated for her contribution in training marginalised women in the skills of crafting eco-friendly products, especially ethnic jute bags.", 
    "section": "national", 
    "title": "Academics initiate debate on ‘rethinking’ the woman", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}