{
    "author": [
        "S Sundar"
    ], 
    "text": "Former Chief Engineer, Public Works Department, R.V.S. Vijayakumar, who was behind the construction of iconic buildings in the State, including the Madurai Bench of the Madras High Court, passed away here on Tuesday.\n\nHe was 67.\n\nA native of Ramanathapuram, Mr. Vijayakumar, an alumnus of Thiagarajar College of Engineering, joined the PWD in 1971 and rose up to the post of Chief Engineer in 2005 and retired as CE, Water Resources Organisation, Madurai Region, in 2007.\n\nMr. Vijayakumar, who was known for his rebellious character, was the first to officially declare that Tamil Nadu was waiting for the water level in the Mullaperiyar dam to rise to 142 feet in September 2006, following the Supreme Court verdict.\n\nFor the first time, through an interview to The Hindu dated September 7, 2006, he said that all the 13 shutters in the main dam were well-oiled and waiting for a significant inflow to bring them down (thus increasing the water level from 136 feet to 142 feet).\n\nWhen the then Dravida Munnetra Kazhagam government adopted a “very guarded” approach on the issue, he spoke about his decision of having asked the State government to deploy Tamil Nadu police personnel in the dam site.\n\nHe frowned at the frequent visit of “outsiders” (read Kerala State Ministers) inspecting the dam.\n\nMr. Vijayakumar conducted hydraulic study at Mullaperiyar dam in Thekkadi and fore-bay dam in 2006 for optimum utilisation of the Periyar water, thus avoiding the probability of water surplussing through the spill way towards Kerala side.\n\nWhen he felt that getting consent from the Collectors of Madurai, Sivaganga and Ramanathapuram districts often became difficult, he amended the compendium of rules from “with consent of the district Collectors” to “under the intimation of the district Collector.”\n\nCD on Periyar Dam\n\nHowever, his decision (in 2007) to restore the Vaigai credit to its original position before construction of Periyar dam that helped Ramanathapuram district get higher quantum of water is still being debated among the farmers of Madurai district. He brought out a compact disc explaining the strength of Periyar dam to counter the “false” propaganda on the dam safety by the Kerala government.", 
    "section": "national", 
    "title": "An engineer and rebel, Vijayakumar, passes away", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}