{
    "author": [
        "Vikas Vasudeva"
    ], 
    "text": "Bahujan Samaj Party chief Mayawati at a rally in the Nawanshahr district of Punjab on Tuesday. —Photo: PTI\n\nSetting up the tone for the Assembly elections, the Bahujan Samaj Party (BSP) chief Mayawati on Tuesday said the party will not form alliance with any party in Punjab and would contest the Assembly elections on its own.\n\nKicking off party’s election campaign in Punjab on the birth anniversary of the BSP founder late Kanshi Ram in Nawanshahr district, Ms. Mayawati said: “We will contest Assembly elections in Punjab on our own and will not form any alliance with other parties.”\n\n“In Punjab you [Bahujan Samaj] can form a government on your own as you have requisite population here. There’s no need to enter into alliance with any party,” she said, adding that only the BSP could safeguard their interests in Punjab.\n\nMs. Mayawati accused other political parties of being opportunist and anti-Dalit. “These parties, which today are talking about Kanshi Ram ji, have always been against reservation and had opposed his ideology,” she said.\n\nMs. Mayawati said she decided to reserve 50 per cent of seats for the youth at all levels in the party set up to ensure that a second line of leadership is well versed with party’s ideology.\n\nBattling to bag the crucial Dalit votes in Punjab ahead of the Assembly polls, Ms. Mayawati and the Aam Aadmi Party leader Arvind Kejriwal were in Punjab on Tuesday.\n\nMr. Kejriwal, who visited the birthplace of Kanshi Ram at Prithipur Bunga village in Ropar district on Tuesday, said, if voted to power, the AAP government would fulfil the dreams, which Kanshi Ram had seen for the Dalit community.\n\nAddressing a gathering Mr. Kejriwal said Kanshi Ram was a visionary and he should be given Bharat Ratna.\n\n“He [Kanshi Ram] has been the only visionary leader for Dalit community after Dr. B.R Ambedkar,” he said.\n\nMr. Kejriwal accused the ruling Shiromani Akali Dal (SAD)-BJP government of being anti-Dalit and working against the interests of minority communities.\n\nHe alleged that people, especially the youth who are forming clubs in the name of Dr. B.R. Ambedkar, were being harassed. “Law and order situation in Punjab was the worst in the country,” he added.", 
    "section": "national", 
    "title": "BSP to go it alone in Punjab polls", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}