{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Holds discussions with banking, IT officials on monitoring mechanisms\n\nserious discussions:Chief Electoral Officer V. Candavelou chairing the meeting along with District Collector-cum-District Election Officer S. Sundaravadivelu and Deputy Inspector General of Police K.Jegadesan.Photo:T. Singaravelou\n\nThe Chief Electoral Officer V. Candavelou on Tuesday held a meeting with representatives of banks, Income Tax Authorities election, police officers in the Union Territory on how to execute an effective mechanism to monitor the expenditure of the political parties and individual candidates during the forthcoming polls.\n\nDistrict Election Officer-cum-District Collector S. Sundaravadivelu and Deputy Inspector General of Police K. Jegadesan were also present.\n\nSuspicious withdrawal\n\nDr. Candavelou told officials that any unusual and suspicious withdrawal or deposit of cash in a bank account exceeding Rs.one lakh should be reported to Income Tax (IT) authorities and District Election Officer (DEO).\n\nAn instruction from the Election Commission (EC) said unusual and suspicious cash withdrawal or deposit of cash in a bank account exceeding Rs.one lakh during the process of election, especially in cases where there has been no such instance of deposit/withdrawal during last two months should be definitely reported to the DEO and IT authorities.”\n\nReporting of unusual RTGS\n\nThe banks should also report unusual transfer of amount of Real-time gross settlement systems (RTGS) from a bank account of a person or organisation (to the accounts of several persons in a district/ constituency during election period.\n\n“Any deposit of cash or withdrawal of cash exceeding Rs.one lakh from bank account of individuals, candidates and other organisations and other suspicious cash transactions that may be used for influencing the voters,” said another instruction of EC.\n\nAs per direction of EC, Income Tax Department was asked to set up a separate control room with dedicated phone number in Puducherry so that public can also report or make complaints on illegal or unauthorised transactions by candidate/ political parties and their supporters.", 
    "section": "national", 
    "title": "CEO gears up to closely track expenses of parties, candidates", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}