{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The District Election Office here has asked all the political parties to ensure that their party flagpoles, which are generally painted in the party colour, are removed.\n\nSome of the parties have apparently expressed dissatisfaction over the decision as the flagpoles were to be just covered during the previous elections.\n\nCollector and Election Officer K. Veera Raghava Rao told The Hindu that covering the flagpoles had resulted in violations in the past.\n\n“They may not be properly covered or the covering may get removed leading to complaints by parties against one another. So it has been decided that the flagpoles be removed completely,” Mr. Rao said. He said that the base of the flagpole need not be demolished or removed but any painting in party colour or symbol should be erased.\n\nOfficials said that checks were already being made and flagpoles not removed by the parties within two days would be removed by the district administration.\n\nMeanwhile, the Collector advised parties and officials that there was no need to cover the statues of leaders but party colour or symbols on the base of statues should be removed.\n\nOfficials were also asked not to insist on removal of plaques or boards mentioning the work carried out through funds of MPs or MLAs unless they have party symbols.\n\nVoting awareness\n\nAround 1,000 postcards with message from the Collector on the importance of voting were sent to voters from villagers in Madurai East constituency on Tuesday.\n\nLaunching the drive, Revenue Divisional Officer (Madurai) and Returning Officer of Madurai East constituency G. Senthilkumari said the idea was to target interior villages where voting percentage was low. “We have selected a few of such villages,” she said.", 
    "section": "national", 
    "title": "Collector asks political parties to remove their flagpoles", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}