{
    "author": [
        "S Poorvaja"
    ], 
    "text": "TV actor’s suicide has brought home need of counselling for those in the field\n\nTelevision Actor Sai Prashant’s suicide has brought home the necessity of counselling for those in the industry.\n\n“There are pressures in any industry and we have to cope with them. He seemed a bit dull on March 10 when we had a shooting and we asked him about it. He said he would be fine in a while. We did not expect this at all,” said Ashwin Kumar, a TV Actor who plays his younger brother in the serial Thamarai .\n\n“We have now realised that many of us are stuck with hectic schedules and have nothing to balance it out with. A few of us have now decided to form groups and engage in some social service which will give us some direction as well as a sense of satisfaction and fulfilment,” he said.\n\nSyamantha Kiran, a TV actor who has been in the field since 2007, said that the TV industry had grown by leaps and bounds in the last few years, with many new entrants.\n\n“”Every day, there is a new face and it can get very intimidating. As a part of the industry, we are required to be mentally equipped to handle this and it is good to seek help, whenever necessary. We are around people all the time and it helps to open up and talk, which we wish Sai Prashant had done,” she said.\n\nWhile the Nadigar Sangam is now contemplating hiring counsellors, members of the television fraternity also said that there was a need for guidance with regard to wealth management.\n\n“For many male actors, who are the sole breadwinners and are supporting families, there is often a lot of financial pressure since work in the industry is not always steady. A lot of shoots can happen one month and the next month can be dry, but people need to realise that it is only temporary and not get dejected,” an actor said.\n\nActress Radikaa, head of Radaan Mediaworks, had tweeted saying that she was shocked to hear of the news and wished that he had not given up on life. Senha’s suicide prevention helpline can be contacted at 044 24640050 and the government helpline at 104.\n\nInsiders said\n\nactors need guidance with regard to wealth management too", 
    "section": "national", 
    "title": "Coping in a high-pressure television industry", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}