{
    "author": [
        "Staff Reporter"
    ], 
    "text": "TPDK members holding copies of the messages on social media in favour of ‘honour’ killings, against which they petitioned the city Police Commissioner in Coimbatore, on Tuesday. —Photo:S. Siva Saravanan\n\nMembers of the Thanthai Periyar Dravida Kazhagam (TPDK) petitioned the Coimbatore City Police Commissioner on Tuesday seeking stringent action against caste Hindus who have lauded and extended their support on the social media to the caste-related murder of Dalit youth V. Shankar of Udumalpet and attack on his caste Hindu wife.\n\nTPDK city unit joint secretary S. Manikandan said that in less than a day after the brutal murder of Shankar in public at the Udumalpet Bus Stand, social media (especially Facebook) was flooded with posts by persons who argued that such killings could put an end to inter-caste marriages.\n\nTPDK general secretary K. Ramakrishnan said that such statements were wounding and added fuel to the fire. “Caste Hindus were earlier criticising Dalits in the social media. They are now directly threatening them” he added.\n\nThe organisation also submitted photocopies of some of those posts by Caste Hindu leaders and youth, in the social media.\n\nThey said that the police who arrest persons for criticising political leaders in the social media should initiate such action against persons trying to spread hatred among communities.\n\nCity Police Commissioner A. Amalraj said that he would verify the claims made in the petition and initiate appropriate legal action. Copies of the petitions were also sent to the Coimbatore District Collector and to the Chief Electoral Officer of Tamil Nadu.\n\nProtests\n\nA group of persons staged a demonstration in front of the Government Arts College in Coimbatore on Tuesday seeking enactment of legislation to end “honour” killings in the name of castes and demanding stringent action against offenders.\n\nProtection sought\n\nThey also sought protection for Kausalya, who is in hospital, and aid to help her complete her education.", 
    "section": "national", 
    "title": "‘Crack the whip on those glorifying killing on social media’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}