{
    "author": [
        "Staff Reporter", 
        "M K"
    ], 
    "text": "Man gets five years RI\n\nThe Additional District Judge–I here on Tuesday sentenced Ramasamy (45) of Mettupalayam to five years Rigorous Imprisonment as he was found guilty of murdering his brother-in-law by attacking him using a sickle.\n\nThe prosecution case was that Ramasamy attacked Ayyasamy when he tried to prevent him from beating his wife\n\nKumutharani on October 13, 2013 in an inebriated condition.\n\nAyyasamy was admitted to the Mettupalayam Government Hospital, and was discharged a few days later.\n\nThree weeks later he developed pain on his head and was admitted to the Coimbatore Medical College Hospital, where he died on the November 5.\n\nRamasamy was booked under section 302 (murder) of the Indian Penal Code (IPC) and was arrested.\n\nBoy dies\n\nA. Leodas (8) died after the sari with which he was playing got entangled around his neck at his house at Bannariyamman Koil Street in Avarampalayam. He was taken to a private hospital, and later to another hospital in Madurai, where he died on Monday.\n\nWoman held for theft\n\nThe police on Monday arrested P. Kanjana (48) on the charge of stealing Rs. 1 lakh, and gold jewellery weighing about 35 gm from her neighbour’s house at Pattanam, near Sulur, on Monday.\n\nShe used to visit the house of Selvaraj often. On Monday, when he and his wife went out, she picked up the key to the house and tried to escape with the valuables.\n\nFour held\n\nA court in Avinashi remanded four accused of kidnapping and murdering an eight-year-old boy from Cheyur.\n\nThe accused were Kumaresan (24), Shanmugasundaram (23), Ravi (21) and Karthi (21).\n\nThe body of the boy was recovered from Erode district on Monday. evening.\n\nFire at mill\n\nThe Fire and Rescue Services personnel on Tuesday extinguished a fire that broke out at a spinning mill, near here, from waste cotton kept on its premises. of the mill caught fire\n\nInfant found dead\n\nThe body of a new born girl was found inside a garbage bin kept along the Tirupur-Mangalam road on Tuesday evening.\n\nThe body was found wrapped in a plastic cover.and thrown into the bin.", 
    "section": "national", 
    "title": "Crime Notes (Three Items)", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}