{
    "author": [
        "Staff Reporter"
    ], 
    "text": "R. Madanagopal, professor and head, ENT, Government Vellore Medical College Hospital along with V. Anandan who underwent the surgery. Hospital dean, Usha Sadasivam, is also in the picture.- Photo: C. Venkatachalapathy\n\nAfter experiencing difficulty in swallowing food and losing close to 15 kilos in two months, 21-year-old V. Anandan is returning to normal life. Little was he aware that a cricket ball-sized tumour was growing in his oral cavity, giving him a tough time even for breathing.\n\nIt was only 15 days ago that Anandan, a carpenter from Ambur, knew he had a tumour in the oral cavity after being examined by ENT doctors at Government Vellore Medical College Hospital (GVMCH), Adukkamparai.\n\n“We did a MRI scan and found that he had a parapharyngeal mass present in the oral cavity. This has been causing difficulty in swallowing, breathlessness, change of voice and loss of weight,” R. Madanagopal, professor and head, ENT, GVMCH told reporters on Tuesday.\n\nFollowing this, the doctors planned a surgery to excise the tumour.\n\n“However, we did not want to perform the procedure by cutting open the neck as the nerves and blood vessels will be compromised. Instead, we did a tracheostomy to enable him to breathe. We secured his airway, and performed the procedure through the oral route and excised the mass,” he said.\n\nA team of five doctors performed a two-hour surgery on March 11 and removed the tumour. Also a Fine-Needle Aspiration Cytology found that the tumour was benign.\n\nHowever, the cause of the tumour is not known, Dr. Madanagopal observed. “The tumour could have started to grow slowly at least in the last six months,” he said.\n\nThe surgery was covered under the Chief Minister’s Comprehensive Health Insurance Scheme. Usha Sadasivam, GVMCH dean, was present. Doctors -Bharathi Mohan, ENT professor, R. M. Elango, Kalidas and Thilagavathy – assistant professors – were part of the surgical team.", 
    "section": "national", 
    "title": "Doctors remove tumour from 21-year-old’s oral cavity", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}