{
    "author": [
        "V S"
    ], 
    "text": "Students of Devarshola Higher Secondary School, Gudalur have been given police protection due to the presence of a tiger in the area. (Right) A well-grown male tiger that was found dead near Parsons Valley in The Nilgiris.— Photos: M. Sathyamoorthy & Special Arrangement\n\nAnother tiger found dead near Parsons Valley\n\nOn a day when the elusive tiger resurfaced at Devarshola near Gudalur by taking a cow and giving a clue about its whereabouts, Forest personnel were busy elsewhere, as another well-grown male tiger was found dead at Wenlock Reserve Forest near Parsons Valley in Nilgiris South Forest Division on Tuesday.\n\nForest and personnel and STF men continued their tracking operations in Devarshola estate area near Gudalur for the fourth day on Tuesday going by the fresh pug marks. The tiger is suspected to have mauled an estate worker to death on Friday night.\n\nOn Tuesday afternoon, the personnel on tracking operations were disappointed with no fresh clues about the location of the tiger and were waiting on tree top machans and were monitoring the camera traps, waiting for the tiger to resurface. Their hope was that the tiger had its prey last on Friday night and with three full days having gone by, they expected the tiger to emerge in search of a prey.\n\nGiven the wounds caused by the snare on its hind legs and stomach, the officials anticipated the tiger would look only for soft targets (i.e.), domestic cattle or human beings as it would be too difficult for the tiger to hunt and kill in the wild. The carcass of the cow was sighted close to the Devarshola police station. With this indication, the Forest Veterinarians, equipped with their darting guns and STF personnel have surrounded the area, to curtail the movement of the tiger further.\n\nOfficials are confident of tranquilising the animal within the next 10 to 16 hours.\n\nHowever, the forest officials have already alerted their counterparts in Wayanad and Mudumalai Tiger Reserve to stay on alert, as they happen to be contiguous to Devarshola. Students were escorted to schools and exam centres by police for the second day on Tuesday.\n\nField Director of Mudumalai Tiger Reserve (MTR) Srinivas R. Reddy, Conservator of Forests – Coimbatore Circle I. Anwardeen, Gudalur DFO S.N. Tejaswi, Collector P. Sankar and Superintendent of Police – Murali Ramba frequently visited the camps from where the tracking operations are being done.\n\nMeanwhile, news about the death of a well grown male tiger in Wenlock RF near Parsons Valley in Nilgiris South Forest Division kept the officials on their toes.\n\nForest officials have informed the National Tiger Conservation Authority (NTCA). Boominathan of WWF has been nominated as the representative for the conduct of the post-mortem by Forest Veterinarian E. Vijayaraghavan of Mudumalai Tiger Reserve (MTR) and is expected to be done on Wednesday morning.\n\nMeanwhile, clinical observation of the dead tiger indicated that it could have been a death resulting out of territorial fight.", 
    "section": "national", 
    "title": "Elusive tiger preys on cow", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}