{
    "author": [
        "S Senthalir"
    ], 
    "text": "Commissioner of Central Excise, Puducherry Commissionerate, explains the provisions\n\nIn view of the continued protests by jewellers against the imposition of excise duty of 1per cent (without input tax credit) and 12.5 per cent (with input tax credit), Commissioner of Central Excise, Puducherry Commissionerate, on Tuesday explained the provisions to allay apprehensions expressed by traders and industries.\n\nU. Niranjan, Commissioner, Central Excise and Service Tax, said Central Excise officers have been directed not to visit the premises of jewellery manufacturers. “The fear of coming under the tax net and maintaining elaborate record is the reason for apprehension. But, this is completely on voluntary compliance. Provisions for online application for registration, payment of excise duty and filing of returns are provided with zero interface with the departmental officers. The excise duty comes into effect on March 1, 2016,” he said.\n\nExcise duty is to be paid on monthly basis and not on each clearance, with first instalment of duty payment to be paid on March 31.\n\nMr. Niranjan said it was only the principal manufacturer who was obliged to register with the Central Excise, pay duty and file returns. “The artisans or goldsmiths who manufacture jewellery on job-work basis need not do so,” he added.\n\nSilver jewellery articles are exempted from tax except if they are studded with diamonds, ruby and emerald. He underlined that almost all States are levied 1 per cent service tax on jewellery and there is 6 per cent tax on imitation jewellery. It is in this backdrop that it is an economic justification of the levy of nominal excise duty of 1 per cent on the gold jewellery articles.\n\nFor all other products, excise duty exemption is up to Rs. 1.5 crore and if the turnover is less than Rs.4 crore he is eligible for small scale industries excise duty. “However, in case of gold jewellery articles exemption is provided up to Rs. 6 crore turnover. Besides, to be eligible for small scale industries excise duty, the turnover should be up to Rs. 12 crore,” he said.\n\nFor the determination of eligibility for the SSI exemption for the month of March 2016 or financial year 2016-17, a certificate from a chartered accountant, based on the books of accounts for 2014-15 and 2015-16 respectively, would suffice. Further, they are given optimal centralised registration. Field formations have been directed to grant hassle-free registrations within two working days of the submission of the registration application.\n\nJewellers’ private records or those of state VAT or Bureau of Indian Standards will be accepted for all Central Excise purposes.", 
    "section": "national", 
    "title": "Excise duty: official allays jewellers’ fears", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}