{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Protesters pick argument with police at District Police Office\n\nPolice took into custody 75 workers belonging to farmers’ front organisations of the Left parties here on Tuesday when they attempted to stage a road roko demanding criminal action against those who assaulted loan defaulting farmer G. Balan.\n\nThe workers were trying to proceed to block road near the District Police Office demanding immediate arrest of those police personnel and Kotak Mahindra Bank collection agents who assaulted Balan. Those who led the stir included the general secretary of the CPI leaning Tamil Nadu Vivasyigal Sangam Durai Manikkam, and CPI (M) affiliated Tamilaga Vivasayigal Sangam general secretary P. Shanmugham.\n\nWhen the police blocked the protesters near the Rajarajan Manimandapam, there ensued an argument between the agitators and police over the delay in taking action against the offenders. Farmers’ leaders questioned the delay in acting against the offenders even a week after the police got hold of the video clearly depicting the attack on Balan.\n\nWhen the police tried to pacify the protesters and failed, they took into custody 75 farmers, including Balan and leaders of Left wing farmers’ associations such as Samy Natarajan, P. Balasundaram, and A. Panneerselvam.\n\nThe protesters insisted that even after 10 days of assault on Balan, penal action has not been initiated against the offenders which itself was proof enough that the State government was against the interest of the farmers and siding with the offending lending agency, the farmers alleged.\n\nMr. Shanmugham said they would meet the Superintendent of Police and based on the outcome of the meeting, action would be decided. The State government must constitute an independent commission to look into the farmer-lending agency conflict and address the issue properly, he demanded.\n\nDemo in Tiruvarur\n\nStressing the same demands, workers of the Tamil Nadu Vivasayigal Sangam led by district secretary P.S. Masilamani, and president T. Rengarajan staged a demonstration in front of the Kotak Mahindra Bank branch in Tiruvarur on Tuesday.", 
    "section": "national", 
    "title": "Farmers’ association members stage protest, arrested", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}