{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Hindu Religious and Charitable Endowments (HR and CE) Department has informed the Madras High Court Bench here that it has issued a circular to all temples under its control in the State to give up the practice of permitting temporary shops during festive occasions since they cause inconvenience and health hazards to devotees.\n\nThe submission was made before a Division Bench of Justices S. Manikumar and C.T. Selvam during the hearing of a public interest litigation petition filed by a resident of Kanyakumari district seeking a direction to the Collector, Superintendent of Police and HR and CE Department officials to remove temporary shops around the Bhagavathiamman Temple.\n\nContesting the PIL petition, K. Sathiya Singh, counsel for the Joint Commissioner of HR and CE at Suchindram, produced a circular issued by the Additional Commissioner (General) on June 17 last urging all Joint Commissioners, Assistant Commissioners and Executive Officers of various temples across the State to avoid temporary shops during local festivals.\n\nThe circular had given six reasons for the temples to desist from the practice of earning revenue by issuing licence to put up temporary shops and the first of them was the hindrance caused to devotees, other pedestrians and vehicle users.\n\nIt also stated that the shops set up in and around the temples might lead to unnecessary chaos even in nearby streets.\n\nThe other reasons given by the Additional Commissioner was the threat of health hazards that could be caused due to pollution created by littering and stagnation of dirty water besides the possibility of sale of unhygienic food items by the shopkeepers. He also apprehended increase in noise pollution as well as incidents of theft and chain snatching if the shops were allowed.\n\nAfter recording the contents of the circular, the judges dismissed the petition after observing that a PIL could not be entertained on “bald allegations.”", 
    "section": "national", 
    "title": "High Court informed of circular against allowing shops at temple festivals", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}