{
    "author": [
        "M K"
    ], 
    "text": "A continuous stream of visitors added to her frustration; likely to be given counselling today\n\nTwo-days after her husband Shankar was hacked to death in daylight in a public place, S. Kausalya (19) who also suffered an injury on her forehead was recuperating in hospital. “But the girl who saw her husband die in front of her eyes is deeply depressed and frustrated,” a senior doctor in Coimbatore Medical College Hospital (CMCH) said.\n\nKausalya is in the intensive care unit where she is expected to remain for a day or two. Hospital authorities said that many persons met her and inquired about the incident on Monday which had added to her stress. The hospital authorities said she had rest without disturbance on Tuesday.\n\nA senior hospital official said that they are planning to give her counselling on Wednesday to help her overcome the stress. A neurosurgeon will also examine her on Wednesday and then decide on the further course of treatment.\n\nPermission denied\n\nOn Tuesday, a lawyer was allowed to meet her and interact with her for five minutes. Other activists who tried to meet her were denied permission, as the girl needed rest. A television journalist tried to interview Kausalya pretending to be an activist and was stopped by the hospital authorities. Policemen stood guard, since the threat on her life was still real.\n\nOn Monday night, various Dalit outfits and women’s forums protested at the hospital, as the hospital authorities did not allow Kausalya to see her husband’s body before it was taken away for the final rites. The last time she saw him was when they were both brought to CMCH from Udumalpet in the ambulance. He died enroute.\n\nHospital sources said that decision to disallow her to see the body was taken after considering her health condition. She was in a bad shape due to her injuries and the emotional trauma she had undergone, doctors said.\n\nA neurosurgeon will also examine her and decide on the further course of treatment", 
    "section": "national", 
    "title": "‘Honour’ killing victim’s wife still traumatised", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}