{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "A machine to make wipes installed at Centre of Excellence (Industrial Textiles) at the campus of PSG Institute of Technology and Applied Research in Coimbatore onTuesday.- Photo: M. Periasamy\n\nCoimbatore, which is one of the major textile centres in the country, is also home to three centres of excellence, set up by the Ministry of Textiles.\n\nWith several medium and large-scale industries here looking at technical textiles for diverse applications, these centres will promote innovative applications for textiles, especially using non-woven materials.\n\nThe CoEs for industrial textiles and home textiles at the PSG Institute of Technology and Applied Research campus and the one for medical textiles at the South India Textile Research Association (SITRA) will soon have incubation facilities (plug-and-play model).\n\nAccording to data available, the market size for industrial textiles in the country is Rs. 9,929 crore, for medical textiles it is Rs. 4,282 crore and for home textiles, it is Rs. 9,274 crore. The market is growing at the rate of six per cent to 14 per cent annually, depending on the product.\n\nIn 2012-2013, import of industrial textiles was 22 per cent of the total technical textiles imported (Rs. 6,525 crore), medical textiles were 15 per cent and home textiles were seven per cent. Export of technical textiles was to the tune of Rs. 7,117 crore and of this 15.1 per cent was industrial textiles, 9.9 per cent was medical textiles, and 10.9 per cent was home textiles.\n\nThe 60,000 sq.ft centre of excellence for industrial textiles was set up at a total cost of nearly Rs. 40 crore. Of this, the land and building was by the PSG Institute and the Ministry had sanctioned Rs. 25 crore. The focused incubation centre will come up at a cost of Rs. 2.85 crore and it will look at filtration products, coir and acoustic materials.\n\nAccording to G. Thilagavathi, head of the department of Textile Technology at PSG College of Technology, the centre promotes research, encourages industry to use the machinery installed, takes up testing, imparts training, and also manufactures products for commercial use. It has set up full production lines to make wet wipes for diverse uses and needle punching coir products and is working on various raw materials to produce non-woven mats that can be used as filter in different industries.\n\n“Some of the testing equipment are not available elsewhere and the industry can use it. Similarly, industries can join hands with the centre to take up research of products for specific applications. The centre can be used by any industry,” she says. The centre has signed agreements with some industries to take up product-specific research.\n\nWith more focus on research and better awareness on the facilities available at the centre, development and manufacture of products for industrial purpose can grow and these will be cost-effective too, she says.", 
    "section": "national", 
    "title": "Innovative applications to be promoted for textiles", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}