{
    "author": [
        "M K"
    ], 
    "text": "Not long after the reported ‘honour killing’ in Udumalpet, a couple approached the Thanthai Periyar Dravida Kazhagam (TPDK) in Coimbatore on Monday asking for help to have an inter-caste wedding.\n\nThe Kazhagam, authorised to enable registration of inter-caste marriages, has organised more than 3,000 inter-caste marriages since 2000. “We performed 50 marriages a year initially. It is steadily increasing every year. Last year, we performed 385 such marriages,” state general secretary of the organisation, Ku. Ramakrishnan, said.\n\nHe said that the number of inter-caste marriages had actually gone up over the last two decades with more girls getting educated and getting better exposure. Around 15 per cent of the couples were students.\n\n“Fifteen per cent are from the IT sector, of them one or both are from other districts or nearby States,” he said. Twenty per cent are inter-faith marriages.\n\nA third of the marriages involved one of them from the southern and central districts, who were getting married here due to fear of attack by the Caste Hindus.\n\nParents of either the groom or bride attended the marriage in only 10 per cent of the cases and in only two per cent of the cases did both the father and mother attend. “Though they were not against the marriage they preferred keeping it a low-key affair, over fear of being sidelined by their community,” he added.\n\nPresident of Social Justice Movement N. Paneerselvam who has organised 150 inter-caste marriages from January 2015 said that there were very few marriages that take place without a problem. “We have even been threatened by the Caste Hindu families on many occasions,” he said.\n\n“After performing such marriages we take the couple to the police station,” he said. He said that doing so gives a strong message to the families of the bride and groom as the police warn the families not to harm or disturb the young couple. “Down the line some of the families accept the couple setting aside casteist sentiments,” he added.\n\nLast year, Thanthai Periyar Dravida Kazhagam had performed 385 marriages", 
    "section": "national", 
    "title": "Inter-caste marriages on rise despite odds", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}