{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Lack of basic facilities, including drinking water, at Thoothukudi railway station has irked passengers. The rail passengers could only find a refreshment stall closed all the time at the station.\n\nOwing to its closure, no food or beverage was available for the passengers, A. Ramachandran of Thoothukudi, who frequently travels by train to Chennai, said here on Tuesday.\n\nIt became a formidable task for the family of G. Sankaranarayanan to buy milk for his one-and-a-half-year-old baby at the station.\n\nHe said that his family reached the station some 15 minutes earlier to board the Mysuru Express recently, but milk could not be bought in time ahead of departure. Since he was new to Thoothukudi, it became difficult for him to locate stalls selling milk in the vicinity of the station.\n\nHe said that he could buy milk only at Kovilpatti station. Only one small refreshment stall was functioning at Thoothukudi station till a few months back.\n\nWhile the Railway Ministry had envisaged several developments, including ‘Wi-Fi’ facility and bio-toilet, to modernise railway stations, it was a shame that Thoothukudi railway station did not have even a refreshment stall to provide drinking water. Though water taps were available at the platform, the quality of water was not good, R. Muthuvel, another affected passenger, said.\n\nThe refreshment stall was open when there were only two trains – Mysuru Express and Pearl City Express – operating from the station.\n\nNow, there were more trains with the introduction of Coimbatore link express, since July, 2011, and Guruvayur link express, from September 2014. But the basic facilities had not improved, S. Allen, a passenger, said.\n\nM. Piramanayagam, secretary, Thoothukudi District Passengers’ Welfare Association, told The Hindu that the refreshment stall remained closed for over six months and several passengers affected by lack of facilities had brought the issue to the notice of the association.\n\nHe said the association members, including its president A. Kalyanasundaram, met Southern Railway General Manager Vashishta Johri during his inspection of Tirunelveli junction, and submitted a memorandum seeking better passenger amenities.", 
    "section": "national", 
    "title": "Lack of facilities at railway station irks passengers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}