{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Anmeega Jothidam’ by P. A. Ponniah, Railway Colony, 7.30 p.m.\n\nMuneeswarar Temple: Masi festival; devotional music by S. Nallathambi, Munsif Court Road, Tirumangalam, 8 p.m.\n\nSaiva Siddhantha Sabha: Discourse on ‘Tirumandiram’ by T. Padmavathi, South Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Tiruvarutpa’ by M. Vijayaraman, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nRamakrishna Mutt: Aarathi, New Natham Road, 6.30 p.m.\n\nChinmaya Mission: Guru Dakshinamurthy varushabishekam; Vigneswara puja, 7.30 a.m.; Ganapathi homam, 8 a.m.; abishekam, 9.15 a.m.; sahasranama archana, 5 p.m.; Thevaram, Tiruvasagam, Tiruvarutpa, Tirumandiram recitation by Pichammal Subramanian, 7{+t}{+h}Cross Street, Doak Nagar, 6.30 p.m.\n\nCULTURE\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nGENERAL\n\nMadurai Kamaraj University: S. Venkataraman speaks on “Historiographical perspective of Tirugnanasambandar,” 10.30 a.m.; on “Nammalvar,” Seminar Hall, School of Religions, Philosophy and Humanist Thought, 2.30 p.m.\n\nSri Meenakshi Government College for Women: Seminar on “Trends and opportunities in commerce literacy today;” Kayal Auditorium, 10 a.m.\n\nThiagarajar College: Biotalenz 16, inter-collegiate science competition, 8.30 a.m.; Girl Students’ Guidance Cell meeting, 9 a.m.; O. B. Balaji of Life Insurance Corporation of India speaks on “De-monetisation for corruption-free India,” Maraimalai Adigal Hall, 11.30 a.m.\n\nSaraswathi Narayanan College: World Consumer Day celebration; A. Paneerselvam, District Judge, addresses; Perungudi, 10 a.m.\n\nSourashtra College: National seminar on “Conservation methods and biopotential assessment of biodiversity;” Silver Jubilee Hall, 9.45 a.m.\n\nMannar Thirumalai Naicker College: Short film show on “Gender equality,” G. Sundararajan Seminar Hall, 12 noon\n\nNadar Mahajana Sangam Sermathai Vasan College for Women: NSS camp, Koodakoil, 10 a.m.\n\nMadurai District Tiny and Small Scale Industries Association: Meeting on Union Budget; J. Britto and M. Lakshmanan address, Maditssia Hall, 5.30 p.m.\n\nM. S. Chellamuthu Institute of Mental Health and Rehabilitation: Programme on “Concept of mental health and positive mental health,” 14 Vaidyanatha Iyer Street, Shenoy Nagar, 10 a.m.\n\nSBI: Inauguration of mobile ATM, Maduram Complex, 2 Dr. Ambedkar Road, 1.30 p.m.\n\nNala Dental Hospital: Programme on “Benefits of dental implants” and free dental consultation, Vallabhai Road, Chokkikulam, 11 a.m.\n\nAlcoholics Anonymous: Meeting, AG Church, Melur, 6.30 p.m.; Dheep Hospital and Loyola Technical Institute, Gnanaolivupuram, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}