{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“Additional train services in Madurai- Chennai section likely”\n\nMadurai– Vanchi Maniyachi– Thoothukudi track doubling work would commence this financial year, and train service on the broad gauge being laid in Shencottai– Punalur section would commence before the end of this fiscal, said Southern Railway General Manager Vashishta Johri here on Tuesday.\n\nSpeaking to reporters after inspecting Tenkasi and Tirunelveli railway junctions, Mr. Johri said that the first phase work on Madurai– Vanchi Maniyachi– Thoothukudi track doubling would commence this financial year with the Rs. 100 crore allotted in the Railway Budget. Work on Vanchi Maniyachi– Tirunelveli– Kanyakumari line would be taken up after the first phase was completed.\n\n“As the double track between Chennai and Madurai is likely to be commissioned before the end of this fiscal, additional train services may be introduced in this section,” Mr. Johri noted.\n\nShencottai– Punalur gauge conversion work would be completed and train service in this section would start before the end of this fiscal as work on this much-awaited project was steadily progressing.\n\nHe said that due attention was being given to ensure better passenger–friendly amenities on trains and also at railway stations by allocating adequate funds every year. “After sanctioning escalator to Tirunelveli junction, the Southern Railway has allotted a lift for this busy junction for the benefit of aged passengers,” Mr. Johri said.\n\nBio-toilets\n\nHe said that bio-toilets, each costing about Rs. 1 lakh, would be introduced in a phased manner and informed that the average speed of express trains would be increased to 90 km per hour in select sections.\n\nThe General Manager was accompanied by Divisional Railway Manager (Madurai) Sunil Kumar Garg, Chief Administrative Officer (Construction) P.K. Mishra, Principal Chief Engineer S.S. Gupta, Chief Operating Manager S. Anantharaman, Chief Commercial Manager A.K. Saxena and Chief Security Officer John Thomas.\n\nThe officials, after visiting Tenkasi junction, inspected the stations, railway colonies, running rooms, railway lines and maintenance facilities at Tirunelveli junction, curves on railway lines, railway level crossing gates and bridges to see whether technical, safety and operational parameters were maintained.\n\nAt Tirunelveli, the General Manager opened and inspected Integrated Office Complex. He also opened and viewed the exhibition on bio-toilets at Tirunelveli.\n\n“Due attention is given to ensure better passenger-friendly amenities on trains and at railway stations”", 
    "section": "national", 
    "title": "Madurai-Thoothukudi track doubling work to start this fiscal", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}