{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Managers should keep trying new ideas, says Ajit Balakrishnan\n\nAjit Balakrishnan, Chairman and CEO, Rediff.com India Ltd (third from left), Dr. Prafulla Agnihotri, Director IIM-Tiruchi, andS. Karunamoorthy, Chairman Convocation, IIM-Tiruchi, with the gold medal winners at the fourth convocation in Tiruchi on Tuesday.— PHOTO: A. MURALITHARAN\n\nStating that the role of managers has seen paradigm shift over the years, Ajit Balakrishnan, Chairman and Chief Executive Officer, Rediff.com India Ltd, on Tuesday asked the management professionals to learn the nuances of failure so as to re-emerge strongly in crisis situations.\n\nDelivering the convocation address at the Indian Institute of Management-Tiruchi held here, he said that managerial positions were once regarded as highly decorated ones with great powers. Their jobs were highly secured. However, the 2007-08 financial crisis had changed the role of managers. There were instances in which IT companies fired managers en masse. Nowadays, they could not enjoy the comforts that they had enjoyed till a few years ago. They had to work hard to prove their worthiness to the companies.\n\nMr. Balakrishnan said most of the companies whether they were nationalised or private banks, advertisement companies or consumer marketing or others had been reeling under the invasion of digital era. The products were keeping on changing with new devices. The regulatory functions of companies and managers too had been changing regularly. Hence, it was important for the present- day managers to quickly sail along the digital changes taking place.\n\nWhile pointing out the focus of management studies on success, he said there had not been much focus on failure. It had focussed a lot on failure to enable the managers to recover quickly.\n\nManagers would have to encounter failure in their ideas, efforts, or projects. They might encounter several failures. However, they should not stop but keep trying with new ideas until they achieved success. But the managers must know the technique of getting over failures quickly and wisely, he said.\n\nR. Karunamoorthy, Convocation Chairman, and Prafulla Agnihotri, Director, spoke.", 
    "section": "national", 
    "title": "Managers should prove their worth, says Rediff CEO", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}