{
    "author": [
        "K Raju"
    ], 
    "text": "Officials stick awareness stickers on cylinders to reach out to every house\n\nCollector T.N. Hariharan affixing stickers on LPG cylinders in Dindigul on Tuesday to create awareness among voters.— PHOTO: G. Karthikeyan\n\nLPG cylinders have become ideal campaigners as the district election officials have used them to create awareness among voters, especially women, as part of Systematic Voters’ Education and Electoral Participation programme.\n\nThe district election officials stuck awareness stickers on domestic LPG cylinders to cover every household in Dindigul on Tuesday, by roping in LPG distributors and supply staff for this work.\n\nSimilar stickers were stuck in the front halls of cinema theatres in the city.\n\nThe administration wanted to make use of all the places where public gathered in large numbers to motivate voters to cast their votes. Local cable television networks were also used to take the message to the voters in urban and rural areas, said Collector T.N. Hariharan, while kick-starting the awareness campaign at YMR Patti in the city in the morning.\n\nTheni\n\nThe district election officials intensified campaign among the public about the importance of exercising their franchise, said Theni Collector N. Venkatachalam.\n\nLaunching the campaign at Theni central bus stand on Tuesday, he said that a ‘video van’ would be used to screen short films and video shows on the rights and responsibilities of the voters at the bus stand regularly. Self-help groups and college and school students would also be roped in to intensify the campaign in urban and rural areas through rallies, seminars, cultural programmes and distribution of pamphlets.\n\nShort films and video shows would also be screened in town panchayats, municipalities and village panchayats, he added.\n\nField staff of Magalir Thittam and Pudhu Vaazhvu Thittam were also advised to monitor their areas and inform to the district administration if there were any violation of model code.\n\nAt the same time, they should campaign about the importance of enrolling all eligible persons in the electoral roll.", 
    "section": "national", 
    "title": "Now, LPG cylinders carry message of voting right", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}