{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Banks asked to provide documents while transporting cash\n\nDistrict Collector K.S. Palanisamy launching a signature campaign to motivate college students and new voters at St. Joseph's College in Tiruchi on Tuesday.— PHOTO: M. SRINATH\n\nIn an attempt to improve the voting percentage and ensure that all eligible voters exercised their franchise, the district administration on Tuesday launched a signature campaign to enlist the commitment of voters.\n\nThe initiative was launched as part of the Election Commission’s Systematic Voters Education and Electoral Participation (SVEEP) programme.\n\nDistrict Collector K.S. Palanisamy launched the campaign on the St. Joseph’s College campus by affixing his signature.\n\nMr. Palanisamy said various initiatives had been taken under SVEEP to urge voters to cast their votes without fail and as per their conscience. He urged youths who had attained the age of 18 to enrol their names in the electoral rolls.\n\nThey should try and raise awareness on the importance of people exercising their franchise by sensitising their family members, neighbours, and relatives, he said.\n\nThe district administration had launched awareness measures through distribution of pamphlets, street plays, screening of short films, public demonstration of electronic voting machines, and cultural programmes.\n\nThe signature campaign was intended to take the message to the people through school and college students, he said.\n\nMeanwhile, the Department of Information and Public Relations had started screening short films with messages from celebrities such as sportspersons, film actors, and musicians at places of public congregation. The personalities highlight the importance of young voters to enrol their names and all eligible voters exercising their franchise.\n\nMr. Palanisamy on Monday instructed bankers and financial institutions to ensure that agencies transporting cash for banks and ATMs had valid documents with them. Those transporting the cash should also carry valid identity cards.\n\nSpeaking at a meeting with bankers here, Mr. Palaisamy informed the bankers that they had to inform suspicious transactions in bank accounts over the past two months to the election authorities.\n\nDetails of all transactions above Rs. 1 lakh after the announcement of the election should be conveyed to the District Election Officer.\n\nWithdrawals or deposits above Rs. 1 lakh from the accounts of candidates and their dependents should be intimated to the authorities.\n\nHe urged the bank officials to extend their full cooperation to election officials in enforcing the model code of conduct.", 
    "section": "national", 
    "title": "Officials launch ‘SVEEP’ for higher voter turnout", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}