{
    "author": [
        "Staff Reporter"
    ], 
    "text": "As part of the ‘Gift Organ - Give Life’ initiative of Sri Ramakrishna Multi Specialty Hospital, an attempt will be made to enter the Guinness Book of Records by drawing maximum number of people in eight hours to pledge for organ donation.\n\nThe event will be held at SNR Sons College ground near Nava India, from 8 a.m. to 4 p.m., on Saturday.\n\nChief Operating Officer of the hospital V. Ramakrishnan said that the existing record was the pledging by 10,451 persons at Rohtak in Haryana in 2013.\n\n“We expect as many as 15,000 persons aged above 18 years to sign for voluntary organ donation,” he said. A good number of students from all the 15 institutions run by their group of institutions would be pledging their organs for donation on that day.\n\nChief Business Officer Swathy Rohit said that the hospital conducted a campaign for three months for the event, during which they interacted with students from colleges, service-minded organisations and NGOs to take part in the event. “Focus is to create awareness on organ donation and not just to make it a record breaking attempt,” she said.\n\nHospital dean P. Sukumaran said that every year around five lakh people in India die because of non-availability of vital organs.\n\nHe said that around 2 lakh die due to liver diseases resulting in want of liver, 1.5 lakh for want of kidneys and around 50,000 for want of heart. These were in addition to the nearly 10 lakh Indian who need eyes.\n\n“But, only around 5,000 of them manage to get the second lease of life by getting organs from donors,” Dr. Sukumaran said and added that this was excluding eyes as there is a commendable increase in the number of eye donations. According to him, there is better awareness on eye and kidney donation, which is still insufficient.\n\nHe cited examples of renowned celebrities and politicians who died due to unavailability of organs. He said a live person could donate his liver and kidney, whereas a brain dead person can donate eight organs including eyes, heart, skin, pancreas, small intestine and lungs as well.\n\nContact\n\nFor details and to take part in the event visit www.giftorgangivelife.com or call 93641 23123.\n\nThe event will be held at SNR Sons College ground near Nava India on Saturday", 
    "section": "national", 
    "title": "Organ donation drive: hospital eyes Guinness Book of Records", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}