{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Scribes arranged for 41 differently abled students; 12 given extra time\n\nStudents appearing for the SSLC examination in Vellore on Tuesday.- Photo: C. Venkatachalapathy\n\nA total of 55,060 students (27,747 boys and 27,313 girls) have appeared for the SSLC examinations in Vellore district. The examinations, which commenced on Tuesday, will go on till April 13.\n\nThe are being held in 208 centres across the district. Officials said 777 regular students and 104 private candidates were absent for the first exam — Language paper I.\n\nScribes arranged\n\nThe School Education Department has arranged for scribes to enable 41 differently abled students to take up the examination. Also 12 differently abled students have been given an additional hour to write the exam, according to a press release.\n\nAs many as 2,800 hall invigilators have been posted for the examinations. Security arrangements are in place at all exam centres. There are nine custodian centres in Tirupattur educational district and 13 in Vellore educational district for safe storage of question papers.\n\nQuestion papers were taken from the custodian centres to the exam centres by 52 route officers. These officers also collected the answer scripts after the day’s exam, and handed over to the collection centres. Vehicles with armed police security have been arranged for this purpose.\n\nStanding squads have been formed for all the exam centres. Flying squads headed by officials including the Chief Educational Officer (CEO), Vellore and District Educational Officers of Vellore and Tirupattur have been formed to check on malpractices during the exams.\n\nCollector R. Nanthagopal along with CEO R. Bhoopathy inspected the exam centre at E.V.R. Nagammai Government Girls Higher Secondary School.", 
    "section": "national", 
    "title": "Over 55,000 students take up SSLC exams in Vellore", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}