{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The family of the 17-year-old-boy, who was allegedly assaulted by policemen, after being mistaken for a thief, will be approaching the State Human Rights Commission (SHRC) on Wednesday. They also want the police to conduct an identification parade.\n\nOn Saturday evening, Vincent, a resident of Kannagi Nagar, lodged a complaint with the city police commissioner’s office alleging that a group of policemen had assaulted his 17-year-old son, mistaking him for a cell-phone thief.\n\nHe was blindfolded and taken to a spot near Velachery Railway station.\n\nAccording to Vincent, his son Ganesh (name changed) dropped out of school after Class VII and began assisting his father at a scrap shop in Pudupet, along with his older brother.\n\nOn Friday night, a few men claiming to be policemen came to his house and dragged him away. They took him in a jeep.\n\nThe ‘policemen’ asked him to come to the Mylapore police station. However, despite searching, they could not find him.\n\n“Around 1 a.m. on Saturday, my eldest son called me and said Ganesh had returned home,” added Sumathi, Ganesh’s mother.\n\nInjured\n\nThe 17-year-old was severly injured and was unable to speak. He had injuries on his lips and torso and was unable to eat.\n\n“After coming to know they had picked up the wrong person, they dropped him near Thoraipakkam and gave him Rs. 10 for him to meet some basic expenses. He suffered an epileptic attack on Sunday and was admitted to a private hospital,” Vincent told The Hindu .\n\nAccording to Vincent, a few years ago, his eldest son was also picked up by the Kotturpuram police.\n\n“They said it was in connection with an accident case. He was also brutally beaten up and different cases were filed against him,” he added. Their advocate S. Rajan said that it was better to conduct an identification parade.\n\n“An inspector from Kannagi Nagar has taken a report from him,” he said.\n\nPetition submitted\n\nA petition has been submitted to the State commission for Child Rights and National commission for Child Rights by League for Child Rights Tamil Nadu & Puducherry, saidA. DevaneyanJoint Convenor.", 
    "section": "national", 
    "title": "Parents of teen allegedly beaten up by police to approach SHRC", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}