{
    "author": [
        "Ta Mil Nadu Bureau"
    ], 
    "text": "Alleging that murder, burglary and sexual violence were on the rise in Tamil Nadu, DMK treasurer M.K. Stalin said the failure of the police department to act on the complaint of Kausalya had resulted in the murder of her Dalit husband Shankar in Udumalapet.\n\nIn a statement here, he said the murder of Dalit youth Shankar in a crowded place had proved that the law and order had gone beyond the control of the government.\n\nHe claimed that gun culture was breeding in Coimbatore, the Manchester of South India.\n\n“People feel vulnerable and a sense of fear has engulfed the society. At least now the State Government should wake up to the reality and maintain law and order,” he said.\n\nSignificantly, Mr Stalin’s statement was silent on the DMK’s stand on murders triggered by inter-caste marriages involving couples belonging to the dominant Hindu communities and Dalits.\n\nEnact law to prevent ‘honour’ killings: CPI (M)\n\nCriticising the two Dravidian majors for not commenting on the Udumalpet ‘honour’ killing, CPI (M) State secretary G. Ramakrishnan appealed to all parties to rise above politics and enact a law to prevent such gruesome killings in the name of caste pride.\n\nThough he did not want to politicise the issue, Mr. Ramakrishnan told reporters that he saw a pattern in the way the AIADMK and DMK acted politically. The two parties did not comment on the granite mining scam that rocked the State sometime ago.The two parties were in power in the 20 years when the illegal granite mining took place.\n\nLikewise, when AIADMK general secretary Jayalalithaa was convicted in the disproportionate assets case, DMK leader M. Karunanidhi said he had nothing to offer in comments. Such instances revealed that the two parties were keen on ruling the State alternately, he claimed adding that the People’s Welfare Front has been formed to break the bi-polarity.\n\nLater addressing reporters, he denied that it was political opportunism on the part of the CPI (M) to criticise the two Dravidian parties after being in coalition with them for the past 20 years. The CPI (M) tried hard to correct the two parties but failed and got frustrated.\n\nConviction rate in crimes against Dalits poor: H. Raja\n\nThe State government was not serious in pursuing cases of atrocities against Dalits and about 71 per cent of the accused have been acquitted, said the BJP national secretary H. Raja.\n\nAddressing reporters at the airport, he said the government should step up its efforts to improve the conviction rate in cases against Dalits.\n\nGovt. should take full responsibility: Vijayakant\n\nMeanwhile, DMDK leader Vijayakant said the AIADMK government, which asserted in the Assembly that there were no honour killings in Tamil Nadu and hence there was no need to enact a special law to curb it, should take full responsibility for the murder of Shankar.\n\nManithaneya Makkal Katchi condemned the brutal murder of Dalit boy, Shankar, in Udamalpet recently by caste Hindus for marrying a girl from a dominant caste, on Tuesday. “The party condemns the barbaric act in strongest possible terms. The human kind can never accept such an act,” said the statement sent by M.H. Jawahirullah, president, Manithaneya Makkal Katchi. He also said that the increase in the number of caste-based killings over the years is a cause for concern. He also urged the National Commission for Scheduled Castes to play a proactive role. He said, “The National Commission for Scheduled Castes must recommend measures that would stop such killings in future.”", 
    "section": "national", 
    "title": "Police inaction led to murder of Dalit youth, says Stalin", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}