{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The nominal excise duty of one per cent (without input tax credit) and 12.5 per cent (with input tax credit) imposed in the Union Budget on articles of jewellery is easy to comply with, said S. Arokia Raj, Joint Commissioner of Central Excise here.\n\nSpeaking to presspersons here on Tuesday, he said that doubts have been expressed by the trade and industry regarding the levy. Easy compliance with provision for on line application for registration, payment of excise duty and filing of returns, with zero interface with the departmental officers are some of the salient features of this new levy.\n\nMr. Arokia Raj said that Central Excise officers have been directed not to visit the premises of jewellery manufacturers. Articles of silver jewellery [other than those studded with diamonds, ruby, emerald or sapphire] are exempt from this duty.\n\nAn artisan or goldsmith who only manufactures jewellery on job-work basis is not required to register with the Central Excise, pay duty and file returns, as all these obligations will be on the principal manufacturers.\n\nIf the turn-over of a jeweller during preceding financial year was more than Rs. 12 crore, he will be liable to excise duty. Jewellers having turnover below Rs. 12 crore during the preceding financial year will be eligible for exemption up to Rs. six crore during next financial year. Such small jewellers will be eligible for exemption up to Rs. 50 lakh for the month of March 2016.\n\nFor determination of eligibility for the SSI exemption for the month of March 2016 or financial year 2016-17, a certificate from a chartered accountant based on the books of accounts for 2014-15, 2015-16 respectively, would suffice.\n\nFacility of optional centralised registration has also been provided. Thus, there is no need for a jewellery manufacturer to take separate registration.\n\nMr. Arokia Raj said that the Finance Ministry has directed all the Central Excise offices to grant hassle- free registrations through online, within two working days of submission of the registration application. There will not be any post registration physical verification of the premises. For on-line registration trade and industry personnel can visit:https:///www.aces.gov.in/.\n\nJeweller’s private records or records for State VAT or records for Bureau of Indian Standards (in the case of hallmarked jewellery) will be accepted for all Central Excise purposes. Also, there is no requirement to file a stock declaration to the jurisdictional central excise authorities.\n\nExcise duty is to be paid on monthly basis and not on each clearance. First instalment of duty payment for the month of March 2016 to be paid by March 31.\n\nSimplified quarterly return has also been prescribed for the duty paying jewellers, the Joint Commissioner added.", 
    "section": "national", 
    "title": "‘Provide hassle-free registrations through online for jewellers’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}