{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Principal District and Sessions Court here on Tuesday refused to adjourn the temple pujari suicide case for long and posted it to Wednesday for continuous trial. It also directed police to produce all the 22 witnesses before it without fail.\n\nAll the seven accused appeared before the court on Tuesday.\n\nOn the first day of trial, the 22 witnesses as well as Special Public Prosecutor B. Mohan did not appear before the court. But his junior appeared before the court and sought time to study the charge sheet and add more sections in it. He appealed for adjournment of the case for some more days.\n\nDefence counsel M. Kannappan, however, argued that lawyers did not have the right to alter the charge sheet submitted in the court. Only the court had the power to do so, if necessary, he said.\n\nOn hearing their argument, Principal District Judge R. Poornima said that the court would not allow the case to be dragged for long.\n\nAlready, the Madras High Court had issued guidelines in this connection, she said, adding the trial should be started first. Meanwhile, the court would decide on adding more sections in the charge sheet.\n\nShe asked why the police failed to produce the witnesses before the court.\n\nThey should produce all the 22 witnesses on Wednesday without fail. The court would write to the High Court in this regard, she said.\n\nMr. Mohan had on Monday sought time to study the case and the charge sheet, and the judge had refused to allow more time, stating that she had to follow the High Court guidelines.\n\nCharges were framed against O. Raja, brother of Finance Minister O. Paneerselvam, and others on December 15, 2015.\n\nTheni District Court had transferred the case to Dindigul District Court on November 25 last year on the direction of the Madurai Bench of the Madras High Court.\n\nWithin four months\n\nThe Bench also directed the subordinate court to complete the case within four months.\n\nThe case pertains to the suicide of S. Nagamuthu (22) of T. Kallupatti village, a Dalit, who worked as pujari in Sri Kailasanathar Hill Temple in Periyakulam, on December 8, 2012, after he was allegedly subjected to harassment.", 
    "section": "national", 
    "title": "Pujari suicide case: judge orders trial from today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}