{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The People’s Welfare Front would wait for Desiya Murpokku Dravida Kazhagam leader Vijayakant to give his consent to come into its fold, said PWF coordinator and Marumalarchi Dravida Munnetra Kazhagam general secretary Vaiko.\n\nTalking to reporters before taking part in the party’s State-level youth wing organisers’ meeting held here on Tuesday, he said that DMDK leader Premalatha announced that the alliance option was not closed. Mr. Vijayakant rejected only the All India Anna Dravida Munnetra Kazhagam and the Dravida Munnetra Kazhagam. “We invited him and our invitation was not rejected by him till now. It has life. Let us not discuss it further,” he said.\n\nMr. Vaiko did not answer the queries on possible change in the Front’s name and DMDK’s negotiation with the Bharatiya Janata Party.\n\nStrongly condemning the murder of a Dalit youth in Udumalpet, he said that honour killing had become a regular occurrence in the State. Police were responsible for this murder. The couple had sought protection for their life. But the police did not take any action. Stern action should be taken against the instigators of the honour killing, he stressed.\n\nExpressing grave concern over the farmer’s suicide in Ariyalur, he said that seizing the tractor even after settling 90 per cent of the loan was atrocious and highly condemnable.\n\nThe police too were involved in seizure activities. As per records, 2,420 farmers committed suicide in the State in recent times. But the number could be more than 5,000 as several cases were not recorded, he noted.\n\nHe said that the fifth phase of PWF’s campaign would commence on March 29 in southern districts.\n\nReferring to the failure of emergence of an alliance between the DMK and the DMDK, Mr. Vaiko said that DMK chief M. Karunanidhi, who was a big political strategist, slipped in this case.\n\nReacting to a statement made by expelled AIADMK leader P. Karuppaiah, he said that Mr. Karuppaiah should not forget his statement on the Sri Lankan issue and the stand taken by the DMK in the past.", 
    "section": "national", 
    "title": "PWF will wait for Vijayakant, says Vaiko", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}