{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Justice P.R. Gokulakrishnan, former Chief Justice of High Court of Gujarat, awarding a scholarship to a student at VIT University on Tuesday. VIT Chancellor G. Viswanathan looks on.Photo: C. Venkatachalapathy\n\nScholarships worth Rs. 42 lakh were distributed to 501 students on behalf of Universal Higher Education Trust (UHET) at VIT University on Tuesday.\n\nUHET was established four years ago to extend a helping hand to meritorious students from poor families to pursue higher education.\n\nIt was started with the aim of ensuring that these students, who secured admission in higher educational institutions on successful completion of Class XII, did not discontinue their education owing to inability to pay the fees, a press release said.\n\nJustice P. R. Gokulakrishnan, former Chief Justice, High Court of Gujarat, handed over the scholarships. This was under the second phase of the scheme for 2015-2016. He appealed to the students to utilise the knowledge acquired during higher education for the development of the country.\n\nG. Viswanathan, VIT Chancellor and president of UHET, said scholarships totalling Rs. 1,90,35,000 was disbursed to 1,717 students through the trust during the current academic year. Among the beneficiaries, 75 per cent were first generation learners, and 65 per cent women. Mr. Viswanathan added that the trust, which was initially launched in Gudiyatham and K.V. Kuppam, had been extended to all 13 Assembly constituencies in Vellore district. He pointed out that any country which gave importance to the higher education of women would become an economically developed one. He also urged the Central and State governments to enable all those who successfully completed their school education to pursue higher education under the Right to Compulsory Education Act.\n\nK. Sathyanarayanan, VIT Registrar, was present.", 
    "section": "national", 
    "title": "Scholarships distributed", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}