{
    "author": [
        "Special Correspondent"
    ], 
    "text": "On the track:Collector S Natarajan inspecting installation of GPS devices in flying squad vehicles at the Collectorate in Ramanathapuram on Tuesday.— Photo: L. Balachandar\n\nAfter organising series of SVEEP (Systematic Voters’ Education and Electoral Participation) activities to achieve 100 per cent polling in the May 16 Assembly elections, the District Election Officer has decided to involve school students to motivate their parents to take part in the democratic process.\n\nTalking to reporters here on Tuesday, District Election Officer and Collector S. Natarajan said the authorities have tied up with the Education department to involve school students, from LKG to plus two to motivate their parents to exercise their franchise without fail.\n\nThe students would be asked to obtain signatures from their parents and other voters in the family in forms, pledging to caste their votes in the Assembly elections. In the first phase, 50,000 pledge forms would be distributed to the students, he said adding college students would also be involved in the exercise.\n\nHe said the SVEEP activities, focussing on 100 per cent polling, have been intensified in all panchayats and targeted polling stations in the district, involving Self Help Groups, those employed under the Mahatma Gandhi National Rural Employment Guarantee Scheme, Anganwadi workers and health department staff.\n\nIn the 2011 Assembly elections, the four assembly segments witnessed an average 70 per cent polling and “we are working to achieve a minimum of 80 to 85 per cent polling in this election,” the Collector said.\n\nAfter the publication of final electoral roll on January 20, the election department has received 20,827 forms for inclusions, deletions and corrections and they were being verified and uploaded. This included 14,256 (Form 6) applications for inclusion, he said adding the supplementary electoral roll would be released soon.\n\nIn the special drive launched in 24 colleges, 4,327 students submitted Form 6 both online and offline seeking inclusion, he added.\n\nHe said 1,307 polling stations were being established in the district and over 6,300 polling personnel, including teachers would be helped to cast postal votes, he also added.\n\nEarlier, the Collector inspected the installation of GPS devices in vehicles used by flying squads, inaugurated a photo exhibition on election awareness and inspected Election Control Room and Voters Facilitation Centre, established at the Collectorate.", 
    "section": "national", 
    "title": "School students to bring in parents to cast their vote", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}