{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "The affidavit claimed that jallikattu “traces its origins to Indus Valley civilisation” and there are terracotta tablets which prove it. —FILE PHOTO\n\nIf the Spanish Senate can find the “far more cruel” sport of bull-fighting a cultural heritage, there is nothing wrong in farmers practising jallikattu in the semi-arid regions of Tamil Nadu.\n\nThis was one of the main arguments of Tamil Nadu government to lift a Supreme Court stay on a January 7, 2016 notification issued by the Ministry of Environment and Forests allowing the use of bulls as performing animals for jallikattu and bullock-cart races despite a ban from the apex court in a judgment in 2014.\n\nThe stay ordered on January 12 came on a batch of petitions filed by various NGOs like Compassion Unlimited Plus Action, People for Ethical Treatment of Animals India and Federation of Indian Animal Protection Organisations in the Supreme Court.\n\nIn a hearing on Tuesday, a Bench led by Justice Dipak Misra gave the Centre more time to file its reply to the petitions and posted the case for July.\n\nThe 22-page counter-affidavit filed by the State delves into religious mythology, the National Freedom Struggle, the “heroic powers” of youths and how bulls, like deer, are accustomed to running.\n\nThe affidavit claimed that jallikattu “traces its origins to Indus Valley civilisation” and there are terracotta tablets which prove it.\n\nThe State then said that ‘Jalli’ is the name of a “Yadav brave man with history dating back to the period of Lord Krishna”.\n\n“Bull-baiting figures in the Mahabharata also describe Krishna controlling a ferocious bull in the forecourt of Kamsa’s palace,” the Tamil Nadu government said. The affidavit also finds links from both ancient Tamil literature and Sangam era “and beyond”.\n\nBefore turning to global events to support its arguments in favour of jallikattu, the State affidavit said the rural people reacted to the Supreme Court’s stay with a “deep sense of shock, disappointment and sadness”. It contended why jallikattu is illegal when bull-fighting, where the animal is killed, has been given constitutional protection as part of cultural heritage.\n\n'“The bloody sport of bull fighting which is far more cruel and involves the killing of the bull is legal in at least eight countries including liberal and democratic countries like France,” the State government argued.\n\nInculcates martial spirit\n\nIt said jallikattu inculcates martial spirit. “Youth who have traditionally taken part in jallikattu have also been at the forefront of the armed struggle against the British,” it said.\n\nCountering arguments that bull is a domesticated, bovine animal, the State compared it to other cloven-footed animal which can run like deer. It said a bull spends less than 30 seconds in the arena.\n\nThe State said jallikattu bulls do not experience fear as they have been reared in a “village atmosphere”.\n\nIt also finds links from both ancient Tamil literature and Sangam era\n\n“and beyond”", 
    "section": "national", 
    "title": "Seeking lift of jallikattu ban, Tamil Nadu cites Spain’s bull-fighting", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}