{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Asks police to take proactive steps against any such practice\n\nWith police “excess” against a farmer in Thanjavur district for defaulting payment of a tractor purchase loan coming under sharp criticism from all quarters, Madurai Superintendent of Police Vijayendra Bidari has warned of disciplinary action against police personnel who employ such “illegal” means.\n\nHe has also instructed the district police to take proactive steps against illegal measures and other forceful methods used by moneylenders, banks and recovery agents to recover their dues.\n\n“Whenever instances or complaints of harassment, threats, intimidation, public abuse or insults, forceful methods and use of other illegal means by banks or their recovery agents come to your notice, register cases and take immediate action as per law,” Mr. Bidari said in a set of instructions issued to the district police on Tuesday.\n\nThe SP also advised the police officials to initiate preventive security proceedings, if necessary, and send the reports to the jurisdictional Revenue Divisional Officers against such moneylenders and recovery agents.\n\nThe district police have been strictly instructed not to provide any illegal police assistance to such moneylenders or recovery agents.\n\nThe SP also made it mandatory for the Station House Officers to obtain prior written permission from the Deputy Superintendents of Police concerned before providing police assistance as per court orders.\n\n“Even while providing such authorised assistance, the police must strictly ensure that no illegal means or methods are used,” Mr. Bidari said.\n\nThe DSPs have been directed to personally supervise investigation of any cases related to abetment, humiliation, harassment or abuse by moneylenders or recovery agents and ensure effective action as per law.\n\nSeeking strict compliance to the instructions, the SP left a note of warning that “any deviation or lapses will be viewed very seriously and will attract disciplinary action on the police personnel concerned.”\n\nMr. Bidari has asked the police officials to crack down on moneylenders charging exorbitant interest as per the Tamil Nadu Prohibition of Charging Exorbitant Interest Act, 2003.\n\n“The officials should register cases whenever such instances of complaints come to your notice and take immediate legal action against such moneylenders,” he said.", 
    "section": "national", 
    "title": "SP warns against illegal methods of loan recovery", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}