{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A visually challenged student writing the SSLC examinations with the help of a scribe in Salem on Tuesday.—Photo: E. Lakshmi Narayanan\n\nStudents pray before entering an examination centre for SSLC Public Exam in Erode on Tuesday.— PHOTO: M. GOVARTHAN\n\nStudents of 353 schools appeared for the SSLC public exam at 102 centres: 47 in Erode educational district and the rest in Gobi educational district on Tuesday.\n\nOf the 29,199 registered candidates, 13,601 students belong to 158 schools in Erode educational district and 15,598 to 195 schools in Gobi educational district. Of them, 51 candidates are differently-abled. There are six centres for 1,290 private candidates.\n\nDistrict Collector S. Prabakar and Chief Educational Officer P. Ayyannan inspected the centre at Government Girls Higher Secondary School, Erode.\n\nAs many as 310 flying squad members monitored conduct of exam to rule out malpractices. The question papers have been kept in 10 strong rooms under protection by armed personnel, the Collector said.\n\nSpecial Correspondent adds from Salem:\n\n471 students absent\n\nIn Salem, a total of 49,138 boys and girls appeared for the SSLC public examinations which commenced at 140 centres across the district on Tuesday. The students hailed from 508 government, government aided, self-financing high schools and higher secondary schools in the district.\n\nOf the 50,363 students who had received hall tickets, 471 boys and girls did not turn up for the examinations, according to official sources.\n\nBesides, a total of 1,225 private candidates wrote the examinations in eight centres.\n\nTight security was in place at all the examination centres and members of flying squads visited different centres to check any malpractice.\n\nThe Tamil Nadu State Transport Corporation operated special buses during the peak hours.\n\nOn the direction of the Collector, the TNSTC also extended its services up to examination centres for the benefit of the students possessing government passes.\n\nIn Namakkal district, a total of 24,664 students of 309 schools and 484 private candidates took up their examination at 85 centres across the district. Collector V. Dakshinamoorthy inspected the examinations at two schools in the town area.\n\nOfficials said that a total of 2,328 officials, including 85 chief supervisors, 10 additional chief supervisors, 85 department officers, seven additional department officers, 1,763 hall supervisors, 85 scribes, 85 office assistants and 170 flying squad members were on duty.", 
    "section": "national", 
    "title": "SSLC exam commences at 102 centres in Erode", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}