{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "Testing knowledge:(Left) Visually challenged student writing the SSLC examination with the help of a scribe at Palayamkottai; Collector M.Ravikumar inspecting an SSLC exam centre in Thoothukudi on Tuesday.— Photos: A. Shaikmohideen and N. Rajesh\n\n46 prisoners lodged in Palayamkottai Central Prison are writing the examination\n\nThe Secondary School Leaving Certificate examination commenced in the district on Tuesday.\n\nIn Tirunelveli district, 47,133 students – 23,240 boys and 23,893 girls – and 2,098 private candidates including 46 prisoners are writing the examination in 149 centres established in Tirunelveli, Cheranmahadevi and Tenkasi educational districts. Scribes have been appointed for writing the exams for 65 physically challenged candidates.\n\nDistrict Collector M. Karunakaran inspected the examination centres at Sri Jayendra Saraswathi Silver Jubilee Matriculation Higher Secondary School at Maharaja Nagar and the Palayamkottai Central Prison where 46 prisoners are writing their SSLC exam.\n\nA total of 243 static surveillance teams have been formed to prevent malpractices.\n\nIn neighbouring Kanyakumari district, 26,511 students – 13,115 boys and 13,396 girls – are writing the examination in 108 centres. Scribes have been appointed to assist 85 differently-abled students.\n\nCollector Sajjan Singh Chavan visited the examination centre at Kavimani Desika Vinayagam Pillai Government Girls’ Higher Secondary School.\n\nThoothukudi\n\nAs many as 25,613 students from 292 schools across the district sat for the SSLC public examination, which commenced here on Tuesday. Among the students, who appeared for the exam, 12,504 students were boys and 13,109 were girl students, sources from Department of Education said. As for Thoothukudi educational district, 16,079 students including 7,822 boys and 8,257 girls, and in Kovilpatti educational district, 9,534 students including 4,682 boys and 4,852 girls wrote the exam. Necessary arrangements had been made in the interest of students, who wrote the examination in 87 centres including 56 in Thoothukudi and 31 in Kovilpatti. Besides, 983 private candidates also appeared for the exam in halls at six schools. Thirty two differently-abled students took the exam in 26 exam centres. Collector M. Ravikumar inspected arrangements in a centre at St. Mary’s School in Thoothukudi. A total of 1,496 invigilators had been deputed to monitor the students in the exam halls. Flying squad comprising of 190 teachers was also on the job to check malpractice inside exam halls. Moreover, 19 route officers had been deployed to carry the answer scripts to the custodian points. Tight security arrangements had been made in all ten custodian points in the district, sources said.", 
    "section": "national", 
    "title": "SSLC examination commences", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}