{
    "author": [
        "Tamil Nadu Bureau"
    ], 
    "text": "Students across the State began their Secondary School Learning Certificate (SSLC) examinations on Tuesday with the Part 1 language paper. “The Tamil paper was simple with not many tricky questions and we are hoping to do well,” said S. Aswathy, a student of a school in Mylapore.\n\nThis is the first batch of students in Tamil Nadu who are writing the Compulsory Tamil Language Paper, 10 years after the Tamil Nadu Tamil Language Act which passed in 2006 and implemented across schools in the state for the students, who had then joined LKG.\n\nHowever, around 8,000 students who had languages other than Tamil as their mother tongue and from minority schools were given exemptions by the Madras High Court after they had approached the Court and the Education department seeking to be allowed to write the exam in their own mother tongue and other languages.\n\nHordes of parents were present at exam centres to drop their children and the students were required to be in the examination halls by 9 a.m. at most centres as it was the first exam. Question papers were handed out at 9.15 a.m. and the exams started at 9.30 a.m. after the particulars of the candidates were verified.\n\nIn Chennai 25,749 boys and 27,799 girls wrote the examinations and will be taking up the Part II paper on Wednesday.\n\nIn Tiruchi, a total of 40,136 students appeared for the exam held in 427 schools across the district.\n\nFifty-eight prisoners appeared for the examination at the Tiruchi Central Prison. This included five persons from the Pudukottai Borstal School which accommodates young offenders in the age group 18-21 years.\n\nThe examination was conducted smoothly in Madurai as well where over 45,000 students from 463 schools and 1046 private candidates across Madurai district sat for the first examination.\n\nEducation department officials across the state had kept a check on the availability of drinking water in examination centres as well as uninterrupted electricity.\n\n( With inputs from C. Jaisankar, S. Poorvaja and Pon Vasanth Arunachalam )", 
    "section": "national", 
    "title": "SSLC exams begin with simple language papers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}