{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Tamil Maanila Congress (TMC) is perhaps the only political party that is not overtly involved in any alliance talks, with its president G.K. Vasan maintaining that it would take another week before any decision is taken. Sources indicate that the party was open to an alliance with the AIADMK and was waiting for an invitation to initiate talks.\n\nAs on Monday, top leaders of the TMC maintained that there has been no formal communication from the AIADMK side and dismissed rumours that a Minister met Mr. Vasan in Kumbakonam recently.\n\n“Till now, the AIADMK has opened channels only with small parties which usually contest under its symbol. Our guess is that it may take some more time before formal deliberations begin,” said a senior TMC leader.\n\nWith the Congress sealing a pact with the DMK and looking for not less than 30 seats, the TMC seems to be in a spot. “We are not too sure how much seats the AIADMK would offer. Getting fewer seats than what the Congress could get from the DMK might be difficult to defend,” the leader said.\n\nMeanwhile, AIADMK sources hint that the talks could begin with an offer for eight seats for the TMC. The AIADMK leaders expect the TMC to begin the bargain with 25 seats and settle somewhere between 15 to 20 seats since the two-year-old party has not proved its electoral strength.\n\nWith senior Ministers O. Panneerselvam, Natham R. Viswanathan and P. Palaniappan sidelined, a new team comprising Ministers R. Vaithilingam, Edappadi K. Palaniswami, P. Thangamani and S.P. Velumani are holding preliminary talks with the potential allies.\n\nAccording to AIADMK sources, all the four Ministers have been asked to be in Chennai on Tuesday so that they could reach party leader and Chief Minister Jayalalithaa’s Poes Garden at short notice.\n\nStating that there could be important developments on the alliance front on Wednesday, party sources could not confirm if Mr. Vasan would be called for alliance talks that day itself.\n\nAIADMK sources say talks could begin with an offer of 8 seats", 
    "section": "national", 
    "title": "Stranded, TMC awaits call from AIADMK", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}