{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A student-faculty team of Kongu Arts and Science College presents its study on the impact of advertisements to the president of Erode District Consumer Protection Centre during the World Consumer Day celebrations in Erode on Tuesday.— PHOTO: M. GOVARTHAN\n\nThe Erode District Consumer Protection Centre invited students for World Consumer Rights Day celebrations on Tuesday.\n\nThe objective was to create an aware future generation, and to sustain this year’s format of World Consumer Day celebrations for future.\n\nThe highlight of the day was a quiz competition for college students in four groups titled ‘Enna Than Theervu’ (What only is the solution?) that followed a special programme: En Kelvikku Enna Bathil (What’s the answer for my question?), conducted by R. Balasubramanian, secretary of Erode District Consumer Protection Centre.\n\nA group of faculty and students belonging to Kongu Arts and Science College came out with its finding that described the disturbing impact caused by misleading advertisements, and another group comprising students of Vellalar College of Education displayed a study of malpractices in the Anganwadi centres.\n\nThey handed over the booklets of their studies to the president of Erode District Consumer Protection Centre SKM Maeilanandhan.\n\nIn his address, Mr. Maeilanandhan said the students could make an impact by joining hands and questioning malpractices, thereby exercising democracy.\n\nMr. Maeilanandhan related the disturbing trend of industries letting untreated effluents into water bodies and consumption of adulterated products to the rising rate of infertility in the district.\n\nAs aware consumers, students ought to rise above political followings.\n\nIn the backdrop of unscrupulous manufacturers and advertisers misleading consumers, the onus was on younger generation to root out the ills and corruption at large, he emphasised.", 
    "section": "national", 
    "title": "Students realise their role in creating consumer awareness", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}