{
    "author": [
        "S Senthalir"
    ], 
    "text": "The result of a study on tourist attractions in Puducherry was released by K.V. Raja, Chairman, IFET College of Engineering, in the presence of A. Mohammed Ilyas, Vice-Chairman, and K. Shivram Alwa, secretary of the college. It was received by Senbagarajan, president of Chamber De Commerce and other office-bearers of hoteliers association. (Below) A view of the Chunnambar Boathouse.— Photos: T. Singaravelou\n\n‘More entertainment hubs like theme parks will make tourists to stay longer’\n\nLack of infrastructure and marketing strategies remains an obstacle for longer stay of tourists in Puducherry. A study on Tourism Attractiveness factors in Puducherry, conducted by the students of Department of Management Studies, IFET College of Engineering, reveals that hotel rooms in Puducherry remain vacant in the weekdays and are filled only during weekends and festival seasons.\n\nIn Puducherry, there are 20 classified hotels and more than 500 second and third tier hotels, home stay and service apartments.\n\nConsidered to be an economical tourist destination, Puducherry cannot hold tourists for more than two days.\n\n“The geographical boundary of Puducherry is limited to 23,742 sq km and the places to visit are very limited. A tourist can visit all the destinations within two days. This makes for a short stay,” said Mohamed Marzooth, assistant professor, Department of Management Studies, IFET College of Engineering, and head of research.\n\nThe study interviewed 940 respondents over a period of one month from January to February 2016. The study was supported by Chamber De Commerce and Hotels Association of Puducherry.\n\nThe study findings reveal that majority of visitors are youngsters between the age group of 26-35 years. Out of the 940 respondents, 518 people were under this category.\n\nPrabhakar Ranganathan, secretary of hoteliers association, said that there was lack of entertainment hubs like theme parks. “If there is good marketing and proper infrastructure is provided, the tourists would stay for longer duration in Puducherry,” he said.\n\nThe study suggested that the tourism department of Puducherry needs to develop various tourist fun spots such as amusement parks, zoo, museum etc. to generate more revenue for the government. “If the industries and education hubs are developed, there will be increase in official visits to Puducherry region. The satisfactory level in terms of sports facilities in Puducherry are considered to be average and good,” said Mr. Mohamed.", 
    "section": "national", 
    "title": "Tourism study finds lacuna in infrastructure, marketing", 
    "subsection": "tamilnadu", 
    "date": "2016-03-16"
}