{
    "author": [
        "B Kolappan"
    ], 
    "text": "“This is not cinema, but real life. You cannot hack someone and leave the spot in slow motion.” This dialogue from the yet-to-be-released Tamil film Yenru Thaniyum has already been proved wrong: A Dalit youth in Udumalpet was killed in broad daylight for marrying a caste-Hindu girl and the assailants drove away from the scene as if nothing had happened.\n\n“Caste is like God. It is omnipotent,” says the heroine Amudha, a victim of honour killing. This dialogue captures well the mind of those possessed by caste arrogance and apparently devoid of humanism. Her lover Thangadurai also falls prey to the caste pride in the film.\n\nThe film directed by Bharathi Krishnakumar announces itself as not a true story, but ‘a story of truths’. Though its central theme is honour killing, it talks about other social evils too: the pernicious two-tumbler system — one for caste-Hindus and another for Dalits — and subjugation of women in every day life. There is hardly any difference in the living conditions and economic status of the oppressor and the oppressed.\n\n“I took extra care to ensure that the truth was not lost in cinematic elements and avoided romanticising scenes. All actors appeared without make-up,” said Mr. Krishnakumar, who has already produced a documentary on police atrocities in Vaachathi.\n\nThe story begins with Amudha being pulled out of school to take care of her new-born brother so that her mother could eke out a livelihood. Her father is an alcoholic who spends the whole day playing cards. The role of mother is imposed on her and she happily accepts it. She takes up the job of cutting seemai karuvelam and educates her brother Mathi. She falls in love with Thangadurai, a supervisor in a quarry.\n\nWhen they decide to leave the village, they are caught and murdered by the panchayat leader and his henchmen. Mathi takes revenge for his sister’s death.\n\nThere is a scene in which a person is thrashed for writing a letter to the government requesting a bus service to his village. “If there is a bus service, people will leave and outsiders will enter. We will be forced to share the seats with persons of low-caste,” says the panchayat leader.\n\nMr. Krishnakumar explained that it was a low-budget film completed in 40 days. “I agree there may be some imperfect shots. But you should take into consideration that all the actors are new faces and we had very little time in perfecting shots,” he said while acknowledging the support of the producer K. Palanisamy, owner of Universal Theatres in Tirupur.\n\nAsked whether a feature film loaded with a heavy social theme could succeed, Mr. Krishnakumar said he had a ‘special’ audience in mind. “If it reaches them, the film will be a success even if it runs for just three days,” he said.", 
    "section": "national", 
    "title": "A film that captures it all", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}