{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Want white paper release by the government on the issue\n\nDays after the Kakrapar Atomic Power Station (KAPS) in Gujarat was shut down following a leak in its cooling system, members of the People’s Movement Against Nuclear Energy (PMANE) staged a protest here on Monday pressing various demands, including one against the expansion of the Kudankulam Nuclear Power Project (KNPP) in Tirunelveli district.\n\nAlleging that there were several glitches in the functioning of the first two units of KNPP, the activists demanded that a white paper on the issue be released by the government.\n\n“There should not be any expansion of KNPP before they clear our apprehensions over the functioning of the first two units. The government should revoke the false cases foisted against our activists and should not implement dangerous projects in Kudankulam and Kalpakkam in the name of development,” PMANE convenor S.P. Udayakumar said.\n\nHe demanded that major parties in the State must make their position on Kudankulam clear. “When we met the Chief Minister a few years back and pointed out that the West Bengal government had taken a stand against new nuclear plants, we were told the units in Kudankulam were on the verge of completion. But, now the government is planning to open more units,” Mr. Udayakumar said.\n\nThe activists also pointed out the differences in the versions of various officials over the incident at KAPS. They claimed that while one official said the unit shut down on its own, another claimed it was forcefully shut down.\n\nAn official release from Atomic Energy Regulatory Board (AERB) had stated that the first unit of KAPS “underwent an automatic shutdown” on March 11 following an incident of a leak from its coolant system. Though it admitted that a plant emergency was declared following the incident, AERB maintained that there had not been any abnormal release of radioactivity outside the plant or radiation exposures, as a result of the incident.", 
    "section": "national", 
    "title": "Activists protest against expansion of Kudankulam nuclear project", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}