{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Indicates that he would resign the post of MLA soon\n\nThe ruling All India NR Congress (AINRC) MLA and party secretary P.A ngalane on Monday resigned from the party primary membership, alleging that the party president and Chief Minister deliberately ignored his constituency. He also indicated that he would resign the post of MLA soon.\n\nMr. Angalane represents the Thirubuvanai constituency in the Legislative Assembly and was secretary of the AINRC.\n\nOn Monday afternoon, Mr. Angalane met the Chief Minister at the latter’s office and tendered resignation quitting primary membership.\n\nPartial treatment\n\nMr. Angalane charged, “The Chief Minister ought to have treated all constituencies impartially. He had provided employment to a number of youth in his constituency alone. As there is no respect for me in the party, I am tendering resignation from the post of party secretary and primary membership as well.”\n\nHe claimed that several more in the party, who were frustrated over the approach of the party general secretary V. Bhalan and secretary N.S.J. Jayabal, would leave the party.\n\n'No system in party'\n\nMr. Angalane made charges against the AINRC supremo: “There is no system in the party. The Chief Minister has a hand in everything here. Then what is the use of MLAs and other posts?.”\n\nHe said he would announce his future course in politics in two days.\n\nEarly days\n\nMr. Angalane was a seller of incense sticks and a folk artist before becoming a full time politician.\n\nHe began his political career with Congress party at initial stage and fielded as a candidate in 2001 in Thirubuvanai (Reserved) Constituency and was elected to the Legislative Assembly first.\n\nIn 2006, he was elected as an MLA from the same constituency and was a Social Welfare Minister for six months during the Congress regime when N.Rangasamy was the Chief Minister .\n\nHe was stripped of the post following a complaint by his wife who accused him of domestic violence.\n\nAt the fag end of the Congress regime, Mr. Rangasamy resigned his MLA post in February 2011 and in just 10 minutes, Mr. Angalane too resigned his MLA post.\n\nMr. Angalane was given the post of party secretary by Mr. Rangasamy when he launched the AINRC in March 2011. He also was elected as an MLA on AINRC ticket for third time from the same constituency.", 
    "section": "national", 
    "title": "Angalane quits AINRC", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}