{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Commercial Crime Investigation Wing (CCIW) of the Crime Branch Crimination Investigation (CB-CID) police launched an awareness programme on various types of economic offences and cheating of gullible public by fraudulent non-banking financial institutions.\n\nAs directed by Prateep V Philip, Additional Director General of Police, Economic Offences Wing (EOW) in Chennai, the CCIW, led by S. Maheswari, Inspector of Police, and Geetha, Sub Inspector of Police, launched the awareness programme at CSI College of Education here on Monday. After screening a 45-minute-long short film on how fraudulent firms cheated the public after coming out with attractive gift schemes and promising high interest rates, they distributed pamphlets to create awareness of fraudulent firms and helpline numbers and email addresses to lodge complaints. Reminding the students and general public about the frauds in the name of emu farming, country chicken farming and high interest deposit schemes, the CCIW warned the public to be wary of these fraudulent firms.\n\nThese institutions would promise to make you millionaires overnight but that was simply impossible, it said. It was mandatory for non-banking financial institutions to register with Reserve Bank of India (RBI) and the public should check whether they were registered with the RBI before depositing their money, she said.\n\nWebsite\n\nThey could check the genuineness of these institutions by visiting www.rbi.org.in/Commanman/English/Scripts/NBFC’s.aspx, she said.\n\nOnly those authorised by the RBI could accept deposits from the public and they should be cautious if any institution offered an interest rate of more than 12.5 per cent and the maximum maturity period on deposits was less, she said.\n\nLottery and money rotation had been banned in the State and the public should not invest their money on such schemes, she said.", 
    "section": "national", 
    "title": "Be wary of attractive schemes: police", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}