{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "Dr. S. Kalavathy, former Associate Professor, Department of Botany, Bishop Heber College, explaining the features of a plant found on the Ramalinga Nagar premises of Sri Sivananda Balalaya to the children.— PHOTO: B. VELANKANNI RAJ\n\nI wish all the schools in Tiruchi undertakesomething like this\n\n‘Blossoms of Balalaya’ lists the plants and herbs in layman’s language\n\nwo botany experts are close to finishing work on a pictorial guide to the vegetation found on the twin premises of Sri Sivananda Balalaya.\n\nTitled “Blossoms of Balalaya”, the glossy publication contains photographs and textual information on 111 plants belonging to 50 botanical families found in both the Ramalinga Nagar South Extension and Adavathur premises of the school.\n\n“We want to encourage the children to study plants and take an interest in preserving them. This is one way of building upon textbook lessons on environmental science,” K.G. Meenakshi, founder of Sri Sivananda Balalaya, told The Hindu .\n\nThe floral inventory lists the taxonomical and local English and Tamil names of each of the plants, besides their properties. The guide has been kept simple to appeal to the lay reader.\n\n“Once you know a particular plant by its name and its physical appearance, you will learn to look for it everywhere,” said S. Kalavathy, former associate professor, Department of Botany, Bishop Heber College.\n\nDr. Kalavathy, along with her student and research scholar A. Vijayan, spent an hour daily from December 2015 to February 2016 recording the vegetation in both the premises. They were accompanied by senior botany professor Dr. Indira in their study.\n\nAccording to the researchers, herbs are predominant and the nativity of 95 plants is clear. The bean family, ‘Fabaceae’, is most common with 17 plants, followed by ‘Poacae’ (grass family) with 10, and ‘Euphorbiaceae’ (spurge family) with 8.\n\nOf the 111 plants identified by the project, the school grounds have 45 types of herbs, 19 shrubs, 33 trees, and 14 climbers and creepers.\n\nThe soil conditions are vastly different – the 5,400 sq ft Ramalinga Nagar plot was originally a rubbish tip, while the nearly two-acre Adavathur premises is built on agricultural land.\n\n“At least half of the plants in both Ramalinga Nagar and Adavathur are not native to the region, but it is interesting to see how they have adapted to wet and dry soil,” said Dr. Vijayan.\n\n“I wish all the schools in Tiruchi undertake something like this,” said Ms. Meenakshi. “We are willing to share the results of our work with other institutions and to help out with the initial botanical surveys,” she added.\n\nBesides starting a Papaya Club for students to promote greater understanding about the tropical fruit tree, Sri Sivananda Balalaya is set to make the “thiruvottukai maram” (Crescentia cujete/Calabash Tree), currently found in its Adavathur premises, its official mascot.\n\nMore information on floral inventory services may be had from Dr. Kalavathy on phone 0431-2772318.\n\nI wish all the schools in Tiruchi undertake\n\nsomething like this", 
    "section": "national", 
    "title": "Botanists bring out book on plants in school premises", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}