{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Even teachers admit the paper was bit tough, social media abuzz with complaints\n\nAnxious discussions dominated scenes outside many exam centres in the city as students in tears complained that the Standard XII CBSE Mathematics Board Examination paper was extremely tough.\n\n“Concepts such as Linear Programming and Matrices which have generally got easy questions over the years had tough questions this time. Every question was tricky, as a result of which many of us found it tough to finish the paper on time and many students, including the top scorers in schools, were crying after the exam,” said Shreya, a student.\n\nA maths teacher from a school in Chennai admitted that it was a standard paper where the difficulty levels were high. “Class 10 exams are usually easy. For Class 12, students will have to really prepare well. This year, the question paper was a bit difficult. Compared to last year when only two questions were difficult, this year’s question paper had more complicated sums which were unfamiliar,” she said.\n\nN. Divya said her son, who expected to score a centum, would find it hard to get above 90 marks. “For science students like him who want to pursue engineering, the cut-off marks will automatically come down now and we will be in no position to compete with State board students who score centums, making it impossible for us to secure seats on merit,” she said. Questioning why not many sums from the NCERT syllabus found a place in the paper, a student said, “For many of us who just went by the prescribed textbook and did not prepare with other guides, it was a difficult paper to crack. Online Forums Complaint Board and Indian Consumer Complaints Forum exploded with posts from students who demanded leniency in correction and lashed out against the Board for a tough paper. Many students took to sharing their grievances on Facebook and urged other students to post on the forums for the CBSE to take note. Parents and students from the city sent tweets to Union Minister Smriti Irani about the “tough” paper.\n\nChemistry paper also tough\n\nState Board students taking the Plus II students Chemistry exam also said the difficulty level was much beyond their expectations. “A few of the questions were tricky for us and it was overall a challenging paper,” said K. Bhavani, a student.\n\n(With inputs from S.P. Saravanan in Salem).", 
    "section": "national", 
    "title": "CBSE class XII students in tears after math exam", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}