{
    "author": [
        "Vivek Narayanan", 
        "K Lakshmi"
    ], 
    "text": "Ambulance drivers list out 15 risky stretches in north and west Chennai and 16 in the south\n\nThirty-one stretches across the city are considered dangerous. This conclusion is supported by the frequency with which accidents are reported from these stretches.\n\nFrom information gathered from pilots of 108 Ambulance Service and the police, 15 stretches in north and west Chennai, and 16 in south Chennai are considered highly accident-prone.\n\nThe 31 stretches include Chennai-Tiruvallur High Road, New Avadi Road, 100 Feet Road and Beach Road. Certain spots on these stretches are said to have witnessed a disturbing frequency of mishaps — they include Royapuram bridge, Kathipara Junction and Pallikaranai bridge.\n\nWhile the police claim negligence as one of the reasons for frequent accidents on these stretches, road safety experts have called for a scientific investigation into the cause of accidents.\n\nThe lack of a dedicated space for pedestrians in Neelankarai has made people using a stretch of East Coast Road vulnerable to accidents.\n\nSrilakshmi Rao, a resident of Neelankarai, said: “It is scary to walk on this road as there is no footpath and small shops occupy the little space that is available. The road needs to be widened up to Vettuvankeni. Police must regulate share autorickshaws that halt haphazardly on the road.”\n\nThe stretch of Inner Ring Road between Padi and Madhavaram is a trouble zone for motorists. Poor lighting and reckless driving often lead to accidents here. Lorries parked on the roads add to the motorists’ risk, especially those who join the road from the Padi flyover.\n\nJ.I.A. Easter Raj, a resident of Kolathur said: “People jump traffic signals and overtake vehicles at high speed leading to collisions and sometimes fatal accidents. Though service lanes are being developed, it doesn’t serve the purpose as lorries encroach upon the space.”\n\nCrossing the Madhya Kailash junction on Sardar Patel Road is a tough task. Residents like S. V. Pandiarajan of Indira Nagar want separate lanes for two-wheelers to be re-introduced and checks to curb rash driving to be increased.\n\nA scientific investigation into accident causes is essential to reduce accidents.\n\n“In most accident cases, the driver of the bigger vehicle is arrested. There is no scientific investigation to determine the cause of the accident — human or vehicle fault or poor road engineering,” said Piyush Tewari, CEO, Save Life Foundation.\n\nExperts feel that unless this is done, it will be difficult to curb accidents.\n\n“When an accident takes place, the traffic police, transport department official and the highways or Corporation official has to study the scene. But, this is done only for major accidents. For minor accidents, only the police report is relied upon,” said a traffic expert.\n\nHe said the State government had a Geographical Information System-based software called the Road Accident Data Management System (RADMS) funded by the World Bank.\n\n“It was used for collecting, comparing and analysing road accident data. But it is not being used due to some fault. Now they are upgrading it,” he added.", 
    "section": "national", 
    "title": "City’s accident hotspots mapped", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}