{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Demandimmediate release of 23 fishermen and their boats seized by the Sri Lankan Navy\n\nUP IN ARMS:Fishermen with their family members staging a demonstration in Pamban in Ramanathapuram district on Monday.— Photo: L. Balachandar\n\nCountry boat fishermen staged a black flag demonstration after entering into the sea here on Monday, protesting against Sri Lankan navy for arresting 23 fishermen with their three ‘vallams’ (country boats) on a charge of poaching.\n\nJoined by women and family members of the 23 fishermen, who were arrested by Sri Lankan navy on Saturday night when they were fishing on the high seas in Mannar Thaulpadu area, the fishermen demanded the immediate release of the fishermen and their boats.\n\nCountry Boat Fishermen Association organised the stir in coordination with Centre for Indian Trade Unions (CITU)- affiliated Tamil Nadu Meenpidi Thozhirsanga Koottamaippu.\n\nThe fishermen announced that about 5,000 country boat fishermen would strike work from Monday till the fishermen were released.\n\nIt was highly condemnable that country boat fishermen who indulged in traditional fishing without causing any harm to marine resources were arrested and harassed by the Lankan navy, Association district president S.P. Royappan and coordinator G. Arul said.\n\nThe Lankan navy was well aware that the country boat fishermen confined themselves to Indian waters and crossed the International Maritime Boundary Line (IMBL) only when their nets laid on the previous evening drifted into Lankan waters, they said. The agitation was also to press for the release of 20 Thoothukudi country boat fishermen, who were arrested by the Lankan navy with their three ‘vallams,’ Mr. Arul said, adding “we are holding talks with our Thoothukudi counterparts to step up the agitation.”\n\nMeenpidu Thozhirsanga Koottamaippu district secretary M. Karunamurthy said that the families of the 23 fishermen who lost their breadwinners all of a sudden were struggling to make both ends meet.\n\nThe Koottamaippu would open a ‘gruel tank’ at Anthoniar Nagar on March 17 to highlight the plight of the fishermen and the fishermen would throng the office of fisheries department in Rameswaram in large numbers on March 21, he said.", 
    "section": "national", 
    "title": "Country boat fishermen stage protest at Pamban", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}