{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Claims asset reconstruction company is harassing him to recover dues\n\nA 42-year-old farmer and his family arrived at the Collector’s office on Monday to surrender their tractor to Collector R. Nanthagopal seeking help to protect their livelihood after an asset reconstruction company sent a letter demanding settlement of outstanding loan amount or to face legal action.\n\nThe farmer, S. Ramesh, a resident of Vilunthakkal village of Katpadi taluk, drove the tractor into the premises of the Collector’s office.\n\nIn 2007, he had taken a loan of Rs. 5.50 lakh from Karur Vysya Bank (KVB), Vellore and purchased a tractor for agricultural work.\n\n“I own five acres of land in my village. I submitted the land documents as surety for the loan. I have repaid close to Rs. 3.25 lakh, and was shocked to receive a letter from Reliance ARC 013 Trust on January 10 asking me to pay Rs. 17,67,315 with interest within 15 days,” he said.\n\nAs the letter was in English, the farmer said he did not realise its importance until he sought a teacher’s help.\n\n“The teacher explained the contents of the letter to me. The company has asked me to settle the outstanding loan amount and has cautioned of legal action if I failed to do so,” he said.\n\nIn the letter to the farmer, Reliance ARC 013 Trust said that KVB had assigned the financial assistance in favour of Reliance Asset Reconstruction Company. Pursuant to the agreement, Reliance ARC Ltd has stepped into the shoes of KVB and now has become entitled to recover the outstanding dues.\n\nThe letter said that he has to pay Rs. 17,67,315 with interest at the rate of 17 per cent together with incidental expenses and costs, failing of which they will take appropriate legal action at his cost and consequences.\n\n“Now, the collection agents of the company are harassing me on a daily basis. They are threatening to takeover my land,” Mr. Ramesh said.\n\nLack of adequate rains and water scarcity has put this farmer and his family in a difficult situation.\n\n“The last five years have been extremely difficult due to water scarcity. Only after the rains last year the situation is easing to some extent,” his wife Gajalakshmi said.\n\nThe farmer has been raising coconut trees and ragi crops.\n\nTo protect his livelihood, he decided to seek the intervention of the district administration.\n\n“I wanted to surrender the tractor and photocopies of my land documents to the Collector,” he said.\n\nHe submitted a petition to officials, and drove his tractor home following assurance from officials to inquire into the issue.\n\nEfforts to get the Reliance ARC 013 Trust’s point of view were not successful.", 
    "section": "national", 
    "title": "Debt-ridden farmer tries to surrender tractor to Collector", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}