{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Policemen dismissed from service following disciplinary proceedings initiated against them have no right to squat on residential quarters irrespective of whether their review petitions pending with the Director General of Police or not, the Madras High Court Bench has said.\n\nJustices S. Manikumar and C.T. Selvam passed the order while dismissing a writ appeal filed and argued in person by M. Sankara Subramanian who was dismissed from service first in 2001 but managed to get the order reversed, due to procedural lapses, until he was dismissed again in 2012. Holding that residential quarters allotted by the government were meant only for policemen in service, the judges said: “We only observe that whether the review petition is pending or not, policemen who are not in service, have no right to squat on police quarters intended for those in service.”\n\nThe appellant had challenged a show cause notice issued by Assistant Commissioner of Police, Tirunelveli City Crime Records Bureau, on December 11 last year seeking explanation as to why he should not be evicted from the quarters as it was more than three years since he was dismissed.\n\nFinding no justification in the challenge made by the petitioner, the judges said that a Deputy Commissioner of Police had dismissed the petitioner way back in September 2001 and the dismissal order was confirmed by the Commissioner as well as the DGP in November 2001 and July 2002 respectively.\n\nHowever, in 2005, he filed a writ petition challenging the dismissal and a single judge of the High Court, in 2009, set aside the dismissal orders with a direction to the officials to conduct fresh enquiry by affording a reasonable opportunity to the appellant to defend himself. Though the DGP preferred a writ appeal against the single judge’s order, a Division Bench dismissed the appeal in 2010.\n\nHence, after another round of enquiry, he was dismissed in 2012 and the second dismissal order was confirmed by the Commissioner of Police. Claiming that a review petition filed by him before the DGP in June 2013 was pending for 31 months, the appellant had urged the court to interfere with the show cause notice issued with respect to vacating the residential quarters at Bharathi Nagar in Palayamkottai Taluk.", 
    "section": "national", 
    "title": "Dismissed policemen can’t occupy quarters: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}