{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“Liquor and corruption are the prime maladies plaguing the State”\n\nPeople should not barter their invaluable vote for cash or kind on election eve as it would only perpetuate their suffering for another five years, said the Pattali Makkal Katchi’s chief ministerial candidate, Anbumani Ramadoss, here on Monday.\n\nDelivering a talk on “Ending corruption,” Dr. Anbumani pointed out that there was widespread anger against the government but it vanished on poll eve when cash was distributed. After Madurai gave the infamous ‘Tirumangalam formula,’ subsequent by-elections in the State threw up ‘Srirangam formula’ and ‘RK Nagar formula,’ which only enhanced the money given to voters.\n\nDr. Anbumani said that liquor and corruption were the prime maladies plaguing the State and change meant deliverance from them. An end to corruption and liquor would facilitate all-round development of the State, he said and listed out the measures he would undertake to eradicate corruption.\n\nAssuring to get the Lokayukta Bill passed in the first session of Assembly, if voted to power, Dr. Anbumani said that the State would pass the Right to Public Services Act under which a time limit would be fixed for 50 government services. It would adopt e-governance in a big way to infuse transparency in administration. “Power, which is concentrated around one person now, would be decentralised in the PMK regime,” he said.\n\nThe meeting of the Cabinet would be held in one district headquarters per month and the Assembly would have a minimum of four sessions spread over 100 days in a year. The proceedings would be telecast live and a toll-free number would be provided for people to lodge complaints of corruption. The Ministers would declare their assets in the government website in January every year. Dr. Anbumani said that the government would conduct referendum on important issues and he would meet Opposition leaders once a month to hear their views. An independent police authority would be formed to streamline law and order administration.\n\nUnleashing a scathing attack on both the DMK and AIADMK, Dr. Anbumani called the former the fountainhead of corruption and the ruling party the “tsunami of corruption.” He also listed the allegations of corruption in various departments and urged the people to exercise their franchise to bring about a change in governance.", 
    "section": "national", 
    "title": "Do not barter vote for money: Anbumani", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}