{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The district administration has taken special initiative to ensure high poll percentage in the district.\n\nThe Election Commission has directed the district administration to identify the booths which witnessed low polling in all the 11 Assembly constituencies in the district in the 2011 elections. The officials involved in the poll work have already launched the survey of the booths which registered low poll percentage.\n\nThe official machinery will create awareness among the people attached to such polling stations on the need for exercising their democratic rights.\n\nIt has been proposed to increase the poll percentage by about 10 per cent than the last Assembly elections.The aim of the Election Commission is ensuring cent per cent polling, official sources said.\n\nSpecial campaigns have been planned to enrol eligible college students as fresh voters.\n\nAwareness will be created among the common people through wall posters, advertisements, street plays, formation of human chains, oratorical competitions among college students etc, the source said.\n\nMeanwhile, the officials are involved in the work of removing the flag masts of political parties in different parts of the district.\n\nOn the complaints received from the public, the Corporation officials swung into action and removed the flag masts of political parties and banners and flex boards in different parts of the city in the last few days.\n\nThe corporation staff removed the flag masts and banners at Shevvapet, Kottai Linemedu, Karungalpalayam, Hasthampatti, Ammapettai, Kondalampatti and Suramangalam on Saturday night.\n\nAll the existing flag masts will be removed within a day or two, official sources said.\n\nThe police protection has been provided to the Returning Officers of all the 11 Assembly constituencies in Salem district.\n\nThe sources said that armed police guards protection has been provided to the Returning officers of the eight constituencies in Salem district police limits and three constituencies in the city limits.\n\nThe protection to the Returning Officers is following the direction of the Election Commission, the sources added.", 
    "section": "national", 
    "title": "Drive to raise polling percentage in Salem", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}