{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Several patients who had undergone surgery shared their experiences\n\nJIPMER Director Dr. S. C. Parija inaugurating the 'Intensive patient counselling programme' for patients and caregivers of patients with cleft lip and palate on Monday.—Photo: Special Arrangement\n\nJipmer on Monday organised an ‘Intensive Patient Counselling Programme’ for patients and caregivers of patients with cleft lip and palate that underscored the importance of seeking early intervention for surgical correction of the defect.\n\nThe program was hosted by the Department of Plastic Surgery under ‘JIPMER Smile Train Cleft Project’.\n\nThe programme was inaugurated by Dr.S.C. Parija, Director Jipmer.\n\nHe highlighted the importance of counselling patients and parents of Cleft Lip and Palate. He informed that the programme was begun in 2014. Doctors have been regularly performing cleft surgeries and organising health camps.\n\nDr. S. Mahadevan Dean, Jipmer stressed that parents seek early medical care while pointing to the psychosocial trauma that the families undergo when a child is born with cleft palate.\n\nDr. Vishnu Bhat, Dean (Research) focused on the comprehensive approach that was adopted in Jipmer while treating patients with Cleft Palate.\n\nThe Head of Department of Plastic Surgery Dr. Ravi Kumar Chittoria and Project Director Dr. D.P. Mohapatra, other Cleft Surgeons Dr. Friji .M.T and Dr. Dinesh Kumar from Department of Plastic Surgery participated.\n\nLater, the Jipmer director felicitated various departments heads who are members of team of ‘JIPMER Smile Train Cleft Program’. Kesavan from Lion’s Club Puducherry who donated two Water Purifiers for patients of Jipmer was also felicitated during the occasion. At the session moderated by Fromsi Lukose, Medical Social Worker, several patients who had undergone surgery shared their experiences.", 
    "section": "national", 
    "title": "Early intervention suggested for cleft lip correction", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}