{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Four of the victims, including two children, died on the spot\n\nThe badly damaged government bus involved in the accident on the Pollachi-Palladam Road in Coimbatore district on Monday.\n\nEight persons died and 27 passengers were injured when a bus they were travelling in collided head-on with a lorry on the Pollachi to Palladam road on Monday afternoon. Four of them, including two children, died on the spot.\n\nAccording to the police, the government bus with 43 passengers was headed to Pollachi from Tirupur, when a lorry came in the opposite direction. The vehicles had a head-on collision.\n\nPolice sources quoted passengers as saying that borewell drilling was under way close to the accident site and to avoid it the bus driver turned the vehicle to the right side of the road, resulting in the accident. This was yet to be confirmed, they said.\n\nSix of the deceased were identified as passengers K. Sangeetha (24) of Chettipudur near Negamam, C. Dharanesh (5) and his sister Nisha (1) of Anamalai near Pollachi, S. Sumangala (28) of Nattukkal in Palakkad, Kerala and S. Arunkumar (30) of Thaavapalayam in Karur and lorry driver M. Madhu (49) of Mettur Dam, in Salem.\n\nThe injured passengers were admitted to Coimbatore Medical College Hospital and Pollachi Government Hospital and a few other private hospitals. Bus passenger S. Baskaran (28) of Chettipudur in Negamam on whose complaint the case was registered said he was lucky to escape with minor injuries.\n\nThe Negamam police registered a case against the lorry driver Madhu under sections 304(A) (causing death due to negligence), 279 (rash driving or driving on a public way), 337 (causing hurt by act endangering life or personal safety of others) and 338 (causing grievous hurt by act endangering life or personal safety of others) of the Indian Penal Code.\n\nThe bus driver was admitted to a private hospital. Collector Archana Patnaik and Superintendent of Police for Coimbatore District R.V. Ramya Bharathi met patients and relatives of the victims at the Pollachi Government Hospital.\n\nStaff Reporter from\n\nTirupur writes:\n\nNineteen passengers of a State-owned public transport bus sustained injuries when the vehicle rammed into a lorry parked at Panapalayam near Tirupur on Monday.\n\nThe bus was plying between Thondi in Ramanathapuram District to Coimbatore. The injured persons were referred to various hospitals. Palladam Police were investigating the cause of the accident.\n\nA passenger said borewell drilling close to accident site forced the bus driver to turn right", 
    "section": "national", 
    "title": "Eight dead, 27 injured in bus-lorry collision", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}