{
    "author": [
        "L Renganathan"
    ], 
    "text": "DMK cadre protesting against the attack on G. Balan in Thanjavur on Monday.— Photo: R.M. Rajarathinam\n\nFarmer G. Balan of Thanjavur district, who was assaulted by police personnel and collection agents of a private bank recently for defaulting on loan repayment, got back his tractor on Monday.\n\nThe DMK, Makkal Adhikaram and a farmers’ collective staged protests fast across the district. Mr. Balan of Cholagankudikadu near here had availed a tractor loan from the Kotak Mahindra Bank in 2011 and had defaulted in repaying the last two instalments for which the bank’s collection agents aided by police personnel from the Pappanadu police station assaulted the farmer and seized his tractor while he was working in his field. The images went viral via WhatsApp creating a furore among the delta farmers who showcased the issue as reflecting the plight of all farmers who are grappling with an economic crisis of enormous proportions.\n\nOn Monday, the Thanjavur South District DMK cadres staged a demonstration in front of the Panagal Buildings here in which district secretary Durai Chandrasekaran, former Minister S.N.M. Ubayadullah, Kumbakonam MLA Sakkottai Anbalagan, Town Secretary T.K.G. Neelamegam and others participated. They demanded criminal action against the errant police personnel and bank agents who assaulted Mr. Balan.\n\nNear the New Bus Stand, a group of Makkal Adhikaram cadres tried to stage a road roko raising slogans. They were led by the State Coordinator Kaliannan. Police picked up a total of 53 cadres.\n\nAt Orathanad, hundreds of farmers coming under the umbrella of the Farmers’ Coordination Committee launched a protest fast under the leadership of the committee’s president Deivasigamani demanding action against the errant police personnel and bank agents.\n\nPolice and revenue officials quietly persuaded Mr. Balan to accept the tractor. Mr. Balan initially resisted but later agreed to take back the tractor and also accept the bank’s offer of waiver of the loan payment in the presence of the agitating farmers’ organisation representatives.\n\nPolice sources said departmental action had been initiated against the offending police personnel.\n\nBank to waive the balance loan to Balan", 
    "section": "national", 
    "title": "Farmer gets his tractor back", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}