{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Injured woman’s husband has lodged a complaint at the Triplicane police station\n\nEven as the 24-year old woman — whose leg was badly injured after she was thrown off a giant wheel 15 feet high at the Chennai trade fair in Island Grounds on Sunday evening — was undergoing surgery on Monday, experts said there was a need to improve safety measures at such fairs.\n\nSamema Banu (24) is the wife of Abdul Backi, who runs a lodge in Triplicane; the couple has two children, aged 4 and 1.5 years.\n\n“On Sunday evening, we visited the trade fair along with some of our relatives,” said Abdul Backi, speaking to The Hindu.\n\nSamema Banu, Abdul’s sister Nooriya Biwi and his cousin Khaja got tickets to take a ride on the giant wheel.\n\n“When my wife tried to buckle up, it did not lock properly. Hence, she sought the operator’s assistance, who locked it properly . When the ride started, the lock became loose and she started shouting for help. Khaja held onto her, but due to the speed, she was thrown off the giant wheel and severely injured her left leg,” explained Mr. Backi.\n\nShe was rushed to the Government Royapettah Hospital. “Her bone was sticking out. We subsequently shifted her to a private hospital near R.K. Salai, where she underwent a surgery on Monday afternoon,” said Mr. Backi.\n\nA tourism official at Island Grounds suspected that Samema Banu had not buckled up properly.\n\n“When officials checked, the lock was working properly. Besides, over 60 days have passed and there have not been any accidents,” he said.\n\nHe said that such rides were done on a contract basis. “Those selected to operate such equipment at the trade fair have to submit a safety certificate. Without this, they will not be allowed to operate such entertainment machines,” added the official.\n\nExperts said that the government should check the safety of the equipment before allowing them to be operated at a trade fair.\n\n“The Government should be very strict when it comes to safety. Many a time, the equipment are locally manufactured,” he said.\n\nMr. Backi said that he had lodged a complaint at the Triplicane police station.", 
    "section": "national", 
    "title": "Giant wheel mishap raises safety concerns", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}