{
    "author": [
        "Deepa H"
    ], 
    "text": "The year 1977 saw labourers, tailors, rickshaw pullers, soda sellers and small farmers being elected as MLAs in the State on AIADMK ticket. Party founder M.G. Ramachandran, popularly known as MGR, chose candidates based on recommendations from party leaders whom he trusted.\n\nFormer MLA, Ko. Samarasam, who too made it to the list that year, hailed from a poor family and went on to do his MA and Ph. D after MGR helped him. Mr. Samarasam recalled how a loader K.R.Chinnarasu became an MLA in Krishnagiri. “He would load consignments on trucks. Later, he set up a parcel booking office and his business grew slowly,” he said. Of the 130-odd MLAs at that time, at least 70 of them had such backgrounds, recalled Durai Karuna, a journalist who has covered the AIADMK for a long time.\n\n“Nilakottai Balusamy, a labourer was chosen by MGR. He didn’t have money to pay Rs. 250 for the election deposit,” he said, adding that in the AIADMK ordinary people with no political background could rise to occupy high posts. After MGR, when the mantle was passed on to Chief Minister and general secretary Jayalalithaa, she continued the practice. During her 1991-96 stint, Gemini Ramachandran who ran a soda shop and was a party platform speaker, became an MLA from Arani constituency.\n\nR. Pandurangan, MLA from Anaikattu, came from an ordinary farmer’s family. He was known to show his immense affection and respect for Ms. Jayalalithaa by falling at her feet every time he saw her.\n\nSitting Avinashi constituency MLA A.A. Karupusamy, who is the party’s fishermen’s wing secretary at the union level, was a temple priest. And who does not know about the mercurial rise of O. Panneerselvam, two-time Chief Minister? He ran a tea shop and was also in the business of supplying milk.\n\nMeghala Chitravel, who has written several books on MGR, claimed, “When candidates are selected, Amma (Jayalalithaa) looks for cadres who know the people and their issues well. Many of them would be on first name basis in their localities.”\n\nAs the party processes over 26,000 applications from cadres for tickets, party seniors say Ms. Jayalalithaa might even give seats to those who have not applied. “She goes about the selection process in a very scientific manner. She gives marks to each candidate based on the interview and what is in his application. Apart from information gathered from party office-bearers, she has her own network of persons giving her unbiased inputs. She assesses the personality of the candidates,” claimed a party senior. Even an ordinary village-level secretary can be given a ticket based on his “faithfulness” to the party and the leader.\n\nFor women, youth\n\nParty seniors said that this time too youngsters, especially women, would have better opportunity. The lists are being finalised and the first batch is expected to be released soon.\n\nLabourers, farmers and those without money to pay deposit have secured ticket", 
    "section": "national", 
    "title": "In AIADMK, being ‘ordinary’ worker is no bar for a ticket", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}