{
    "author": [], 
    "text": "Recently, the National Council of Science Museums has proposed to establish an ‘Innovation Hub’ at District Science Centre in Tirunelveli to meet the requirements of budding innovators and scientists. The proposed facility will provide an opportunity to students and the common man to express their new scientific ideas. If there is wide scope then the ideas will be discussed and evaluated by experts for further action. In the interest of students and young innovators of Tirunelveli and neighbouring districts, this hub should be established at the earliest.\n\nP. Victor Selvaraj,\n\nPalayamkottai.\n\nPlant trees\n\nKanyakumari is one of the important tourist places in the country and the number of tourists visiting the town is increasing every day. While the government has built more toilets on Beach Road and at other places, they are not be enough for the increasing number of tourists.\n\nAs summer is approaching, tourists stay back in their rooms and come out only in the evenings to avoid the scorching heat on Beach Road. So it will be good to plant more trees on either side of Beach Road from the new bus stand up to Gandhi Mandapam, so that it will add more greenery and shade to the tourists.\n\nW.D. Chitranand Arachi,\n\nKanyakumari.\n\nStray dog menace\n\nI refer to the news report (March 10), “Sterilise stray dogs to protect humans, Supreme Court tells States.” It is strange that the Supreme Court has to give directions to the States even for sterilising stray dogs as they have become a grave threat to the lives of human beings. The stray dog menace is a crucial issue to be addressed in all the States, especially in tourist centres. Recently, I had been to Kanyakumari where I could see many dogs roaming about jeopardizing the safety of tourists.\n\nCan’t the Blue Cross Society take steps to take care of the stray dogs at least in tourist spots and keep them away from the public? A few days back, in Palayamkottai, a stray dog bit two girl students when they were eating lunch under a tree in their school.\n\nThey were taken to Tirunelveli Medical College Hospital for treatment. Shanthi Nagar, Murugankurichi and Samathanapuram in Palayamkottai are the areas worst affected by stray dogs. I request the Corporation to eradicate this menace.\n\nAs it has been pointed out, if sterilisation is the only option for reducing the population of stray dogs the State has the responsibility to spend the needed money for this process in the interest of citizens following the rules of Prevention of Cruelty to Animals Act.\n\nE. Rajakumar Arulanandham,\n\nPalayamkottai.\n\nTrain halt\n\nPanagudi is a developing town located on the highway. The railway station has been renovated recently with two loop lines. But most of the trains do not stop here, though the Kudankulam Nuclear Power Plant and ISRO unit are located nearby. But there is no connectivity to Chennai in morning hours from here. The railway authorities should provide a halt for Guruvayur Express at Panagudi.\n\nG. Pradheeban,\n\nPanagudi.\n\nImprove industrial activities\n\nI would like to highlight the issues facing Tuticorin, Tirunelveli and Kanyakumari districts. Urgent steps are required to improve industrial activities in these southern districts. The Nanguneri Special Economic Zone in Tirunelveli district is yet to become full-fledged. The Sethusamudram project has been crying for attention. As for Kanyakumari district, the time has come to tap its natural resources in a fair manner.\n\nA strict vigil is needed to preserve the resources of Kanyakumari that are being misused. Immediate steps are required to expand the Tuticorin airport and introduce night flights, apart from increasing the number of services.\n\nI request the authorities to look into these issues and take serious steps to improve industrial activities in the southern districts.\n\nP. Senthil Saravana Durai,\n\nVazhavallan.\n\nMoral obligation\n\nThere are two notable concerns regarding the Assembly elections in Tamil Nadu. Though literacy is not a prerequisite for contesting elections, development in a high-tech world depends largely on education.\n\nAs per 2011 census, the average literacy rate in Kanyakumari district is 91.96 per cent. Hence, it is reasonable to expect well educated legislators from various constituencies of the district.\n\nIn the 2011 Assembly elections, Kanyakumari district polled the lowest percentage of votes (68 per cent) while the State average was 77.8 per cent, which means, people who were entitled to vote did not turn up for voting.\n\nThere can be no justification for that. People are morally obliged to vote.\n\nPolitical parties are requested to bring to political limelight a group of trustworthy, corruption-free and knowledgeable people who can steer the State to excellence and all voters need to exercise their legitimate franchise.\n\nG. Stanley Jeyasingh,\n\nNagercoil.", 
    "section": "national", 
    "title": "‘Innovation Hub’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}