{
    "author": [], 
    "text": "At the outset, I would like to make it clear that the intention of this letter is not to find fault with the novel idea put into practice over a stretch of about 800 m of NSR road under the fancy name, ‘Car-free Sundays.’\n\nThough its announced duration is two-and-a-half hours from 6.30 a.m. to 9 a.m., it lasts for almost 6 hours from 4 a.m.\n\nThe young and the aged do enjoy to the brim the given liberty by playing, singing, dancing or by resorting to their routine physical exercises. The question that arises in one’s mind is why should an arterial road be blocked for hours together, when playgrounds in the nearby education institutions like Avila Convent, GCT, Forest College, or Ramalingam Chettiar High School can be used for the purpose. As town buses get diverted through Alagesan road, the passengers who normally board them at the designated stops on NSR road, have to walk up to Alagesan road. Fuel consumption will also be more. If people come from far and wide it may be just out of curiosity to know what really is happening. The above play-grounds or even VOC Park will be ideal for such well-meant Sunday diversions.\n\nK.D. Viswanaathan,\n\nThadagam Road\n\nMore coaches needed\n\nThe Coimbatore-Nagercoil-Coimbatore Express has just one AC 3 tier coach. Repeated pleas for an additional AC 2 tier coach have fallen on deaf ears.\n\nIt is very difficult for senior citizens to occupy middle or upper berths in 3 tier coaches.\n\nThe railways should immediately allot an AC 2 tier coach in the train.\n\nA.S. Gopala Krishnan\n\nKaradimadai Road.\n\nLane discipline\n\nThe traffic police should implement lane discipline for two-wheelers, and four-wheelers.\n\nIt will help decongest the arterial roads.\n\nThis should be made a part of the Smart City plan.\n\nPrasanna Krishnan,\n\nPeelemedu.\n\nMobile post office\n\nIn 1970, the Postal Department was having a mobile post office in the State.\n\nI still remember the mobile postal van coming to Chennai Marina Beach clock tower area, and Jansi Rani Park of Madurai (in front of YWCA building) between 6.45 p.m. and 7.15 p.m.\n\nI request the department to re-introduce the van so that the general public, particularly businessmen, can make use of the same.\n\nG. Radhakrishna,\n\nPachapalayam.", 
    "section": "national", 
    "title": "Is car-free Sunday necessary?", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}