{
    "author": [
        "M K"
    ], 
    "text": "“Let my son be the last victim of honour killing in Tamil Nadu,” says daily-wage earner C. Velusamy (47) of Komaralingam near Udumalpet in Tirupur. His son V. Shankar (22) was hacked to death while the latter’s wife was also brutally injured in an attack near the Udumalpet bus stand on Sunday.\n\nVelusamy, who lost his wife Selvanayagi three years ago, raised his three sons by working as a farm labourer. Shankar was the eldest and would have been the first in the family to complete collegiate education. “His death comes as disaster. The government should put an end to such killings,” he said.\n\nMonday would have been his last day in college. On the fateful day, he went to Udumalpet with his wife S. Kausalya (19) to buy new clothes for his farewell on Monday. “Nobody guessed that it would be the last day of his life,” Shankar’s brother Vigneshwaran (19), a second year B.Sc. computer science student in a college at Udumalpet, said.\n\nShankar and Kausalya were married eight months ago. Shankar was in the third year when he and Kausalya, who was then in the first year in that college, fell in love. They used to travel in the same bus. Shankar’s family came to know about their marriage only when the couple approached the Udumalpet All Woman Police Station about seven months ago seeking protection, following threats.\n\n“My brother said that it was a registered marriage as her caste-Hindu parents started looking for an alliance for her after coming to know that she was in love with a Dalit boy,” Vignesh said. The girl discontinued college in the second year and started working in a nearby firm.\n\nIt is learnt that Shankar also got placed in campus recruitment in a firm in Chennai, and was supposed to join after his final semester exams. He wanted to help his wife complete her degree and support his other school-going younger brother to pursue higher education.\n\nThe girl’s family had come to his house twice and asked her to return home or face dire consequences. The victim’s relatives and friends used to escort the couple when they went out of the village, fearing attacks by the girl’s family. But since there were no threats of late, they started going out without the escort, which helped the assailants.", 
    "section": "national", 
    "title": "‘Let my son be the last victim of honour killing’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}