{
    "author": [
        "L Renganathan"
    ], 
    "text": "Adikumbeswarar theppotsavamto be celebrated on March 23\n\nPlans are under way to completely drain the Mahamaham tank of all water and refill it with fresh water in time for the Sri Adi Kumbeswarar temple float festival slated for March 23.\n\nThe tank was renovated ahead of the once-in-12-years Mahamaham rituals that commenced on February 13, peaked with the Mahamaham Teerthavari on February 22 and taper into weekend gatherings over the next three weeks. In all, more than 60 lakh pilgrims had taken bath in the Mahamaham tank as associated spiritual spots such as Portramarai tank and the Chakra Padithurai on the banks of the River Cauvery. That included 46.40 lakh people during the February13 to 22 period.\n\nDue to the visit of lakhs of pilgrims during the past month, the Mahamaham tank and the Portraramari tank water necessitated recycling. Although the Kumbakonam Municipality and other departments tried to maintain the tank by frequently recycling water, spraying disinfectants and resorting to prevention of communicable diseases, the pilgrims had been rightly calling for a wholesale emptying of the Mahamaham tank and Portramarai tank waters that they rightly claimed had turned unfit for bathing purposes.\n\nHeeding their pleas and for filling the Mahamaham tank with fresh water to smoothly conduct the fast approaching temple float festival scheduled for March 23, the authorities are emptying completely the tank from Tuesday and will fill it with fresh waters to ready the tank before March 20.\n\nThe works will include emptying the tank, clearing the silt, and then refilling the tank with fresh water. The Portramarai tank will undergo extensive clean up and refill with fresh water.\n\nAfter that, the authorities plan to enforce the bathing arrangements that existed prior to the Mahamaham teerthavari rituals — allowing pilgrims and devotees to take bath in the tank only in the areas close to the bunds on all the four sides and denying them access to the interior sacred wells.\n\nOn Sunday, the last day of the Tamil month of Masi, there were huge gathering of devotees in the Mahamaham sacred spots and an estimated two lakh people visited Kumbakonam during the day and took bath in the tanks. Buses were re-directed to allow free flow of pilgrims through the main thoroughfares of the temple town.\n\nHowever, sections of the officialdom expect several more thousands to throng the Mahamaham tank in the next month as well to add up to the lakhs who have already visited the sacred spots and devising measures to meet their demands as well.", 
    "section": "national", 
    "title": "Mahamaham Tank to be refilled with fresh water ahead of float festival", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}