{
    "author": [], 
    "text": "The roundabout at No. 1 Tollgate needs lane marking and preferably traffic signals. The speed-breakers need to be painted as per the rule. The expanded roads have been encroached upon with parked vehicles obstructing the view of oncoming vehicles for the driver. I hope the authorities will sort these issues soon.\n\nT.M. Ranganathan,\n\nSrirangam\n\nEnforce law on\n\ndefacement\n\nWith the model code of conduct in force, public walls of Tiruchi sport a clean look. The Tiruchirapalli City Corporation should enforce the Tamil Nadu Open Places (Prevention of Disfigurement) Act throughout the year. Without proper enforcement, public properties are defaced. If a pro-active corporation takes up the matter then Tiruchi will look smart. Several voluntary organisations are keen to help the corporation in this matter. Thousands of youth are involved in the weekends in cleaning and greening the city. Their energy and enthusiasm must be used for the betterment of the city.\n\nA. Prabaharan,\n\nPuthanampatti\n\nStray dog\n\nmenace\n\nStray dog menace in Salafi Nagar has reached a new high. The canines bark relentlessly at night, disturbing the peace in the area. People are unable to get a good night’s sleep. I appeal to the corporation to take steps to end this menace.\n\nO.M. Mohamed Nawas,\n\nSalafi Nagar, Wireless Road\n\nProblems during\n\nprocessions\n\nFuneral processions create traffic snarls. Some mourners burst crackers on the way and throw away garlands on overhead power cables. I appeal to the corporation to take appropriate steps to solve this problem.\n\nAravind K. Rao,\n\nSrirangam\n\nBuild integrated\n\nbus stand\n\nIntegrated bus stand, which was proposed in the 1990s, is yet to materialise in Tiruchi. With the construction of a multi-level bridge at Viralimalai Road intersection in full swing, there is extensive traffic diversion. As the work progresses to the Mannarpuram side, more diversions would be introduced. The authorities should take steps to get the Defence land at Mannarpuram to set up the integrated bus stand. Similarly, a service road should be provided to the residents of Ramachandra Nagar and Chettiappaty on either side of the Tiruchi–Madurai National Highways.\n\nH. Ghouse Baig,\n\nCrawford\n\nBad road\n\nPuthanampatti is 30 km from Tiruchi. Buses are operated from Tiruchi to Puthanampatti via SH 62 via Thiruvellarai and Omanthur. The 12-km road from Thiruvellarai to Puthanampatti via Saalappatti, Sirugudi, and Omanthur is in bad condition. Motorists, especially two-wheelers, suffer because of dangerous pits, soil accumulation, and gravel erosion in this State highway. Two sharp curves at Sirupathur pose a threat. I request the authorities to take action to asphalt the road.\n\nSaravanan Natesan,\n\nPuthanampatti\n\nRun more trains on\n\nMadurai-Punalur line\n\nTrains service between Tiruchi and Thiruvananthapuram is inadequate. There are two trains that start at midnight and midday. If the Madurai-Punalur passenger was extended as Tiruchi-Punalur Express, it will be a good option for passengers. Please introduce some more trains on this route.\n\nDeepu Krishna,\n\nTiruchi\n\nFix reflectors\n\non medians\n\nMedians are meant to avoid accidents by not letting the vehicles cross the road. But what is the use if they lead to accidents. The huge concrete medians in Samayapuram Tollgate to Musiri Road, Nochiyam to Manachanallur Road, and the medians on Tiruchi Road in Thuraiyur don't even have reflectors. So persons unfamiliar with the roads are facing problems, leading to accidents. Reflectors should be installed on the medians.\n\nAnbin R. Inian,\n\nWoraiyur\n\nCircuitous route\n\nto Junction\n\nThe Dindigul Road-Railway Junction arm of the new bridge has been opened for traffic, vehicle owners find it useful to go to Melapudur and areas on the other side of the junction. But vehicles proceeding towards Crawford, Mannarpuram, and K.K. Nagar have to take a little circuitous route via Junction roundabout and along the junction road and make a roundabout turn to reach the old bridge. To make it easy for them, a small U-turn can be provided before proceeding towards roundabout. The road below the bridge near Aristo Hotel should be levelled and traffic allowed till black topping or concrete road is formed.\n\nGaspar Amaldas,\n\nPonnagar Extn,\n\nSchoolgirls\n\nharassed\n\nAt Melapudur, schoolgirls are harassed by mentally ill persons and boys. Boys sitting on the parapet on either side of the railway track abuse the girls. The girls are harassed at Periyasamy Towers in Chatram bus stand where there are many schools and colleges. Police should swing into action at least once in two weeks to put fear of law in the minds of these boys.\n\nS. Prakash,\n\nTiruchi\n\nHave a clean\n\npoll campaign\n\nPolitical parties should desist from distributing money among voters during the election. They should desist from promising freebies. Canvassing should be done without disturbing traffic and exam going children.\n\nG. Nallasivan,\n\nTiruchi\n\nRegulate traffic\n\nat Tiruvanaikovil\n\nCrossing the road at Tiruvanaikovil Trunk Road is a nightmare, particularly for people visiting the temple. A traffic constable could be posted here or a traffic signal installed to regulate traffic. Will the authorities look into the problem?\n\nS. Rajagopal,\n\nRockfort\n\nMore schemes\n\nfor women\n\nA nation which does not respect women will never be great. Accordingly, Chief Minister Jayalalithaa has given great recognition to women by reserving 50 per cent of the seats in local bodies. Introduction of women commandos, encouragement to women athletes and schemes for women would be a great help for women’s emancipation and development.\n\nR. Pichumani,\n\nThippirajapuram\n\nPoor finishing mars\n\nMahamaham book\n\nOn account of the Mahamaham, the Department of Hindu Religious and Charitable Endowment released a 256-page Kumbakonam Mahamaham-2016 special issue. The magazine consists Kumbakonam profile, including details of several temples and theertham, besides several valuable devotional articles. But due to lack of proper binding, the sheets were loose. There were several spelling errors.\n\nM. Baluswamy,\n\nKumbakonam\n\nLong-pending\n\ndemand ignored\n\nThere is a huge demand for 45 years for introducing a day train between Tiruchi and Bengaluru, especially from senior citizens such as myself. Often we cannot get reservation in the existing train even one month in advance.\n\nS. Shankar,\n\nVayalur Road", 
    "section": "national", 
    "title": "Mark lanes, put up speed-breakers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}