{
    "author": [
        "Staff Reporter"
    ], 
    "text": "District election officials here on Monday asked mobile phone retailers and service providers to report abnormal transactions. Sources said that in the meeting headed by Collector Archana Patnaik, officials of the expenditure monitoring committee asked them to report bulk purchases and also requests for bulk connections.\n\nThough there was no limit or guideline, the officials told the dealers and service providers that if they found any abnormality they should report the same to the election officials at the control room number.\n\nBulk messages\n\nThe officials also asked the mobile phone service providers to provide details of bulk messages being sent through their network.\n\nThis was a routine meeting the officials had held, the sources said and added that on Tuesday, the officials would meet jewellers and pawn brokers to brief them on the rules regarding carrying cash and documents for the same.\n\nPMK’s charge\n\nThe meeting comes two days after Pattali Makkal Katchi’s chief ministerial nominee Anbumani Ramadoss alleged here in a press meet that a few political parties tried to bribe voters by giving smart phones.\n\nMeanwhile, officials of the Flying Squad II in the Thondamuthur Assembly constituency on Monday seized Rs. 1.06 lakh from a businessman, who did not carry necessary documents.\n\nAccording to officials, the Squad II intercepted the businessman Santhoshkumar’s vehicle in Gandhipark and during the vehicle check seized the cash.\n\nHe did not carry documents, said the sources adding that he was on his way home in Chokkampudur.\n\nIn The Nilgiris district, the election officials seized Rs. 3.83 lakh from three persons in Makkamoola, Iron Bridge and Kunjapanai check-post in Udhagamandalam, Gudalur and Coonoor Assembly constituencies.\n\nMonday’s seizure takes the total amount seized in the district to Rs. 6.69 lakh.\n\nOfficials engaged in poll duty in Valparai Assembly Constituency on Monday seized 62 liquor bottles that were to be illegally sold.\n\nA release from the district administration said that officials found 48 bottles of 180 ml each and 14 bottles of 375 ml each in Kadamparai.\n\nThey also seized Rs. 37,900 cash. The release added that so far the officials in the Coimbatore district had seized Rs. 19.94 lakh for which the carriers did not have proper documents.", 
    "section": "national", 
    "title": "Mobile phone dealers asked to report abnormal transactions", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}