{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Marked rise in number of polling stations this time\n\nThe Election Commission is planning to send more paramilitary troops to Tamil Nadu for the upcoming Assembly polls as there has been an increase in the number of polling booths across the State compared to the previous polls.\n\n“There were over 50,000 polling stations during the 2011 Assembly polls and this has been increased to 65,616 for the coming Assembly polls; so naturally, we need more forces. A decision has been taken to send more forces during today’s meeting, but we have not decided on the number of companies to be sent,” said Chief Electoral Officer Rajesh Lakhoni.\n\nReplying to a query, he said a total of 240 companies of paramilitary troops were deployed for poll duty during the 2011 Assembly elections. According to the Election Commission, there were 54,315 polling booths during the Assembly polls in 2011.\n\nMeanwhile, the State Election Commission has set up 363 election facilitation centres across the State that began functioning on Monday. Voters can approach these centres for including their names in the voters list and for applying for voter ID cards. They can also avail a host of other election-related services.\n\n“These offices will work on Sundays too,” Mr. Lakhoni said. Voters applying for Electors Photo Identity Cards (EPIC) can pay a fee of Rs. 25 at these centres and collect their cards after two weeks, he said.\n\nPolitical parties too can use these centres to apply and collect orders for meetings and processions. The Election Commission has also set up three printing centres for printing voter ID cards.\n\n“People who have already registered and whose information we have uploaded on our server can download new EPICs in colour,” he said. Among the inmates of jails in the State, only those who are under preventive detention have voting rights, Mr. Lakhoni said. “So, we are checking who are eligible to vote,” he added.\n\n240 companies of paramilitary troops were deployed for poll duty during the 2011 Assembly elections", 
    "section": "national", 
    "title": "More paramilitary forces for poll duty", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}