{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "Fact-finding team visits the scene of crime, says attack well-planned\n\nPeople stage a road blockade at Komaralingam in Tirupur district on Monday demanding compensation of Rs. 10 lakh to the family of V. Sankar and a government job to his wife.— Photo: SPECIAL ARRANGEMENT\n\nThe murderous attack on Dalit youth V. Sankar (22) and his young wife Kausalya (19) at Udumalpet in Tirupur district on Sunday was an outcome of simmering differences between the two families over the last eight months.\n\nWhile Sankar died in the assault, his wife is recovering from grievous head injuries in the Coimbatore Medical College and Hospital.\n\nQuoting family and friends of Sankar, a fact-finding team of Evidence, a human rights organisation that visited the scene of crime, said that the Dalit youth was under constant threat from his in-laws ever since he married Kausalya in July 2015. The couple settled in Komaralingam, his native village, near Udumalpet. On one occasion, Kausalya was kidnapped and taken to Usilampatti by her relatives and was later rescued by the police. “Even last week, Kausalya’s parents came to Komaralingam and offered Rs. 10 lakh to Sankar’s family to send the girl with them. When she objected to this, they threatened her with dire consequences. Sankar was also threatened often…had the Madathakkulam police taken action on his complaints, this murder could have been averted,” said A. Kathir, executive director of Evidence.\n\nThe Udumalpet police have registered a case under Section 302 (murder) of IPC and also invoked the provisions under the SC/ST (Prevention of Atrocities) Act against the suspects. Perusing video footage, investigators reportedly identified two of the assailants, police sources said.\n\nMeanwhile Chinnasamy, father of Kausalya, surrendered before a Judicial Magistrate in Nilakottai in Dindigul district.\n\n‘81 honour killings’\n\nMr. Kathir said the murder of Sankar was not consequent to any sudden provocation but a well-planned case of ‘honour killing’. Seeking a compensation of Rs. 10 lakh to the aggrieved family, he said 81 honour killings have been reported in Tamil Nadu since July 2013 and a majority of the victims were women. There were instances where women who married or fell in love with other caste men were murdered and their bodies burnt to erase evidence.\n\nStressing on the need for a stringent law to prevent honour killings, he said cases of alleged suicides where the family disposed of bodies without conducting post-mortem should be investigated as a case of murder.", 
    "section": "national", 
    "title": "Murdered Dalit youth faced constant threat", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}