{
    "author": [], 
    "text": "Government urged to have clear policy, incentivise polytechnic education\n\nThis academic year as many as 1,01,121 seats in polytechnic colleges and 1,18,887 seats in engineering colleges in the State had no takers. Data shows that 57.35 per cent of seats in self-financing engineering colleges and 48.39 per cent in private polytechnics were filled. In institutions that offer part-time courses or allow for shift system, the admission has remained at about 50 per cent. The 12 colleges offering the shift system have managed to fill 60 per cent of their seats.\n\nWhile engineering college teachers blame the All India Council for Technical Education’s policies for the excess seats , polytechnic teachers say the government’s skewed policy has adversely affected the students. “The policy of giving free uniforms and laptops has resulted in students continuing their education up to class XII. When I canvas for polytechnic education in government schools, the authorities there refuse to provide transfer certificates to willing students citing pressure from the school education department to strengthen their schools,” alleges C. Sivakumar, principal of Excel Polytechnic College.\n\nE. Balagurusamy, former Vice-Chancellor of Anna University, says the government should have a clear policy. “There is no point in giving laptops to school students as it serves only as a diversion. Students only need good teachers. While it is good that students are finishing school, the government should incentivise polytechnic education also,” he said.\n\nHe also found fault with the quality of infrastructure both in government and self-financing engineering colleges, saying “It is a good trend that students are choosing arts and science colleges over engineering colleges. After a basic degree, they have more opportunities,” he said.\n\n“The government should focus on improving the quality of faculty as good teachers can ensure quality technical education,” he said.\n\nUnemployment is also high among engineering graduates.", 
    "section": "national", 
    "title": "Over 1 lakh engineering seats to remain vacant this year too", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}