{
    "author": [
        "C Jaisankar"
    ], 
    "text": "It is three days since Alagar (26), a farmer, committed suicide after his tractor was seized by “recovery agents” of a private finance company for loan default, his family is yet to recover from the shock.\n\nThe police have registered a case against seven persons of the finance firm who threatened the farmer.\n\nAkila (21), who got married to Alagar three years ago, is in a state of shock. She hardly speaks to anyone and refuses to eat. She could not believe that her loving husband had left her alone at this tender age itself.\n\nA pall of gloom descended on Orathur, a tiny village on the outskirts of Ariyalur.\n\n“No woman in the country should undergo the sufferings and pain that I am undergoing with the loss of my husband. He could not withstand the humiliation meted out to him. We have paid a heavy price,” said teary-eyed Akila.\n\nShe said a group of well-built men, who came to the house in search of the tractor and her husband, shouted at her in objectionable language and threatened the family with dire consequences if they did not get back the tractor.\n\nArumugam (65), father of Alagar, a marginal farmer with 1.5 acres of land, claimed that his son had repaid Rs.5.10 lakh out of Rs.7 lakh he had taken. He had sought one month time to pay the dues, but the agents of the company did not bother to listen.\n\nThey not only took away the tractor, but also insulted and humiliated him in front of others.\n\nDeivamani, mother of Alagar, said he had been the pillar of the family. He was the breadwinner. He constructed a small house by toiling for three years as a worker in Singapore. He had left behind a big void in the family, she said.\n\nTMC leader G.K. Vasan and PMK leader Anbumani Ramadoss visited the farmer’s house and consoled his family members on Monday.\n\nThe Ariyalur police have filed a case against Manivannan, Manager of Cholamandalam Finance in Perambalur and six others under sections 306 (abetment of suicide) read with 34 (acts done by several persons in furtherance of common intention), 506 (ii) (criminal intimidation), 323 (punishment for voluntarily causing hurt), 294/B (uttering obscene words) and 147 (rioting) of Indian Penal Code.\n\nAnil Kumar Giri, Superintendent of Police, Ariyalur district, told The Hindu that special teams had been formed to nab the accused.", 
    "section": "national", 
    "title": "Pall of gloom descends on Orathur village", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}