{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "Thousands of powerlooms in Tirupur and Coimbatore districts have envisaged a plan to go in for green and captive power.\n\nWith two lakh powerlooms in the two districts, about 100 MW of solar energy system (rooftop systems) can be installed if the powerloom units get assistance from the State and Central Governments to switch over from grid power to solar energy.\n\nOne powerloom unit had gone in for solar energy on a trial basis. Since these are small-scale units, they do not have the financial resources to invest in solar energy panels. If the Governments give 50 per cent of the cost as subsidy, the units can bear the remaining amount, according to the Coimbatore Tirupur District Labour Weavers Working Powerloom Owners’ Association.\n\nA powerloom shed with 12 looms now consumes 150 units of power a day. It is estimated that a shed requires 10 HP power. It means 20 KW of installed solar energy capacity and the total cost for solar energy system works up to nearly Rs. 14 lakh. Instead of giving subsidy to powerloom units in the electricity consumption charge, the State Government should look at financial support to these units to switch over to solar energy, suggested M. Senthil Kumar, chairman of Southern India Mills’ Association.\n\nThe Coimbatore Tirupur District Labour Weavers Working Powerloom Owners’ Association has appealed to the Central and State Governments to extend 50 per cent of the cost (which works up to Rs. 7 lakh) to each powerloom unit. The units can go in for on grid solar energy systems with net metering.\n\nThus, the powerloom sheds can consume the power generated on working days and when they close down operation (on holidays and festival days), the solar energy generated can be sent to the grid. This will make power cost economical to the powerlooms, these units can be self-sufficient on the power front, and the Government can supply the grid power to other industries.", 
    "section": "national", 
    "title": "Powerloom units look at tapping solar energy", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}