{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Prime opponents are DMK and AIADMK, says CPI leader\n\nThough the Desiya Murpokku Dravida Kazhagam had announced its decision to contest alone, the People’s Welfare Front was still hopeful that Vijayakant would consider its invitation to align with it and fight the DMK and the AIADMK under one plank, said Communist Party of India (CPI) State secretary R. Mutharasan here on Monday.\n\nSpeaking to reporters, he said that the PWF comprising the CPI, CPI (M), MDMK and the VCK, had invited Mr. Vijayakant a long time back. “We have held discussions with the DMDK leader in this regard…Though he had announced his decision to fight independently, we are hopeful that he would invite us for talks,” he said, and refused to divulge further when more questions were asked.\n\nThe PWF’s objective was clear.\n\n“If we are elected to power, we will give a clean administration, corruption-free governance and liquor-free Tamil Nadu. From time immemorial, many parties had entered into understanding during elections, which was seen more as electoral politics. The PWF had been founded with a broader objective to cleanse the State of corruption and liquor. The parties together would deliver their promises, he added.\n\nHe said that the PWF was clear about who should or which party should align with it and who should not.\n\nThe prime opponents of the PWF were the DMK and the AIADMK. The designs of the BJP and the Congress would also be exposed, he said.\n\nWhen asked about the CPI (M) coming closer to the Congress to fight against the Trinamool Congress in the West Bengal election, Mr. Mutharasan said that it would not affect their prospects in Tamil Nadu.\n\nCondemning the AIADMK government for “having ruined the State in the last five years”, Mr. Mutharasan said that honour killing had become so common that even on Sunday a young Dalit was murdered in broad daylight for having married a caste Hindu girl.\n\nHe also strongly condemned the way, farmer Balan was humiliated by a private banker and the police for not paying two EMIs of a loan in Thanjavur district.\n\nThe fishermen too suffered at the hands of Sri Lankan navy personnel and the government in the island nation. Both the Centre and Tamil Nadu governments had failed to protect them, he also charged.", 
    "section": "national", 
    "title": "PWF still optimistic of Vijayakant joining it", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}