{
    "author": [
        "Madurai Bureau"
    ], 
    "text": "A total of 26,511 students (13,115 boys and 13,396 girls) are expected to appear for the SSLC examination in Kanyakumari district in 108 examination centres on Tuesday.\n\nThe examinations end on April 13, according to sources in the education department.\n\nNumbers of students appearing for examination in three education districts are; Nagercoil 8636 — (4231 boys, 4405 girls); Thuckalay — 9482 (4794 boys and 4688 girls) and Kuzhithurai — 8393 (4090 boys and 4303 girls).\n\nForty-three flying squads and 200 static surveillance teams are formed.\n\nBesides these, special flying squads headed by officials in the rank of Joint Director, Chief Educational Officer and District Election Officers have also been formed.\n\nThirty-four scribes will write examination for visually challenged and dyslexia students. Eighty differently abled students will also appear for the examination. The dyslexia and differently-abled students would be given an hour extra for the examination, the sources said.\n\nThoothukudi\n\nArrangements are in place for the examination in Thoothukudi district. As many as 25, 613 students — 12,504 boys and 13, 109 girls from a total o 292 schools — are expected to write annual public examination commencing on Tuesday. Among the total students, 16,079 students from Thoothukudi educational district and 9,534 from Kovilpatti educational district would write the exam, sources from Department of Education said on Monday. Exam centres numbering 56 in Thoothukudi and 31 in Kovilpatti were arranged.\n\nTirunelveli\n\nA total of 47,133 SSLC students including 23, 240 boys and 23,893 girls from 466 schools would appear for the public exam, Chief Educational Officer R. Swaminathan said. As for Tirunelveli educational district, 16,551 students and in Cheranmahadevi educational district, 15,298 students would sit for the exam.\n\nIn Tenkasi educational district, a total of 15,284 students were ready to take the exam, he said.\n\nTotally 149 exam centres were established in the entire district. With the deputation of 270 standing squads and 10 flying squads, proceedings would be keenly monitored in exam halls, the CEO said.", 
    "section": "national", 
    "title": "SSLC exam from today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}