{
    "author": [], 
    "text": "With the onset of summer, the government should arrange adequate public drinking water points to help the people.\n\nG. Sathyanarayanan Iyer,\n\nThanjavur\n\nFence the toilet\n\nThe toilet at the ration shop at Annai Anjugam Nagar in Kumbakonam should be fenced. In the absence of fence, anti-social elements use the building. A toilet should be built for the benefit of the public.\n\nK. Santhanam,\n\nKumbakonam\n\nSpruce up\n\nMahamaham wells\n\nI am a senior citizen, with vision and hearing impairment. During the mahamagam festival, I took a dip in the tank for five days. The arrangements were good, but the temporary bus stands were not well connected with feeder services. The location of the public toilets could have been better planned. Previously, there was less number of devotees and taking bath in the 20 wells did not pose a problem. Can these wells be spruced up and maintained well for Masi Maham every year?\n\nV. Srinivasan,\n\nThiruppanandal\n\nStray dog menace\n\nStray dog menace is on the rise at Chettimandapam area causing much nuisance to residents. The local body should take steps to check the problem\n\nS. Lakshmi,\n\nKumbakonam\n\nMark lanes, put up\n\nspeed-breakers\n\nThe roundabout at No. 1 Tollgate needs lane marking and preferably traffic signals. The speed-breakers need to be painted as per the rule. The expanded roads have been encroached upon with parked vehicles obstructing the view of oncoming vehicles for the driver. I hope the authorities will sort these issues soon.\n\nT.M. Ranganathan,\n\nSrirangam\n\nProblems during\n\nprocessions\n\nFuneral processions create traffic snarls. Some mourners burst crackers on the way and throw away garlands on overhead power cables. I appeal to the corporation to take appropriate steps to solve this problem.\n\nAravind K. Rao,\n\nSrirangam\n\nRun more trains on\n\nMadurai-Punalur line\n\nTrains service between Tiruchi and Thiruvananthapuram is inadequate. There are two trains that start at midnight and midday. If the Madurai-Punalur passenger was extended as Tiruchi-Punalur Express, it will be a good option for passengers. Please introduce some more trains on this route.\n\nDeepu Krishna,\n\nTiruchi\n\nBad road\n\nPuthanampatti is 30 km from Tiruchi. Buses are operated from Tiruchi to Puthanampatti via SH 62 via Thiruvellarai and Omanthur. The 12-km road from Thiruvellarai to Puthanampatti via Saalappatti, Sirugudi, and Omanthur is in bad condition. Motorists, especially two-wheelers, suffer because of dangerous pits, soil accumulation, and gravel erosion in this State highway. Two sharp curves at Sirupathur pose a threat. I request the authorities to take action to asphalt the road.\n\nSaravanan Natesan,\n\nPuthanampatti\n\nMore schemes\n\nfor women\n\nA nation which does not respect women will never be great. Accordingly, Chief Minister Jayalalithaa has given great recognition to women by reserving 50 per cent of the seats in local bodies. Introduction of women commandos, encouragement to women athletes and schemes for women would be a great help for women’s emancipation and development.\n\nR. Pichumani,\n\nThippirajapuram\n\nPoor finishing mars\n\nMahamaham book\n\nOn account of the Mahamaham, the Department of Hindu Religious and Charitable Endowment released a 256-page Kumbakonam Mahamaham-2016 special issue. The magazine consists Kumbakonam profile, including details of several temples and theertham, besides several valuable devotional articles. But due to lack of proper binding, the sheets were loose. There were several spelling errors.\n\nM. Baluswamy,\n\nKumbakonam\n\nLong-pending\n\ndemand ignored\n\nThere is a huge demand for 45 years for introducing a day train between Tiruchi and Bengaluru, especially from senior citizens such as myself. Often we cannot get reservation in the existing train even one month in advance.\n\nS. Shankar,\n\nVayalur Road\n\nHave a clean\n\npoll campaign\n\nPolitical parties should desist from distributing money among voters during the election. They should desist from promising freebies. Canvassing should be done without disturbing traffic and exam going children.\n\nG. Nallasivan,\n\nTiruchi", 
    "section": "national", 
    "title": "Streamline water supply in Thanjavur", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}