{
    "author": [
        "Udhav Naig"
    ], 
    "text": "Protesters call deaths of students “institutional murders” and not suicides\n\nEngineering Students Federation protesting at Anna University against management of Sai Ram Engineering College in connection with the recent suicide of a student. —Photo: R. Ragu\n\nAt least a hundred engineering college students raised slogans demanding accountability for the successive deaths of four engineering college students — Ajith Kumar (St. Joseph College of Engineering, Sriperumbudur), Abinath (Sri Sairam Engineering College, West Tambaram), Vignesh (Kathir College of Engineering, Coimbatore), Gunaseelan (Mahendra College of Engineering, Namakkal) — from their college managements, outside Anna University campus here on Monday.\n\nThe students of Sri Sairam Engineering College and St. Joseph College of Engineering rejected the claim that depression was the cause of their peers’ suicide.\n\nWhile Abinath’s parents said that he had told them about the harassment by college authorities, Ajith Kumar’s friend said that Ajith was often humiliated for ‘studying engineering for free’ even by senior staff the college.\n\n“He was studying engineering on a government scholarship. This humiliation led him to take such a decision. The management is responsible,” charged Ajith Kumar’s friend.\n\nThe students who had come from seven colleges said that these were ‘institutional murders’ and called for a complete reform of these colleges.\n\n“We demand that a compensation of Rs. 20 lakh be given to families of the deceased. And, we want the government to ensure that the colleges have an elected student union to deal with their grievances,” said Kannan of Students Federation of India.\n\nIn a statement released to the media, Saiprakash Leo Muthu, CEO, Sri Sairam Engineering College, said that Abinath was ‘not very keen on studying engineering’.\n\n“His lack of interest in pursuing engineering reflected in his performance in the various tests conducted. In the recent university examination results too, he had failed in 4 subjects out of 6,” the statement said. His poor performance had disturbed him and he did not attend the classes on the fateful day (11 March 2016), the report added.\n\nRepresentatives met officials of Directorate of Technical Education and explained their grievances. “They have assured us that a decision on having an elected students union will be taken by the end of this month. They said that they will ensure that four students, who were being pushed out for protesting against Sairam management, will not be harassed by the management,” said one of the organisers of the protest. The students said that they would continue to protest until there is a concrete solution.\n\nThe students say they would continue to protest until there is a concrete solution", 
    "section": "national", 
    "title": "Students demand elected unions", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}