{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "On January 29 last year, Senthamizh Anbu was supposed to go on a trip to Gokarna, Karnataka. On the night of January 28, he was returning home from work at night with a friend on a two-wheeler, when he met with an accident.\n\n“We were crossing the Keelkattalai junction when a buffalo, running across the road, hit my knee and the rear wheel of the bike. My friend, who was riding, had turned the bike towards the median, but luckily the bike did not fall. There is no proper lighting on that stretch and I could barely see the buffalo,” he said.\n\nThe 26-year-old had been hit so badly, that for a little while, his vision was hazy. The 108 ambulance eventually took him to a hospital, where doctors found he had a ligament tear and a bone injury in the knee.\n\nMore than a year on, the IT professional says, his leg has still not completely recovered.\n\n“I used to be a badminton player and a sprinter. I play badminton now, but it’s not the same as before. And I haven’t sprinted since the accident,” he said.\n\nAwareness drive\n\nIt took over two months for him to recover, and even with his office’s insurance paying for most of the costs, Senthamizh’s family still had to pay some medical costs. Today, he along with friends and colleagues conduct road safety awareness campaigns at schools, colleges and traffic signals. “I wasn’t wearing a helmet that day and had the bike fallen on the median, my injuries would have been much worse,” he said.\n\nDoctors who treat road traffic accident victims say that they can cause a myriad of problems – apart from a loss of income to the family, it can cause disabilities, lower the quality of life and sometimes, the victim cannot go back to the job he once had.\n\n“We operate on between 30 and 40 cases a month. Ninety per cent of them are male, and most are between the ages of 20 and 30. Rash driving, drunken driving, overtaking buses, jumping traffic signals and sometimes having more than two people on the bike are some of the causes,” said M.M. Sankar, professor of neurosurgery, Government Stanley Hospital.\n\nDr. Sankar explained that with a mild injury, patients can recover within a month, but with severe head injuries it could take six months and even then, manual labour and some other kinds of jobs may not be possible.\n\n“And it’s not only the patient’s income that is lost – usually, a family member is there throughout at the hospital and their income too, may be lost,” he said.\n\nDisability\n\nDisability is another issue, said S. Balu, head of the emergency department at SRM Institutes for Medical Science, Vadapalani.\n\n“Some victims become paralysed. Some don’t have insurance. Some victims have more than one injury – for instance to the head, abdomen, chest or fractures,” he said.\n\nA majority of the 20 to 25 cases the hospital sees per month are of those in the age group of 18 to 50 – the working age group.\n\nFor many like Senthamizh, an accident is not just short-term pain. It has long-term consequences.\n\nDisabilities, loss of income and lower\n\nquality of life are\n\namong the issues accident victims face", 
    "section": "national", 
    "title": "The long and arduous path to recovery", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}