{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Thayumanaswamy Temple, Rockfort: Theppam festival, Karpaga virutcham – Kamadhenu vaganams, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Sri Venugopalan Sannidhi, Ranganathapuram, Srirangam, 6 p.m.; Padmam Flats, Malligaipoo Agraharam, Srirangam, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 92, Balamurugan Street, Amman Nagar, 6 p.m.\n\nJamal Mohamed College: Milad-u-Nabi festival, M.Mohamed Abuthahir, professor, Noorul Islam Arabic College, chief guest, 9.30 a.m. & 3 p.m.\n\nGENERAL\n\nIndian Institute of Management-Tiruchi: Convocation, Ajit Balakrishnan, Chairman and CEO, Rediff.com India Ltd., delivers the convocation address, Vinay Sheel Oberoi, Secretary, MHRD and Chairman, Board of Governors, IIM-Tiruchi, presides, NIT campus, 4 p.m.\n\nSaranathan College of Engineering Department of Management Studies: Santhosh Subramanian, senior finance manager, Microsoft Corporation, speaks on Steps for corporate career success, 11.15 a.m.\n\nK. Ramakrishnan College of Technology Department of Mechanical Engineering: Mesmer 2016, 10 a.m.\n\nThe Institution of Engineers: G. Arunpandiyan, lecturer, Periyar Centenary Polytechnic College, speaks on Recent Trends in CNC Machining, institution building, BHEL Township, 5 p.m.\n\nTamil Nadu Integrated Social Workers’ Association: International Social Workers Day, C. Shanthakumar, Director, The Spastics Society of Tiruchi, chief guest, Hotel Arun, 4.30 p.m.\n\nShrimati Indira Gandhi College: SIGCOM exhibition, 10 a.m.\n\nPeriyar E.V.R. College: National seminar on “Partition literature and its relevance to contemporary India”, 10 a.m.; valedictory address by T. Marx, professor, University of Pondicherry, 3.30 p.m.; Consumer Rights Day, S.Pushpavanam, Secretary, Consumer Protection Council, Tamil Nadu, speaks, 11.30 a.m.\n\nSrimad Andavan Arts and Science College: Valediction of NSS special camp, A.Lakshmi Prabha, NSS Coordinator, Bharathidasan University, chief guest, Community Centre, Kambarasampettai, 11 a.m.\n\nBishop Heber College Department of Economics: Valediction of Economics Association, R.Rajendran, associate professor, E.V.R. College, 9.30 a.m.\n\nNational College Department of Tamil: Dr. K. Rajarathinam endowment lecture by Arasu Parameswaran, assistant professor, Arignar Anna Government Arts College, 11.30 a.m.\n\nChidambaram Pillai College for Women, Manachanallur: Motivation Day, C. Thiruchelvam, Registrar, Bharathidasan University, speaks, 10 a.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti: Seminar on “R. Language”, 5.30 p.m.\n\nTamil Nadu Retired Government Employees’ Association: Conference, K. Gangadharan, State president, presides, VSM Thirumana Mahal, Khajamalai, 10 a.m.\n\nM.A.M. College of Engineering: Arjuna 2016 – intra-departmental project exhibition, M.A. Mohamed Nizam, college secretary, inaugurates, 9 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}