{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Bharathi Kannamma is determined to contest from Madurai Central constituency\n\nBharathi Kannamma says she is open to contest through any political party which assures to fulfil the demands of transgender people.— Photo: S. James\n\nThe loss in 2014 Parliament election has not deterred Bharathi Kannamma (56), the only transgender to contest in that poll in Tamil Nadu.\n\nMs. Kannamma, who contested as an independent candidate and secured 1,226 votes in Madurai Lok Sabha constituency, is determined to contest from the Madurai Central Assembly constituency in the upcoming election for Tamil Nadu Assembly.\n\n“Though I knew I would lose, I was pleasantly surprised that I secured the 15th rank among the 31 candidates,” Ms. Kannamma said.\n\n“It was anyway not about winning but to highlight the problems of transgender and open up the electoral space for people like me. I think I have succeeded fairly well in that,” she said.\n\nShe said that fellow activists like P. Sudha from Transgender Initiative of India, K. Raadhika and Devi are planning to contest in this election in Chennai and Salem.\n\nMs. Kannamma said she is open to contest through any political party which assures to fulfil the demands of transgender people.\n\n“Free education, housing, skill development training and employment are our primary demands,” she said, adding that she should also be allowed to discharge her duty as an MLA without any interference.\n\n“I have been approached by two political parties. I have also been invited by Ilaignar Kootamaippu, a group of youngsters who are planning to field candidates in this election,” she said.\n\nShe, however, added that even if none of the parties give her a seat, she will contest the election as an independent.\n\nShe expressed hope that she can make a better impact in this election. “I am already a familiar face because of the Lok Sabha elections. Moreover, since we do not have families to spend time with, people know that we will be at their service any time,” she said.\n\nOn elections becoming more expensive, she said that she spent only Rs. 55,000 for the Lok Sabha election as many people helped her in terms of logistics and publicity.\n\n“This time also I hope many kind hearts will be there to help,” she said.\n\nBharathi Kannamma is determined to contest from Madurai Central constituency in the upcoming Assembly elections", 
    "section": "national", 
    "title": "Transgender to try her luck again", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}