{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Voters’ facilitation centres have been opened at 13 places in Virudhunagar district to provide election-related assistance to voters and political parties.\n\nVirudhunagar Collector and District Electoral Officer, V. Rajaraman said that the centres hade been set up at all the nine taluk offices, three offices of the Revenue Divisional Office and at the Collectorate.\n\nAll persons above the age of 18 years can verify whether their names were available in the voter list or not from the centre. They could also use the centre for online application for inclusion of names, change of address and incorporating corrections.\n\nThey could use the centres to apply for duplicate elector's photo identity card (EPIC).\n\nSimilarly, political parties could use the facility for online application for vehicle permission, permission for public meetings and rallies.\n\nMr. Rajaraman said that the movement of all the flying squads in the seven Assembly constituencies were being monitored online through the control room. “With the global positioning system installed in the flying squad vehicles, monitoring them has become easy,” the Collector said.\n\nThe Collector could also monitor the movements on his mobile phone.\n\nMeanwhile, Superintendent of Police P. Aravindhan said that nine inter-district check-posts were checking the movement of vehicles. With the police and revenue officials having conducted a special drive to remove hoardings in the district already, the number of cases of violation of model code of conduct stood at just 34. Political parties had erased many of the wall writings in the district.\n\nThe police had identified 700 trouble-mongers and127 of them had been made to give bonds of good conduct failing which they would be remanded, he said.", 
    "section": "national", 
    "title": "Voter facilitation centres opened in 13 locations in Virudhunagar district", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}