{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Principal District and Sessions Judge M.M. Krishnan has directed a woman to stay away from Anaipatti, her native village, in connection with a Protection of Civil Rights (PCR) Act case here on Monday and sign every day at the police station in Cantonment in Tiruchi for one month from Tuesday.\n\nThe Judge was hearing a conditional bail petition filed by her in this connection.\n\nSpecial Public Prosecutor (PCR cases) A. Vellaisamy said that Andavar of Anaipatti village in Uthamaplayam block had committed suicide on February 13 owing to torture, abuse and intimidation by Caste Hindus. Tension gripped the village even today. Heavy police were deployed at the village to bring the situation under control. Above all, it was a grave crime against the community.\n\nGranting bail to Revathi, daughter of Mayi and her presence at the village would escalate communal tension, he argued.\n\nThe Defence Counsel stated that she was a woman who has a small child. So condition bail could be granted on those grounds.\n\nOn hearing the case, the judge advised Revathi not to enter Anaipatti village and sign at the police station in Cantonment in Tiruchi city at 10 a.m. daily for the next one month. Earlier, her father Mayi was arrested and remanded in judicial custody. In a complaint, Siva, son of Andavar, had lodged complaint with Royappanpatti police station stating that Mayi and her daughter had threatened his father that he had stolen Rs.1 lakh from his house and forced him to sign a bond for Rs.70,000 in this connection.\n\nThe deceased went to his house thrice to receive his daily wages. But they did not settle his wages and also abused him and foisted false complaints against him. Unable a bear the mental agony, he had committed suicide.\n\nActing on his complaint, cases were filed under PCR Act and 306 of IPC against Mayi and his daughter Revathi.", 
    "section": "national", 
    "title": "Woman told to stay away from village", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}