{
    "author": [
        "Karthik Madhavan"
    ], 
    "text": "Sometime last year, the Coimbatore Corporation started of the work to construct a bicycling and walking track on the Valangulam bund.\n\nThe corporation turned its focus on the water body after it had evicted the illegal occupants by providing them tenements in Ammankulam and taking up beautification works in Big Tank and Perur Tank.\n\nIt first said that it would strengthen the bund at Rs. 75 lakh and then take up the construction of walking and bicycling track.\n\nTwo phases\n\nThe civic body proposed that it would take up the work in two phases – the first phase would the development of the track on the 1.6 km stretch of the bund that ran almost parallel to the Trichy Road and in the second phase the rest of the bund.\n\nThe officials said that the corporation had earmarked Rs. 5 crore for the purpose.\n\nThe corporation then began the work to strengthen the bund and lay the tracks.\n\nEven as the work progressed, the corporation said that it welcomed private participation to develop islands in the tanks to plant trees and construct an amphitheatre.\n\nBut in the process of laying the track, the corporation was accused of dividing the tank on the eastern side.\n\nThe corporation said that it planned to construct culvert to the take the water from the western side of the bund to the eastern side, near the Sungam roundabout but that did not cut ice. Even the Public Works Department wrote to the Coimbatore Corporation in this regard.\n\nIn this backdrop, the corporation appears to be going slow on laying the track.\n\nA look at the tank suggested that no track construction was in progress.\n\nCoimbatore Corporation officials said that work was on and model code of conduct would have no impact as the civic body had started the work long ago.\n\nThey added that senior officials were seized of the matter and that with private participation, the corporation would definitely develop the bund.\n\nThe tank with a bund length of 5 km is part of the Noyyal eco system.", 
    "section": "national", 
    "title": "Works to create bicycling tracks stop", 
    "subsection": "tamilnadu", 
    "date": "2016-03-15"
}