{
    "author": [
        "National Bureau"
    ], 
    "text": "Delhi Police Commissioner B.S. Bassi, who has been accused of blatant partisanship in the handling of the recent JNU crisis, was dropped on Friday from the list of names recommended for appointment as Information Commissioners in the Central Information Commission.\n\nThe decision was taken by a selection panel led by Prime Minister Narendra Modi, after its member and leader of the Congress in the Lok Sabha Mallikarjuna Kharge opposed the move. Mr. Bassi will retire from service at the end of this month and was hoping to be one of the three names recommended for appointment as Information Commissioners.\n\nThe decision came in the face of severe criticism of Mr. Bassi’s conduct in recent times, especially in the last few days since the Delhi Police arrested Jawaharlal Nehru University Students Union president Kanhaiya Kumar. While the arrest is now being seen as appalling police excess based in all probability on doctored tapes, what followed has further infuriated more sections of society.\n\nThe Delhi Police stood by, as if on order, when a group of goons attacked journalists, teachers and students in the Patiala House Courts complex during the hearing of Mr. Kumar’s case over two days. Hundreds of journalists marched through the heart of the city to the Supreme Court on Tuesday, demanding the dismissal of Mr. Bassi.\n\nA defiant Mr. Bassi has been justifying the the Delhi Police, despite the Supreme Court’s intervention. And all his actions have only added weight to allegations of the AAP government that Mr. Bassi was acting as a BJP agent.\n\nThe committee, chaired by Mr. Modi and comprising Union Finance Minister Arun Jaitley and Mr. Kharge, met at the Prime Minister’s South Block office on Friday. Minister of State in the Prime Minister’s Office Jitendra Singh was present.\n\nSources said Mr. Kharge was against Mr. Bassi’s candidature.", 
    "section": "national", 
    "title": "Bassi out of CIC candidate list", 
    "subsection": "general", 
    "date": "2016-02-20"
}