{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Maharashtra opposition criticises govt. for not issuing ads on Maratha warrior’s birth anniversary\n\nThe Maharashtra government-approved Shivjayanti (birth anniversary of Chhatrapati Shivaji) on Friday was marred by controversy after the Opposition slammed the government for not publishing advertisements to honour the king, accusing the Bharatiya Janata Party-Shiv Sena government of sidelining the Maratha warrior.\n\n“The BJP used Shivaji Maharaj’s name to win elections. But now, it seems that the party is not interested in carrying on with his legacy. It is unfortunate that the government could not publish a single ad to commemorate the birth anniversary of the Maratha king,” said Nawab Malik, chief spokesperson, Nationalist Congress Party (NCP).\n\nThe Congress slammed the government for sidelining Chhatrapati Shivaji on his birth anniversary. “We expect the government to act instead of advertise or promise. The issue of memorial is pending, as the government seems to be dragging the issue forever,” said Ashok Chavan, president of Maharashtra unit of the Congress.\n\nIronically, BJP’s alliance partner Shiv Sena has maintained the position that king Shivaji’s birth anniversary should be celebrated as per the Hindu calendar and not according to English calendar. “No matter whether we are in government or not, our position on Shivjayanti has not changed. We have been celebrating it as per the Hindu calendar and will continue to do so,” said a senior Sena minister.\n\nThe BJP, however, defended its government saying the opposition must recheck its own tenure.\n\n“Did they honour the king ever? What right do they have to ask questions to us? All allegations made by the Opposition are nothing but out of desperation. The government is working on the thoughts of Chhatrapati Shivaji and will continue to do so,” said Keshav Upadhye, BJP’s spokesperson.", 
    "section": "national", 
    "title": "‘BJP-Shiv Sena have sidelined Shivaji’", 
    "subsection": "general", 
    "date": "2016-02-20"
}