{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "The event will serve as a platform to showcase the best Indian artwork in the comic medium.— File photo: AFP\n\nFrom the deliciously madcap to traditional derring-do to the bleakest visions of urban despair, connoisseurs in Pune are set to savour the treasures of comics as the fourth edition of the highly successful Comic Con event hits the city on Saturday.\n\nThe two-day event, a veritable feast for pop-culture aficionados, will witness talks by international artists including Ivan Brandon and Peter Nguyen. More significantly, the event will serve as a platform to showcase the best Indian artwork in the comic medium with launches of graphic books by Indian authors.\n\n“We are thrilled to bring the Comic Con experience to Pune,” said Jatin Varma, founder, Comic Con India.\n\n“Comic Con Express is a travelling version of our bigger shows, incorporating all the key elements of pop culture. The show in Pune will feature a sampling of the best in Indian and International comics juxtaposed with content from the worlds of films, television and gaming.”\n\nThe convention is a great platform for the increasing number of people who have begun experimenting with comics, creating, writing and illustrating their own works, he said.\n\nThe event will feature the launch of final instalments of two of the hottest favourites in Indian comic series, Taranath Tantrik: City of Sorrows and Shaitan .\n\nTaranath Tantrik , authored by Shamik Dasgupta, has achieved a cult status with its rendering of an apocalyptic Kolkata as a metropolis in decay, riven by gore, violence and corruption.\n\nInterestingly, for inspiration of his memorable central character of the devilish-looking Tantrik, Mr Dasgupta turned to legendary Bengali author Bibhutibhushan Bandopadhyay, and based his ominous character on a minor one created by Mr Bandopadhyay in his literary classic Pather Panchali , which introduced the world to its boy-protagonist Apu.", 
    "section": "national", 
    "title": "Comic Con Express begins in Pune today", 
    "subsection": "general", 
    "date": "2016-02-20"
}