{
    "author": [
        "Satyasundar Barik"
    ], 
    "text": "The Centre is ready to talk to Maoists if they lay down arms without any conditions, Union Home Minister Rajnath Singh said here on Friday.\n\nEmerging from a meeting with Odisha Chief Minister Naveen Patnaik at the Secretariat here, Mr. Singh said: “Violence does not have any place in a healthy democratic set-up.\n\n“There is a government at the Centre under the dynamic and visionary leadership of Narendra Modi. I appeal to all people involved in Left-Wing Extremism (LWE) to come forward and contribute in building a powerful and self-dependent India.”\n\n“If they lay down arms and shun violence, we are ready to talk to them within the constitutional limits,” he said.\n\n‘Situation better’\n\nExpressing satisfaction over the success in anti-Maoist operations in the region, the Home Minister said: “I have reviewed the security scenario in Andhra Pradesh and Odisha. There has been improvement in curbing Maoist violence.”\n\n“I have assured the State government of maximum assistance to combat LWE,” he said.\n\n“According to information received, four Maoists have been killed in Jharkhand. Maoists have suffered casualties in Chhattisgarh. Our security personnel use force only in self-defence,” Mr. Singh said.\n\nAsked about the status of the Integrated Action Plan (IAP), a special development scheme for Maoist-affected areas, the Home Minister said: “Implementation of the IAP has been discussed in detail. We will revive the programme.”\n\nEarlier in Koraput, the Home Minister appealed to the Maoist cadres to join the mainstream.\n\nDGP K.B. Singh and Home Secretary Asit Tripathy were present during the review meeting in Koraput. In Bhubaneswar, Chief Minister Patnaik appealed to the Home Minister to sanction two companies of Central forces for combating Maoists.\n\nOur security personnel use force only in self-defence, says Home Minister", 
    "section": "national", 
    "title": "Govt. ready for talks if Maoists shun violence, says Rajnath", 
    "subsection": "general", 
    "date": "2016-02-20"
}