{
    "author": [
        "S Anandan"
    ], 
    "text": "The Bharatiya Janata Party on Friday staged a dharna in front of Excise Minister K. Babu’s residence at Tripunithura, demanding justice for the second-year Mohiniyattom student of RLV College of Music and Fine Arts who attempted suicide on February 8. ABVP, the party’s student wing, has alleged that the attempt was a fallout of her being harassed because she was a Dalit.\n\nAt the root of the issue is graffiti that allegedly appeared in a girls’ hostel bathroom and the college campus, linking the victim to a senior student. Over the last week, the BJP has been reiterating that this was a case of Dalit persecution.\n\nT.N. Govindan Namboory, Principal, RLV College, told The Hindu that on February 1, the student filed a formal complaint about her name being inappropriately linked to a final-year student in some scrawls on the campus walls. The boy, a former SFI worker, also gave a complaint. The college union held by SFI, too, wanted to trace the miscreant behind the graffiti. A telephone call was reportedly made to the girl’s fiancé that had led to her marriage proposal falling through.\n\nFollowing discussions with the activists of the SFI and the ABVP, it was decided that the complaint be forwarded to the police’s women’s cell, Mr. Namboory said.\n\nThe girl said the principal assured her of action but student representatives opposed her. She maintained that it was a political issue and caste had nothing to do with it. The girl’s mother said on phone that the college should have taken care to contain the matter, adding that it was not a caste issue.\n\nAccording to M. Baiju Poulose, Circe Inspector, Hill Palace, five persons were arrested on charges of criminal intimidation and actions intended to insult the modesty of women. They were later released on bail. The police had obtained complaints made to the college authorities, besides her suicide note and diary. Caste angle, if any, would be investigated.\n\nC.P. Madhavan Nampoothiri, faculty member, said the decision to hand over the case to the police was taken at the general body after everyone demanded it. “We don’t know what happened after the meeting on February 8. At night, some ABVP activists, not her hostel mates, informed us of her suicide bid.”\n\n“We want justice for the victim. The ABVP’s attempt is to portray her in a poor light so as to fashion a counterpart to Hyderabad’s Rohit Vemula,” alleged V.M. Junaid, SFI district secretary.\n\nABVP national executive committee member Shyam Raj accused the police of “colluding” with the SFI activists and dragging their feet on the case. “They registered a case after a lot of delay. They hastily made the girl sign a statement as soon as she came out of the ICU. We demand that her statement be freshly recorded, with inclusion of the Dalit persecution element.”\n\nStudent and her family say the suicide bid had nothing to do with her being a Dalit", 
    "section": "national", 
    "title": "Graffiti in Kerala fine arts college given caste colour", 
    "subsection": "general", 
    "date": "2016-02-20"
}