{
    "author": [
        "National Bureau"
    ], 
    "text": "Sharad Yadav says the move is against the secular fabric of the country\n\nJanata Dal (United) president Sharad Yadav on Friday protested against an alleged move by the government to withdraw the minority status for the Aligarh Muslim University (AMU) and the Jamia Millia Islamia (JMI), saying it will infringe on the rights of Muslims and will be against the Constitution.\n\nHe said in a statement that there was “unrest” in the community over the issue. “It is against the Constitution and secular fabric of this country. It is absurd that the institutions made by the minority community will lose their minority status. It will not only demoralise them, the public at large will also feel threatened as it will show that the Constitution and the Acts passed in Parliament have no value,” he said.\n\nMr. Yadav said the government in 1981 amended the AMU Act which acknowledged that the university was set up by Muslims for Muslims. It was also acknowledged that AMU should be run by its elected court and be considered a minority institution, he said, accusing the Narendra Modi government of trying to a make a U-turn in this regard.\n\n“It is disturbing that on January 11, 2016, when the case challenging the minority status of these institutions came up for final disposal, the government made a complete U-turn on the issue and said that it wanted to take back the affidavit given by a previous government. I am worried about this move to infringe on the rights of the minority, especially Muslims,” he said.\n\nMr. Yadav said the minority status ensured that these institutions could keep their character and also support their communities. “I oppose this move and will urge it to desist from such actions and utterances, which play with the sentiments of the minority communities, in order to keep peace and harmony in the country,” he added.", 
    "section": "national", 
    "title": "JD(U) opposes move to withdraw minority status of AMU, Jamia", 
    "subsection": "general", 
    "date": "2016-02-20"
}