{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Bihar Chief Minister Nitish Kumar on Friday slammed the Narendra Modi government at the Centre for slapping sedition charges on Jawaharlal Nehru University Students’ Union (JNUSU) president Kanhaiya Kumar without sufficient evidence, and said the violence unleashed on the trial court premises earlier in the week was proof that a “jungle raj” prevailed in Delhi.\n\nAddressing mediapersons on the sidelines of his weekly “Janata Durbar” here, Mr. Kumar said, “The BJP-led Central government has triggered an emotional issue through the JNU row to hide its failure on the economic front... they are yet to produce the evidence to justify the sedition charges made against Kanhaiya Kumar… why don’t they produce the evidence in public?”\n\nHe said the JNU had been their (BJP/RSS) target as there were very few people in the university who believed in the saffron ideology.\n\nReferring to the violent incidents at Delhi’s Patiala House courts in which the JNUSU president and journalists were beaten up by a group of lawyers despite a Supreme Court order to the police to ensure security, Mr. Kumar said, “It all indicated there is a jungle raj in Delhi and not in Bihar.”\n\n“People of other parties too are nationalist but they do not require a certificate of their nationalism from them (BJP/RSS).”\n\nEarlier in the week, Mr. Kumar had said that the JNU student leader was a nationalist and so were political parties. “The BJP is trying to impose its ideology on the JNU campus through the ABVP and so it has triggered the emotional stir there,” said the Chief Minister.\n\nMeanwhile, hundreds of students demanding the early release of Kanhaiya Kumar, stopped trains at various places in Bihar on Friday.\n\nThe agitating students were mainly from the All India Students’ Federation, the All India Students’ Association and the Students’ Federation of India.", 
    "section": "national", 
    "title": "‘Jungle raj’ prevails in Delhi, says Nitish", 
    "subsection": "general", 
    "date": "2016-02-20"
}