{
    "author": [
        "Nagesh Prabhu"
    ], 
    "text": "Despite strong resistance from the Opposition Bharatiya Janata Party, the State government has decided to recommend the candidature of Karnataka Law Commission Chairman S.R. Nayak for the post of Karnataka Lokayukta.\n\nThe government will make the recommendation by next week to Governor Vajubhai R. Vala, who is the appointing authority for the Lokayukta. It now remains to be seen if the Governor will give his consent to the recommendation. According to sources, four members in the six-member panel, headed by Chief Minister Siddaramaiah, opposed the candidature of Mr. Nayak.\n\n‘Mere formality’\n\nAs soon as the meeting commenced, Mr. Siddaramaiah recommended the name of Mr. Nayak and Leader of the Opposition in the Legislative Assembly Jagadish Shettar opposed it. Sources in the BJP said: “The Chief Minister just completed the formalities and only consulted the other members in the panel.”\n\nMr. Shettar and his counterpart in the Council, K.S. Eshwarappa, Council Chairman D.H. Shankaramurthy and acting Chief Justice of High Court of Karnataka Subhro Kamal Mukherjee, all members of the panel, are said to have opposed the candidature of Mr. Nayak. They recommended the name of Vikramjit Sen, retired Supreme Court judge, for the post.\n\nAccording to sources, the Chief Justice abstained from the meeting held at Kumarakrupa Guest House here, but he had sent a note to the meeting recommending the name of Mr. Sen for the next Lokayukta. Legislative Assembly Speaker Kagodu Thimmappa, who backed the candidature of Mr. Nayak, also abstained from Friday’s meeting.\n\nBJP members argued that a complaint of disproportionate assets against him has been filed with the Lokayukta police and hence it was not appropriate to recommend his name for the post.", 
    "section": "national", 
    "title": "Karnataka to recommend S.R. Nayak as Lokayukta", 
    "subsection": "general", 
    "date": "2016-02-20"
}