{
    "author": [], 
    "text": "Researchers led by an Indian-origin scientist have designed innovative membrane wings inspired by bats, paving the way for a new breed of unmanned Micro Air Vehicles (MAVs) that can fly over long distances and are more economical to run.\n\nThe wings work such as artificial muscles, changing shape in response to the forces they experience and have no mechanical parts, making MAVs incorporating them easier to maintain, said researchers from University of Southampton and Imperial College London in UK.\n\nThe unique design of the wings incorporates electro-active polymers that makes the wings stiffen and relax in response to an applied voltage and further enhances their performance.\n\nBy changing the voltage input, the shape of the electroactive membrane and, therefore, aerodynamic characteristics can be altered during flight. The proof of concept wing will eventually enable flight over much longer distances than currently possible.\n\nSometimes as small as 15 centimetres across, MAVs are increasingly used in a wide variety of civil and military applications, such as surveying remote and dangerous areas.\n\nOne emerging trend among MAV developers is to draw inspiration from the natural world to design vehicles that can achieve better flight performance and that offer similar levels of controllability to small drones but use the efficiency provided by wings to fly much further.\n\nResearchers focused on mimicking the physiology of bats — the only type of mammal naturally capable of genuine flight.\n\nTo inform and speed up the design process, they built innovative computational models and used them to aid the construction of a test MAV incorporating the pioneering ‘bat wings’\n\nThe findings were incorporated into a 0.5 metre—wide test vehicle, designed to skim over the sea’s surface and, if necessary, land there safely.\n\nAfter extensive wind tunnel testing, the vehicle was put through its paces at a coastal location.\n\n“We have successfully demonstrated the fundamental feasibility of MAVs incorporating wings that respond to their environment, just like those of the bats that have fuelled our thinking,” said Bharath Ganapathisubramani from University of Southampton who led the study. — PTI\n\nThe wings work like artificial muscles that stiffen or relax in response to an applied voltage", 
    "section": "national", 
    "title": "Now, bat-inspired micro vehicles that can fly over long distances", 
    "subsection": "general", 
    "date": "2016-02-20"
}