{
    "author": [], 
    "text": "A Kenya Wildlife Service (KWS) officer carries a tranquiliser gun, during a search for two escaped lions in Nairobi on Friday.— Photo: AFP\n\nWildlife rangers in Nairobi on Friday hunted for two lions who escaped from Nairobi’s national park and meandered into “highly populated” areas of the Kenyan capital.\n\nKenya Wildlife Service (KWS) issued an appeal, “for help to get two lionesses that strayed from the Nairobi National Park.”\n\nArmed rangers, as well as KWS vets with dart guns, scoured bush and agricultural land alongside the Kibera district, one of Africa’s largest slums.\n\n“Lions are dangerous wild animals. Avoid provoking the lions by confronting them,” said KWS spokesman Paul Udoto.\n\nAt least two lionesses are reported to have late on Thursday left the park, spread over 117 square kilometres where buffalo and rhino roam just seven kilometres from the bustling high-rise city centre. Local media reported as many as six lions might be on the loose.\n\nIt is not the first time lions have prowled into town. The big cats are under growing pressure as one of Africa’s fastest growing cities creeps onto ancient migration routes and hunting grounds.\n\nSometimes the lions are killed by livestock farmers protecting their herds, other times they prowl leafy gardens giving residents a fright.\n\n“These are highly populated areas and that is why we are intensifying the search,” Mr. Udoto said, adding that “anyone with information about them should share it with us immediately.”\n\nOne fearful Nairobi resident tweeted KWS spokesman Udoto asking whether she ought to “lock my kids in.”\n\n“Yes, please do until we report lions have been captured and safely returned to the park. Perils of born town lions,” Mr. Udoto replied. — AFP", 
    "section": "national", 
    "title": "Panic as lions on the loose in Kenyan capital", 
    "subsection": "general", 
    "date": "2016-02-20"
}