{
    "author": [], 
    "text": "The experiment will also help fight hunger and malnutrition by identifying varieties suited to growing in harsh conditions\n\nGrowing potatoes under tough conditions is considered a major step towards saving millions of lives on Earth in view of climate change.— Photo: International Potato Centre\n\nDo Peru’s potatoes have the right stuff?\n\nThat’s the question scientists will be asking in Lima next month, when a selection of tubers will begin undergoing tests to determine whether they’re fit to grow on Mars.\n\nNASA, the U.S. space agency, is conducting the pioneering experiment together with Lima’s International Potato Center (CIP).\n\nThey will cultivate a hundred selected varieties already subjected to rigorous evaluation in extreme, Mars-like conditions that could eventually pave the way to building a dome on the Red Planet for farming the vegetable.\n\nThe selection was made from a total of 4,500 varieties registered at CIP, a non-profit research facility that aims to reduce poverty and achieve food security.\n\nOf the selected candidates, 40 are native to the Andes Mountains, conditioned to grow in different ecological zones, withstand sudden climate changes and reproduce in rocky, arid terrain.\n\nThe other 60 are genetically modified varieties able to survive with little water and salt. They are also immune to viruses.\n\nThose that pass the tests must meet a final criterion — they must be able not only to grow well on Mars but also reproduce in large quantities. “We’re almost 100 per cent certain that many of the selected potatoes will past the tests,” said Julio Valdivia Silva, a Peruvian NASA astrobiologist who is taking part in the ambitious project.\n\nThe scientists hope the experiment will also help address the earthly scourges of hunger and malnutrition by identifying varieties suited to growing in harsh conditions.\n\n“We must be prepared for the future,” said virologist Jan Kreuze, a scientist at CIP. “To respond to desertification, rising temperature and high salt content in the soil.”\n\nVegetable of the future\n\nThe soil in La Joya Pampas — a sector of the Atacama Desert in southern Peru that’s considered one of the driest places on earth — is very similar to that found on the Red Planet.\n\nThe scientists plan to transport 200 pounds (100 kilos) of it to a CIP laboratory in Lima that will simulate the complex Martian atmosphere —which contains mostly carbon dioxide — and expose it to extreme ultraviolet radiation.\n\n“We’ll have more concrete results in one or two years, Mr. Valdivia said, adding that it will take more than five years to launch an unmanned mission to Mars.\n\nThe potential future space crop is also one of the oldest.\n\nRecords of potato cultivation date back to 2500 BC, when the indigenous Aymara Indians farmed it in modern-day Peru and Bolivia.\n\nIf the varieties selected for next month’s experiment don’t adapt to the desert soil, the researchers will introduce nutrients and subject them to radiation.\n\n“If that doesn’t work,” Mr. Valdivia said, “we’ll administer a new method the CIP is using called aeroponics.” The technique, used for cultivating plants without soil, would expose roots inside a sphere or cube that is sprayed with nutrients and contains a system for removing toxins. In future years, NASA plans to build a Mars research centre in the Peruvian desert.\n\nIt would create a perfect replica of the Martian landscape and atmosphere for future research into space farming that could serve manned missions to Mars and other planets in the solar system. — AFP", 
    "section": "national", 
    "title": "Peru’s potatoes getting ready for a trip to Mars", 
    "subsection": "general", 
    "date": "2016-02-20"
}