{
    "author": [], 
    "text": "The Supreme Court on Friday sought the response from actor Salman Khan on Maharashtra government’s appeal against his acquittal in the 2002 hit-and-run case, observing that exoneration from the top court would “vindicate him once and for all”.\n\n“Acquittal from this court is important. If you (Salman Khan) are acquitted from here, you will be vindicated once and for all,” a Bench comprising Justices J.S. Khehar and C. Nagappan said while issuing notice to Salman.\n\nAttorney General Mukul Rohatgi, appearing for the State, said the Bombay High Court had erred on two points while acquitting the actor. “Firstly, the High Court had erred in its finding by holding that there was ‘erroneous application’ of Section 33 of Evidence Act (relevancy of certain evidence for proving, in subsequent proceeding, the truth of facts therein stated) by the trial court,” he said.\n\nMr. Rohtagi said that on second count, the HC erred by holding that the prosecution witness Ravindra Patil, a constable who was guarding the actor, and had first called the police, was not a “wholly reliable witness” and his version needed corroboration with accounts of witnesses.\n\nSenior advocate Kapil Sibal, appearing for Khan, said that in the FIR recorded on the statement of Patil, there was no mention of the actor being drunk.\n\n“He was a police officer and the first thing he would have said was that the actor was drunk,” he said adding the other eye witness Kamal Khan was not examined.\n\nMr. Sibal said the family driver, Ashok Singh, who deposed as a defence witness was also interrogated by the police, but his statement was not recorded by the Investigating Officer (IO).\n\nThe Bench, after hearing the arguments, posted the matter for further hearing after six weeks. — PTI", 
    "section": "national", 
    "title": "SC seeks Salman’s reply on appeal in hit-and-run case", 
    "subsection": "general", 
    "date": "2016-02-20"
}