{
    "author": [
        "Petlee Peter"
    ], 
    "text": "The cybercrime wing of the Criminal Investigation Department (CID) has traced the recent spate of online bank frauds — initiated by deactivating SIM cards of bank customers and regenerating one-time password (OTP) — to the banks themselves, or rather a few unscrupulous bank employees.\n\nOver the last few months, a network of fraudsters had siphoned off as much as Rs. 70 lakh from Bengaluru residents. The police have arrested a bank official from Hyderabad along with two other accomplices from Mumbai.\n\nThe Hyderabad bank employee has been linked to the Chickpet case where a city garment trader lost Rs. 9.62 lakh in November 2015. The police suspect that the banker leaked details of the garment dealer to the fraudsters. Investigators also suspect a similar bank connection in another case where a businessman lost Rs. 45 lakh to fraudsters.\n\nBanker involved in Rs. 45-lakh fraud?\n\nTheir modus operandi was ingenious in its simplicity and highlighted flaws not just in the banking system but also from the cellphone service provider’s end, said sources.\n\nAccording to Mr. Kumar, a man deactivated his business cellphone number attached to the bank account by personally visiting the mobile service provider’s outlet in Jayanagar. “Posing as my manager, the culprit submitted a copy of the Aadhaar card with a changed photograph and obtained a duplicate SIM after saying that he had lost his cellphone and the card needs to be blocked immediately,” Mr. Kumar told The Hindu .\n\nThe gang soon began operating Mr. Kumar’s online account obtaining OTPs on the duplicate SIM card and transferring the money quietly.The Mumbai connect\n\nOn Wednesday, CID investigators arrested two men from Mira Road, Mumbai, who were identified as Rahul Patil (24), a SIM card retailer, and Afsal (46), an insurance agent, in connection with Mr. Kumar’s case.\n\nA network of fraudsters\n\nsiphoned off\n\nRs. 70 lakh from Bengaluru residents", 
    "section": "national", 
    "title": "‘SIM deactivation fraud linked to bank insiders’", 
    "subsection": "general", 
    "date": "2016-02-20"
}