{
    "author": [
        "Omar Rashid"
    ], 
    "text": "The suicide of Dalit scholar Rohith Vemula and the ongoing unrest at Jawaharlal Nehru University loom large over Prime Minister Narendra Modi’s visit to Varanasi on February 22, a month after he faced protests by Dalit students in Lucknow.\n\nIn his constituency, Mr. Modi will pay homage at the Guru Sant Ravidas Mandir on the saint’s jayanti, before attending the convocation of Banaras Hindu University.\n\nIn what appears to be a showdown ahead of the Punjab Assembly elections, Delhi Chief Minister Arvind Kejriwal will also visit the temple a few hours after Mr. Modi. Thousands of Ravidasis (devotees) visit the holy place each year from across the country, including Punjab, where the saint has a huge following. The visit of the two leaders is interpreted as an attempt to woo Dalits.\n\nHowever, Mr. Modi’s visit to the birthplace of Sant Ravidas has been opposed by Left and Dalit student groups.\n\nMahesh Prasad Ahirwar, BHU professor and general secretary of its ST/SC Teacher Welfare Society, wrote to the Ravidas Trust, which manages the temple, to “review” the invitation to Mr. Modi. Mr. Ahirwar said his society “will not allow the political use of a religious site” and would protest Mr. Modi’s visit in a “democratic fashion.”\n\nThe Mandir, however, said the programme would go as per schedule. The BHU had proposed to confer an honorary doctorate in law on Mr. Modi, but he declined the degree, BHU spokesperson Rajesh Singh said.\n\nOn Monday, Minister of State for Social Justice and Empowerment Vijay Sampla visited the BHU and met Dalit students. There are also apprehensions that supporters of Hardik Patel could stage a protest against Mr. Modi to oppose his arrest after he led a massive protest to demand reservation for the Patels.", 
    "section": "national", 
    "title": "Unrest looms over Modi’s visit to Varanasi", 
    "subsection": "general", 
    "date": "2016-02-20"
}