{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "The residents of the village of the minor girl, who was allegedly raped by Rashtriya Janata Dal legislator Rajballabh Yadav, have decided to collect money to legally take on the bahubali (strongman) MLA, who has been absconding for the past two weeks.\n\nThe fugitive MLA, who was expected to surrender on Thursday, failed to turn up and the police on Friday arrested his son, Akhilesh Yadav, on the charge of “destroying evidence in the case”.\n\nThe residents of Sultanpur village in Nalanda district have declared that they would collect money to help the father of the victim to prosecute the MLA. “We know the family is not economically well-off and the father has been working hard to educate his children”, said Rajiv Kumar, one of villagers who were seething with anger against the MLA.\n\n“Such MLAs are sexual predators and we all have to teach him a lesson before he repeats the act with our sisters and mothers”, said another youth of the village.\n\n“Come what may, we’ll take this battle to its logical end”, the villagers said. After the incident, the parents of the girl who is to appear for her Standard X board examination next month, have confined themselves to the house.\n\nMeanwhile, the State government, while carrying out a major reshuffle of police officials, also transferred the Nalanda Superintendent of Police, for, as the buzz in the police headquarters was, “failing to arrest the absconding RJD MLA”.\n\nThe rape victim is from Nalanda district and was allegedly taken to the residence of the MLA in the adjacent Nawada district, where the incident took place.\n\nChief Minister Nitish Kumar had assured journalists earlier in the week that the MLA would be arrested soon. A young IPS officer, Ashish Mishra, has been appointed as the new Superintendent of Police of Nalanda.\n\nA court in Nalanda has issued an arrest warrant against the MLA and is likely to hear the anticipatory bail plea by the legislator on Saturday.", 
    "section": "national", 
    "title": "Villagers collect money to help rape victim sue MLA", 
    "subsection": "general", 
    "date": "2016-02-20"
}