{
    "author": [
        "Shankar Bennur"
    ], 
    "text": "A key player in enhancing Mysuru’s profile as the cleanest city, the zoo’s waste management model could be worth replicating\n\nWith Mysuru hogging the limelight after retaining the ‘cleanest city’ tag for the second year in a row, bulk waste generators across the country could look at the decade-old waste management system being followed by the Mysuru zoo.\n\nWhat is interesting is that the zoo earns income from the waste as it is converted into compost, which is used by many, including farmers, at their fields and gardens.\n\nVermicompost is produced using animal, vegetable and kitchen waste.\n\nOn an average, eight to 10 tonnes of vermicompost is produced in a month and it is marketed by the zoo. Vermicomposting is the process of recycling organic matter into nutrient-rich compost using worms.\n\nIt is an important source in supplementing and substituting chemical fertilisers in agriculture.\n\nAbout 12 years ago, the zoo came up with the project of generating vermicompost after it realised the that the waste generated on its zoo premises was making the conditions unhygienic.\n\nBesides helping to improve hygiene on the zoo premises, the project has brought in additional revenue to one of the country’s oldest and most prestigious zoological gardens.\n\nHow it does it\n\nOver a decade ago, Mysuru zoo was selling the waste from over 1,000 animals at throwaway prices. A lot of the waste lying in the zoo premises was unutilised\n\nDung from herbivores such as elephants, rhinos, hippos and gaur is a major source of vermicompost\n\nFallen leaves, grass and other green material from the garden section; and vegetable, kitchen and garbage waste are the other sources\n\nBlack-coloured, granular, lightweight and humus-rich compost is produced in 30 days after processing large volumes of organic residuals using earthworms", 
    "section": "national", 
    "title": "Waste to energy: Mysuru zoo shows the way", 
    "subsection": "general", 
    "date": "2016-02-20"
}