{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Officers celebrate after the passing out parade at Officers Training Academy in Chennai on Saturday.— Photo: By Arrangement\n\nA dentist, a professional Bharatanatyam dancer, a recipient of ‘May Queen Miss Pune’ and a software engineer were among the women, who were commissioned as short-service officers into the Army at an impressive ceremony here on Saturday.\n\nA total of 183 officers, including 37 women, were commissioned into the Army at the Officers Training Academy (OTA) after they completed their 49-week rigorous training schedule. Chief of Army Staff General Dalbir Singh Suhag reviewed the parade.\n\n“As officers the foremost duty is to provide leadership. Military leadership is unique and is tested in situations that are complex, challenging and demanding. You must therefore let your actions speak louder than your words. Hereafter you will lead the finest soldiers in the world. Your men are your most valuable asset,” General Singh said, after reviewing the passing out parade.\n\nOTA Commandant Lieutenant General Bobby Mathews was present during the parade.\n\nThe training at the OTA brought women who have excelled in various fields and have moulded them as officers. Lieutenant G. Vaishali, a native of Coimbatore, was a a Bharatanatyam dancer for 16 years, before she joined the Academy. Lieutenant Nikita A. Nair was the recipient of ‘May Queen Miss Pune’ few years back before she decided to join the Army.\n\nLieutenants Sahiba Sidhu, Barkha Srivastava and Nisha H.K. were dentist, architect and software engineer respectively before they joined the Academy.\n\nThe OTA in Chennai is the only Academy in the country that trains women officers for the Army.\n\nWhile Lieutenant Parikshit Bawa got the coveted ‘Sword of Honour’, Lieutenant Sonu Sharma stood first in the order of merit and Lieutenant Gobind Singh Danu stood third in the overall order of merit.\n\nGen. Singh briefed\n\nabout flood relief\n\nGeneral Singh later visited the Headquarters of Dakshin Bharat Area along with Lieutenant General Bipin Rawat, where they were briefed on the assistance provided by the Army during the December floods and the efforts taken in rescue and relief. Lieutenant General Jagbir Singh, General Officer Commanding, Dakshin Bharat Area was present, a release stated.", 
    "section": "national", 
    "title": "183 officers, including 37 women, commissioned into Army", 
    "subsection": "general", 
    "date": "2016-03-13"
}