{
    "author": [
        "Aabha Anoop"
    ], 
    "text": "When the District Child Protection Unit and Child Welfare Committee of Kozhikode invited applications from families to adopt a child for the two summer months, little did it expect the overwhelming response it got from all strata of society.\n\n“We have received more than 200 applications. We have enough choice,” Sheeba Mumtaz, District Child Protection Officer told The Hindu .\n\nThe summer foster care programme is being implemented in Kozhikode with an aim to familiarise children of the Government Children’s Home with a family atmosphere. “There are a lot of things that a child needs to learn from a family,” Ms. Mumtaz said adding that similar programmes had been successfully implemented in Kollam and Malappuram districts.\n\nSelection of parents\n\nThe parents are selected on the basis of interviews and background analyses. They should be settled in Kozhikode district. Couples with children are given preference because of their experience in handling children, and the atmosphere they can provide. Ms. Mumtaz said families settled outside India are not encouraged to join the programme, as it would be impossible for the office to conduct a follow-up on the child’s whereabouts.\n\nFlip side\n\nThe possibility of a child undergoing emotional trauma while being returned to the Children’s Home is a cause of concern.\n\n“Children and parents will be emotionally affected, but it will not last long. The children know they have to return after two months. Families are given the option of extending the period of foster care. They can visit the children during holidays. We have a team of psychologists and counsellors who handle such situations well,” said Ms. Mumtaz. Twenty-five children from the children’s home, in the age group of 5 to 18, have been short-listed for the programme. Some level of confidentiality is maintained on where each child is sent.\n\nParents adopt kids for two months from government home as part of a foster\n\ncare programme", 
    "section": "national", 
    "title": "A taste of family for these children of Kozhikode", 
    "subsection": "general", 
    "date": "2016-03-13"
}