{
    "author": [
        "Mahesh Langa"
    ], 
    "text": "Official says no cause for worry as radiation level has not gone up at the plant or in its vicinity\n\nEmergency declared:A view of the Kakrapar Atomic Power Station in Gujarat on Friday, after it was shut down following a heavy water leak.— Photo: AFP\n\nA day after a rupture in the coolant system in one of the reactors at the Kakrapar atomic power station in Gujarat, experts of the Atomic Energy Regulatory Board (AERB) launched an inquiry to identify the cause and nature of the leakage which forced the authorities to shut down the reactor on Friday morning.\n\n“We have carried out a thorough radiation survey and there is no change in the radiation level at the plant as well as outside. There is no increase in radiation level,” Lalit Kumar Jain, Director of the plant, said on Saturday. He said two experts from the AERB had arrived at the plant to take stock of the situation and help plant engineers in the normalisation process.\n\nAccording to Mr. Jain, the radiation level is being constantly monitored.\n\n“The probe is to identify the cause of the leakage in the primary heat transport system [PHTS],” he said.The leakage occurred in one of the operation units at the plant as another unit has been shut for maintenance since July 2015.\n\nNPCIL probe\n\nNuclear Power Corporation of India Limited (NPCIL) will investigate what led to the rupture in a feeder pipe in the heavy water system, which led to the spilling of heavy water on the floor of the reactor building on Friday. Following the incident, a plant emergency was declared. The plant emergency signifies a heightened state of alert for the plant personnel and management.\n\n“These feeder pipes, which carry heavy water, are made of high-grade carbon steel. We will do a metallurgical examination [of what led to the rupture in one of the pipes]. It is not a phenomenon which is frequent ... But the fact that all the safety systems came into operation immediately after the leak of the heavy water and the reactor was shut down automatically proves the robustness of the system,” said N. Nagaich, Director (Human Resources), NPCIL.\n\n“This is a failure of one component. We will investigate how it happened,” he said.\n\nThe NPCIL is tasked with building, operating and decommissioning nuclear reactors. There are two indigenously built Pressurised Heavy Water Reactors (PHWRs), each of 220 MWe capacity, operating at Kakrapar in Vyara district of Gujarat, about 80 km from Surat. These PHWRS use natural uranium as the fuel. Heavy water acts both as a coolant and moderator in the reactor.\n\nMr. Nagaich said there was “no cause for worry” and it had been “established” that there was no release of radiation into the atmosphere. Several samples had been taken from the environment and “they indicated that there is no rise in the radioactivity levels either in the plant site or outside,” he said.\n\n“Today, the situation is that the reactor is under cold shutdown. The [natural uranium] fuel core has been cooled. The coolant temperature has come down. It is around 30 degrees centigrade. It has come to normal temperature,” Mr. Nagaich said on Saturday.\n\nAbout 2,500 tonnes of ordinary/light water was used for long-term cooling of the natural uranium fuel core. This had led to the temperature of the fuel core coming down.\n\nWhen contacted, S. Harikumar, Secretary, Atomic Energy Regulatory Board (AERB), which keeps a watch on safety in nuclear establishments in the country, said on Saturday that “things are close to normal” at Kakrapar-1. The situation was under control and “plant parameters are almost normal”.\n\nThere are 306 small feeder pipes in the reactor system and they carry heavy water. Each feeder pipe has a diameter of about an inch and a half. Around 9 a.m. on Friday (March 11, 2016), when the reactor was generating its full power of 220 MWe, one of the feeder pipes ruptured, which led to the leak of heavy water, and its spilling on the floor of the reactor building. The reactor tripped immediately. Several safety systems kicked in and the reactor shut down automatically. The safety systems performed according to design. Cooling systems sprayed water on the fuel core, to ward off any possibility of the fuel core from melting. Asked how many tonnes of heavy water leaked into the reactor building, Mr. Nagaich said: “We will estimate it now. The first priority was the safe shutdown of the reactor. All safety systems are under close watch.”\n\nAutomatic shutdown\n\nWhat was significant, he said, was that the reactor shut down automatically, all the safety systems came into operation and there was no radiological consequence. As part of laid-down procedures, the management and plant personnel were alerted. A plant emergency was declared and the staff members were asked to be available at the plant site.\n\nAnil Kakodkar, former Chairman, Atomic Energy Commission, said what was important was that after the heavy water leak occurred, “the safety systems of the reactor took over and acted according to design.”\n\nPlant authorities say all safety systems kicked in soon after the leak was detected", 
    "section": "national", 
    "title": "AERB probing leak at nuclear plant", 
    "subsection": "general", 
    "date": "2016-03-13"
}