{
    "author": [
        "Prakash Kamat"
    ], 
    "text": "Even as a group of combined opposition MLAs on Saturday demanded an investigation, and action against the north Goa Collector for failing to act in the ‘Kingfisher villa’ SBICAPS mortgage case, acting Collector Swapnil M Naik said the matter was pending for an interim order.\n\nResponding to a statement from senior SBI officials citing a High Court order to attach liquor baron Vijay Mallya’s Kingfisher villa at Candolim in the coastal north that the Collector ‘failed’ to implement, Mr Naik told The Hindu that the SBI official’s statement was ‘entirely incorrect’.\n\nAddressing presspersons about the budget session of the Assembly scheduled to begin on Monday, four independent and two Congress MLAs, led by independent legislator Vijay Sardesai lashed out at the north Goa District Magistrate for what they termed ‘a blunder’ in the Rs 90-crore loan case the Kingfisher group is embroiled in.\n\nIn connection with the case registered after a petition filed under Section 14 of the Securitisation and Reconstruction of Financial Assets and Enforcement of Security Interest Act, the Bombay High Court last month extended by three months the time to complete the hearing and dispose of the matter, said Mr Naik.\n\n“In fact, the court had upheld our stand that because of various interventions and parties’ move to lead evidence by producing documents, it was necessary to hear the matter. The court passed an order asking the Collector to hear the case and dispose of the matter in three months,” Mr Naik said.\n\nHowever, he pointed out that north Goa Collector Nila Mohanan, who had conducted seven-eight hearings and was supposed to pass an interim order over collecting documents and related evidence, had to go on maternity leave from December 24. Ms Mohan is expected to resume office on April 1.\n\nWith that, the matter, Mr Naik said, reached him. He said after legal advice, he arrived at the conclusion that either he has to hear the whole matter afresh to pass an interim order or to keep the matter in abeyance. As Ms Mohanan was expected to resume office on April 1, it was decided to keep the matter pending for the order, Mr Naik said.\n\nThe SBICAP Trustee Company Limited had approached the Collector on behalf of the consortium of banks seeking to attach the villa on December 2, 2014.\n\nMr Mallya had taken a stand that the villa was rented to United Spirits Limited (USL). Simultaneously, the property was also mortgaged with the bank, with another company, United Breweries Holdings Limited (UBHL), owned by Mr Mallya standing as guarantor.\n\nBefore the SBICAP could approach the Collector for attachment of the property, the USL filed a caveat before the Collector to hear the case before passing an ex-parte order. While the Collector allowed that application, she rejected those filed by Kingfisher Airlines and the UBHL seeking to be made parties.\n\nWhen the USL wanted to lead the evidence by producing documents the SBICAP approached the High Court seeking directions to the Collector not to allow the USL to lead the evidence. And on August 26, 2015, a High Court order was passed allowing the Collector to allow the USL to lead the evidence and dispose of the matter in three months, which was subsequently extended, Mr Naik explained.", 
    "section": "national", 
    "title": "Collector faces flak for not attaching Mallya villa", 
    "subsection": "general", 
    "date": "2016-03-13"
}