{
    "author": [], 
    "text": "A Google-developed computer programme won its best-of-five match-up with a South Korean Go grandmaster on Saturday, taking an unassailable 3-0 lead to score a major victory for a new style of “intuitive” artificial intelligence (AI).\n\nThe programme, AlphaGo, took a little over four hours to secure its third consecutive win over Lee Sedol — one of the ancient game’s greatest modern players with 18 international titles to his name.\n\nMr. Lee, who has topped the world ranking for much of the past decade and had predicted an easy victory when accepting the AlphaGo challenge, now finds himself fighting to avoid a whitewash in the two remaining dead rubbers on Sunday and Tuesday. “I don’t know what to say, but I think I have to express my apologies first,” a crestfallen Mr. Lee told a post-game press conference.\n\n“I apologise for being unable to satisfy a lot of people's expectations. I kind of felt powerless,” Mr. Lee said, acknowledging that he had “misjudged” the computer programme’s abilities.\n\n“Yes, I do have extensive experience in playing the game of Go, but there was never a case where I was under this much pressure.... and I was incapable of overcoming it,\" he added.\n\nFor AlphaGo’s creators, Google DeepMind, victory went way beyond the $1 million dollar prize money, to prove that AI has far more to offer than superhuman number-crunching.\n\n‘Stunned and speechless’\n\n“To be honest, we are a bit stunned and speechless,” said a smiling DeepMind CEO Demis Hassabis, who stressed that Lee’s defeat in Seoul should not be seen as a loss for humanity.\n\n“Because the methods we have used to build AlphaGo are general purpose, our hope is that in the long-run we will be able to use these techniques for many other problems,” Mr. Hassabis said.\n\nApplications might range from making phones smarter to “helping scientists solve some of some of the world’s biggest challenges in health care and other areas,” he added.\n\nPreviously, the most famous AI victory to date came in 1997 when the IBM-developed supercomputer Deep Blue beat Garry Kasparov, the then-world class chess champion, in its second attempt.\n\nBut a true mastery of Go, which has more possible move configurations than there are atoms in the universe, had long been considered the exclusive province of humans — until now.\n\nAlphaGo's creators had described Go as the ‘Mt. Everest’ of AI, citing the complexity of the game, which requires a degree of creativity and intuition to prevail over an opponent.\n\nAlphaGo first came to prominence with a 5-0 drubbing of European champion Fan Hui last October, but it had been expected to struggle against 33-year-old Lee.\n\nHuman-like approach\n\nCreating “general” or multi-purpose, rather than “narrow”, task-specific intelligence, is the ultimate goal in AI — something resembling human reasoning based on a variety of inputs and, crucially, self-learning.\n\nIn the case of Go, Google developers realised a more “human-like” approach would win over brute computing power.\n\nThe 3,000-year-old Chinese board game involves two players alternately laying black and white stones on a chequerboard-like grid of 19 lines by 19 lines. The winner is the player who manages to seal off more territory. — AFP", 
    "section": "national", 
    "title": "Computer wins series against South Korean Go champion", 
    "subsection": "general", 
    "date": "2016-03-13"
}