{
    "author": [
        "C Gouridasan Nair"
    ], 
    "text": "Final decision to be taken at party State committee meeting today\n\nThe Communist Party of India (Marxist) has overcome what used to be described as a major obstacle to its smooth progress in the upcoming electoral battle by deciding to field both Leader of the Opposition V.S. Achuthanandan and CPI(M) Polit Bureau member Pinarayi Vijayan.\n\nThe party State secretariat, which concluded its two-day meeting here on Saturday, is understood to have formally decided to field both the leaders in the Assembly elections. The final decision would be taken by the party State committee meeting here on Sunday.\n\nMr. Achuthanandan would contest in Malampuzha in Palakkad district and Mr. Vijayan in Dharmadam in Kannur district.\n\nThe decision is a victory of sorts for the CPI(M) national leadership, particularly party general secretary Sitaram Yechury.\n\nHe and his Polit Bureau colleagues Prakash Karat and S. Ramachandran Pillai were present throughout the two days' of deliberations by the State secretariat on the tactics to be adopted by the CPI(M) and the LDF in the elections and the question of choosing candidates.\n\nMr. Yechury had, during his visit to the State a fortnight ago, a one-on-one interaction with Mr. Achuthanandan. The subsequent Polit Bureau meeting in New Delhi had decided to field both the leaders. Mr. Yechury had spoken to Mr. Achuthanandan over phone on Friday night.\n\nApart from Mr. Vijayan, only five other members of the State secretariat would take to the fray. They are T.M. Thomas Isaac (Alappuzha), E.P. Jayarajan (Mattannur), A.K. Balan (Tharoor), T.P. Ramakrishnan (Perambra) and M.M. Mani (Udumbanchola). Central committee member K.K. Shylaja would also be in the fray.\n\nThe leadership has decided to leave out office-bearers of class and mass organisations among the State secretariat members out of the fray.", 
    "section": "national", 
    "title": "CPI(M) to field Pinarayi and Achuthanandan in Kerala", 
    "subsection": "general", 
    "date": "2016-03-13"
}