{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Centre planning to cut down time for clearance to 100 days, says Prakash Javadekar\n\nUnion Environment Minister Prakash Javadekar on Saturday claimed that in the 21 months of the NDA government at the Centre, his Ministry has given environmental clearances to 943 projects, unlocking investments of up to about Rs 6.72 lakh crore.\n\nMr. Javadekar said the NDA government focussed on three key principles — make new sustainable development policies, making the process of clearance simpler and more transparent, and decentralising power to the States.\n\n“During the last 10 years (of the UPA government), environment clearances took an average of 600 days. But the new strategy has helped my Ministry cut down the time for various clearances to an average of 190 days. We intend to further improve this to 100 days in the next one year,” Mr. Javadekar said at a press conference at the BJP headquarters here.\n\nHe said during the UPA regime, the time-consuming process of environment clearances for big investment projects led to delays, stunting growth, increased unemployment, a large number of incomplete projects, and a sharp increase in non performing assets of banks.\n\n“The Environment Ministry had earned the nickname of Roadblock or Speedbreaker Ministry. Our sustainable development policies will increase investment inflow, ensure completion of projects on time, boost employment and development without compromising with environment. We don’t just believe in Ease of Doing Business, but Ease of Doing Responsible Business,” said the Minister, who, earlier in the day also delivered the keynote address at the 11th National Convention on Sustainable Development Goals held in Mumbai.\n\nMr. Javadekar told journalists that the Modi government was committed to sustainable development. He said climate change was a reality with one degree of temperature rise caused by 150 years of uncontrolled carbon emissions by the developed world.", 
    "section": "national", 
    "title": "‘Eco nod for 943 projects in 21 months’", 
    "subsection": "general", 
    "date": "2016-03-13"
}