{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Enforcement Directorate (ED) on Saturday questioned former Kingfisher Chief Financial Officer (CFO) A Raghunathan and former United Breweries CFO Ravi Nedungadi for the second consecutive day in connection with the alleged money laundering case that the agency is investigating.\n\nMr Raghunathan and Mr Nedungadi reached the ED office in Mumbai at around 11:00 am on Saturday for inquiries and left at around 7:00 pm.\n\nThe duo was also quizzed by the ED for around eight hours on Friday.\n\nSources said that the duo, having held the top posts in the financial section of businessman Vijay Mallya’s companies, were questioned at length about the financial transactions of the companies and the loans that were taken from the IDBI bank as well as various other financial institutions.\n\nThe ED’s case looks at the Rs 900 crore loan that Kingfisher Airlines took from the IDBI bank despite having a poor credit rating.\n\nAccording to sources, inquiries are currently underway to find out whether any part of the loan amount was routed through the UB group before being sent abroad, or whether it was transferred to UB group accounts after being routed through off shore accounts.\n\nOfficials said that the inquiries were not only limited to the transactions between IDBI and Kingfisher Airlines, although this aspect is the most significant one. “We have also obtained records of financial transactions of several other financial institutions that Kingfisher Airlines has had dealings with in the past, and some more such documents are also being obtained so that clear trails of money can be established as well as a clear picture of the company’s finances be obtained,” said a source.\n\nThe agency had on Friday issued a summons to Mr Mallya, asking him to come to the Mumbai office for inquires on March 18. Officials declined to comment on whether there had been any response to the summons from Mr. Mallya.", 
    "section": "national", 
    "title": "Ex-CFOs of Mallya firms quizzed again", 
    "subsection": "general", 
    "date": "2016-03-13"
}