{
    "author": [], 
    "text": "Google is about to embark on an old-school search, swapping its Internet algorithm for a custom-built van that will cruise across the U.S. to find out how people use its online services and react to new features.\n\nThe white van emblazoned with Google’s colourful logo and an invitation to “shape the future” of the world’s most powerful Internet company is scheduled to pull out Monday on a six-week road trip.\n\nGoogle is using the van to help it break out of its Silicon Valley bubble. The van will make multiday stops in seven states, stopping near colleges, libraries, parks and some of Google’s own regional offices in hopes of finding out how average Americans are using the company’s multitude of digital offerings.\n\nAbout 500 walk-up volunteers will be invited to step inside the van designed to serve as a mini-version of Google’s Silicon Valley laboratories, where most of the company’s user studies are conducted.\n\nOnce inside, researchers will watch, question and record how the volunteers use apps and other services on their smartphones in sessions that will last 15 to 90 minutes. They will receive gift cards and Google t-shirts in return for their time.\n\nA few may even get a glimpse at ideas that Google’s engineers are still refining before the company decides whether to release them as products to the public.\n\nThe plan to build a research lab on wheels grew out of Google’s recognition that most people don’t live and think the same way as the population living in the San Francisco Bay Area, where the company does most of its user research. In this geeky and affluent area, the day’s biggest worry sometimes boils down to how long it will take to summon a Uber ride.\n\n“We are trying to understand the whole end-to-end experience, which is why we are trying to get out to more locations and see more people so we can gather more context,” says Laura Granka, a lead Google researcher focusing on Internet search and maps. — AP", 
    "section": "national", 
    "title": "Google is hitting the road for user feedback", 
    "subsection": "general", 
    "date": "2016-03-13"
}