{
    "author": [
        "Ranjani Govind"
    ], 
    "text": "In the right hands, the twang of the mouth organ can be transformed into a riveting melody. But by the 1980s, the harmonica, as it is also called, started losing ground to guitars and keyboards in local popular culture. Now, the instrument is once again being heard across Sandalwood, the Kannada film industry. In the last five years, nearly 50 songs in more than a dozen films have relied on the mouth organ for its distinctive sound.\n\nThe latest film to join the ranks is Jessie — expected to be released later this month — in which music director Anoop Seelin has generously relied on the harmonica for the song ‘Male Bantu’. Some music directors like Sameer Kulkarni have used the harmonica not just in individual compositions, but also in the background score to convey a range of emotions. “The harmonica, like the santoor, sarangi and the shehnai, lost ground due to contemporary entrants like the keyboard and guitar,” says Mr. Seelin whose passion for the mouth organ can be traced to his childhood. “I grew up appreciating the ingenuity of the renowned Naushad, Hamsalekha, Rajan Nagendra and Upendra Kumar, and the way they creatively merged the harmonica in their compositions. I believe in live orchestras with different time-honoured instruments, not in keyboard simulations,” said Mr. Seelin who has 16 films to his credit.\n\nOne of the reasons for the resurgence is: increasing number of youth in Bengaluru is rediscovering the twangy depths of the mouth organ. The city is home to nearly 500 amateurs and professionals who experiment with the mouth organ in different genres as rock, blues, jazz, gospel and Carnatic.\n\nRiding on this wave of popularity, Carnatic musician Saitejas Chandrashekar and professional organist Avinash Kulkarni recently published a book, The Joy of Harmonica Playing, to guide young musicians. “The intention was to see people getting lessons in Indian swaras, so that the harmonica gets a push,” said Saitejas.", 
    "section": "national", 
    "title": "Harmonica returns to Kannada films", 
    "subsection": "general", 
    "date": "2016-03-13"
}