{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Boosting the nation’s rapid airlift capability for forward operations and troop deployment, the Indian Air Force re-activated two upgraded Advanced Landing Grounds (ALG) at Ziro and Along in Arunachal Pradesh on Saturday.\n\n“The ALGs will further enhance our existing operational capabilities in Eastern Air Command,” Air Marshal C. Hari Kumar, Air Officer Commanding-in-Chief, Eastern Air Command said during the inauguration of ALG at Ziro.\n\nHe later inaugurated the ALG at Along. Further underscoring the significance he said that “the capacity build-up will enable operations by some of our new inductions including the C-130J Super Hercules transport aircraft”.\n\nThis will give the ability to rapidly airlift troops in case of hostilities or a standoff. India has belatedly embarked on a major drive to operationalise the ALGs which have not been in use for decades.\n\nIn the mid-eighties Vayudoot Airlines had operated from Ziro airfield and the IAF too had operated a flying detachment from for air maintenance. Subsequently the airfield fell out of use.\n\nFollowing an approval from the Cabinet Committee on Security (CCS) in June 2009, the IAF began an ambitious plan to upgrade and operationalise the existing eight ALGs.\n\nThe IAF took over the Ziro airfield from Airport Authority of India (AAI) in August 2010.\n\nThe ALGs for upgradation include Tuting, Mechuka, Along, Tawang, Ziro, Pasighat, Walong and Vijaynagar in Arunachal Pradesh. The outlay plan for the upgradation of ALGs alone is nearly Rs. 1,000 crore.\n\nOfficials said that three more ALGs — Mechuka, Pasighat, Tuting — are scheduled to be inaugurated in the next three months. The ALG at Tawang, which was taken up in 2014, is ongoing and is expected to be ready by September this year.\n\nWith the inauguration of the ALGs at Ziro and Along, altogether three ALGs have since got upgraded with paved runway surfaces and other facilities, officials added.\n\nALGs are expected to enhance the capabilities of\n\nthe Eastern Air Command", 
    "section": "national", 
    "title": "IAF reactivates two landing grounds in Arunachal Pradesh", 
    "subsection": "general", 
    "date": "2016-03-13"
}