{
    "author": [
        "Ellen Barry"
    ], 
    "text": "New Delhi is intent on developing its “frontier” regions, says official\n\nIndia and Japan are in talks to collaborate on upgrading civilian infrastructure in the Andaman and Nicobar Islands, an Indian archipelago seen as a critical asset to counter China’s efforts to expand its maritime reach into the Indian Ocean.\n\nThe first project being discussed is a modest one — a 15-megawatt diesel power plant on South Andaman Island, as described in a proposal submitted late last month to the Japanese Ministry of Foreign Affairs.\n\nBut the collaboration signals a significant policy shift for India, which has not previously accepted offers of foreign investment on the archipelago. The Andaman and Nicobar Islands are northwest of the Strait of Malacca, offering control of a so-called choke point that is one of China’s greatest marine vulnerabilities.\n\nIt is also testimony to the unfolding relationship between India and Japan, which is also funding a $744 million road building project in the northeastern Indian border regions of Mizoram, Assam and Meghalaya. Like the Andaman and Nicobar chain, the northeastern region is a strategic area that has remained relatively undeveloped because of its separation from the mainland.\n\nJapan’s marshalling of official development assistance in the region has drawn less attention than the effort that China calls “One Belt, One Road,” a network of roads, railways and ports intended to link China to the rest of Asia and to Europe.\n\nBut it fits logically into the web of strategic projects taking shape as Indian Prime Minister Narendra Modi enters into closer relationships with Japan, Australia and the United States, as well as regional powers like Vietnam, to counter China’s growing influence.\n\nA senior Indian official, who spoke on the condition of anonymity to discuss internal deliberations, said China’s project would be answered by “a more decentralised, local but organic response.”\n\nThe official described proposed infrastructure projects in the Andamans as “not of a big scale, and not of a big value,” but added that New Delhi was intent on developing its “frontier” regions.\n\n“The idea that the frontier should be left undeveloped, I think people have rejected that approach,” the official said.\n\n“There is a realisation that it doesn’t help to leave part of any part of India undeveloped.” Japan’s vision for contributions in the island chain goes far beyond the proposed power plant.\n\nThe plan was submitted in Tokyo more than a year after Japan’s Ambassador made a visit to Port Blair on South Andaman Island and, in a meeting with the territory’s top official, offered financing for “bridges and ports.”\n\nAkio Isomata, Minister for Economic Affairs in the Japanese Embassy, said the country’s aid agency, Japan International Cooperation Agency, could only respond to “formal requests” from the Indian government.\n\nHe said Japan would consider “any other requests” on the Andaman and Nicobar chain or elsewhere and was eager to use official development assistance to enhance India’s “connectivity” with countries that were members of the Association of Southeast Asian Nations or the South Asian Association for Regional Cooperation.\n\n“We usually start with small projects and go bigger,” he said. — New York Times News Service\n\nBid to counter China’s efforts to expand its maritime\n\nreach into the Indian Ocean", 
    "section": "national", 
    "title": "India collaborates with Japan on Andamans project", 
    "subsection": "general", 
    "date": "2016-03-13"
}