{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "In a major development, the Left Front has decided not to field candidates in Darjeeling, Kurseong and Kalimpong, giving an almost unbeatable advantage to the Gorkha Janamukti Morcha (GJM) in these hill districts.\n\nSenior CPI(M) leaders told The Hindu on Saturday that the front had decided so as not to divide the anti-Trinamool Congress votes.\n\nIt is learnt that the Congress leadership, which has an electoral understanding with the Left Front in the State, is not opposed to the idea. While the decision may help the GJM in the hills, it will be beneficial for the Left-Congress alliance in the plains where it is expected to get support in return.\n\nWhile a section of the GJM leadership has welcomed the development, the party has refrained from making any formal comment on the issue. In the 2014 Lok Sabha election, the GJM had supported the Bharatiya Janata party (BJP) candidate S.S. Ahluwalia in the Darjeeling Lok Sabha seat.\n\nDarjeeling district has six Assembly constituencies. The BJP, with the support of the GJM, led in all the six Assembly segments in the 2014 election.\n\nThe GJM had won Darjeeling, Kurseong and Kalimpong in the 2011 Assembly polls while the Congress won Phansidewa and Matigara-Naxalbari. The Trinamool Congress won Siliguri.\n\nWith the former Minister and CPI(M) leader Asok Bhattacharya bringing about a turnaround in the civic polls, winning the Siliguri Municipal Corporation with the support of Congress councillors, the district is likely to pose a tough challenge to the TMC.\n\nOf late, the relations between the GJM and the Trinamool Congress have touched a new low with the ruling party nominating former GJM legislator Harka Bahadur Chettri from Kalimpong as its candidate.\n\nThe GJM is the principal political force in the hills and runs the regional autonomous body Gorkhaland Territorial Administration.\n\nWith the Left Front not fielding any candidates, the Morcha is now in an enviable position", 
    "section": "national", 
    "title": "It’s advantage GJM in hill districts", 
    "subsection": "general", 
    "date": "2016-03-13"
}