{
    "author": [
        "Amarnath Tewary"
    ], 
    "text": "Sharing the stage with Bihar Chief Minister Nitish Kumar for the first time after the NDA’s defeat in the Assembly polls last year, Prime Minister Narendra Modi said on Saturday that India “cannot make progress without the development of eastern States like Bihar and Uttar Pradesh.”\n\nHe said the use of technology and the release of an annual bulletin to highlight the oldest cases in courts would help to improve the functioning of the judiciary and “create sensitivity to the pendency of cases in the country.”\n\nSpeaking at the closing ceremony of the centenary celebrations of the Patna High Court, Mr. Modi suggested that the court, the Bar and the Bench should become techno-savvy “to improve the quality of judgments and arguments.” “Now we’ve something which we had not earlier — the power of technology. We’ve to see how much techno-savvy we can make the Bar, the Bench and the courts by using digital technology in their functioning and help work towards improving the quality of judgments.”\n\n“Earlier, a lot of time was spent doing research in the legal field, but today Google is a bar member which digs out what you need for your cases,” Mr. Modi said.\n\nPM flags off rail projects\n\nIn another programme in Chhaukia village in Hajipur of Vaishali district, Mr. Modi flagged off railway projects and said India could not be a developed country unless its eastern States made progress. “We’re committed to the development of the eastern States…The nerve centre of India’s development lies in eastern India… For India’s sustainable development, it is important that the eastern States develop.” He also thanked Mr. Kumar for extending support to the Centre for Bihar’s development. While listing the priorities of projects of his government for Bihar like providing gas connectivity and electricity to every household, Mr. Modi said that in the past 18 months, his government had completed 34 per cent of unfulfilled projects in Bihar.\n\nWhen Mr. Kumar thanked Mr. Modi for visiting Bihar and hoping that he would keep coming to the State for its development, some people kept chanting Modi…Modi…Modi. The Prime Minister himself had to get up from his chair and asked them to sit down.", 
    "section": "national", 
    "title": "Judiciary should turn tech-savvy, says Modi", 
    "subsection": "general", 
    "date": "2016-03-13"
}