{
    "author": [
        "Nagesh Prabhu"
    ], 
    "text": "Kerala and Tamil Nadu have acquired the first and second rank in the public affairs index (PAI) of governance in States, while Bihar, Jharkhand and Odisha lag behind, a latest survey by a think-tank, Public Affairs Centre (PAC), Bengaluru, has revealed. Karnataka secured the third position, while Gujarat stood fifth.\n\nKarnataka secured the top position among all States in the category of providing adequate and effective social protection to its citizens. West Bengal and Kerala secured the second and third positions.\n\nThe survey, which was based on 10 themes, 25 focus subjects and 68 indicators, said Mizoram, Himachal Pradesh and Delhi secured top three ranks among the small States (less than two crore population).\n\nKarnataka, which ranked ninth in the ease of doing business in the World Bank report released last year, was placed at an overall rank three in the PAC survey. The State stood second in both transparency and public accountability and environment. However, it lagged behind in delivery of justice, with a rank of 13.\n\nThe State performed above average with respect to women and children, crime, law and order. “Education and health are said to be the pillars of development and it is worth mentioning that the State has performed well and has bagged the second rank,” the survey said. Kerala secured the 18th rank in the ease of doing business report. “This latest ranking in governance will give a breath of fresh air to Chief Minister Oommen Chandy in the run-up to the elections,” said Kerala Chief Secretary Jiji Thomson.\n\nThe ranking will also help Tamil Nadu Chief Minister Jayalalithaa in the run-up to the poll campaign. Tamil Nadu had stood at 12th position in the World Bank’s report.\n\nFormer Chief Justice of India M.N. Venkatachaliah released the report in the presence of a few State Chief Secretaries of States. The survey authored by C.K. Mathew, Athreya Mukunthan and Vivek Divekar of PAC, was conducted on the basis of the latest data provided by State governments.\n\nPunjab, which secured overall 6th rank, bagged top spot on the infrastructure front, followed by Haryana and Gujarat. Among small States, Delhi led, followed by Goa and Himachal Pradesh.\n\nIn maintenance of law and order, Tamil Nadu topped the list followed by Gujarat and Kerala.\n\nBihar, Jharkhand and Odisha are ranked low in social protection, economic freedom, delivery of justice, women and child development and essential infrastructure indicators.\n\nKarnataka comes third, while Gujarat ranks fifth; Delhi leads in small States category", 
    "section": "national", 
    "title": "Kerala, T.N. secure top ranks in governance", 
    "subsection": "general", 
    "date": "2016-03-13"
}