{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "Thousands of women’s self-help groups (SHGs) in Maharashtra woke up to a rude surprise on March 8, the International Women’s Day, when they found what Women and Child Development Minister Pankaja Munde had in store for them. Posted online on the Ministry’s website was the announcement of a new tender, with serious implications for scores of women SHGs who supply nutritious food under the Integrated Child Development Scheme (ICDS) to malnourished children.\n\nThe stipulations set in the Multi-Item contract for supply of Ready-to-Cook Food Mix, the women say, will allow access only to big manufacturers, violating the Supreme Court orders. Though the tender clearly follows the spirit of Supreme Court orders effectively barring contractors, traders, middlemen, distributors, dealers, non-trading companies, agents and any other individual and/or legal entity who are not from Women’s Cooperative Groups, the conditions spelt out for eligibility put a question mark on the participation of women in the scheme.\n\nMaharashtra has nearly 36 per cent of children under five who are underweight and malnourished, according to the National Family Health Survey (NFHS-4) survey.\n\nLast year, Ms. Munde had come under fire for awarding Rs. 206-crore contract for the supply of chikkis (groundnut candy) to schools run by the State administration without due processes.\n\nThe latest tender document, which has been examined by The Hindu, takes its cue from the Ministry of Women and Child Development under Maneka Gandhi, which, in the past has displayed ambivalence in addressing the issue of supplying nutritious food to malnourished children.\n\nAny outsider can bid\n\nAmong the conditions stipulated in the tender are requirement of a Permanence Certificate that should mention the total value and quantity of Ready-to-Cook Food Mixes manufactured and value equal to 25 per cent of the required turnover of applied sector. Also required are copies of the balance sheets and profit-and-loss accounts for the last three years, certified by a chartered accountant. The biggest fear, the women said, was that there were no restrictions on outsiders who could bid, effectively rendering the women jobless.\n\nAs reported in The Hindu , circulars from the Ministry advise State government/Union Territories to get the nutritious food prepared/manufactured by only competent and capable groups or entities, who comply with and strictly adhere to the stipulations, irrespective of whether these are self-help groups, mahila mandals, village community or a manufacturer. This, according to several activists, is a result of poor reading of the Shagun Mahila Judgment of 2011 that stipulated stringent conditions for the supply of healthy food to vulnerable children and women.\n\nIn sharp contrast are the practices put in place in Odisha and Kerala, which according to Rajkishor Mishra, the State adviser to Supreme Court Food Commissioners, have given equal importance to the quality of food as well as participation of women SHGs.\n\nAll that is required is a joint bank account by the SHGs and the school or anganwadi centre where they supply food.\n\nWomen feel the tough eligibility norms set by the Ministry will render them jobless", 
    "section": "national", 
    "title": "New food tender favours big firms: Maharashtra SHGs", 
    "subsection": "general", 
    "date": "2016-03-13"
}