{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Though the ban came into force on Friday, strict enforcement is expected to begin from Monday\n\nIt’s the calm before the storm as the Karnataka government machinery prepares to impose the plastic ban in the coming week.\n\nWith the issuing of the notification, the plastic ban has been technically in force since Friday — making even the sale of common use items such as plastic forks, spoons, cups and plates illegal.\n\nTraders who talked to The Hindu said the enforcement should not begin until their stocks, bought over the past few months, are exhausted. “Unfortunately, with the notification, it is becoming difficult to sell the plastic products … the raids by civic authorities began even as the draft notification was made public,” said a trader.\n\nHowever, the “strict” enforcement of the rule is expected to commence from Monday.\n\n“We will start doing random checks on traders and industries from Monday itself. Since the ban is in force, there is no leniency — because plastic manufacturers have known about the rules over the past few months,” said Lakshman, Chairman of the Karnataka State Pollution Control Board. Similarly, Anil Kumar T.K., Secretary (Urban Development and Municipal Administration), said as officials across the State had been trained to crack down on plastic lesser than 40 microns thickness, it should “not be difficult” to enforce a broader ban.\n\n“As soon as the notification is studied, instructions will be passed on to all urban local bodies.”\n\nShopkeepers happy\n\nThe ban is in principle supported by shop-keepers. For instance, at the busy Russel Market, where thousands are given plastic bags for vegetables, dry fruits and meats, the local association — which represents more than 480 shops in the iconic complex — has started the process of doing away with plastics in the complex.\n\n“This is the right time to impose the ban. We have told the traders to do away with plastics to reduce the piling garbage close to our market. Now, with the ban, we will ensure all shopkeepers use cloth or paper bags within a fortnight,” said Mohammad Idres, general secretary of the Russel Market Traders’ Association. Similarly, traders at K.R. Market, where 1,300 shops see vendors giving out more than 200 kg of plastic bags daily, believe penalties can ensure strict implementation of the ban.\n\nPlastic assn. to move court\n\nSuresh Sagar, honorary secretary of the Karnataka State Plastic Association, has said there was no option but to go to the court.\n\n“The draft plastic rules of the Central Government proposes to ban plastic bags of 50 micron thickness or lesser. Why can’t the State government follow this instead of a blanket ban?” he said, adding that the expectation of reductions in solid waste was “unrealistic”.\n\nHe believed more than 350 plastic industries would be directly affected — particularly those manufacturing plastic bags and cling wraps. A majority of these are small-scale industries.", 
    "section": "national", 
    "title": "Preparations on to make Karnataka plastic-free", 
    "subsection": "general", 
    "date": "2016-03-13"
}