{
    "author": [
        "Vikas Pathak"
    ], 
    "text": "BJP president Amit Shah spoke at the Akhil Bharatiya Pratinidhi Sabha, the RSS’s highest decision-making body, on Saturday. The conclave passed resolutions on affordable education and health care.\n\nTill Sunday morning, various affiliated bodies of the RSS, including the BJP and the ABVP, will make presentations on what they have achieved in the last one year and what they have planned for the coming year.\n\nMr. Shah is believed to have listed the achievements of the BJP government and called this year’s budget as poor-friendly that “focused” on agriculture.\n\nOn Sunday, there is likely to be a discussion on whether the RSS’s uniform ( gana vesh ) needs a change. While there is a strong buzz that the Khaki shorts will be replaced, an insider cautioned that the proposal might get rejected. “This proposal was discussed in 2010 too, but rejected,” he said.\n\nThe meeting passed resolutions on affordable education, with suggestions for more budgetary allocation for education and a greater community participation. “Inadequate allocation for education and lack of priority for education in the government policy during the preceding years have left open this field to institutions aiming for profits,” the resolution said. It made no reference to “anti-national” activities on campuses, a key RSS theme that also figured in the report of Sangh general secretary Suresh (Bhaiyyaji) Joshi on Friday.\n\nRSS Akhil Bharatiya Sampark Pramukh Aniruddha Deshpande refused to discuss the issue at his press conference.\n\nThe resolution, however, did call for value-based, nationalistic, employment-oriented and skill-based education for each child.\n\nThe health resolution called for medical facilities in small towns and villages and made a case for more philanthropic health care efforts. It also called for medicines to be brought within the reach of the people. While there was much emphasis on social justice and a call to end caste discrimination, an insider said he had not yet seen any draft of a resolution on the issue.", 
    "section": "national", 
    "title": "RSS presses govt. for higher allocation for education, affordable health care", 
    "subsection": "general", 
    "date": "2016-03-13"
}