{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "According to the tender, Technodinamika will supply nine Auxillary Power Units for the IL-76 aircraft.- File Photo: Rajeev Bhatt\n\nTechnodinamika, a holding company of Rostec State Corporation of Russia, will set up a service centre in India to boost support to the Indian Air Force’s (IAF) aircraft fleet of Russian origin.\n\nThe company has recently won a contract to supply Auxillary Power Units (APU) to the IL-76 transport aircraft of the IAF.\n\n“In the very near future we are going to open a service centre in India. It will be arranged in compliance with the principles of the ‘Make in India’ program, under which aircraft repair and maintenance will be localised in India. In this case, the IAF will be assured of guaranteed deadlines and a high quality of performed works,” Maxim Kuzyuk, CEO of Technodinamika said.\n\nIt will improve availability of spares for aircraft and increase the operational availability of aircraft.\n\nAccording to the terms of the tender for APU’s, Technodinamika will supply nine APUs for the IL-76 aircraft and its modifications owned by the Indian Air Force, the company said.\n\nHowever the company has not disclosed the value of the contract. Currently, the IAF uses 28 aircraft of this type.\n\nThis contract follows an earlier deal by the company in overhauling the existing APU’s. Convinced of the holding’s competence in APU production and repair, the IAF representation recently approved the first two auxiliary power units overhauled by Technodinamika, the statement added.\n\nThe company had earlier won an IAF bid in June 2015 to overhaul 11 APUs for the IL-76 and its derivatives.\n\nA bigger upgrade of the IL-76 fleet is also under discussion with Russia.\n\nIn October last year, ahead of Defence Minister Manohar Parrikar’s visit to Russia, the Defence Acquisition Council (DAC) cleared engine and avionic upgrades for the Air Force’s fleet of IL-76 transport and IL-78 mid-air refuelling aircraft to cost about Rs. 4300 crore,\n\nSpares and support has been an issue of concern for the Indian military with respect to Russian military hardware. Faced with increasing competition from the U.S. and Israel in the defence sector, Russian firms are moving to localise spares and supply issues to maintain their position in the Indian defence sector.", 
    "section": "national", 
    "title": "Russian firm to set up service centre for IAF aircraft fleet", 
    "subsection": "general", 
    "date": "2016-03-13"
}