{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Reacting to the decision by the Securities and Exchange Board of India (SEBI) to ban wilful defaulters from tapping the capital market, Abizer Diwanji, partner and national leader, financial services at consulting firm EY, says the SEBI’s strictures on wilful defaulters, though conceptually correct, have serious limitations as it pre-requisites banks to be judicious in their call on such entities.\n\n“The RBI guidelines state that funds diversion by a defaulter classifies as wilful. Given that our bad debt problem has been built over years of successive CDRs [corporate debt restructuring] and restructurings where additional debt raised for growth was used for interest payments to protect NPAs [non-performing assets], pricing diversion is easy not realising that some of these may be conscious. Also, one bank can declare a defaulter wilful when the fact that such diversion was known or not at the time of sanction can never be proven,” he explains.\n\nThe Securities and Exchange Board of India (SEBI) has decided to significantly increase its activities related to investor education and awareness, and plans to appoint at least one ‘resource person’ in each district for conducting such programmes on a regular basis in all areas.\n\nIn the financial year 2016-17, the SEBI also plans to encourage delisting of suspended companies, strengthen its surveillance mechanism, enhance the functioning of credit-rating agencies and encourage the use of technology to streamline ‘know your customer’ procedure\n\nIn another move that would help investors take a better informed decision, the capital market watchdog has said companies will have to disclose the impact of all remarks — qualifications in accounting parlance — in a separate statement along with the annual financial statements. While the new mechanism will be applicable from the financial year ending March 31, 2016, the management of a company will have the right to give its views on the qualifications along with the impact.", 
    "section": "national", 
    "title": "SEBI crackdown on wilful defaulters", 
    "subsection": "general", 
    "date": "2016-03-13"
}