{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The video of the two boys, aged six and seven, crying outsidethe tuition centre, went viral on social media.\n\nThe Mumbai police on Saturday registered a case under the amended Juvenile Justice (Care and Protection of Children) Act, 2015 against the management of a tuition centre in Malwani for allegedly punishing two students by making them stand naked outside the centre in the middle of a busy street.\n\nThe action was taken by the police after a video of the two boys, aged six and seven, standing naked outside the tuition centre and crying went viral on social media, followed by widespread public outrage.\n\nAccording to police sources, the video was posted on messaging application WhatsApp by a Malwani resident, who was passing by the Shree Tutorials in Malad on Friday. The video showed one boy completely naked and the other with only a shirt on his body crying incessantly and trying to cover their private parts with their hands.\n\nThe video, which was shared widely, reached some police officials, and the Malwani police were instructed to look into the matter. Inquiries in the area helped the police trace the boys, and the police spoke to their families. However, their parents were unwilling to register an FIR, as they feared a backlash from the tuition centre management, said sources.\n\nFinally, after consultation with senior police officials, the Malwani police on Saturday registered an FIR against the manager of the tuition centre as well as the teacher who had “punished” the boys, with one of their own officials acting as the complainant in the case. “We have registered a case under various Sections of the Juvenile Justice Act,” said Senior Police Inspector Milind Khetle, Malwani police station.\n\nMumbai police registered\n\nFIR against the manager and\n\nthe teacher", 
    "section": "national", 
    "title": "Staff of tuition centre booked for making students stand naked on road", 
    "subsection": "general", 
    "date": "2016-03-13"
}