{
    "author": [], 
    "text": "(Left) A sandstone statue of Rishabhanata and (above) a panel depicting Revanta and his entourage were recovered from Christie’s auction house in New York.— Photos: U.S. Immigration and Customs Enforcement/AP\n\nTwo stolen Indian statues that are more than 1,000 years old dating back to as early as the 8th Century and valued at over $4,50,000 (Rs.3 crore) were seized in the U.S. from premier auction house Christie’s just days before an auction next week.\n\nThe artefacts made from sandstone were recovered from the auction house following an international investigation with assistance from the Indian government and the Interpol.\n\nSpecial agents with U.S. Immigration and Customs Enforcement’s Homeland Security Investigations (HSI) along with the Manhattan District Attorney’s Office seized the statues here on Friday. The statues date back to the 8th Century A.D. and the 10th Century A.D.\n\nThe seizure comes days before the March 15 ‘Asia Week New York’ festivities, as part of which Christie’s is organising the auction titled ‘The Lahiri Collection: Indian and Himalayan Art, Ancient and Modern’.\n\nThe artefacts are a buff sandstone statue of Rishabhanata, believed to be from Rajasthan or Madhya Pradesh belonging to the 10th Century A.D. It depicts the first Jain Tirthankara and is valued at approximately $1,50,000 (Rs.1 crore). The second artefact is a buff sandstone panel depicting Revanta, a rare representation of an equestrian deity. It dates back to the 8th Century A.D. and is valued at approximately $300,000.\n\nThe statue of Rishbhanata appears to have been sold to London-based Brandon Lynch Ltd between 2006 – 2007. Christie’s said that it would never knowingly offer a stolen work of art and it was cooperating with authorities. — PTI", 
    "section": "national", 
    "title": "Stolen Indian antiques seized in U.S.", 
    "subsection": "general", 
    "date": "2016-03-13"
}