{
    "author": [
        "National Bureau"
    ], 
    "text": "Birender Singh says the government will push for Constitutional Amendment to ensure the implementation of the quota across the country.\n\nMinister for Rural Development and Panchayati Raj, Birender Singh, has said the government would be pushing a Constitutional amendment, first cleared by the UPA Cabinet, to increase reservation for women in panchayats from 33 per cent to 50 per cent in the budget session of Parliament.\n\nSpeaking at a national workshop on the “Implementation of PESA Act: Issues and way forward”, Mr. Birender Singh said that “though some States have provided 50% reservation to women in panchayats, the government will, through the Constitutional Amendment, ensure that it is implemented in the whole country.” He also said the Ministry would bring about other changes in the law to reserve a particular ward for women for two terms of five years each from the existing single term so that they can undertake developmental activities in a continued fashion.\n\nThe UPA government’s Cabinet had, in its second term, cleared the Constitution 110th Amendment and the Standing Committee on Rural Development had also gone through the Bill as per norms. The Bill had first been introduced in the Lok Sabha in November 2009, after which it went through the committee process. It was re-introduced in the Lok Sabha in 2010 after the report had been tabled, after which it lapsed at the end of the 15th Lok Sabha in 2014.\n\nThe Constitutional Amendment was to ensure that 50% of total seats filled by direct elections in every panchayat be reserved for women.\n\nAmong the States that already follow 50% reservation for women in Panchayati Raj Institutions (PRIs) are Bihar, Uttarakhand, Madhya Pradesh and Himachal Pradesh.\n\nThe Minister also made a strong pitch for the faster implementation of the Panchayats (Extension to the Scheduled Areas) Act by States for the uplift of tribals, saying that had already waited for 65 years for development.", 
    "section": "national", 
    "title": "50% quota for women in panchayats planned", 
    "subsection": "general", 
    "date": "2016-02-05"
}