{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "Search efforts still on to locate bodies\n\nThe 10 soldiers trapped in ice after an avalanche on the Siachen glacier were declared dead late on Thursday evening. However rescue efforts are still on to locate and retrieve the bodies, officials said.\n\n“Demise of soldiers in Siachen is very tragic. I salute the brave soldiers who gave their lives to the nation. Condolences to their families,” Prime Minister Narendra Modi tweeted late in the day.\n\nThe soldiers belong to the Madras regiment of the Army and have been posted there recently. They include one Junior Commissioned Officer and nine soldiers.\n\nDefence Minister Manohar Parrikar too expressed “heartfelt condolences” to the bereaved families of the soldiers “martyred in the line of duty.”\n\nEarlier in the day a senior officer said that “rescue teams are braving adverse weather and the effects of the rarified atmosphere to locate and rescue survivors.”\n\nA very large rescue team has been deployed to reach down to the swamped Army post. The rescuers are working at extremely low temperatures hovering between -25 to -45 degrees putting their lives at risk.\n\nAs per inputs received complete blocks of snow and ice had fallen on the post burying it very deep and clearing it was a very difficult task, the officer said.\n\n“Heavy snow cutters and major equipment are being used to clear and cut the ice blocks,” the officer said. A rescue dog too was flown to the spot in an Air Force Mi-17 helicopter.\n\nThe major avalanche struck the Army post in Northern Siachen Glacier located at a height of 19600 feet in the early hours of Wednesday. The Indian Army has been controlling the dominant heights of the glacier, the world’s highest battlefield, since occupying it in April 1984 under Operation Meghdoot pre-empting Pakistan’s move which controls heights at the lower altitudes.\n\nPakistan offers help\n\nThe Inter Services Public Relations (ISPR) of Pakistan tweeted an offer to help in the search mission.\n\nHowever the Indian Army, while appreciating the gesture, declined it as “adequate resources and personnel have already been pressed into service.”", 
    "section": "national", 
    "title": "All 10 soldiers declared dead", 
    "subsection": "general", 
    "date": "2016-02-05"
}