{
    "author": [], 
    "text": "Mr. Jaitley, who was the first Disinvestment Minister in the Atal Bihari Vajpayee-led NDA, proposes to unveil in his budget speech a two-year road map for three types of sales of government stake in PSUs.\n\nFirst, a plan for winding up loss-making units, including rules for the disposal of their assets and land. Passage next month of the new bankruptcy code by Parliament during the budget session, it is expected, will aid these sales. Second, profitable PSUs will be listed on stock exchanges through public sales of shares. The government’s shareholding in enterprises already listed will be pared down through public offers to the minimum level depending on the sector and “in line with government policy.” The third category will be that of strategic sales of high-value and big-size companies such as BHEL, and the oil and defence sector PSUs.\n\nThe government will invite global companies to bid for its stakes in such companies with the aim of inducting cutting edge technology and improving corporate governance in them.\n\n“The private partners will be expected to turn the energy PSUs into global giants spread across the world… India wants to be big in the energy sector,” the source said. The mega strategic sales in the oil sector will be part of India’s energy security plan.\n\n“The bureaucracy has not been very supportive of our plans for disinvestment but we will push ahead,” the source said.\n\nBased on inputs received from private investors, the government is finalising a new revenue model for irrigation projects to be developed in the public-private partnership space, which will bring down the downstream user charges for farmers. This technology-intensive concept will be selectively applied to high-yield, plantation and commercial crops.\n\nChanges in the policy regime for repatriation of returns by investors from their Foreign Direct Investment (FDI) on the basis of inputs from inland highways and waterways are also being worked out.\n\nMr. Jaitley announced earlier this month that railways will soon invite bids for modernisation of 400 stations, including their development and management. The Centre has already opened up 100% FDI under the automatic route in rolling stock, services, catering and the development and running of passenger terminals. Measures are likely for addressing delays in land acquisition in various States that is leading to stalled rail projects.\n\nThe mega strategic sales in the oil sector will be part of India’s energy security plan", 
    "section": "national", 
    "title": "Centre to shed PSU stake", 
    "subsection": "general", 
    "date": "2016-02-05"
}