{
    "author": [
        "National Bureau"
    ], 
    "text": "Tanzanian High Commissioner seeks arrest of those who molested woman\n\nA day after the Tanzanian envoy to India sent a note verbale and called the attack on a student in Bengaluru “racist”, the External Affairs Ministry announced on Thursday that a Central team would be sent to the city to conduct an inquiry and reassure African students following the brutal assault.\n\nA team comprising Tanzanian High Commissioner John W.H. Kigazi, two Joint Secretaries and a representative of the Indian Council of Cultural Relations, which provides scholarships, will travel to Bengaluru on Friday, Ministry spokesperson Vikas Swarup said.\n\n“We will extend the cooperation of both the Central and State governments and will reach out to the students to reassure them that their security and well-being is our primary concern,” he said.\n\nExpressing hope that the government would keep its commitment to ensure the safety of students, Mr. Kigazi said it was necessary to bring to book the 40-50 people who molested the Tanzanian student.\n\n“These students had nothing to do with the crowd’s anger over a car accident by another person. Even so, they were targeted because there was anger against each and every black person,” he told presspersons.\n\n“That means it was a racist attack.”.\n\nMr. Swarup said External Affairs Minister Sushma Swaraj had been in contact with the officials responsible and said she was “deeply pained over the incident”.\n\nThe Ministry has often had to deal with complaint from diplomats from African nations about attacks on Africans studying and working in the country.\n\nSeveral countries took up the issue during the India-Africa summit in 2015.\n\nEnvoy says there was anger against each and every black person, and it was a racist attack", 
    "section": "national", 
    "title": "Central team heads for Bengaluru", 
    "subsection": "general", 
    "date": "2016-02-05"
}