{
    "author": [
        "Mehboob Jeelani"
    ], 
    "text": "The leaderships of the Congress and CPI(M) are undecided whether to join hands ahead of the Assembly polls in West Bengal, even though their ground level workers are already working in tandem to defeat their common foe—the Mamata Banerjee-led Trinamool Congress (TMC).\n\nUnofficial reports say that the CPI(M) would resolve its West Bengal conundrum on February 15, when it is scheduled to have a three-day intra-party discussion. But Hannan Mollah, a Politburo member of the CPI(M), ruled out any final call on West Bengal anytime soon.\n\n“Congress has always been our number one enemy in Bengal,” Mr.Mollah said. “It’s hard to keep the years of political differences aside and go ahead with some sort of an alliance.”\n\nMr.Mollah, however, confirmed that CPI(M) workers had developed an understanding with their Congress counterparts on the ground. “The workers on both sides are making alliances at their own level to ensure that TMC’s booth capturing attempts are scuttled.”\n\nIn the Congress camp, the urgency to finalise the tie-up with the CPI(M) is quite visible. On February 1, a delegation from West Bengal led by PCC chief Adhir Ranjan Chowdhury met Congress vice-president Rahul Gandhi and strongly advocated that the party should start negotiating a pre-poll alliance with the State’s Left-leaning parties.\n\nSince befriending the Left parties in West Bengal could backfire in Kerala, where Assembly elections are slated around the same time, Mr.Gandhi did not reveal his position to the delegation. Recently, some degree of opposition to the Left-Congress electoral combination has emanated from the Congress’ minority cell in West Bengal. The State’s minority vote share is 30 per cent, which can swing the polls to any side.", 
    "section": "national", 
    "title": "Cong., CPI(M) workers join hands in Bengal", 
    "subsection": "general", 
    "date": "2016-02-05"
}