{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Triggering yet another round of public debate over the feasibility of the proposed Athirappilly hydroelectric project, Communist Party of India (CPI) State secretary Kanam Rajendran on Thursday took strong exception to the reported statement of CPI(M) Polit Bureau member Pinarayi Vijayan that the 163-MW project on the Chalakkudy River was inevitable for the overall development of the State.\n\nTalking to presspersons here, Mr. Rajendran said the view of Mr. Vijayan was not reflective of the collective policy decision of the Left Democratic Front (LDF). “The LDF is yet to discuss the matter and take a collective decision. The front has nothing to do with the personal opinion of Mr. Vijayan. As far as the CPI is concerned, our opposition to the project which may sound the death knell for a one-of-its-kind riparian ecosystem in Kerala will continue,” he said.\n\nHe said the CPI was staunchly opposing the project, which would affect 138.6 ha of forestland, dry up the Athirappilly waterfall and affect tribal families living in the area.\n\nMr. Rajendran said his party was of the opinion that maximum solar energy must be sourced to meet energy deficits in future without building dams and mooting projects which would cripple ecological balance. “All developmental initiatives must have the ultimate objective of achieving greater common good and they must not remove the existing green cover over the Earth,” he said.\n\nAsked about the State moving the High Court to override a CBI court order exonerating Mr. Vijayan in the SNC Lavalin corruption case, Mr. Rajendran said the ruling UDF was trying to gain political mileage from the issue as the Assembly election was fast approaching. “Mr Vijayan is not presently an accused in the case. He can fight and win the case,” Mr. Rajendran said.\n\nDiffers with Pinarayi saying LDF is yet to discuss the issue.", 
    "section": "national", 
    "title": "CPI against Athirappilly project, says Kanam", 
    "subsection": "general", 
    "date": "2016-02-05"
}