{
    "author": [
        "Rahi Gaikwad"
    ], 
    "text": "A PIL seeking directions for a case to be registered against actor and BJP MP Hema Malini and Maharashtra Revenue Minister Eknath Khadse in connection with the government’s controversial decision to allot land for her dance school was filed before the Bombay High Court on Thursday.\n\nFiled by activist Ketan Tirodkar, the PIL questions the “secret” manner in which a 2,000 sq mts plot in Andheri’s Ambivli area was given to the Natyavihar Kala Kendra, a trust run by Hema Malini.\n\n“There has been a series of judgment of the High Court and the apex court stating that public property cannot be allotted by the State without releasing advertisement inviting applications of the needy people,” the PIL states.\n\nIt points out that in a 2014 order, the High Court struck down government notifications conferring powers to the Chief Minister to use discretion for the allotment of public property and directed the State to issue fresh housing policy for disbursing public-owned plots.\n\n“Despite this the State went to the extent of gifting the public property to the ruling party MP for the sake of Bharat Natyam promotion when many poor and needy [people] are deprived from houses under CM quota for want of a policy that is yet to be framed. Are the housing needs of Mumbaiites less intense than the Bharatanatyam need of Hema Malini?” the PIL asks.\n\nCalling the allotment “a clear-cut case of fraud” on the lines of the Adarsh housing scam, the PIL seeks that the Mumbai Police Commissioner be directed to file a criminal case against the actor and Mr. Khadse under section 420 (cheating), 467 (forgery of valuable security) of the Indian Penal Code and other relevant Sections.\n\n“The PIL will be mentioned before the court on Friday,” Mr Tirodkar told The Hindu .", 
    "section": "national", 
    "title": "Direct police to file case against Hema Malini, PIL urges HC", 
    "subsection": "general", 
    "date": "2016-02-05"
}