{
    "author": [
        "R Krishna Kumar"
    ], 
    "text": "Onset of summer heralds the season of forest fires in Nagarahole and Bandipur national parks\n\nNagarahole National Park on Thursday reported its first fire of the current season, with a major incident reported at Veeranahosahalli range.\n\nThis suggests the onset of summer, a season of forest fires. Both Nagarahole and Bandipur — as also other national parks — have a history of such fires wreaking widespread devastation.\n\nNagarahole witnessed massive fires in 2014, 2012 and 2009, as also Bandipur, which witnessed major conflagration. Though controlled burning is carried out to remove weeds and clear the jungles of deadwood to pave way for new growth after the first flush of rain, wildfires tend to destroy the ecosystem.\n\nA wildlife conservationist said the negative impact of repeated forest fires are far too many, and could destroy the ecosystem in the long run.\n\n“A ground fire will destroy the reptilian creatures, which will perish in the heat, while the quality of top soil will degrade over a period of years,” he said.\n\nRepeated fires will result in the proliferation of non-palatable grass and weeds, which cannot be consumed by herbivores.\n\nA consequence of this is that the herbivore population will abandon the degraded habitat and move in search of greener pastures. Once the herbivore population depletes, it has a direct impact on the carnivore population too, and will have a negative bearing on their population.\n\nParts of Nagarahole that are prone to wildfire include Veeranahosahalli, Metikuppe, D.B. Kuppe, Kalahalla range, among others.\n\nBandipur too has a history of severe fires and the threat has been exasperated by the proliferation of weeds like lantana, Eupatorium, Ageratum conyzoides, Parthenium etc. of which lantana has been identified as the most problematic as it not only proliferates fast, but is resistant to cutting and burning. It has covered more than 50 per cent of the national park area. Omkara, Beguru, Himmavad Gopalswamy Betta, Hediyala are among the areas prone to fires.", 
    "section": "national", 
    "title": "Fear of forest fires as heat escalates", 
    "subsection": "general", 
    "date": "2016-02-05"
}