{
    "author": [
        "Kolkata Bureau"
    ], 
    "text": "Environmental activists and legal experts who recently visited the Sunderbans have accused the West Bengal government of “gross negligence” in protecting the forest-dependent communities under the Forest Rights Act (FRA). Moreover, the forest officials torture the villagers in the name of forest and wildlife protection. Even women are often subjected to “molestation,” claimed the activists, who include Medha Patkar, anthropologist Nandini Sundar and Kolkata-based social activist Naba Dutta.\n\nThe activists say the primary concern of the forest department officials is to protect the wildlife, including the Royal Bengal Tiger of the Sunderbans. In doing so, they are keen to extend the boundary of the core area which can be inhabited by the tigers. But in implementing their policy, the forest officials are violating the FRA, the activists claimed.\n\n“Project Tiger area has recently been extended without the consent of local gram sabhas. This goes against the FRA [2006],” said Ms. Patkar.\n\nShe criticised the State government for not protecting the “livelihood, culture and identity” of the dwellers by implementing the FRA. “The State government must recognise these rights as they have already been granted under the Act,” she said.\n\nThe activists have conducted a public hearing in the islands of the Sunderbans — Shamsernagar, Gosaba, Saatjaliya, Kultali, Bali and Kumirmari. At the hearing, the villagers have alleged that “though there are no restrictions on tourists from visiting the core areas, the forest-dependent communities are prevented to visit the core area for their livelihood needs,” the activists said.\n\nFact-finding mission\n\nThe national and state-level organisations that hosted the fact-finding mission followed by a public hearing on the FRA implementation in the Sunderbans — Jana Sramajibi Manch, Delhi Forum and All India Union of Forest Working People — have stated in a release that the villagers are “required to pay fines arbitrarily” to forest guards. Moreover the “core area ... is changed as the Forest Department deems fit without properly informing the locals,” said M. Ilango, chairperson of the National Fishworkers’ Forum, who issued the release on behalf of the organisations.\n\n“They [villagers] are illegally detained, charged with false cases and their collections of the forest products are confiscated. On the other hand, the authorities do not register complaints raised by the community people, be it sexual harassment or SC/ST [Prevention of Atrocities] Act,” the release said.\n\n“The women community members have filed complaints against the FD staff charging them with molestation, verbal and physical abuse. Immediate penal action should be taken against those FD staff and steps should be taken to set up a special women’s cell in the region for the protection of victims,” the release said.", 
    "section": "national", 
    "title": "Forest staff molesting women in Sunderbans, claim activists", 
    "subsection": "general", 
    "date": "2016-02-05"
}