{
    "author": [], 
    "text": "Glacial meltwater has been known to contain phosphorus, but as Greenland ice sheet melts, it could be releasing more of phosphorus — a key nutrient that can enrich waters of the oceans, potentially stimulating the growth of marine food chain, finds a new study.\n\nThe total phosphorus concentrations found in the meltwater of the Leverett glacier was 10 times greater than concentrations found in Arctic river waters, the study showed.\n\nThe rising nutrient level could speed up the biological activity of the Arctic waters. It can stimulate growth of plankton — a diverse group of organisms that live in large water bodies and provide a crucial source of food to fishes —— at the base of the ocean food web, which could impact birds, fish and marine mammals higher up the food chain, the researchers indicated.\n\n“We found greater amounts of phosphorus in the waters of the Leverett Glacier in Antarctica than had been detected at previous study sites, which have looked mostly at smaller glaciers,” said Jon Hawkings of the University of Bristol.\n\n“The large Leverett Glacier, however, is more representative of the glaciers that contribute the bulk of meltwater coming from the Greenland ice sheet,” he said.\n\nThe researchers found that the annual phosphorus input for all of Greenland’s outlet glaciers is at least equal to some of the world’s largest rivers, such as the Mississippi in the US and the Amazon in Brazil.\n\nAlso, if most of the phosphorus found in meltwater from all of Greenland’s glaciers reaches the sea, it would be equal to about 400,000 metric tonnes per year, the study revealed. The amount could increase as the climate warms and more ice melts.\n\nHowever, how much phosphorus makes it from the meltwater into the open oceans is not yet known, pointed out the researchers. — IANS", 
    "section": "national", 
    "title": "‘Greenland ice sheet releasing large amount of phosphorus’", 
    "subsection": "general", 
    "date": "2016-02-05"
}