{
    "author": [
        "Josy Joseph"
    ], 
    "text": "‘The aerospace giant has failed to create a robust supply network of domestic firms’\n\nThe Ravindra Gupta Task Force Report on Defence Modernisation and Self Reliance submitted its report in September 2012, officially recording that the Hindustan Aeronautics Limited, India’s aerospace giant, has been importing most of its raw material from abroad, assembling them and supplying finished products to the Indian military. And that it has failed to create a robust supply network of domestic companies and R&D capabilities.\n\nOf the total raw material consumption of HAL, the import component has been going up over the years. Between 2000-01 and 2010-11, it was always above 77.3 per cent. And in 2009-10 and 2010-11 it went up further to 92.6 and 95.4 per cent respectively.\n\nOver the last decade, as HAL grew exponentially, its total raw material consumption was worth Rs. 12,280 crore in 2010-11. The indigenous component was just Rs. 565 crore, which was just 4.6 per cent of the total consumption as opposed to 15.8 per cent in 2000-01, the Task Force Report pointed out.\n\nHow did HAL react to the Task Force concerns? Air Marshal Matheswaran’s report points out that the annual reports of HAL for 2011-12 and 2012-13 omit the details of imports after the Task Force report. The report pointed out that the figures available from the Task Force and other sources show that “These figures reiterate the window-dressing that ‘indigenisation’ actually has become in many DPSUs/PSUs.”\n\n“HAL has been an assembler, in essence, of SKD and CKD [semi knock down and completely knock down] kits for engines and aircraft for six decades. Much of this is dependent on component, sub component, engine and airframe assemblies manufactured under licence. Hence it could actually be thought of as a ‘licence raj’,” the Matheswaran report says. It points out that the import content of HAL for materials and spares amounts to a major portion of its turnover itself.\n\nLittle indigenisation\n\n“HAL’s model ... has resulted in very little indigenisation, less than expected ancillary job and revenue generation within India, besides inadequate vendor development. Along with scanty vendor development in terms of true value and criticality of product to the aircraft itself, there is negligible impact on skill development within the DPSU/PSU,” the report points out.\n\nExamining the 2010-11 performance of HAL, the report points out that the company’s turnover was Rs. 13,115.5 crore and the total consumption was Rs. 12,280.2 crore. Of the total consumption “Rs. 11,715.1 crore [i.e. 95.4 per cent] went abroad towards imports and can be said to be towards profits that foreign OEMs, vendors and MRO services would make there from,” the report says.\n\n“Although 10 Research and Development centres have been in existence for a long period of time at various divisions of HAL, their contribution towards self reliance is negligible,” the report says. Most of these centres spend most of their time resolving basic transfer of technology implementation issues. Resultantly, HAL has come to be fully dependent on imported items.", 
    "section": "national", 
    "title": "HAL’s import, assemble, supply ‘model’", 
    "subsection": "general", 
    "date": "2016-02-05"
}