{
    "author": [], 
    "text": "The intense work probably helped him keep the use of his hands right till he died\n\nThe intense work probably helped the great artist keep the use of his hands right till he died, a team of doctors has found.\n\nDo you know how the famous Italian sculptor and painter Michelangelo managed to produce some of the greatest work of his life even suffering from degenerative arthritis?\n\nAlthough prolonged hammering and chiselling accelerated degenerative arthritis in his hands, the intense work probably helped Michelangelo keep the use of his hands right till he died, a team of doctors has found. To reach this conclusion, they analysed three portraits of the artist that he produced between the ages of 60 and 65.\n\nThe diagnosis of the work shows that the small joints of his left hand were affected by non-inflammatory degenerative changes that can be interpreted as osteoarthritis.\n\nNot gout\n\nIn earlier portraits of the artist, his hands appear with no signs of deformity.\n\n“It is clear from the literature that Michelangelo was afflicted by an illness involving his joints. In the past this has been attributed to gout but our analysis shows this can be dismissed,” said lead author Dr Davide Lazzeri from Villa Salaria Clinic, Rome, in a paper published in the Journal of the Royal Society of Medicine .\n\nNo signs of inflammation\n\nThis, he goes onto explain, is because there are no signs of inflammation in the artist’s hands and no evidence of uric acid crystals that can form under the skin of people with gout.\n\nAccording to letters written by Michelangelo his hand symptoms appeared later in life and in 1552, in a letter to his nephew, he wrote that writing gave him great discomfort.\n\n‘Loss of dexterity’\n\nDespite this he continued to create one masterpiece after another and was seen hammering up to six days before his death in 1564, three weeks before his 89th birthday.\n\nBy then, Michelangelo was unable to write anymore and only signed his letters.\n\n“The diagnosis of osteoarthritis offers one plausible explanation for Michelangelo’s loss of dexterity in old age and emphasises his triumph over infirmity as he persisted in his work until his last days,” Dr Lazzeri explained.\n\nIndeed, the continuous and intense work could have helped Michelangelo to keep the use of his hands for as long as possible, the authors noted. — IANS", 
    "section": "national", 
    "title": "How Michelangelo created greatest work despite bone disease", 
    "subsection": "general", 
    "date": "2016-02-05"
}