{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "Abdullah doesn’t rule out possibility of link between Pathankot and attack on Indian mission\n\nIndia has been kept in the loop on “each and every development” in the Taliban reconciliation process, Afghan Chief Executive Abdullah Abdullah said here on Thursday, ahead of the next round of talks in Islamabad on Saturday.\n\nIn his first interview on the Pathankot attacks that occurred at the same time as the attack on the Indian mission in Mazar-i-Sharif in early January, Dr. Abdullah told The Hindu that he could not rule out that both attacks were launched by the Jaish-e-Mohammad, but said it was “too early to make a judgement” on any link between them or to the transfer of Mi-35 helicopters by India to Afghanistan just a week prior to the attacks.\n\nDr. Abdullah said the visit of Prime Minister Narendra Modi to Kabul on Christmas had “re-energised” the strategic partnership agreement (SPA) between India and Afghanistan, and the SPA commission headed by the Foreign Ministers that had not met since 2012 would meet soon to take ties forward.\n\nIn particular, he said the transfer of four Mi-35 helicopters to Afghanistan had “boosted the morale and combat operations”.\n\nTwo levels\n\nAsked about the possibility of any link in the two attacks, given the evidence, Dr. Abdullah said he could not give a comment, but was not ruling it out. “Yes, all of this evidence is available, but I cannot make that judgement, because there are two levels to this. [At one level] these terrorist groups and their aims and goals are known. But at the other, details of the attacks and any linkages must be discussed by the countries directly not in the media.”\n\nOn Taliban talks, Dr. Abdullah said there would be “no preconditions for talks with the Taliban” as and when they would be resumed, holding that the only “redlines” announced by former President Hamid Karzai, which insisted on the Taliban giving up violence and accepting the Constitution, were meant to be outcomes of the talks, and not preconditions. “If the outcome anyway violates our Constitution that is an absolute redline. If the groups want to continue links with terrorists but join the political mainstream the same time, that is an absolute redline too. Or if they want deny the rights for men and women, then that won’t be allowed. But there will be no preconditions for talks with the Taliban,” Dr. Abdullah said.\n\nOn the widely held perception that India had opposed talks with the Taliban, and that it was blind-sided by President Ashraf Ghani’s announcement of an intelligence partnership with the Islamic State, Dr. Abdullah said this was a misconception of the media.\n\n“That’s how you see it from the outside. Within, India is kept in the loop throughout, because India has a stake in the stabilisation of the country and India has helped with stabilising Afghanistan,” he said.\n\nDuring his visit to Delhi, where Dr. Abdullah met Mr. Modi, National Security Adviser Ajit Doval and External Affairs Minister Sushma Swaraj, he discussed the upcoming meeting of the “Quadrilateral Cooperation Group” (QCG), made up of the U.S., China, Pakistan and Afghanistan that are facilitating the talks with the Taliban. The meeting on Saturday is expected to lead to a resumption of direct talks with Taliban leaders that were called off when it emerged that former leader Mullah Omar had been dead for several months, if not more. In the interview, Dr. Abdullah accepted that the last round of talks with the Taliban, held in July 2015, that were abruptly called off after it emerged that Taliban chief Mullah Omar had been dead for several months, were a sham, but that it was necessary to keep engaging Pakistan.", 
    "section": "national", 
    "title": "India in the loop on Taliban talks: Abdullah", 
    "subsection": "general", 
    "date": "2016-02-05"
}