{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A crew member employed with the Jet Airways was arrested by the Directorate of Revenue Intelligence (DRI) on Thursday, after he was found to be in possession of over Rs. 2.6 crore in United States dollars before boarding a flight to Hong Kong.\n\nAccording to official sources, the accused has been identified as Rislie Agat. Officials said Agat was intercepted at the Customs counter at the Chhatrapati Shivaji International Airport in Mumbai around 12.45 a.m. He was stopped and searched at the Customs counter based on a tip-off from the DRI about an attempt to smuggle foreign currency on board the flight.\n\n“Agat was to be a crew member on board the Jet Airways flight number 9 W 076 to Hong Kong leaving at 2.05 a.m. on Thursday. He did not mention carrying foreign currency in his declaration. However, a search of his baggage revealed USD 3.9 lakh, which he had concealed inside leather diary covers,” said an official.\n\nAgat was detained after the cash was found and was questioned by Customs officials, and later handed over to the DRI. Initial investigation has revealed that the foreign currency was attempted to be smuggled to buy gold that would then have been smuggled into the country by the airline crew, said sources.\n\nIn a statement released on Thursday afternoon, a Jet Airways spokesperson said, “Jet Airways is cooperating with the relevant authorities in their investigation. Jet Airways has a zero tolerance policy towards actions of employees that contravene local or international laws. This is clearly stipulated in employee contracts and reinforced in training sessions. We take all necessary disciplinary action in accordance with company policy and procedures.”\n\nIn the last one year, the DRI has registered several cases of smuggling which have revealed involvement either of either airlines flight crew or ground staff members.\n\nRislie Agat, a crew member, had concealed USD 3.9 lakh inside leather diary covers", 
    "section": "national", 
    "title": "Jet Airways staffer held with Rs. 2.6 crore in U.S. dollars", 
    "subsection": "general", 
    "date": "2016-02-05"
}