{
    "author": [
        "Vijaykumar Patil"
    ], 
    "text": "The Marathi feature film ‘Marathi Tigers’, based on the boundary dispute between Karnataka and Maharashtra, with circumlocutory references to the violent incidents in Yellur village of Belagavi taluk, will not be screened in Belagavi district. This is because there has been a strong protest by Kannada groups and veiled threats by the State government of taking legal action if the film provoked disturbance and disrupted peace and harmony.\n\nThe film will hit the screens in Maharashtra on Friday. Meanwhile, the Chandgad tahsildar has denied permission to screen the film in Shinoli apprehending that the film might spark off law and order problems in boundary areas of the taluk.\n\nThe tahsildar issued an order to this effect on Thursday in reply to a request made by manager of the Touring Theatre, Shinoli. However, the local unit of the Shiv Sena has reportedly threatened to go against the government’s directive, come what may\n\nA makeshift theatre has been erected in Shinoli, a village across Karnataka boundary in Chandgad taluk of Kolhapur district, for the convenience of the Marathi-speaking members of Belagavi and adjoining areas.\n\nIn fact, an air-conditioned tent theatre, with a seating capacity of 500 has been erected in the village. The tickets are already being sold in various counters in Belagavi city.\n\nThere will be four shows every day. The producers could not find any theatre in Belagavi district willing to screen the film, as the district administration had made it clear to theatre owners that they would be held responsible for any untoward incident arising out of the film show in the city and district.\n\nBelagavi District Kannada Organisations Action Committee president Ashok Chandargi said here on Thursday that the Maharashtra Ekikaran Samiti leaders were using the film to lure Marathi voters for the electoral prospects of MES members contesting the zilla and taluk panchayat elections in the district. He said the tickets were being sold in Belagavi and transportation had also been arranged for the ticket holders to ferry them from the city to Shinoli and back.\n\nThe Marathi feature film will hit the screens in Maharashtra\n\ntoday", 
    "section": "national", 
    "title": "‘Marathi Tigers’ not to be screened in Belagavi", 
    "subsection": "general", 
    "date": "2016-02-05"
}