{
    "author": [], 
    "text": "The claim that low-dose radiation causes cancer is based on an unproven, decades-old theoretical model and has never been conclusively proven, scientists say.— File Photo\n\nThe widespread belief that radiation from X-rays, CT scans and other medical imaging can cause cancer is based on an unproven, decades-old theoretical model and has never been conclusively proven, scientists say.\n\nThe model, known as linear no-threshold (LNT), is used to estimate cancer risks from low-dose radiation such as medical imaging, the researchers said.\n\nHowever, risk estimates based on this model are only theoretical and, as yet, have never been conclusively demonstrated by empirical evidence, they said. Use of the LNT model drives unfounded fears and excessive expenditures on putative but unneeded and wasteful safety measures, according to James Welsh, a professor at the Loyola University Chicago Stritch School of Medicine in U.S.\n\nThe LNT model dissuades many physicians from using appropriate imaging techniques and “discourages many in the public from getting proper and needed imaging, all in the name of avoiding any radiation exposure,” Welsh and colleagues wrote in the study published in the American Journal of Clinical Oncology .\n\nThe researchers re-examined the original studies, dating back more than 70 years, which led to adoption of the LNT model. This reappraisal found that the data reported in those studies do not actually support the LNT model. In the LNT model, the well-established cancer-causing effects of high doses of radiation are extended downwards in a straight line to very low doses.\n\nThe LNT model assumes there is no safe dose of radiation, no matter how small. However, the human body has evolved the ability to repair damage from low-dose radiation that naturally occurs in the environment.\n\nThe LNT model dates to studies, conducted in the 1940s, of fruit flies exposed to various doses of radiation. The scientists who conducted those studies concluded there is no safe level of radiation, thus giving rise to the LNT model that is used to this day. However, their conclusion was unwarranted because their experiments had not been done at truly low doses. A study exposing fruit flies to low-dose radiation was not conducted until 2009, and this study did not support the LNT model. — PTI", 
    "section": "national", 
    "title": "Medical imaging doesn’t cause cancer: study", 
    "subsection": "general", 
    "date": "2016-02-05"
}