{
    "author": [
        "Max Berlinger"
    ], 
    "text": "For a new adventurous generation, dyeing one’s hair grey is gaining traction\n\nSinger Zayn Malik dyed his hair grey for two recent magazine cover shoots. Men such as him are appropriating a naturally occurring phenomenon from older men and giving it a millennial twist.— Photo: The New York Times\n\nOn two magazine covers that singer Zayn Malik has graced in the last few months — for Billboard and L’Uomo Vogue (as well as the racy video with his girlfriend, Gigi Hadid) — he looks every bit the young, brooding pop star. The requisite smouldering stare, perfectly manicured stubble and bad boy tattoos are all in tow.\n\nAnd then there’s the hair.\n\nMalik, 23, a former member of the musical group One Direction, peers out in both images from beneath a silver mane. This isn’t a case of a young man going prematurely grey, but a premeditated decision by the performer, who has a penchant for dyeing his hair and then broadcasting it to his 6.5 million Instagram followers.\n\nGus Kenworthy, the Olympic freestyle skier who came out as gay last year on the cover of ESPN magazine, debuted an ashen dye job in December on Instagram, thanking Anderson Cooper for the inspiration, adding the hashtag #50shadesofgay.\n\nThey’re not alone.\n\nGone are the days when guys would actively avoid greying hair. For a new generation of adventurous men, dyeing one’s hair grey is gaining traction, appropriating a naturally occurring phenomenon from older men and giving it a millennial twist.\n\n“Men are embracing colour more in a general way,” said Amie Rau, a stylist at Matthew Morris Salon in Denver, who dyed Kenworthy’s hair. “This is an extension of that.”\n\nBoth Malik and Kenworthy declined to be interviewed for this article.\n\nRau said that since their first session, Kenworthy had brought in an image of a young woman with dyed grey hair as inspiration. “He kept asking me, ‘Is it crazy that I want to do this?'”\n\nAfter the ESPN cover, Kenworthy, 24, went to Rau to go platinum blond. “I said: ‘You know, you just came out to an entire nation. You should do what you want to do,\"’ she recalled saying.\n\nGray and silver hair has definitely been trending, said Aura Friedman, a senior hair colourist at the Sally Hershberger Salon in New York. “The demographic of guys who come to me to go gray are doing it more as a fashion statement,” she said, as opposed to a more natural look.\n\nFriedman said she has dyed the hair of Phillip Picardi, the digital editorial director of Teen Vogue, and Drew Elliott, the chief creative officer for Paper magazine, among others.\n\nInterest definitely seems to be up. A representative from Amazon said it had seen a threefold increase in the last year in customers searching for gray hair dye.\n\n“It’s kind of an ironic statement, especially when the wearer is noticeably young and probably years away from natural graying,” said Michael Fisher, creative director of menswear at Fashion Snoops, the trend forecasting agency. “It’s just another bold way to stand out from the crowd.”\n\nTyler Oakley, 26, the social media personality who parlayed his online cachet into the documentary “Snervous” and book “Binge” last year, has experimented with his hair color, adopting many shades, from purple to green.\n\n“Gray is the favorite color I’ve ever had,” he said. “It was unique and fun, but it’s not eye-catching in the way that like lilac or mint was. When I had those colors, I felt like everyone was looking at me. With gray, I felt like I was trying on a new look, but it was also relatively natural.”\n\nCelebrities aren’t the only ones to take the plunge. “I’ve always been confident, but now I feel more fun and cooler,” Michael Vasquez, 30, a senior business analyst, said of his artificial gunmetal hue, now several months old. “I really love it. I feel sexier.”\n\nAdmittedly, part of that is because of the positive response he received from friends and on social media, getting 90 “likes” on his Instagram account. “Of course, my mom doesn’t like it,” Vasquez said with a laugh.\n\nAchieving the silver fox look is an involved process. “In the industry, we call it a bleach and tone or a double process,” Friedman said, referring to a two-part procedure in which the hair is first stripped of its natural pigment and then colored, an undertaking that can last eight hours and is often costly. — New York Times News Service", 
    "section": "national", 
    "title": "Millennial men flaunt grey hair", 
    "subsection": "general", 
    "date": "2016-02-05"
}