{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "In a move that could become a model for countries keen on a share of India’s civil nuclear energy pie, India and Russia have set up a working group to locally build components for nuclear power plants of Russian design.\n\nThis is based on the Action Programme signed between Rosatom and the Department of Atomic Energy of India during Prime Minister Narendra Modi’s visit to Moscow in December last year.\n\n“Based on the decision signed in December 2015, a fourth working group on the localisation of production in India has already been established and is operating successfully,” Evgeni Griva, Director General of Rosatom South Asia, said in an interview to Russian agency TASS. It has been shared exclusively with The Hindu .\n\nRosatom, as part of its plans for expanding its global footprint, is in the process of opening its regional office for South Asia office in Mumbai.\n\nAccording to Mr. Griva, the Action Programme includes areas of cooperation in the field of joint machinery production, especially for nuclear power plants, as well as cooperation in the field of joint development, mastering and technological support of the implementation of end-to-end production technologies of products for heavy and power engineering industries.\n\nThe three joint working groups, set up under the Indo-Russian Coordinating Committee on cooperation in the peaceful uses of nuclear energy established in December 2014, are on the nuclear fuel cycle, nuclear energy and scientific-technical cooperation.\n\nThe localisation plans are part of the government’s efforts to build manufacturing in the country under its ambitions Make in India initiative.\n\n“We fully support this commitment of the Indian Government…,” Mr. Griva stated.\n\nRussia is currently building six reactors in Kudankulam of which the first unit was commissioned in autumn 2013. It was shut for the first scheduled preventive maintenance (SPM) and has now successfully restarted power generation.\n\nThe assembly of the second unit assembly has been finished and the hot run stage was completed. “The physical launch is scheduled by the Indian party for mid-2016,” Mr. Griva said.\n\n(Full interview at:\n\nhttp://bit.ly/1SKQIUe)\n\nThe localisation plans are part of the government’s Make in India initiative", 
    "section": "national", 
    "title": "N-plant parts to be made in India", 
    "subsection": "general", 
    "date": "2016-02-05"
}