{
    "author": [
        "G S"
    ], 
    "text": "Andhra Pradesh Chief Minister N. Chandrababu Naidu paying homage to martyrs at the Victory-at-Sea memorial in Visakhapatnam on Thursday to mark the beginning of the International Fleet Review.— Photo: C.V. Subrahmanyam\n\nAndhra Pradesh Chief Minister N. Chandrababu Naidu accompanied by Chief of Naval Staff Admiral R.K. Dhowan and Flag Officer Commanding-in-Chief, Eastern Naval Command, Vice-Admiral Satish Soni laid a wreath at the War Memorial – Victory at Sea – here on Thursday to honour the sailors and officers who laid down their lives for the nation.\n\nThe Chief Minister saluted the martyr’s memorial even as Navy buglers sounded the Last Post.\n\nThe solemn ceremony in proper naval tradition was preceded by wreath-laying by the commanding officers of the ships of foreign navies participating in the International Fleet Review 2016.\n\nThe ceremony in martial tradition marked the beginning of the activities of the IFR 2016 being hosted by the Eastern Naval Command for the first time. The second IFR conducted by the Indian Navy is also the biggest congregations of warships, Indian and foreign, off the coast of Visakhapatnam during peace time.\n\nChief of Staff Eastern Naval Command Vice-Admiral Bimal Verma, representatives from the navies of Australia, Bangladesh, Singapore, Seychelles, South Africa, Bahrain and Malaysia, among others were present.\n\nLast rehearsal\n\nBefore the Chief Minister arrived at the Victory at Sea War Memorial, the crowd gathered on the beach road to witness the last rehearsal of the International City Parade and the flypast by Navy aircraft. The crowd was treated to some breathtaking aerobatics by the two Catwalk Grumman biplanes of the Scandinavian Airshow team of Jacob Hollander that flew along the beach road .\n\nThe engines strained as the pilots took them up vertically, and then the aircraft flipped to glide in vertically and straightened up to fly along the beach.\n\nAfter some time one aircraft left the beach and the single biplane did some amazing rolls and flips and flew past the crowd close to the beach.\n\nThen it was the turn of the Wingwalker team on the second aircraft. The aerobatics concluded by the time the Chief Minister reached the venue.\n\nThe event is being hosted by the Eastern Naval Command for\n\nthe first time", 
    "section": "national", 
    "title": "Naidu pays tributes to martyrs", 
    "subsection": "general", 
    "date": "2016-02-05"
}