{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Two policemen who were present when the 24-year-old Tanzanian student was attacked and allegedly stripped by an angry mob at Soladevanahalli on Sunday evening did not come to her rescue, it has now emerged. Worse, they pushed one of the students back towards the mob when he pleaded for protection, the woman recalled while narrating her ordeal to Home Minister G. Parameshwar on Thursday, police sources confirmed.\n\nMr. Parameshwar himself drew a spate of criticism on Thursday after he said the attack was not racial and that she would not have been targeted had there been no accident in the area involving an African student.\n\n“My friend Hashim Jamal, who was driving the car, was dragged out by the mob and beaten up,” the victim, a student of Acharya Institutes in the city, told presspersons after meeting the Home Minister.\n\n“Shockingly, there were cops at the spot and they did not come to our rescue. I saw two cops to whom Jamal ran for help. But they not only refused to protect him, but pushed him back at the mob. Hashim, again for a second time, went and fell at their feet and pleaded that if he were to die he would rather it happened at the police station, after which they acted to control the mob.”\n\nSenior police officials who were part of the meeting also confirmed that the woman reported this to the Home Minister and Police Commissioner N.S Megharik, who met the victim at Yeshwanthpur police station. She is reported to have told the Minister that when she approached the police for help soon after the incident on Sunday night, she was asked to get the Sudanese national responsible for the accident that triggered the violence. When she protested that she did not know the Sudanese national, a policeman allegedly made a racist remark.\n\nMeanwhile, though the victim was unable to provide more information to identify the two policemen, senior police officials said finding them would not be difficult. “It is part of the probe and we will not spare them,” a senior official leading the investigation said.", 
    "section": "national", 
    "title": "Police did not come to our rescue, says victim", 
    "subsection": "general", 
    "date": "2016-02-05"
}