{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Naidu asks Backward Classes panel chief to submit report soon\n\n: The issue of reservation for the Kapu community is brewing into an uncomfortable issue for the Andhra Pradesh government, which is hosting the International Fleet Review in Visakhapatnam. The countdown for former minister and Kapu community leader Mudragada Padmanabham and his wife Padmavathi’s fast-unto-death has begun and it is likely to be launched a 9 a.m. on Friday.\n\nHundreds of supporters, mostly youth from different parts of Andhra Pradesh and neighbouring States, met Mr. Padmanabham and his wife on Thursday.\n\n“Supporters from far-off places like Gooty, Uravakonda in Anantapur district and Palakonda in Srikakularm are joining him,” said Sai Chilakamarthi, a close associate of the Kapu leader. According to a senior police officer, the couple may be taken into custody after the fleet review at Visakhapatnam ends on February 7.\n\nMr. Padmanabham had set a deadline for the State government to include his community in the Backward Classes list and release Rs. 1,900 crore immediately. He threatened to sit on a fast if the government failed to do so.\n\nThe police took it as a challenge and deployed more than 5,000 special personnel in Prattipadu (of which Kirlampudi is a part), Jaggampeta and Tuni constituencies to ensure that no untoward incident took place. Of the five companies of special police, two have been deployed in Prattipadu and about 1,000 armed police were seen in riot gear. The police have imposed Section144 of the Police Act in Tuni, Jaggampeta, Prattipadu and Kakinada and nine other towns in East Godavari district.\n\n‘Expedite report’\n\nAndhra Pradesh Chief Minister N. Chandrababu Naidu on Thursday asked the State BC Commission Chairman Justice K.L. Manjunath to submit the report on reservation for the Kapu community at the earliest. Mr. Manjunath met Mr. Naidu and said the report could be submitted within the stipulated time.\n\nNegotiations begin\n\nAccording to the latest reports, two Telugu Desam Party MLAs, Bonda Umamaheswara Rao and Thota Trimurthulu, have left for Kirlampudi to negotiate with Mr. Padmanabham\n\nThe Congress has demanded that Mr. Naidu call an all-party meet to resolve the issue.\n\nThe party opined that statements made by the Chief Minister are only aggravating the problem and polarising communities in the State.", 
    "section": "national", 
    "title": "Quota issue: Kapu leader firm on indefinite fast", 
    "subsection": "general", 
    "date": "2016-02-05"
}