{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "A few years ago, a police officer who was reviewing cases of unnatural deaths in Salem by chance noticed ligature marks in the photo of the deceased. The case was that of a Dalit youth who was declared dead when taken to a hospital by his wife.\n\nAlmost a year later, further investigation revealed that the youth was strangled by his friend over a quarrel and left at home in an unconscious state. The victim died hours later. The case was altered to murder and the accused arrested.\n\nThis triggered the thought that cases of unnatural deaths, particularly suicides, should be probed in depth to rule out possibility of murder, abetment to suicide or any other foul play.\n\nFollowing this, the Human Rights and Social Justice wing of the Tamil Nadu police is now examining every case of unnatural death involving Dalits in detail.\n\nMan/woman “missing” cases are also being monitored closely and investigators given a check list that could lead to the detection of the case, police sources said.\n\nAccording to Additional Director-General of Police (Human Rights and Social Justice) Rajesh Das, on an average the State reports at least 5,000 unnatural deaths of Dalits a year. At least 45 per cent of these cases pertain to alleged suicides.\n\n“There are cases where youth end their lives owing to stomach pain or illness. Do people commit suicide because of stomach pain or any other ailment? There could have been some other factor that forced the victim to take the extreme step. If such angle is made out, it means that there was abetment to the suicide,” Mr. Rajesh Das said.\n\nCases of women resorting to self-immolation are often treated as suicide due to personal reasons. Investigation in a woman suicide case in Theni district revealed that she ended her life because her husband was in deep debt.\n\n“We found that he had taken loans on high rates of interest and was under extreme pressure from moneylenders. Provisions of the Tamil Nadu Prohibition of Exorbitant Interest Act, 2003, were invoked and the accused arrested. Where victims of attempted suicide are admitted to hospital, we are making sure that the dying declaration is recorded by a judicial magistrate,” he said.\n\nTeams of Human Rights and Social Justice Wing headed by a Deputy Superintendent of Police are posted in every district. “These personnel are now monitoring investigation in every case of Dalit suicide in detail to ensure that there is no foul play. There have been a few instances of cases of suicide that were altered to Section 306 (abetment of suicide) of IPC,” the officer said.\n\nConviction rate up\n\nSystematic investigation, filing of charge-sheet and ensuring court attendance (of investigation officers) had resulted in the rate of conviction going up.\n\nIn 2015, the State police secured 11 life sentences in grave crimes where Dalits were victims.\n\nA number of accused persons involved in rape or attempt to rape offences were detained under the Goondas Act, Mr. Rajesh Das added.\n\nHuman Rights wing of police examining every case of unnatural death", 
    "section": "national", 
    "title": "Spotlight on Dalit suicide cases", 
    "subsection": "general", 
    "date": "2016-02-05"
}