{
    "author": [
        "Anuradha Raman"
    ], 
    "text": "IIMC curriculum directs students not to discuss issues relating to religion, gender\n\nIn the curriculum designed for students studying for a journalism diploma at the Indian Institute of Mass Communication (IIMC), is a paragraph directing students to steer clear of making comments related to caste, religion or gender.\n\nThis was incorporated in the curriculum five years ago, as faculty members felt that with increasing diversity it was necessary to prepare students for their future role as journalists. The directives were only for those studying Hindi journalism and directed at students coming from the Hindi heartland in an attempt to sensitise them to caste and gender issues.\n\nYet as events unfolded on January 18, when a Facebook post by Utkarsh Singh was shared and read out on January 29, students such as Prashant Kanojia were upset by the contents.\n\nThe use of derogatory words against Scheduled Caste students gathered to express solidarity with research scholar Rohith Vemula who had committed suicide, prompted them to write to the administrative head of the institute. Prashant and his friends only demanded a public apology from Utkarsh.\n\nA letter written on February 1 by the students, draws attention to the safeguards in the Scheduled Castes and Scheduled Tribes (Prevention of Atrocities) Act, as it seeks positive action from the administration.\n\nAt the IIMC, there is no dean of student welfare. There is no cell to address grievances of students, let alone students from the Scheduled Castes and the Scheduled Tribes.\n\nA faculty member said: “It was an institutional failure as we realised there was no mechanism to deal with the problem at hand.”\n\nFor the last six years, teachers at the institute have been seeking the Ministry’s permission to set up a structure to address issues of discrimination, if any.\n\nWith preparations for observing the 48th convocation under way, the administration got into the act and set up a committee under faculty member Pavan Kondal to investigate the matter. The students were told not to make political capital out of it as their careers were at stake. Utkarsh apologised but Prashant said he has only been told that Utkarsh has apologised. “It looks like the institute is supporting him,” Prashant said. The Information and Broadcasting Ministry has sought a report by February 10.\n\nThere are 30 students from the Scheduled Castes and the Scheduled Tribe communities at the institute.\n\nThe institute has no academic council, no full-time registrar for the last 10 years and no director general for the last three months as the select committee is yet to finalise a name.\n\nThe chairperson of the institute is the secretary in the I&B Ministry and a joint secretary is often the nodal officer between the institute and the government.\n\nThe aggrieved students have approached the National Commission for Scheduled Castes and Scheduled Tribes.", 
    "section": "national", 
    "title": "‘Steer clear of comments on caste’", 
    "subsection": "general", 
    "date": "2016-02-05"
}