{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "Senior staff of Inamdar College argue with parents of the students who drowned off the Murud beach recently.— PHOTO: SPECIAL ARRANGEMENT\n\nAmid bitter recriminations in the wake of the Murud beach tragedy, a video clip purporting to show high-handed and insensitive behaviour on the part of college authorities towards grieving parents has gone viral on social media sites.\n\nFourteen students from Pune’s Abeda Inamdar College on a picnic drowned in the Arabian sea on Monday.\n\nThe clip, taken on Wednesday, shows P.A. Inamdar, president of the Maharashtra Cosmopolitan Education Society which runs the college, sternly reprimanding the parents to “lower their voice” as the distraught parents are seen demanding to know just how a mishap on such a scale could have occurred.\n\nThe parents are seen questioning Mr. Inamdar about the “negligence” on the part of the 11 college guardians, eight teachers and three staffers, who failed to dissuade the children from entering the waters on Monday afternoon.\n\nThe clip, which was widely circulated on WhatsApp, then shows Mr. Inamdar losing his cool and asking the peons to drive away the parents from the meeting room.\n\nTempers ran high after Wednesday’s condolence meet organised by the college when parents of the victims accosted Mr. Inamdar. The parents have been repeatedly accusing the college authorities of “gross insensitivity.” “There is no question of issuing an apology,” said Mr. Inamdar, when contacted. “The college has done its utmost to help the parents in the wake of the tragedy. The college arranged for ambulances... two Ministers and a Superintendent of Police were present on the spot. Never before has a rescue operation been mounted on such a scale.”\n\nHeavy police deployment continued on the college premises to avert untoward incidents.", 
    "section": "national", 
    "title": "Video of Murud victims’ parents being mistreated goes viral", 
    "subsection": "general", 
    "date": "2016-02-05"
}