{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Bird watchers trying to capture birds as part of the Big Bird Day near Big Tank in Coimbatore on Sunday. (right) Bird watchers counting birds at Kunjapanai near Kotagiri. —Photos: S. Siva Saravanan and Special Arrangement\n\nBird watchers trying to capture birds as part of the Big Bird Day near Big Tank in Coimbatore on Sunday. (right) Bird watchers counting birds at Kunjapanai near Kotagiri. —Photos: S. Siva Saravanan and Special Arrangement\n\nTeams had earmarked their areas of operation to avoid repetition\n\nBird watchers have sighted more than 140 bird species in Coimbatore on Sunday – a day where they went across the district to record birds for the first time as part of Big Bird Day. Three teams of bird watchers were involved in the exercise, says Mansur Ahamed, one of the members of a team.\n\nHis team visited Siruvani, Ukkadam Big Tank, Kalapatti and a few other areas to record birds they had sighted. A second team led by bird watcher Jishnu covered Marudhamalai, Kallar and areas in their neighbourhood. A third team led by Keerthana and a few students covered Singanallur and Sulur tanks and areas nearby.\n\nA few days prior to the exercise, the teams had earmarked their areas of operation to avoid repetition and ensure every land type was covered. The bird watchers noted down details of the birds and location and also entered the data in an app, says Mr. Ahamed.\n\nThe teams’ record had overlapping details in that they had noted down same species but that had been discounted to arrive at the 140-plus mark.\n\nThis was part of the nation-wide exercise where bird watchers had panned out to forests, rural, semi-urban and urban areas to sight and record birds. Though it was the first time in Coimbatore, such an exercise has been going on in The Nilgiris district for the past four years, he adds.\n\nOn Sunday, her team sighted Malabar Trogan, a rare bird to sight given its shy nature, says Gayathri, a member of Mr. Ahamed’s team.\n\nIn The Nilgiris, bird watchers have recorded 60 species in Ooty and 40 in Kundah, say sources.", 
    "section": "national", 
    "title": "140-plus bird species sighted on Big Bird Day", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}