{
    "author": [], 
    "text": "Rising establishment costs, difficulty in finding librarians and general apathy towards reading\n\nLending libraries, which were once a good business model, seem to no longer guarantee commercial success.\n\nG. Sujatha of Madipakkam laments that finding a lending library, particularly those offering English and children's novels, has become difficult in the suburbs. The rise of social media and lack of enough spare time seem to be the reason, she says.\n\nOwners of lending libraries find running them increasingly tough, primarily due to rising rental costs that take a huge chunk out of their overall expenditure. Another problem is that they are finding it difficult to hire librarians. Many also feel that the reading habit is waning among people.\n\nV. Sridhar, proprietor, Book World Library, says that it has become tough to operate libraries at a time when it is not financially rewarding. He says due to dwindling users and high rent, he was forced to shut down two lending libraries. He cited children’s attention shifting to television as another reason for people closing down lending libraries. Online lending libraries also are not in the best of health.\n\nThe long wait\n\nfor an app\n\nWhat if a mass rapid transit app tells people when the next train is scheduled for arrival, its route and other details?\n\nLike Delhi, Chennai Metro Rail also has been thinking of launching such an app soon. But, many months after the launch of the first service between Koyambedu and Alandur and six months from commissioning its next stretch, it is high time an app is launched if Chennai Metro Rail needs to stay connected with its commuters, especially the youth.\n\nThe current route of operation is small, but the next one will connect Chennai airport and Chennai Metro Rail Limited (CMRL) may want to add on this feature. “We have already considered it and it will certainly be something we would want to have. But, it is not clear when we will launch the app,” an official says.\n\nThis app will certainly be appreciated since commuters, on a daily basis, are in for a painfully long wait before taking a mode of public transport.\n\n(Reporting by R. Srikanth and Sunitha Sekar)", 
    "section": "national", 
    "title": "A dark age ahead for lending libraries?", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}