{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Coimbatore Consumer Cause had filed a public interest litigation with Madras High Court seeking direction to the government for implementation of an amendment made to Registration Act.\n\nThe court has issued notice to the government and has posted the matter for further hearing on March 10.\n\nAccording to the consumer organisation, even seven years after passing the amendment to the Registration Act and Gazette notification, it was not given effect and this had paved way for illegal and unsafe growth of cities.\n\nThe Tamil Nadu Government had made the amendment to the Registration Act and introduced a new Section 22 in November 2008.\n\nThus, registration of certain documents (conveyance of properties belonging to the Government or local bodies, conveyance of properties of Wakfboard and State Bhoodan Yagna Board, and lands converted as house sites without approval of the concerned planning authorities) are banned.\n\nMany layouts have been developed even in low-lying areas and these constructions receive electricity and water connections too. These pose inconvenience and difficulties to houses in approved layouts too. Such problems could be prevented if the Registration Department stopped registering such unapproved sites.\n\nThe State Government had issued gazette notification of the amendment in March 2009. It was also said that action was being taken to notify the date of coming into force of the amendment. The Government had regularised all house sites purchased in unapproved layouts till July 2006 and permitted them to regularise till 2010. However, the regularisation scheme had said that if any unapproved site or layout was developed after the date of the Government Order, strict action would be taken.\n\nAccording to the consumer organisation, though it had made several representations, the government had not given effect to its notification on the amendment to the Registration Act. “But, even after nearly seven years it failed to give effect to its notification necessitating the writ petition.”", 
    "section": "national", 
    "title": "Amendment to Registration Act: consumer body goes to court on non-implementation", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}