{
    "author": [
        "S P"
    ], 
    "text": "One of the oldest prisons in the State, Salem Central Prison is today not just a physical structure for confining persons convicted of crimes, but also serves as a place for reformation and rehabilitation of the prisoners.\n\nStarted in 1862 on Yercaud Main Road in Hasthampatti, the prison is spread across 113 acres. Presently, 600 remanded and under trial prisoners and 300 convicts are lodged. The Prison for Women is located just outside this prison where 60 inmates are lodged.\n\nIndustrial units like power loom, tailoring and book binding are located inside the prison premises where inmates work every day and also earn. These units produce almirah, cot, racks and steel materials that are sold in the market. Cots manufactured here are supplied to Government Mohan Kumaramangalam Medical College Hospital for many years now and there is good demand for the product in the market also.\n\nAs part of reform activity, Prison Bazaar, a shop selling and serving products made by the convicts was opened last year. Named as ‘Freedom’, services such as laundry, saloon and tailoring are available for the public at affordable cost. “They charge Rs. 6 for ironing a set of dress where as we have to pay Rs. 10 outside. Even for hair cutting they charge only Rs. 40. It is very cost effective,” said a regular customer to the bazaar.\n\nInitially, 15 inmates were trained and deployed for the work every day. However, with good public response, another 15 inmates would soon be deployed for the work. “Our stress level is reduced and we have chance to see and interact with the public”, said a convict who was involved in tailoring.\n\nThe ‘sukku’ coffee prepared by women inmates are sold to the morning walkers every day. Inmates who are involved in the work are paid 20 per cent of the profit and the amount is credited to their account.\n\nG. Shanmugasundaram, Superintendent of the prison, said that Prison Bazaar has brought positive change in the minds of the inmates and the response from the public is also encouraging. “Work will start soon to construct a hotel where food will be available at affordable cost”, he added.", 
    "section": "national", 
    "title": "An initiative to reform and rehabilitate", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}