{
    "author": [
        "Staff Reporter"
    ], 
    "text": "On a rather quiet Sunday, morning walkers at Nageswara Rao Park were in for a colourful surprise as the pavement was adorned by fabulous paintings resting against giant old trees.\n\nThe Art Mart held on Sunday saw several artists and many working people whose hobby was art display their creations at the park. Aarthi Rao, a doctor, displayed her art works from Kerala Murals to Kalamkari.\n\n“This is my way to relieve stress. I do not watch television. As soon as I am back from hospital, I start painting and nothing else gives me more happiness,” she said.\n\nIn one of the corners, while Jyothimani, an artist was quietly giving a demonstration of how to paint a portrait, children and senior citizens sat next to each other furiously taking tips about strokes and colour combination.\n\n“It is interesting to meet people in such an atmosphere and teach. After all, of what use is art if one does not want to teach it,” he said.\n\nB. Srivarshini, a class VI student, wrote down every technique that Mr. Jyothimani explained.\n\nShe said though she had been into sketching for a while now, this session had inspired her to take up painting. “It was interesting to see the way he blended colours, hear his explanation of the difference between various mediums and usage of black and white colours,” she added.\n\nThe first edition of this Art Mart saw about 78 people displaying their works that ranged between Rs. 200 and 20,000. Ganapathy Subramaniam, a software engineer and an artist, said bringing art into public space exposes it to more people.\n\n“I have seen this happening in other cities. When art is brought out it becomes more accessible to people from different walks of life.”\n\nPaintings were displayed on\n\nthe pavement outside Nageswara\n\nRao Park", 
    "section": "national", 
    "title": "Art of all shades and hues, for the people, by the people", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}