{
    "author": [
        "V S"
    ], 
    "text": "Validity of existing licence expired; continuance of bars amount to violation of licensing conditions\n\nWith the Tasmac bar owners locking horns with authorities resulting in closure and sealing of all the bars in over 190 liquor outlets in Coimbatore, tipplers are left to consume liquor in public places.— Photo: S. Siva Saravanan\n\nIn a tug of over renewal of bar licence, the arm twisting resorted to by Coimbatore District Bar Owners Association with the Tamil Nadu State Marketing Corporation (Tasmac) officials resulted in the authorities closing and sealing all the 196 bars in Coimbatore district since February 4.\n\nWhen the validity of the existing licence was about to expire, the Tasmac floated tenders to enable the bar licensees to bid for the same for getting it renewed for the second time. Tenders floated in November and December 2015 and January 2016 had no takers. Bar owners abstained for even picking up the application for getting the licence renewed.\n\nBar owners pay a licence fee ranging from Rs 1.5 lakh to Rs. 4 lakh per month depending on the area and the projected sale volume. In addition, licence fee for two months is paid as deposit. According to Mr. Azhagu, president of Coimbatore District Bar Owners Association, this time they wanted a fresh tender to be floated and were ready to bid for it afresh. Meanwhile, they wanted the authorities to deduct the deposit amount for two months i.e., the intervening period between the expiry of licence and renewal of licence including the time taken for bidding for tenders and finalisation of the same and issue of fresh licences. They alleged that whenever licence changes hands, getting back the deposits took anywhere between two to four years.\n\nTasmac officials say that the deposit amount rests with the State Government and is never at the dispensation of authorities at the local level. Bar owners should have made a representation to the Tasmac higher officials in Chennai and only on orders from them, deduction could be done. However, the bar owners never made any concrete move for the same, but kept pressing for it orally and that too with the officials at the district and zonal level. This particular demand and deadlock over renewal of licence is unique to Coimbatore and no other district had witnessed the same.\n\nHowever, with the deadlock having remained unresolved, officials commenced a drive to lock and seal all the bars as the validity of the existing licence had expired and continuance of bars beyond the date would amount to violation of licensing conditions. The district has 126 Tasmac outlets in Coimbatore North and 104 in South. Of the 230, closer to 196 had bars. Now, almost all the 196 bars had been locked and sealed.\n\nWhile closure of outlets resulted in tipplers starting to consume liquor in public places creating nuisance, which in itself is an offence under Tamil Nadu Prohibition Act, bar owners said that they had paid rent for the premises and bar attendants (servers) had to be paid salaries without any work. Mr. Azhagu said that with outlets not having a bar, the Tasmac sale was dipping every day causing a loss to the State exchequer.\n\nCountering this argument, officials say that elite Tasmac outlets in high-end areas and malls (without bars) have a very good patronage which is consistently on the rise. In the last-days after the closure of bars, there has not been any significant dip in sale volumes.\n\nWhen contacted, District Collector Archana Patnaik said that officials were in talks with the bar owners and a fresh date had been fixed for floating of tenders again for the fourth time on February 25. Ms. Patnaik said that by then the issue would be resolved.", 
    "section": "national", 
    "title": "Bars in all Tasmac outlets closed", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}