{
    "author": [
        "S Sundar"
    ], 
    "text": "14 bodies handed over to relatives after post-mortem\n\nDeath toll in the accident involving a bus and a lorry on Madurai-Shencottah highway under T. Kallupatti police station limits on Saturday rose to 16 with one more passenger succumbing to injuries at Government Rajaji Hospital (GRH) here around 2.30 a.m. on Sunday.\n\nPolice identified the deceased as Devakalaiselvan (35) of Uthamapalayam.\n\nAmong the dead were five women and drivers of both the vehicles.\n\nFourteen of the 16 bodies were handed over to the relatives after post-mortem conducted at the GRH and Tirumangalam Government Hospital.\n\nPost-mortem could not be conducted on two bodies – those of S. Jaisantosh (6) and his grandmother M. Nallaguru (55) of Mamsapuram – as the woman’s son, Sangilipandi, a military man deployed in Assam, was yet to reach here, the police said.\n\nForty passengers, including 22 women, were admitted to the GRH and government hospitals in Virudhunagar and Tirumangalam.\n\nPolice sources said that the passengers of the bus proceeding from Tirunelveli to Kumili raised an alarm when they noticed the lorry which was wobbling on the two-way highway. Bus driver R. Murugesan signalled to lorry driver K. Muthukumar about the ensuing danger with headlights as the cement-laden truck was drifting to its right.\n\nMurugesan also honked the horn.“The truck driver lost control of the vehicle probably because he dozed off. By the time he was alerted by the horn, the vehicles had come too close to each other. When the bus driver tried to avoid hitting the lorry by swerving the vehicle to the extreme right, the truck driver too tried to turn the vehicle in the same direction,” a police officer said.\n\nThe heavily-loaded truck ripped through the front portion of the bus, and in the impact, both the vehicles turned towards the eastern side.\n\n“All the rods in the buses were broken and we were caught inside,” said Leelavathi (50) of Sivagiri in Tirunelveli district.\n\nThe police and Fire and Rescue Services personnel, after using gas cutters to cut the entangled rods, had to use three earthmovers to separate the vehicles, police sources said.\n\nIt took more than two hours to complete the task as focus was on rescuing two passengers whose limbs were caught in the mangled remains.\n\nThe police sources said that at least 63 passengers were travelling in the bus.", 
    "section": "national", 
    "title": "Bus-truck collision: toll rises to 16", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}