{
    "author": [
        "V S"
    ], 
    "text": "Vacancies in the Consumer Disputes Redressal Fora across Tamil Nadu are leading to a pile-up of cases and denial of justice to consumers.\n\nAs on February 1, a total of 8,245 cases and 1,400-odd execution petitions are pending disposal before various fora. Fora in as many as 12 districts do not have president or members.\n\nAs per the Consumer Protection Act 1986, complaints should be disposed of in 90 days. Even in fora which have the president and members, cases take more than 90 days for settlement.\n\nActivists say that the vacancies have defeated the very purpose of enacting the Consumer Protection Act.\n\nThe consumer forum is headed by the president – a retired district judge who holds office for five years or till he turns 65 years old, whichever is earlier, and has a male social worker or an advocate and a female social worker as members.\n\nActivists said the post of president has not been filled in Coimbatore, Namakkal, Vellore, Nagapattinam and Madurai.\n\nPosts have remained vacant ranging for a period between eight months and four-and-a-half years.\n\nThe post of male member has been vacant in Cuddalore, Tirunelveli and Salem. In Salem, the member nominated has not joined yet.\n\nThe post of woman member is unfilled in Nagercoil, Thanjavur, Tiruchirapalli and Villupuram and the oldest vacancy dates back to 2012.\n\n“Our plea to keep a panel of persons for the post of presidents and members ready ahead of the actual date of the incumbent demitting office has gone unheeded.\n\nThe procedure or process for filling up the vacancy begins only after the person demits office and this has resulted in piling up of cases,” says K. Kathirmathiyon, secretary of Coimbatore Consumer Cause.\n\nA total of 8,245 cases and 1,400-odd execution petitions await disposal", 
    "section": "national", 
    "title": "Cases pile up in consumer fora as vacancies remain unfilled", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}