{
    "author": [
        "Deepa H"
    ], 
    "text": "Both production and consumption have gone up in Tamil Nadu\n\nWith more farmers in the State opting for coarse cereals and the resultant increase in production, Tamil Nadu has been chosen for the Centre’s Krishi Karman award this year.\n\nIn 2014-15, the State produced a record 40.75 lakh tonnes of coarse cereals that include ragi, maize and the minor millets.\n\nIn 2010-11, the production was only 15.58 lakh tonnes, said an official in the Agriculture Department.\n\n“Several factors, including an increase in area under production, introduction of high-yield varieties, integrated pest management and agronomic planting practices, have led to increase in production,” he noted.\n\nCoarse cereals are short-duration crops which do not require much water for irrigation. Though activists and farmers are happy about the increase in production, they say much more needs to be done to take them to a larger population.\n\nThe M.S.Swaminathan Research Foundation has been working with the tribal people in Kolli Hills in the area of climate smart nutri-cereals. “Millets are not only nutrition rich, but also climate resilient,” M.S.Swaminathan.\n\n“In the past, our food basket was very wide, consisting not only wheat or rice but also a wide variety of millets - what is normally described as coarse cereals. Later, public procurement and distribution tended to be confined to rice and wheat. Thenoon-meal programme in schools also did not include the nutri-millets, he said.\n\n“I got millets included in the National Food Security Act of 2013, so that there will be both the minimum support price and public procurement. This will help to widen the food basket and insulate farmers from a failure of crops under conditions of low rainfall and moisture stress,” Mr. Swaminathan said.\n\n“With more and more people becoming health conscious, consumption of millets is on the rise. Compared to five years ago, consumption of cereals is far better despite the fact that millets are costly,” says Ananthoo of the Safe Food Alliance that has been campaigning for organic foods.\n\nHowever, since the government is yet to implement any programme for propagation of millets, it is not reaching a larger section of the population. The neighbouring Karnataka government has introduced ragi and jowar through the public distribution system and Telengana and Orissa too have come out with plans, he points out.\n\nSupply through PDS\n\nMillet farmer and organics promoter Pamayan of Madurai suggested that the government consider supplying coarse cereals through the PDS in cities where awareness levels are higher.\n\n“If more farmers have to take up coarse cereals, the government must extend the incentive of Rs. 2500 per acre to all districts. It should also ensure procurement from farmers at reasonable prices. Harvesting equipment is also needed for millets. Interesting recipes need to be developed to create a taste for such cereals,” he said.\n\nThe PDS focus in the State is on supply of rice, and the government is neither procuring nor supplying coarse cereals through the system. Official sources said that cooperative stores are already selling such cereals procured from tribal areas.", 
    "section": "national", 
    "title": "Cereals making slow comeback", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}