{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Communist Party of India (Marxist) welcomed Colachel Port project as it would result in economic development of the industrially-backward Kanyakumari district, said party’s central committee member and Rajya Sabha MP T.K. Rangarajan here on Sunday.\n\nAddressing reporters on the sidelines of a conference on ‘Industrial development and labour protection,’ Mr. Rangarajan said that Union Minister of State for Road Transport, Highways and Shipping Pon. Radhakrishnan had spoken to him about the project. It should be implemented within the time-frame.\n\n“No industry”\n\nNot even a single industry had been established in the district for the last four decades and educated youths were forced to migrate to other districts in search of employment.\n\nThough the district had been gifted with abundant tourism opportunities, the State government failed take measures to improve tourism infrastructure.\n\nVast tracts of lands\n\nVast tracts of lands were allotted to set up a rubber park and former Chief Minister M. Karunanidhi had laid the foundation stone for the park. But nothing had happened after the AIADMK came to power.\n\nNanguneri Special Economic Zone was also facing a similar fate due to the rivalry between the two Dravidian parties, he noted.\n\nArrest recalled\n\nRecalling the arrest of an Employees’ Provident Fund Organisation official in Chennai recently for allegedly receiving bribe, Mr. Rangarajan said that corruption had become a mockery of democracy, and ridiculed that the owner of the institution who gave bribe to the official was still not arrested.\n\nThe People’s Welfare Front aimed to win in all the 234 Assembly constituencies in the election, he added.\n\nFormer MP A.V. Bellarmin, CPI (M) district secretary N. Murugesan, district committee member Vijaya Mohan and district executive committee member K. Chellapillai were also present.\n\n“Though the district has been gifted with abundant tourism opportunities, the State government has failed to improve tourism infrastructure”", 
    "section": "national", 
    "title": "“Colachel port will help develop Kanyakumari district”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}