{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Justice P. Devadass exhorts judicial officers and lawyers\n\nJustice P. Devadass of the Madras High Court addressing after inaugurating District Munsif-cum-Judicial Magistrate Court building and Judicial Officers’ Quarters at Thiruvadanai in Ramanathapuram district on Sunday.— Photo: L. Balachandar\n\nAdvocating that justice should be meted out objectively in a free and fair manner, Madras High Court Judge P. Devadass has exhorted judicial officers and lawyers to ensure there was no delay in delivering justice.\n\nAddressing after inaugurating the District Munsif-cum-Judicial Magistrate Court building and judicial officers’ quarters at Thiruvadanai near here on Sunday, he said judicial officers and lawyers should have no conflict of interest as they belonged to the same family and should ensure speedy justice system.\n\n“Deliverance of justice is a service to the people and judicial officers should deliver judgements without fear or favour and without considering the caste, creed and religion of the accused and litigants,” the judge said and explained the logic behind Lady of Justice being depicted wearing a blindfold.\n\nSuggesting that the police and government staff should extend their fullest cooperation to the judicial officers and lawyers for speedy justice, Mr. Justice Devadass cautioned that the judicial officers should not err or ‘murder’ justice while attempting to deliver speedy justice.\n\nJudges should treat the accused and litigants humanely and ensure that they had a feeling of stepping into ‘Temple of Justice” when they entered the corridors of courts seeking justice. Even when they were convicted in a criminal case or lost a civil case, they should have a sense of satisfaction of fully heard and given every opportunity to defend themselves, the judge said.\n\nMr. Justice Devadoss, who is also the portfolio judge of this district, recalled that he had served as a judicial officer in Thiruvadanai court before elevated to the High Court. This was one of the oldest courts, functioned even during the British period in a revenue department building and he was happy it got a new building, he said.\n\nSpeaking on the occasion, S.P. Velumani, Minister for Municipal Administration and Rural Development, Law, Courts and Prisons, said there were 989 courts in the State, including 113 in Chennai and 87.17 per cent of them had own buildings. The government has created new court buildings and judges’ quarters at a total outlay of Rs.679 crore, he said.\n\nMinister for Sports and Youth Welfare S. Sundararaj, Collector S. Natarajan, Superintendent of Police N. Manivannan, Principal District Judge M.P. Ram, Chief Judicial Magistrate J. Chandran, Thiruvadanai Bar Association President U. Sivaraman and secretary N. Alagarsamy were among others addressed.", 
    "section": "national", 
    "title": "“Ensure no delay in delivering justice”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}