{
    "author": [
        "S Senthalir"
    ], 
    "text": "Participants at the Pondicherry Heritage Festival 2016 with painters, sculptors, photographers and potters in Puducherry on Sunday. (Below) A woman teaches a traditional game to her children at the Children’s Interactive Exhibition and Interactive Mapping held as part of the festival at Gandhi Thidal in Puducherry.— Photos: S.S. Kumar\n\nPainters, sculptors, and potters share their experiences working in Puducherry at heritage festival\n\nIn the beautiful colonial heritage building in the White Town, the documentation of fading landscapes, streetscapes and arts in Puducherry became the centre stage of conversation on Sunday.\n\nPainters, sculptors, photographers and potters shared their interests and experiences living and working in Puducherry while expressing their concern over lack of galleries to showcase their works and local patronage to encourage and carry forward the disappearing visual art heritage in the Union Territory.\n\nDeborah Smith of Golden Bridge Pottery who came to lean about Aurobindo’s teachings stayed to pursue her passion for pottery in Puducherry. For Adil Writer from Mumbai, the decision to stay in Puducherry happened naturally as he moved here to learn pottery from Golden Bridge Pottery. “I did not think much while deciding to stay back here,” he said.\n\nA place that entices many talents from across the world has seen drastic changes over the years. Young film-maker Nishanth Varma and photographer Pattabi Raman have documented the events, festivities, art and landscapes of Puducherry.\n\n“The landscapes in Puducherry and its character change swiftly. Heritage is like time. My relevance to a place or aspect of life is relevant to the time,” he said.\n\nFashion designer Sonam Dubal, currently doing research in textile, heritage, and embroidery along the Silk Route and its cultural linkages with contemporary clothing, shared his love for Puducherry.\n\nAs dusk fell on Sunday, children were seen playing with tops and ‘Seven Stones.’ They painted, danced, played traditional games at Gandhi Tindal. Students from Baby Sarah’s Home served traditional food such as kesari urundai , ellu urundai and rava urundai to visitors at the Children’s Heritage Event.\n\nChildren from the Satya Special School showcased their crafts and described how they had made it. In order to draw the attention of visitors to conserving trees, a tree made of plastic bottles and waste was on display at the exhibition.\n\nCelebrating the closing ceremony of the Pondicherry Heritage Festival 2016 which began on February 5, musical performance by Adishakti Group and a celebration of natural heritage through dance was performed by young girls from Anegundi Village, Hampi and Lycee, Puducherry.\n\nAs the conversations on the heritage festival came to an end, some participants expressed concern over the relatively low public patronage and participation by government, and hoped that community engagement would be stronger in subsequent editions of the festival.\n\nThe three-day festival organised by INTACH, The People for Pondicherry’s Heritage PondyCAN, Department of Art, Cutlure and Tourism, and supported by Alliance Francaise and French Institute of Pondicherry (IFP) concluded on Sunday.", 
    "section": "national", 
    "title": "Fading landscape, arts in spotlight", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}