{
    "author": [
        "R Rajaram"
    ], 
    "text": "With arrangements for the ‘Mahamaham’ celebration apace, fire fighters have braced themselves for the mega event in Kumbakonam.\n\nHaving drafted a detailed plan encompassing a host of aspects including manpower strength, vehicles and other paraphernalia required for fire fighting and rescue operations, fire fighters drawn from different regions across the State would take positions days before the grand event (February 22).\n\nAnticipating a massive crowd, the Fire and Rescue Services Department has mobilised over 1,000 fire fighters for deployment at vantage spots in Kumbakonam. In addition to fire fighters from the central region, those from southern, western, north western and northern regions have been drawn to augment manpower strength. This includes 360 fire commandos who would be exclusively deployed at three spots - ‘Mahamaham’ tank, Potramarai tank and the Cauvery as a precautionary measure to carry out rescue missions in case the situation warranted.\n\nAs part of their plan, fire fighters have divided Kumbakonam town into 27 sectors deployment fire tenders along with personnel at each sector.\n\nA senior official told The Hindu that seven Quick Reaction Vehicles, a couple of emergency rescue tenders, 15 ambulances and 10 bikes used for fire fighting missions in narrow lanes would be deployed at different places in Kumbakonam. The fire fighters would be armed with necessary paraphernalia used for fire fighting and rescue missions including life jackets, life buoys and Aska lights. A huge collapsible tank with a 20,000 litre water capacity would be kept near the Mahamaham tank.\n\nThe official said the fire fighters would be deployed from February 11 to get familiarised with the topography of the town and would be present there till February 24. Over 300 fireman commandos would be deployed on the peak days from February 19 to 22 at the three chosen spots. The fireman commandos would be attired in T-shirt with the department’s name engraved behind it for easy identification. All officers would be provided with walkie-talkie sets for faster communication and the entire operation would be monitored from the control room which would be set up in the Kumbakonam fire station.\n\nMajority of manpower strength and vehicles has been drawn from the central region encompassing 10 districts. The entire plan has been drafted on the advice and instruction of the Additional Director General of Police / Director of Fire and Rescue Services, R.C. Kudawla, said the officer.", 
    "section": "national", 
    "title": "Fire fighters brace up for Mahamaham", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}