{
    "author": [
        "Poorvaja Sundar"
    ], 
    "text": "SASTRA University and VIT University steal top honours in cultural and sports events respectively\n\nThe curtains came down on Riviera 2016, the international sports and cultural festival of the VIT University with thousands of students converging at the outdoor stadium to catch a glimpse of Actor Siddharth, who was present for the valedictory function. Amidst loud cheers from the enthusiastic audience, Mr. Siddharth performed two songs from his upcoming movie ‘Jil Jung Juk’, composed by Vishal Chandrasekar. He was joined on stage by his co-actors from the movie, Avinash and Sanath.\n\nAddressing the students, the actor said that he was pleased to be there among them and their energy.\n\nThe students of SASTRA University bagged top honours of the event and walked away with the overall trophy as a part of the cultural events.\n\nOver 98 students from the college had participated in events across the four days and this is the sixth time that they are bagging the trophy for their overall performance.\n\nSRM University Chennai and PSG college of Arts and Sciences won the first and second runner-up trophies for the cultural events respectively. The overall trophy for the sports events went to VIT University Vellore.\n\nVIT University Chancellor G. Viswanathan, vice-presidents Sekar Viswanathan and G.V. Selvam were present at the closing ceremony.\n\nA footfall of over 30,000 students from over 200 institutions had attended and participated in the events, the student organisers from VIT said.\n\nOn the final day, the spotlight turned on social issues at the ‘Street Play’ competition in which various colleges participated, taking up themes ranging from reservation in the education system, corruption to politics in the country.\n\nStudents of SASTRA bagged top honours of the event and walked away with the overall trophy", 
    "section": "national", 
    "title": "Fitting finale to Riviera", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}