{
    "author": [], 
    "text": "Masks, coolers and raincoats are DISTRIBUTED to them\n\nThe traffic police are among the most affected by air pollution as they spend extended hours on the road. Considering their plight, a private company distributed imported masks with filters to more than 200 traffic police men in December. But, over the last two months not many policemen seem to be wearing them.\n\nSome policemen say they wear it when they are regulating traffic and not when they are engaged in booking violators – as it covers their nose and mouth as well. A few others use it when they are on duty in crowded areas in the city.\n\nSome policemen still wear disposable medical masks. Use and throw masks were earlier supplied by a few hospitals, before the imported masks were given to the police. Policemen who have a stock of disposable masks say they will use the new mask after they run out of stock of the disposable ones. Police officers say they will be sensitising their personnel to the importance of the masks given to them.\n\nLike every year, this summer too the Police Department will be distributing lime juice to the traffic policemen from the end of this month. Lime juice or buttermilk will be given to them twice a day in the forenoon and afternoon. This will continue for about three months till the summer season ends. They are also provided with special hats that will reduce the impact of the sun and coolers to reduce the stress caused by the climatic change. Traffic police personnel say that it will be even better if they are allowed to use alternative shoes that have better ventilation and take a break from using their regular uniform shoes that don’t support proper ventilation. Change in the type of shoes will come handy as they have to stand for a long time on the bitumen-topped roads that generate heat. The police are also given raincoats and boots during the rainy season.\n\nApart from these, providing them standard sweaters during the winter and tea for those at work in the cold will help boost the morale of the personnel slogging on the road for long.\n\nReporting by\n\nM.K. Ananth", 
    "section": "national", 
    "title": "For the health of policemen", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}