{
    "author": [
        "S Sundar"
    ], 
    "text": "The accident has snuffed out not just the life of 16 persons, but the lives of many others too\n\nPeople who were travelling in the bus either after meeting their relatives or on their way to meet them had lost their dear and near ones in the Saturday’s accident on Madurai-Shencottah highway near T. Kallupatti.\n\nIt was a small and happy family of Suruliraja (45), a lorry driver from Periyakulam, that was returning home from Sankarankoil after attending a wedding in the family on Wednesday. While many of their relatives went back home the same day, Suruliraja, his wife, Azhagumeena (37) and their two children, Ramya (14) and Sankar (13), chose to stay back.\n\nFor the marriage was that of Azhagumeena’s niece (sister’s daughter). “Many of the family members were returning to Madurai by the Shencottah Passenger train when I received a call from Ramya. She was tensed and was trying to explain to us about the accident of the bus in which they were travelling,” said her cousin (brother of the bride), R. Manikandan.\n\nDespite being invited to join them to travel in the train, they took a direct bus to Theni district from Sankarankoil. Ramya, recuperating from several cuts on her face after the shards of the bus and lorry windscreens pierced through her face, does not know the fate of her family members. All that she knows that her mother is in another special ward in the ground floor of the new annexure building of Government Rajaji Hospital (GRH).\n\n“Azhagumeena has suffered fracture on her leg and spinal chord. She has been demanding to meet her husband and son. But, both the mother and daughter do not know that they have lost the male members of the family,” her uncle B. Ramakrishnan said.\n\nSimilarly, Sangili Pandian, a military man posted in Assam, has lost his mother and his son in the accident. The family members took the ill-fated bus from Mamsapuram.\n\nM. Nallaguru (55) and her grandson Jayasantosh (6) were killed in the accident while another boy, Jaisankar (4), and his mother, S. Kalaiselvi (34), were being treated at the GRH.\n\nFor Mahalakshmi, who had lost her husband in a road accident few years back, her ill-fate took the life of her father, Narayanasamy (65), on Saturday, making her life more miserable.\n\nNarayanasamy, who makes savouries for an eatery near Sivagiri, along with the family members was going to attend a tonsure function in Theni. “My brother was the only consolation for his daughter and family. We don’t know how she (Mahalakshmi) is going to face the world now,” cried her aunt Leelavathi.\n\nAn official at the help desk in GRH was pained to say when an injured woman accompanied the body of her husband for the funeral.\n\nThe accident has snuffed out not just the life of 16 persons, but the lives of many others too. The GRH was teeming with scores of relatives and friends of the victims of the accident.", 
    "section": "national", 
    "title": "Grief-stricken relatives narrate tales of woes", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}