{
    "author": [
        "Dennis S"
    ], 
    "text": "The Madras High Court has directed Facebook, WhatsApp and Youtube to block certain “objectionable material, containing a scandalous attack”, on women in particular, which was circulated by two lawyers, who were earlier prohibited from practising in any court, pending disciplinary proceedings.\n\nHearing a PIL plea filed by six women lawyers, practising in the High Court, a Division Bench comprising Justices V. Ramasubramanian and K. Ravichandrabaabu also said that the Superintendent of Police of Cyber Cell shall render necessary assistance to the social networking sites in this regard.\n\nFollowing a spate of posts that appeared in the social media last week containing remarks against some women lawyers, petitioners Sudha Ramalingam, Anna Mathew, Sathya Rao, S. Devika Rao, M.N. Sumathi and R.S. Akila moved the High Court with a PIL plea.\n\nThe audio and written formats posted by respondent W. Peter Ramesh Kumar, in connection with a contempt proceedings, some of which were reposted by another respondent Manikandan Vathan in the social media were “wholly obscene, scandalous, vexatious and create a hostile work environment for women lawyers”, petitioners alleged in their plea.\n\nThe petitioners sought to restrain the two lawyers from posting comments in the social media, and a direction to Information Technology department, Facebook, WhatsApp and Youtube to remove uploads by them. Further they sought appropriate guidelines in relation to proceedings and pleadings in courts that contain sexually coloured remarks against women.\n\nThe appeal also includes a direction to Information Technology department, Facebook (also the owner of WhatsApp), Youtube and all other media or service providers to frame a protocol. The bench restrained both the respondent lawyers from publishing, distributing and circulating any message or material scandalising the institution and women lawyers. The case was further posted on February 26.\n\nComments posted by two men lawyers are obscene, petitioners allege", 
    "section": "national", 
    "title": "HC asks social media to block contents against women lawyers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}