{
    "author": [
        "Aditi R"
    ], 
    "text": "During the December deluge, when the city was submerged, many residents rose to the occasion to offer aid to those who were hit the hardest. There were many unlikely volunteers doing such selfless work. They included three young boys, homeless themselves, who went to The Hindu relief centre and insisted that they be allowed to be part of the relief efforts.\n\nThese boys have now been recognised for their service. NDTV recently presented them with the ‘Indian of the Year’ award, in New Delhi. It is strange, and sad too, that these children, who received a trophy recognising their efforts, don’t have a safe place to keep it. Eight-year-old Arjun, one of the three, narrates how it all started.\n\nHe lives on a pavement, opposite Chepauk stadium, with his family. During the flooding, Arjun and his family took shelter under a leaky railway bridge nearby. One day, right outside where he stayed, Arjun saw volunteers carry large amounts of supplies into The Hindu flood relief centre. Arjun, along with his cousins Arumugam and Ashok, volunteered to become a part of this relief effort. They wanted to help people.\n\n“As we are children, we were given the easy job of packing water packets. Later, when we asked for more responsibilities, they hesitated because of our age. We insisted that we be given more to do and they conceded,” said Arjun, smiling.\n\nDue to the floods, these boys’ families were in dire straits but that did not deter them from reaching out to the other flood-hit.\n\n“Actually we had nothing, but luckily, the boys were given food. We used to manage with whatever we had,” said Rajalakshmi, Arumugam’s mother. The trip to Delhi to receive the award was exhilarating for the boys. \"We got to travel in an aeroplane,” said ten-year-old Ashok, who initially confused it with a helicopter. “My teacher made me stand in front of everyone and told them that they should be like me,” grinned Arumugam.\n\n“All three of them want to study and become Collectors. We can see the potential in them, but we don’t know how to help them realise their dreams,” said Bhagavathy, Arjun’s mother.", 
    "section": "national", 
    "title": "Homeless boys recognised for service during floods", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}