{
    "author": [], 
    "text": "V.M. Muthukumar, Vice-Chancellor, Bharathidasan University, speaking at a workshop in Tiruchi; students of Bharathidasan Institute of Technology, Tiruchi, who won medals in the Anna University inter-zonal fencing competition; Founder’s Day celebrations at Shrimati Indira Gandhi College in Tiruchi; Graduation Day at Swami Dayananda College of Arts and Science, Manjakkudi, Tiruvarur district; ostrich at the TANUVAS College at Orathanad; students explaining a model at a science exhibition in MIET in Tiruchi.— Photo: M. Srinath\n\nV.M. Muthukumar, Vice-Chancellor, Bharathidasan University, speaking at a workshop in Tiruchi; students of Bharathidasan Institute of Technology, Tiruchi, who won medals in the Anna University inter-zonal fencing competition; Founder’s Day celebrations at Shrimati Indira Gandhi College in Tiruchi; Graduation Day at Swami Dayananda College of Arts and Science, Manjakkudi, Tiruvarur district; ostrich at the TANUVAS College at Orathanad; students explaining a model at a science exhibition in MIET in Tiruchi.— Photo: M. Srinath\n\nBoiler Plant Girls Higher Secondary School emerged overall winners of ‘SAARAL-2016,’ an inter-school competition, and St. Antony’s Higher Secondary School bagged the overall shield for exhibiting maximum number of models at ‘MIETY EXPO-2016,’ a district-level science exhibition. The events were organised by M.I.E.T. Arts and Science College. More than 400 students from around 35 schools participated in ‘SAARAL-2016,’ while more than 500 students from around 30 schools took part in ‘MIETY EXPO-2016.’\n\nGraduation Day\n\nTalented young brains are not in the cities of India, they are to be found in rural areas such as Manjakkudi, said Venkataraman Mahadevan, Global Head – CBS, Wipro BPS, delivering the Graduation Day address at Swami Dayananda College of Arts and Science, Manjakkudi, Tiruvarur district. “Patience and perseverance are two great pillars of success. Everyone should have a big dream and only failures in life could teach remarkable lessons,” he said. As many as 552 young graduates, including 10 university rank holders, received their degrees from Swami Suddhananda Saraswatiji, Chairperson and Managing Trustee, Swami Dayananda Ashram, Rishikesh. Balaram, Corporate Director, Ayyavu, Senate Member, Bharathidasan University, Sheela Balaji, Chairperson and Managing Trustee, Kavitha, Principal, and Bhaskar, Correspondent, spoke.\n\nWorkshop\n\nInternet and e-learning facilities are helping students in effective learning. In future, we may have classrooms without teachers and internet resources could replace them, said V.M. Muthukumar, Vice-Chancellor, Bharathidasan University, speaking at the inauguration of a national workshop on “Ecopreneurship: Scope and opportunities in Green Energy Technologies,” organised by the Department of Environmental Management, Bharathidasan University. He emphasised that tapping renewable energy resources alone could help conserve our natural resources as our future development is based on these resources. D. Sivalingam, Chairman, S.R.I. Educational Institutions, Alfred Vinod Antony, Director, Progen Energy Solutions, and R. Mohanraj, Head, Department of Environmental Management, spoke.\n\nFounder’s Day\n\nFounder’s Day, commemorating the birth anniversary of K. Santhanam, founder secretary of Shrimati Indira Gandhi College, was celebrated recently. Scholarships worth Rs.3.25 lakhs were distributed to 163 deserving students on behalf of the management, Sri Jagadguru Sadapthi Medical, Educational and Charitable Trust and City Union Bank Ltd, on the occasion. K. Meena, former Vice-Chancellor, Bharathidasan University, said self-confidence, courage and hard work were the main factors required for students, especially girls, to be sucessful. A. Kaliyamurthy, former Superintendent of Police, highlighted the importance of hard work and perseverance to come up in life. P. Sundaresan, Mirasdar, Karuppathur, Lalapet, distributed the scholarships. S. Kunjithapatham, secretary of the college, and S. Vidhyalakshmi, Principal, spoke.\n\nFencing contest\n\nStudents of Bharathidasan Institute of Technology, Tiruchi, won medals in the Anna University inter-zonal fencing competition held at Coimbatore. In the men’s section, they bagged gold medal in Epee team event. In the women’s category, they clinched bronze medals in Foil and Sabre team events. T. Senthil Kumar, Dean, and M. Gopinath, Deputy Director of Physical Education, felicitated the students.\n\nOstrich farm\n\nK. N. Selvakumar, Dean of TANUVAS Veterinary College and Research Institute, Orathanadu, Thanjavur district, inaugurated a new ostrich unit recently. So far, ostrich are available at Vanadalur Zoological Park, Kattupakkam, ostrich farm of the TANUVAS and at TANUVAS Veterinary College in Namakkal in the state. He said the new unit, the fourth of its kind in the State, is open to school and college students and the public. This unit will serve as a model farm for research on livestock management and teaching of veterinary students.\n\nInteractive session\n\nThe PG and Research Department of English, Holy Cross College, organised an interactive session with Brenda Beck, Adjunct Professor, University of Toronto. She spoke on the invaluable folk traditions of Tamil and Kongunadu culture. She recounted her experience of researching for her important work, ‘The Legend of Ponnivala,’ a Kongunadu epic narrating the Annamar Kadhai. She recalled the tradition of storytellers, whose contributions to the oral tradition were immense. She urged the students and faculty to take up research on Indian, especially Tamil folk traditions so that the beauty and the importance of the cultural heritage was not lost.\n\nSeminar\n\nOver 250 students participated in the State-level seminar, conducted by the Department of Mathematics of the Tamilavel Umamaheswaranar Karanthai Arts College, Thanjavur. Principal Dr. R. Rajamani inaugurated it in the presence of S. Sivakumar, Head, Department of Mathematics. A. Venkatesh of the AAVM Sri Pushpam College, Poondi, and K. Muthugur Pakiam of Rajah Serfoji Government Arts College, Thanjavur, spoke. Coordinator of the TUK Arts College, G. Shanmugham offered felicitations. The Department of Computer Science organised the annual inter-collegiate meet and its silver jubilee celebrations recently. College secretary S. Ramanathan presided. G. Ravi of the Jamal Mohammed College, Tiruchi, and S. Kumaravel of the AVVM Sri Pushpam College, Poondi, spoke. U. Durai, Head, Department of Computer Science, welcomed the gathering. Over 500 students took part in technical competitions. Government Arts College for Men, Kumbakonam, bagged the overall championships.\n\nSASTRA meet\n\n“Microbes are smarter than humans contrary to common belief,” said Prof. V. Nagaraja, Professor, Indian Institute of Science and President of Jawaharlal Nehru Centre for Advanced Scientific Research (JNCASR), Bengaluru, while inaugurating the conference on Microbial Biofilms (CoMB 2016) at the Sastra University at Thirumalaisamudram near Thanjavur recently.\n\nIn his keynote address, “Biofilm - as a lifestyle statement,” he described the role of transcription factors in the regulation of biofilm development, iron homeostasis and virulence in Candida albicans. He encouraged researchers to discover knowledge at the genomic level of biofilms. He said that microbiology was a rapidly growing field and not a neglected one in India.\n\nThe conference organised by the Centre for Research in Infectious Diseases (CRID) and the School of Chemical and Biotechnology (SCBT) featured some of the greatest minds from the scientific community focussing on various aspects of biofilm research. Over 100 from all over the country participated in the meet.\n\nThe focus was on biofilms, which are formed by microbes to survive unfavourable environments. The various sessions focussed on unravelling the complex biology of biofilms and discussed developing appropriate prevention and eradication measures.\n\nC. S. Srinandan, convenor of the conference, welcomed the gathering. G. Bhalachandran, Registrar, released the book of abstracts and V. Nagaraja received the first copy. N. Saisubramanian proposed a vote of thanks.\n\n300 get degrees\n\nThe fourth graduation day of Annai Vailankanni Arts and Science College, Thanjavur, was held recently. Vicar General of the Thanjavur Diocese and vice-president of the college governing body Rev. T. Gnanapragasam presided. H. Devaraj, Vice-Chairman, University Grants Commission, delivered the graduation day address and conferred the degrees on the graduates. He lauded the staff and management imparting values, developing skills and nurturing creativity in students. He urged the graduates to be grateful to their parents and teachers for their service and sacrifice. In all, 300 graduates and 30 post graduates received their degrees in person. Correspondent of the College Rev. John Joseph Sundaram, Administrator Rev Amirtharaj and Principal P. Devanesan spoke.\n\nMeet on biotechnology\n\nA two-day national seminar on “Bio-Technology and Healthcare – Opportunities and Challenges” was organised by the Department of Zoology and Bio-Technology, AVVM Sri Pushpam College, Poondi, Thanjavur.\n\nM. Jayanthi, Principal, Seethalakshmi Ramaswami College for Women, Tiruchi, said “vast development had been achieved through bio-technology and they included 25 per cent increase in life span among human beings, eradication of smallpox, partial liver and brain transfer, DNA profiling, gene therapy, stem cell manipulation and low cost production of insulin. Still there were a lot of challenges that were to be surmounted, she added.\n\nSecretary and correspondent K. Thulasiah, Vandaiyar observed that peace in mind through yoga through simple exercises help lead a pleasant life. We need to control our emotions and that would strengthen life and mind. Principal S. Udayakumar, who presided, explained the role of biotechnology in various spheres of study. Head, Department of Zoology R. Damodharan welcomed the gathering. Scholars from Punjab, Haryana, Puducherry, Karnataka, Uttar Pradesh and Tamil Nadu submitted 263 research articles.\n\nCompiled by\n\nL. Renganathan\n\nand G. Prasad", 
    "section": "national", 
    "title": "Inter-school contest", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}