{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Agents report calls from travellers asking if it is safe to travel; no cancellations made as yet\n\nChennaiites are planning their summer vacations, and the spread of the Zika virus, a mosquito-borne disease, to over 20 countries, may cause some concern, say travel agencies.\n\nWhile there have been no cancellations, a couple of Chennai-based agents reported calls from travellers asking if it was safe to travel to certain parts of the world.\n\n“While South America is not a big tourist destination for residents of Chennai, Europe and the United States are. One client of mine is planning to change her travel plans as she told me she was going to start a family,” said Charanya Ramesh, CEO, Shakthi Tours and Travels.\n\nWith two cases also having been reported in Australia, a popular destination for Chennaiites, Ms. Ramesh said she was not recommending it, and honeymoon-ers in particular, would not want to take any chances of travelling to affected countries.\n\nAt Akshaya India Tours and Travels, about 40 calls have been received from their regular clients, enquiring about the virus and if it was safe to travel, said Venkatraman Suresh, senior manager. “We are following all the guidelines and advising travellers based on them,” he said.\n\nOther travel agencies said they had not received any anxious calls, but were waiting and watching to see if the virus would impact travel over the next few weeks. “This is the time people make their travel plans for April, May and June, especially to Europe,” said an official at another agency.\n\n“While there is no concern as of now, if the virus does spread across Europe, we could see some concern and this could then have an impact on travel,” said Sharat Dhall, president, Yatra.com, a travel portal.\n\nA statement from Rajeev D. Kale, president, MICE, Domestic and Sports Tourism, Thomas Cook (India), said the company was closely monitoring developments as also guidelines/updates from government and health authorities. A strong demand for South America had led to a 12 to 15 per cent growth across the leisure and MICE segments and among sports enthusiasts, it said.\n\n“While we do anticipate an impact, our summer 2016 departures have not seen any cancellations so far. We continue to receive queries for the Olympics scheduled in August in Brazil,” it said.\n\nThis is the time people make travel plans for April, May and June, especially to Europe", 
    "section": "national", 
    "title": "Is Zika affecting travel plans?", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}