{
    "author": [
        "L Srikrishna"
    ], 
    "text": "Poor environment conditions, lack of sleep and untimely hours of eating in unhygienic circumstances are identified as some of the key factors which result in road accidents involving heavy vehicles.\n\nThe Saturday’s accident involving a Tamil Nadu State Transport Corporation bus and a cement-laden truck near T. Kallupatti in Madurai district, which claimed 16 lives, had come as an eye-opener to different stakeholders to examine the causes for the accident.\n\nMembers of various transport workers’ unions opined that the management should not be keen just on fuel efficiency and revenue collection, but also look into safety aspects of crew and upkeep of vehicles.\n\nK. Natarajan, national treasurer of LPF, a DMK-affiliated trade union, said that in the absence of any mechanism to check rest period for heavy vehicle drivers, there was an indirect thrust on them to be on the wheels for long hours.\n\nA study by a research scholar from V.V. Giri National Labour Institute, Noida, said that as there was no specified working hours for lorry/truck drivers, they did not have sound sleep. The governments might claim to have laid top class roads and rest shelters (bay areas) for heavy vehicles, but the absence of a mechanism to ensure proper rest for drivers led to accidents.\n\nWhen TNSTC management ran long-distance services, it should ensure that the crew had sufficient rest before the start of duty hours or double-driver system should be in place.\n\nS. Sampath, State treasurer of Tamil Nadu State Transport Employees’ Federation, said that the TNSTC could operate buses between Madurai and Nagercoil and vice versa. Presently, the buses were run from Kanyakumari to Tirupur, from Nagercoil to Coimbatore, Nagercoil to Chidambaram, Rameswaram to Coimbatore, Kumuli to Mannargudi, Madurai to Hosur and so on.\n\nA single driver and conductor operated the vehicles on the full stretch for 15-18 hours. In long-distance services, the TNSTC management should follow State Express Transport Corporation which had the double-driver system in place, he added.\n\nA TNSTC official in Madurai division said that the vehicles plying in mofussil routes were fit to run and maintained properly. After being run in long routes for six years, they were operated in city routes. The crew covering long distances were given at least one-hour break before the next trip began.", 
    "section": "national", 
    "title": "“Lack of sleep leads to high fatigue levels in drivers”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}