{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": ": While the Chennai Corporation has announced that it has reached the final leg of the project to install 1.1 lakh light-emitting diode (LED) streetlights across the city, primarily in the added areas of the Corporation, there are complaints from some residents and Opposition councillors that certain areas where work was proposed long ago, are still without LED streetlights.\n\n“At least 529 LED lights have been proposed in our ward. But work has not started yet. Residents have requested the Corporation to complete the work before elections,” said P.V.Tamil Selvan, councillor of a ward in Mogappair.\n\nMayor’s directive\n\nWith councillors of wards that are yet to get these lights asking the civic body to commence work before the notification of elections, Mayor Saidai Duraisamy has directed officials to speed up the work.\n\nAnother issue that has come into focus is the cost escalation of the project. A few activists have pointed out that the project cost has gone up by 33 per cent due to delay in its execution.\n\nIn 2012, when the Corporation proposed the installation of 1.1 lakh LED streetlights, the estimated cost was Rs.300 crore.\n\nNow, the cost has escalated to Rs.401 crore.\n\nThere have been other costs. Due to the delay in execution of the project, neighbourhoods without streetlights have had to face problems pertaining to safety, including increase in accidents.\n\n79,998 LED fittings\n\nTo prevent further delay, the civic body has asked councillors to monitor the work on each street an achieve the target this year.\n\nThe civic body has been able to complete work on 79,998 LED fittings in four years in Tiruvottiyur, Manali, Madhavaram, Ambattur, Valasaravakkam, Alandur, Perungudi and Sholinganallur.\n\nSome wards of Chennai Corporation have been left out,\n\nsay residents", 
    "section": "national", 
    "title": "LED project in final leg in Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}