{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "RELIGION\n\nSelva Vinayagar Temple : Discourse on ‘Sithargalin Anmeegam’ by M. Ilango, Railway Colony, 5 p.m.\n\nMeenakshi Sundareswarar Temple : Discourse on ‘Periyapuranam’ by M. Gnana Poongothai, Thirukalyana Mandapam, 5 p.m.\n\nPanniru Tirumurai Mandram : Discourse on ‘Sivagnana Botham’ by N.S. Sundararaman, South Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram : Discourse on ‘Kanthapuranam’ by A. Arumugam, Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nBharati Yuva Kendra : Discourse on ‘Nala Charithram’ by Tiruchi Kalyanaraman, Setupathi Higher Secondary School, North Veli Street, 6.30 p.m.\n\nSwami Tatwananda Ashram : Swami Samananda conducts Gita class, Ayiram Vysyar Primary School, South Avani Moola Street, 6.45 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre : Yoga and meditation classes, 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women)\n\nPrajapita Brahma Kumaris Ishwariya Vishwa Vidyalaya : Free rajayoga meditation classes, 36 Meenakshi Nagar, P and T Nagar, 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nYoga Research Centre : Yoga training by S. Yoganand, Department of Philosophy, Madura College, 6.30 a.m.\n\nGENERAL\n\nMadurai Kamaraj University : School of Religions, Philosophy and Humanist Thought, Lectures on ‘Fundamental Principles of Buddhism: Theravadam’ and ‘Fundamental Principles of Buddhism: Mahayanam’ by O.N. Krishnan, secretary, Tamil Nadu Buddhist Society, Seminar Hall, 10.30 a.m. and 2.30 p.m.\n\nThiagarajar College : Department of Computer Science, special lecture on ‘A Journey on JAVA Programming,’ Computer Science Lab, 11.30 a.m.\n\nSaraswathi Narayanan College : Internal Quality Assurance Cell, workshop for non-teaching staff on soft skills, 11.30 a.m.\n\nGovernment Arts and Science College : PG and Research Department of Physics, Commencement of two-week refresher course on ‘Quantum Mechanics,’ Melur, 10 a.m.\n\nWales Academy : Launching of Project Guidance Centre of Entrepreneurship Development Institute of India (EDII), MEPCO Mini Auditorium, Tamil Nadu Chamber of Commerce and Industry premises, 6 p.m.\n\nMakkal Sakthi Iyakkam : Election awareness consultation meeting, College House, 6.31 p.m.\n\nAlcoholics Anonymous : Meeting, Holy Redeemers Church, near Periyar bus stand, 7 a.m., Quality Care Hospital, Ellis Nagar, 7 p.m.; A.G. Church, Gomathipuram, 7 a.m.", 
    "section": "national", 
    "title": "Madurai Today for 08 Feb Monday", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}