{
    "author": [
        "Special Correspondent"
    ], 
    "text": "To be started in Madurai, Theni, Dindigul, Karur and Pudukottai also\n\nPeople afflicted with symptoms of mental illness are often deprived of their rights and privileges and remain isolated from the mainstream of the society. To solve the problems, the Rotary Foundation, Rotary International District 2730 and RI District 3000 in coordination with the M.S. Chellamuthu Trust and Research Foundation, Madurai, have taken up a project.\n\nCalled ‘Mission mental health project’, it aims at bringing dignity to persons with mental illness. Promotion of mental health, early detection of mental health-related problems, initiation of treatment, fighting against the stigma and ensuring social inclusion are the key objectives of the project.\n\nCommunity mental health consultation centres will be started in Madurai, Theni, Dindigul, Tiruchi, Karur and Pudukottai. They will strive to create awareness of the importance of mental health and focus on community-based rehabilitation. The first centre was inaugurated in Tiruchi on Sunday when the office-bearers of the Rotary Clubs and a team of doctors chalked out the initial plan for effective rehabilitation of the mentally-ill.\n\nR. Saravanan, district chairman of the project, said periodical camps would be held where the needy persons would be identified. “We will seek the coordination of the government hospital doctors for ascertaining the persons in need of assistance,” he said. Apart from known persons, efforts would be taken to treat all the needy persons through a series of camps. The person-specific needs would be ascertained and rehabilitation package such as educational opportunities in schools, placement and other facilities would be provided. A batch of 10 coordinators would visit and re-visit various areas across the district and would provide the information to the consultation centre. Those in need of any assistance can contact by dialling 98424-01532 or 74027-27114.\n\nNonaka Genyu, district governor, RI District 3000, the chief guest, went round the centre and ascertained the rehabilitation programmes planned to be taken up in Tiruchi district.\n\nC. Ramasubramanian, founder of the trust and Tamil Nadu State Nodal Officer, Mental Health Programme, explained the ordeals of the mentally-ill persons and assured of all support possible from the trust.\n\nR. Theenachandran, district governor, RI District 3000, said efforts would be taken for providing placement opportunities to the mentally-ill persons. A team of physicians, Kumar, Ramakrishnan and Zameer Pasha were present.", 
    "section": "national", 
    "title": "Mental health centre inaugurated in Tiruchi", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}