{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Open end spinning mills in the State, which mainly supply yarn to the power loom and handloom units, will stop production from Monday demanding early solution to the problems faced by the power loom units in Coimbatore and Tirupur districts.\n\nNearly two lakh job working power looms in Coimbatore and Tirupur District are on strike for the last 10 days seeking payment of wages agreed by the textile manufacturers in 2014. The job working units say the textile manufacturers have reduced the total wages by 15 to 20 per cent in the last four months.\n\nAccording to G. Arulmozhi, secretary of the open end spinning mills association, there are 350 open end spinning mills Tamil Nadu mainly in Coimbatore, Palladam, Mangalam, Somanur, Vellakoil and Udumalpet. These units buy waste cotton from the textile mills, make yarn and sell it to the powerloom and handloom units.\n\nAbout 25 lakh kg of cotton waste comes out of the spinning mills in the country every day. The open end spinning units in Tamil Nadu produce about 10 lakh kg of yarn a day worth Rs. 10 crore.\n\nWith the power loom units here on strike for the last 10 days the yarn stock with the open end units has piled up. “We have yarn stock worth nearly Rs. 100 crore. Now, we are unable to proceed. Hence, we want the Government to hold talks with the power loom units and find a solution at the earliest,” he said.\n\nThe open end spinning mills are already hit by issues such as export of high quality waste cotton and slowdown in the yarn market. The units have appealed to the Union Government to levy export duty of Rs. 10 a kg on the cotton waste exported. Further, with the strike of the power loom units now, the yarn prices have dropped by nearly Rs. 10 a kg (for both warp and weft yarn). “We will resume production when the power loom units start functioning,” he said.", 
    "section": "national", 
    "title": "Open end spinning mills to go on strike", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}