{
    "author": [
        "Staff Reporter"
    ], 
    "text": "A line has been proposed between K.R. Puram and Silk Board\n\nIf all goes as planned, people who live and work along the Outer Ring Road between K.R. Puram and Silk Board junction may get some relief from commuting by road.\n\nThe State government is considering the possibility of a metro link between the two points. If it’s given the green signal, it will be implemented parallel to the upcoming Phase II of Namma Metro, for which joint measurement of land is currently under way.\n\nApart from that, the State government is also looking at the feasibility of developing a metro line to the Kempegowda International Airport. This has also been a long-standing demand as many are opposed to a high-speed rail link to the airport.\n\nA few days before Invest Karnataka, a global investors’ meet, a proposal was made to the State government by a few industrialists and civic evangelists requesting City Development Minister K.J. George to consider a metro link between K.R. Puram and Silk Board. The Minister then announced that the government was looking at two lines, one between K.R. Puram and Silk Board, and the other to connect the airport to Nagavara.\n\nAlthough not included in the original Phase II alignment, there has been a growing demand to link the Outer Ring Road through a metro line because of the high volumes of traffic that passes through this stretch — home to several IT parks and companies — every day. The traffic jams at the Silk Board junction have attracted the ire of several commuters, with memes on the bumper-to-bumper traffic going viral.\n\nBRTS plan\n\nBangalore Metro Rail Corporation Ltd. (BMRCL) officials said there had been proposals to create individual lines based on demand from several stakeholders. However, a decision on it was yet to be finalised. “They will have to be implemented on independent lines developed side by side with Phase II. We will have to secure funding for them as well. There was also a proposal for a Bus Rapid Transport System (BRTS) from Silk Board to Hebbal and this will also have to be taken into account before finalising a metro line on the same route,” a senior BMRCL official told The Hindu .\n\nThe BRTS link was proposed for a distance of 33 km and a detailed project report on it had been submitted to the government. The cost of the project is expected to be around Rs. 1,000 crore. “The government has to take a decision on which project to commission,” a senior official from the Department of Urban Land Transport said.\n\nSrinivasa N, who commutes on the ORR stretch regularly, said, “We are stuck in traffic on the Silk Board stretch for almost 2 hours every day while commuting to office; a metro link to the Outer Ring Road will reduce a lot of stress and cut down on travel time for thousands of commuters.”\n\nGovt. also looking\n\nat the feasibility of developing a\n\nmetro line to Kempegowda International Airport", 
    "section": "national", 
    "title": "ORR may get metro link", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}