{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Traffic diversion creates chaos\n\nThe civil construction at Arumparthapuram Railway over bridge site was started for link road work.\n\nFor a smooth work flow vehicles are being diverted in both directions. This is creating chaos. Especially during peak hours students and office goers are worst affected. At Moolakulam, as traffic of Villupuram highway is forced in to this stretch, there is total confusion in the area. .\n\nThe authorities need to look into the possibilities of having a one-way traffic at the construction area with other part taking the Moolakulam Stretch. This could be done for two-wheeler and light vehicles and continuing the heavy vehicle traffic as per the current diversion.\n\nS.Ramamurthi,\n\nMariamman Koil Street, Ellapillaichavadi, Puducherry\n\nRepair roads leading to offices\n\nVillupuram is one of the district quarters in Tamil Nadu. The main government departments of Collector office, Deputy Inspector General of Police office, Superintendent of Police office, Chief Educational Officer’s office, Regional Transport Office, District Panchayat Union office etc., are placed in the nearby Villupuram new bus stand. On the other hand, these junction roads have been highly damaged by the recent rain and is unable to take the load of increased vehicular traffic. As the offices are often visited by thousands of people, drivers and pedestrian are forced to bear the burnt of chaotic traffic. I, therefore, request the authorities concerned to repair roads leading to these government offices at the earliest.\n\nM.R. Lakshiminarayanan\n\nVillupuram\n\nMeat, liquor shops defy ban\n\nThe law, lax as have been proved the other day with shops selling meat and liquor defying a ban. The complaints have gone without anyone responding to it. This has only made the order, a paper tiger. With law implementation not being strong as seen, no wonder the fleecing by auto drivers, open traffic violations and thugs claiming right to unloading ones domestic goods and many other violations take place fearlessly.\n\nT.V. Sreekumar\n\nLawspet, Puducherry\n\nReaders can send their mails to pondy.thehindu@\n\ngmail.com and The Hindu, No. 135 Mission Street, I Floor, Puducherry – 605001.", 
    "section": "national", 
    "title": "Page 3 or 4 07PYSSM02 READER’S MAIL", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}