{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Rs. 30 crore down the drain and still future bleak for the bridge which has become more of a hindrance\n\nThe issue over construction of a road overbridge (RoB) at Palanganatham, intended to connect Madakulam on one side and two arms at the other side connecting TVS Nagar and Jaihindpuram, appears to have created a consensus among the public, a rare act not often seen in many issues.\n\nAsk anyone in the locality about the bridge and they invariably opine how public money had been wasted on an ill-planned project, under construction since 2010, costing more than Rs. 30 crore till now, and its future looking uncertain.\n\nWhile the stretch connecting Madakulam to TVS Nagar has been completed, construction work on the arm connecting Jaihindpuram has been temporarily stopped due to legal issues. Though a few people use the completed stretch, it has not been declared open officially.\n\nGood for walkers\n\nInterestingly, the completed stretch has become a preferred destination for walkers in the mornings and evenings. “That is the only purpose the bridge serves. In the evenings, one can also see young couples chatting peacefully for long hours,” said S. Solaimalai (59), who is residing nearby. “The place was better off without the bridge. It is so badly planned that there will be no option for vehicles, particularly government buses, coming from TVS Nagar side to reach Tirupparankundram Road. There is no space to take a ‘U’ turn after getting off the bridge on the Madakulam side,” said a man running a workshop nearby.\n\nResidents say the easiest solution could have been to just make the subway wider, which is now usable only by light motor vehicles as it is very narrow. “As the subway has a blind curve, accidents have become a routine affair. It also gets flooded during rain and becomes unusable for days together,” said K. Manikandan (38), a taxi driver.\n\nMr. Solaimalai added that even the completed stretch of the bridge witnessed accidents. “A few months ago, a motorcycle rider fell off the bridge and died as the parapet wall was not completed then,” he said, adding that absence of streetlights has made it risky to take the bridge at night.\n\nLegal quagmire\n\nConstruction of the Jaihindpuram arm of the bridge, meanwhile, has got into legal quagmire as it involves partial or complete eviction of at least 55 houses. D. Lakshmanan (62), one of the residents who will lose a fraction of his 800 square feet property, said that while he had accepted the compensation, many had approached the court. The delay in the work has meant that even the paved road in the Jaihindpuram stretch that existed before has been damaged and rendered unusable.\n\n“This stretch used to witness heavy traffic before the construction began. My business has also taken a huge blow now due to the delay,” said S. Narayanan (56), who is running a teashop.\n\nHe added that with a Tasmac outlet at the end of the road, which is almost deserted, the place had become a haven for antisocial elements at night.\n\nM. Kannan, Dravida Munnetra Kazhagam councillor of Ward 91, however, denied the allegations that the bridge was ill-planned. “Had it been fully completed, people would have realised the benefits.” He said that efforts were made during the previous DMK regime. “Even the underground drainage and pipelines were shifted for the project. However, the present government has not shown interest as the project is the brainchild of the DMK,” he claimed.\n\nWhen contacted, a senior official from Tamil Nadu Highways Department, which is executing the project with assistance from National Bank for Agriculture and Rural Development (NABARD), acknowledged that the project may not get completed in the near future.\n\nContract expired\n\nWhile denying the opinion that the project did not benefit the public, he said that the idea was to remove the railway level-crossing, which was achieved. “The contract with the builder has expired owing to delay caused by the legal hurdle. A new tender has to be issued once the legal issues are sorted out, which is not expected to happen any time soon,” he said.\n\n“The bridge serves no purpose. My business, like that of many other shops in the stretch, has taken a blow as the road in the unfinished stretch is almost deserted”\n\nS. Narayanan\n\nTeashop owner\n\n“Inordinate delay by the present government has rendered the project useless. The government has not shown interest as it is DMK’s brainchild”\n\nM. Kannan,\n\nCouncillor (DMK)", 
    "section": "national", 
    "title": "Palanganatham bridge, the height of poor planning", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}