{
    "author": [
        "S Prasad"
    ], 
    "text": "Leaders say opponents jittery about the front’s prospects and spreading rumours\n\nMDMK general secretary Vaiko launches the website of the People's Welfare Front at a public meeting in Puducherry on Saturday. -Photo : T.Singaravelou\n\nMDMK general secretary Vaiko has lashed out at those spreading unfounded rumours against the People’s Welfare Front (PWF) and said that opponents were resorting to such tactics because they were jittery about the front.\n\nAddressing a meeting of the PWF attended by leaders of the front here on Saturday, he claimed that the very formation of the Front had sent shock waves among political opponents were spreading rumours that the Front would disintegrate as they were jittery about it.\n\nThose who are spreading rumours are only indulging in wishful thinking. The PWF would emerge victorious in the elections and form the next government in Tamil Nadu and Puducherry, he stated.\n\n“We have strong cadres and firm policies. If we are elected to power we would procure statehood for Puducherry and make the Union Territory free of liquor,” he said.\n\nStatehood issue\n\nTaking a dig at Chief Minister N. Rangasamy he said that although he had worked out an alliance with the BJP in the 2014 Lok Sabha elections nothing had happened in respect of statehood for Puducherry. The Puducherry Assembly had also passed several resolutions seeking statehood. But what is the achievement of Mr. Rangasamy on the issue, he asked\n\nMr. Vaiko accused the BJP-led National Democratic Alliance (NDA) of trying to crush the AAP government in Delhi. Full statehood is essential for both Delhi and Puducherry for their development, he said.\n\nVCK leader Thol Thirumavalavan said the alliance would bring total prohibition in Puducherry. Those who were opposed to PWF were on the job of spreading rumours about disunity in the front.\n\nThe PWF was not just an alternative front but one with an alternative political ideology for the people of Puducherry and Tamil Nadu. If the Front was elected to power, leaders of the four parties would decide on the Chief Minister.\n\nMr. Thirumavalavan said that States like Maharashtra, Bihar and Uttar Pradesh had Dalit as Chief Minister. However, the DMK and AIADMK which had ruled the state did not even had a debate on the issue.\n\nCriticising the ruling AINRC and the Congress, he said they were wholly responsible for the deterioration of Puducherry. The PWF was a viable alternative and if elected to power would bring total prohibition and generate employment opportunities he said.\n\nCPI national secretary D Raja said the front was a historical necessity. He said Mr. Rangasamy had not been able to take any steps to reopen the closed textile mills and to procure grants from the Centre.\n\nThe government had also not taken any steps to address issues of unemployment and atrocities against the downtrodden.\n\nStatehood for Puducherry is an immediate need and the CPI was in full support of the plea, he said.", 
    "section": "national", 
    "title": "People’s Welfare Front promises statehood, prohibition", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}