{
    "author": [
        "R Srikanth"
    ], 
    "text": "Work on sub-station is yet to take off despite availability of land measuring over 6,000 sq. feet\n\nThe land was purchased from the revenue department at a cost of Rs. 1.10 crore—Photo: M. Vedhan\n\nSeveral hundred families in Avadi and Pattabhiram and villages around them have been suffering due to erratic power supply, unscheduled disruption and voltage fluctuations as the execution of a 33/11 kilo volt (KV) power supply sub-station has been delayed by nearly four years.\n\nAt a time when the Tamil Nadu Generation and Distribution Corporation (Tangedco) is constructing several 33/11 KV substations, the delay in completing a similar facility at Avadi has disappointed people living in Mittanamallee, Palavedu, Alattur, Pattabhiram, Thandurai and Pakkam.\n\nThere has been a phenomenal growth in the population of these villages, resulting in an increased demand for power too.\n\nR. Raghunathan of Muthapudupet near Heavy Vehicles Factory in Avadi, said they fear the onset of summer as problems worsen. “Erratic power supply and low voltage damage electrical appliances,” he said.\n\nConsumer activist T. Sadagopan said that in response to a Right to Information Act petition by him seeking details about the position of the sub-station, he was informed that the project is to be executed under R-APDRP - Restructured Accelerated Power Development and Reforms Programme.\n\nHowever the project is yet to take off, despite the availability of land measuring more than 6,000 square feet of ‘kalam poromboke’ (unassessed waste land) purchased from the Revenue department at a cost of Rs. 1.10 crore, he said, sharing the details of the response to the application.\n\nTangedco officials said tenders for constructing the sub-station has been finalised but the work is yet to begin. Though electricity is sourced from Alamatty and Pattabhiram substations, the supply is not adequate to meet the demand in these villages as they are located in “tail-end” areas. If the substation is commissioned, it will not only benefit residents of Mittanamallee but also areas including Palavedu and Alattur.\n\nMr. Sadagopan also complained that though a section office was opened more than six months ago, collection counters were not yet started and many residents had to travel to Pattabiram or Avadi to pay their bills.\n\nRegarding the delay in the opening of collection centre at Mittnanamallee section, officials said they would be looking into the problem.\n\nElectricity sourced from other areas is not adequate to meet the demand in these villages", 
    "section": "national", 
    "title": "Power woes: Avadi residents sweat it out", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}