{
    "author": [
        "Udhav Naig"
    ], 
    "text": "SPI Cinemas started pre-booking tickets with Amitabh-Dhanush starrer, ‘Shamitabh’\n\nPre-booking may not be a new concept, but more and more exhibitors and theatre owners are embracing it in Tamil Nadu.\n\nIt assists theatre owners and producers gauge the demand generated by a movie and therefore can help the producers plan their release strategy.\n\nChennai-based SPI Cinemas started pre-booking tickets with Amitabh Bachchan-Dhanush starrer, ‘Shamitabh’. Bookings were open two weeks before the film’s release. For the movie, ‘Aranmanai’, the booking window opened a week before the film hit the screens.\n\nThe Revenant\n\nCurrently, pre-booking is open for Leonardo Dicaprio-starrer, ‘The Revenant’, and filmmaker Vetrimaran’s ‘Visaranai’.\n\n“The concept helps the movie-maker understand the buzz for the film in the market. You need not wait till the eleventh hour,” said a programmer from a well-known multiplex in the city.\n\nUncertain areas\n\nBut it is not without uncertainties.\n\n“If the film is postponed or fails to clear the censors and does not hit the screens on time, the theatre owner has to return the cash. That way, it is tricky,” he said.\n\nRaju Mahalingam, creative head, Lyca Productions, said that pre-booking may not directly help producers since theatres do not pass on the money to the producer, but it could still matter in a larger scheme of things.\n\nNegotiating rights\n\n“A great demand could be used as leverage while negotiating television rights, DVD rights, overseas rights and with distributors. Going forward, better terms could be negotiated with theatre owners so that a part of this money could also be used to subsidise print and publicity costs,” he said.\n\nBut will it work in an industry where producers do not have a coherent and a well-coordinated release strategy and does it have a flip side?\n\n“The release dates need to be sorted out first to actually plan pre-booking. Also, this might work for movies which have a tremendous demand – like the ones by Rajini, Ajith or Vijay. Smaller movies might not get much out of the pre-booking concept,” said Sashikanth, a producer.", 
    "section": "national", 
    "title": "Pre-booking comes to stay in theatres", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}