{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Chennai District Election Office has initiated the process that would ensure video recording of events relating to the Assembly elections this year.\n\nTenders floated\n\nThe Electrical Department of Greater Chennai Corporation on Friday floated tender for video recording of significant events that happen between notification of elections and declaration of results.\n\nThe work on video recording in 16 Assembly constituencies in the district is estimated at Rs.50 lakh.\n\nThe recording is expected to cover an activity that may aggravate existing differences or create mutual hatred or cause tension between different groups, religious or linguistic.\n\nThe videographers assigned for the purpose would also be sensitised well to issues relating to criticism of other political parties by candidates.\n\nAs per the model code of conduct, criticism, when made, shall be confined to the policies and programmes, past record and work of parties and candidates.\n\nRecord of activities\n\nThe video is also expected to be a record of parties and their activities.\n\nThere will thus be a record of candidates who carry out activities that are “corrupt practices” and offences defined by the election law, such as bribing, intimidation and impersonation of voters; canvassing within 100 meters of polling stations; holding public meetings during the period of 48 hours ending with the hour fixed for the close of the poll and the transport and conveyance of voters to and from polling station.\n\nAs a few video recordings in Chennai district were damaged in violence during the State Assembly elections in 2011, the workers would be sensitised in order to prevent damage to such video records this year.\n\nAssigned videographers will be sensitised to various issues", 
    "section": "national", 
    "title": "Preparation for polls: video recording initiated", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}