{
    "author": [
        "M K"
    ], 
    "text": "In the next few weeks more convicts in Coimbatore Central Prison will become active members of society and interact with the public on a day-to-day basis. Providing them this opportunity will be the ‘Prison Bazaar’ that will function at the prison ground on Dr. Nanjappa Road.\n\nThe project is aimed at removing the stigma on convicts. There are more than 1,750 inmates in the l Prison and around 1,000 of them are convicts. More than 400 are employed in eight industrial units in the prison as skilled, semi-skilled and unskilled labourers.\n\nOf these, nearly 10 were at work in the hotel run by the prison and are the only persons who get a chance to meet the public every day. On completion of the bazaar, nearly a dozen shops in the complex will employ more than 100 convicts with good conduct initially.\n\nThe bazaar will have an air-conditioned vegetarian and non-vegetarian restaurant, an open air restaurant with eight huts that could also be booked for organising parties for a gathering of 50 persons, a sweet and savouries shop and another selling idly and dosa batter.\n\nThe textiles shop in the bazaar will sell readymade shirts woven at the l Prison, saris manufactured at the Special Prison for Women (SPW) in Vellore and Chennai, night dresses from the Trichy SPW and bed sheets, lungis and dhotis made at other prisons in the state.\n\nPrison authorities say this will facilitate job opportunities by expanding the industries in other prisons. Some prison inmates here are already at work making the first set of shirts ready for the bazaar. Another section of the convicts are busy making wooden and metal furniture.\n\nApart from cots, almirahs, dining table sets and dressing tables on display at the furniture outlet, customers can also order furniture. The bazaar will have a beauty parlour for men and tailoring and ironing shops.\n\nA portion of the prison ground will be converted into a vehicle parking stand, on a pay and use basis.\n\nPrison authorities said only long-term convicts with good conduct who has gone on parole five or more times have been handpicked and trained to work in the bazaar. While convicts working in the industries inside the prison get Rs. 60 to Rs. 100 a day as wage, based on their experience, those working in the bazaar will get a better pay as business picks up.", 
    "section": "national", 
    "title": "Prison Bazaar to be ‘learn and earn’ hub for convicts", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}