{
    "author": [
        "R Sivaraman"
    ], 
    "text": "AINRC cadre, leaders celebrate sixth anniversary of the party\n\nHigh spirits:Chief Minister N. Rangasamy distributes sweets to partymen during the anniversary celebrations in Puducherry on Sunday.- Photo: S.S. Kumar\n\nOn the day of All India NR Congress (AINRC) entering sixth year, party president and Chief Minister N. Rangasamy on Sunday exuded optimism of coming back to power in the Assembly elections this year because the people had faith in the government which had has served all sections of people in the Union Territory.\n\nCadres and leaders celebrated the sixth anniversary since the launch of the AINRC in 2011. Sweets and fruits were distributed at the party headquarters here.\n\nRousing reception\n\nCadres extended a rousing reception to Mr. Rangasamy on his arrival at the party office. He performed poojas to portraits of leaders such as Mahatma Gandhi, former Tamil Nadu Chief Minister K.Kamaraj and his spiritual guru Appa Paithiyam Swami. The party flag was unfurled by him.\n\nMinisters, MLAs and other functionaries greeted him with shawls and bouquet after waiting for a couple of hours.\n\nBreaking away from the Congress, Mr. Rangasamy had launched the AINRC in 2011. Within three months of the launch, the party bagged 15 of the 30 seats and independent MLA V.M.C. Sivakumar supported the AINRC. On May 15, Mr. Rangasamy was elected to become Chief Minister by the MLAs and he assumed office the very next day.\n\nIn the last Lok Sabha elections, the party candidate R. Radhakrishnan emerged victorious defeating Congress senior leader V. Narayanasamy. Later, the AINRC nominated V. Bhalan and N.S. Jayabalan as MLAs.\n\nOptimistic views\n\nExpressing optimism on his party coming back to power, Mr. Rangasamy said, “People have confidence on us.”\n\nLater addressing media persons and party men in a packed hall, Mr. Rangasamy said: “This movement, after its launch, contested in elections and captured power. Completing a five year-tenure , the party is going for Assembly polls for the second time”, said Mr. Rangasamy.\n\nMr. Ranagasamy said, “I am glad to say that in the last five years, my government has been fulfilling its promises to people in the run-up to Assembly polls and responding to demands of the MLAs on the floor of house. Our government will continue to serve the people and we are satisfied with whatever we have done to them. People are also satisfied with our performance.”\n\nOn the chances of his party to come back to power in the 2016 Assembly polls, the Chief Minister Mr. Rangasamy said,\n\n“We have paid a lot of attention towards the growth of the Union Territory. This has instilled faith in amongst the people are we are therefore hopeful of coming back to power.”\n\nMeasures implemented by government\n\nElaborating about the various measures implemented by the AINRC government, he pointed out that his government had created free medical facilities and has been consistently extending efforts to improve standard of education in schools and colleges.\n\nHe said the government has been extending due assistance to all those who were affected by the unprecedented rain.\n\nHe promised that relief would be given directly to those who have been left out.\n\nMr. Rangasamy said with aim of attaining equal development, his government had allocated proportional funds to all regions and attained growth due to consistent efforts in this regard.\n\nDismissing allegations of opposition political parties over alleged back-door recruitments, the Chief Minister said only qualified persons were recruited into government posts such as teachers, police, upper division clerks and other posts. “Many youngsters were given jobs by the government”.\n\nThe CM said over 14,750 new applicants would be given old-age pension in addition to previous list from 13, 14 and 15 of this month.", 
    "section": "national", 
    "title": "Rangasamy hopeful of retaining power", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}