{
    "author": [], 
    "text": "AIADMK and DMK leaders share dais but endup in a verbal duel\n\nThe launch of various projects by the Union Minister of Railways Suresh Prabhu in Chennai on Sunday saw a rare coming together of the ruling AIADMK and DMK party leaders on stage.\n\nSince the event was organised at the Railway Colony ground, a good 2-km distance from the Tambaram railway station, not many members of the public were at the venue and several rows of chairs remained empty. DMK Member of Parliament Tiruchi Siva took strong exception to the way the programme was organised. Though he had allocated Rs. 1 crore from his constituency development fund for an escalator at Tiurchi railway station, there was no mention of his name in the advertisements or announcements, he complained.\n\n“It was on my insistence that Mr. Prabhu agreed to visit Tamil Nadu and launch the projects in Tiruchi. However, the venue was shifted to Chennai and the Minister inaugurated the escalator in Tiruchi through video-conferencing. I am pained by a letter from the Southern Railway General Manager asking me to be present before the screen in Tiruchi,” Mr Siva said.\n\nIn his address, State Minister for Animal Husbandry TKM Chinnayya made some veiled references to Mr. Siva’s speech and the two were seen exchanging some heated words later.\n\nWhen road accident victims from T. Kallupatti were admitted in the Government Rajaji Hospital in Madurai, they had to undergo more pain because of the stream of visitors. Self-appointed VVIPs from the ruling party who came in groups stepped into the wards behind the news photographers and videographers. A Minister and his associates waited for a private television channel videographer to arrive at the hospital. Till such time, they were busy on mobile phones talking loudly in the corridors of the hospital disturbing other inpatients on Saturday night.\n\nOn Sunday morning, the DMK leaders visited the hospital. Only the hospital administration did not extend the same hospitality it bestowed on the ruling partymen.\n\nWith the notification of the Assembly election expected in the coming weeks, academic circles are rife with speculation about the appointments of Vice-Chancellors to various universities. The VC post is vacant in the University of Madras, Teacher Education University, Madurai Kamaraj University, Manonmaniam Sundaranar University, Tamil Nadu Open University, Bharathiar University and Tiruvalluvar University.\n\nIt is learnt that the search panels of three universities – MSU, Teacher Education and Tiruvalluvar – had apparently given the list of three probable candidates to the Governor-Chancellor on Friday.\n\nIt is also learnt that the VCs for the rest of the universities will be appointed latest by Feb 25, ahead of the poll notification. The appointments to the VC post in MKU and the University of Madras have generated much interest as teacher associations in both the universities have been continually complaining of irregularities and corruption.\n\nThe recent public meeting attended by Prime Minister Narendra Modi in Coimbatore recently served as yet another proof of how the charisma of former Chief Minister M.G. Ramachandran has endured even decades after his death.\n\nAfter Mr. Modi took the stage, Tamil Nadu BJP president Tamilisai Soundararajan began her speech in which she began taking the names of stalwarts of Tamil Nadu politics and said Mr. Modi embodied all the good qualities of such leaders.\n\nWhen she mentioned the name of AIADMK founder MGR, even mentioning the popular title of ‘Puratchi Thalaivar’, the crowd erupted in a loud cheer. Even some in the VIP box in the front were on their feet.\n\n(Reporting by S. Vijay Kumar, L. Srikrishna, R. Sujatha and Sruthisagar Yamunan)", 
    "section": "national", 
    "title": "Rare coming together, routine heated exchange", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}