{
    "author": [], 
    "text": "Consult residents on de-silting issue\n\nThis refers to the report titled ‘Corporation launches inquiry into de-silting works’ (February 5). If the intent of the vigilance officials is to find out whether the de-silting of stormwater drains had been carried out prior to the onset of the monsoon, they need to consult the residents of the respective areas and get details, rather than embarking on a ‘wild goose chase’. Most stormwater drains have not been de-silted and even if attempts have been made, work is still incomplete. There is no point of de-silting the areas around the manholes and not cleaning up the lines connecting them. In some areas, the drains are blocked and are not connected to the main system as a result of which water stagnates in the area. If there was proper de-silting of stormwater drains, the deluge that followed the torrential rains could have been mitigated to some extent. Most drains that have been built have become garbage dumping holes for commercial establishments and mobile eateries.\n\nV.S. Jayaraman\n\nMotilal Street, T. Nagar\n\nA bus service for Puthur\n\nOver the last few years, hundreds of apartments and villas have mushroomed in and around Puthur village in East Tambaram. But, bus connectivity for residents of this village is very limited. Only, a small bus operates at odd hours from Tambaram to Vengambakkam via this village. I appeal to the transport authorities to introduce a few buses to Puthur on a trial basis and see the response this evokes from the residents.\n\nS. Srinivasan Mani\n\nKargil Street, Puthur\n\nPoor condition\n\nof footpaths\n\nThe footpaths on 100-feet road in Koyambedu opposite CMBT bus terminal are in a bad state, because of which, pedestrians are compelled to walk on the main road risking their safety. These footpaths are also being used as urinals by many miscreants. I wish that the authorities concerned take note of this and take measures to rectify the situation immediately.\n\nS. Sundresan\n\nKoyambedu\n\nCleaning the staircase at MRTS station\n\nAt Tirumayilai MRTS railway station, walls on either side of the platform were painted recently. However, the staircase leading to the station is dirty and requires an immediate whitewash. Behind Tirumayilai and Triplicane MRTS stations, there are open canals which have become dumping grounds for garbage and this blocks the water flow. The canals need to be cleaned up and these compound walls need to be raised in order to prevent people from throwing garbage into it.\n\nB. Rabindranathan\n\nMadhavaram\n\n(Readers can send grievances and share pictures toreporting.thehindu@gmail.com)", 
    "section": "national", 
    "title": "Readers’ MAIL", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}