{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Manithaneya Makkal Katchi (MMK) has demanded the release of all life convicts who have served more than 10 years in prison in a protest staged here on Sunday, which witnessed participation from hundreds of cadres from the MMK and the Tamil Nadu Muslim Munnetra Kazhagam (TMMK) from Madurai and surrounding districts.\n\nIn the protest organised simultaneously in Coimbatore and Chennai also, the MMK and human rights activists urged the State government to exercise the power conferred on Governor under Article 161 of the Constitution to secure premature release of such convicts languishing in prisons.\n\nThey highlighted the cases of Abu Tahir, convicted in the Coimbatore serial bomb blast case and presently recuperating in a hospital for kidney failure, and A.G. Perarivalan, who is in prison for more than 24 years in the Rajiv Gandhi assassination case. S. Hyder Ali, senior leader of the MMK who led the protest, and P. Abdul Samad, general secretary, came down heavily on the State government for refusing to release several Muslim prisoners, who, according to them, were jailed in foisted cases.\n\nAddressing the gathering, Henri Tiphagne, Executive Director of People’s Watch, said that this was the first time a mass protest was organised for the rights of prisoners in Tamil Nadu. Criticising the State machinery for letting the highly corrupt but powerful people go scot-free while oppressing the marginalised communities, Mr. Tiphagne alleged that prisoners from such communities were the worst affected.\n\n“There is not a single prison in Tamil Nadu where non-official members of Board of Visitors have been appointed, who should regularly visit the prisoners to hear their grievances as per Prison Manual,” he said.\n\nAdvocate P. Pugalenthi, who has taken up the cases of many life-convicts, said that even persons convicted of crimes such as raping children and sensational political murders had been released but the government was reluctant to release Muslims and prisoners such as Perarivalan.\n\nDravidar Viduthalai Kazhagam founder ‘Kolathur’ Mani urged the government to respond to the democratic protest and release the prisoners who had served more than 10 years in jail.", 
    "section": "national", 
    "title": "Release convicts in jail for more than 10 years: MMK", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}