{
    "author": [
        "K C"
    ], 
    "text": "Before the city’s showpiece was renovated, the rent was Rs. 5,000 per day\n\nRenting the centrally located Sir Puttanna Chetty Town Hall for a programme is now officially an expensive affair. With its swish new interiors and additional features, the renovated auditorium, housed in a heritage building, will cost a whopping Rs. 1.22 lakh per day, excluding service tax.\n\nThe BBMP has issued a notification to this effect recently. Before renovation, the rent was Rs. 5,000.\n\nThe BBMP is set to start taking regular bookings after a fortnight once the full-fledged power supply is in place.\n\nCivic officials are defending the new rate saying that the new hall has much more to offer.\n\nRenovation cost\n\n“It has been fitted with air-conditioning. There is a sound system in place. The interiors have been improved and LED lights fitted. The renovation has cost us nearly Rs. 5 crore,” an official said.\n\nApart from the money invested on renovation, they also cited maintenance cost and regular monthly expenditure to justify the hike.\n\n“We are expecting annual collection of Rs. 2 crore, which will help us break even. We got bookings from IT companies in the last six months, some for seven days at a stretch. We offer concessions for government functions and to charitable trusts,” the official said.\n\nIn fact, the Palike has managed to collect Rs. 30 lakh in the six months that the renovated hall accepted bookings after it was formally inaugurated in April 2015, officials said.\n\nHowever, the palike’s defence is not cutting ice with everyone.\n\nTheatre groups, such as Samudaya, have decried the ‘commercial rates’.\n\nJayanth V.M., actor-director of the two-year-old Hi5 Stage and Screen Productions, said Town Hall is an ‘amazing venue in terms of capacity’.\n\n“The hike in fees is going to impact budding theatre companies in terms of affordability. As a theatre team grows, we can pull in sponsors. But in the initial stage, it is a big hole in the pocket. With a fan base still in a growing phase, income is not guaranteed,” he said.\n\nHe further added that even for the more established groups, getting sponsorship to the tune of Rs. 1 lakh would not be easy.", 
    "section": "national", 
    "title": "Rent of Town Hall raised to Rs. 1 lakh", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}