{
    "author": [
        "C Jaisankar"
    ], 
    "text": "They claim that absence of service roads on both sides of the NH 67 has caused several accidents\n\nnger, frustration and disappointment were palpable among the face of protestors, who once again took to the streets on Sunday to press their long pending demand of service roads on both sides of the NH 67 from Palpannai to Thuvakudi.\n\nBilled as “Perunthiral Arpattam,” the protest drew huge support with the participation of men and women from different residential colonies at Kattur, Thiruverumbur, Thuvakudi and Ariamangalam. The protestors, mostly young men and women, who were severely affected by the absence of service roads along the four-way NH, built by the National Highways Authority of India (NHAI) about a few years, registered their protest by taking part enthusiastically in the agitation. Placards and banners, raised by the protestors, had slogans against the State government for failing to start the land acquisition process even after the gazette notification issued by the Central Government in May 2014.\n\nA flex board put up by the agitators had details of those killed in road accidents on NH 67 due to the absence of service road. A pamphlet distributed to the protestors and passersby claimed that 1840 road accident cases were registered between 2006 and 2015 from Thuvakudi to Oil Mill stop. The accidents had claimed the lives of several people. The agitators said that the State Government, which was supposed to complete the land acquisition so as to enable the NHAI to lay service road for 14.5 km, had not taken any step so far in spite of numerous protests since 2011. They had met the Collector on several occasions. A Revenue Divisional Officer, who met the protestors while observing fast on August 9, 2015, promised that all hurdles on land acquisitions would be cleared and Centre’s notification would be released as advertisements on newspapers before October 15, 2015. However, the officials had failed to keep up their words.\n\nMoreover, about 3,500 petitions were sent separately to the Chief Minister on October 17, 2015 demanding immediate action to lay service road. But there was no reply to anyone. Hence, they were forced to register the protest once again. The protestors warned that it would turn as an important election issue if the State government failed to act immediately.\n\nThe government had not\n\ntaken any step so far in\n\nspite of numerous\n\nprotests since 2011.", 
    "section": "national", 
    "title": "Residents agitated over delay in laying service roads", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}