{
    "author": [
        "T Ramakrishnan"
    ], 
    "text": "India ready to facilitate transportation of Sri Lankan Tamils\n\nIndia’s External Affairs Minister Sushma Swaraj has asked the Organisation for Eelam Refugees Rehabilitation (OfERR), a not for profit organisation having offices in Chennai and Colombo, to ascertain how many Sri Lankan Tamil refugees in India, especially in Tamil Nadu, are willing to return to Sri Lanka voluntarily.\n\n“If they [OfERR] give us a list of such persons, we can consider how we can help [in ensuring the transportation of people],” Vikas Swarup, spokesperson of the External Affairs Ministry, told The Hindu .\n\nThe issue was discussed during a meeting that the Minister had with S.C. Chandrahasan, treasurer, OfERR (Ceylon) along with S. Sooriyakumary, president, here on Saturday afternoon.\n\nWhen asked about Mr Chandrahasan’s observations that the Indian government was willing to provide ships for repatriation of the refugees, Mr. Swarup replied that for such help to be rendered, there must first be a shipload of people willing to return.\n\n“We have made it clear to them that the return has to be voluntary. There should be no compulsion,” he added.\n\nApproximately, one lakh Sri Lankan Tamil refugees are living in Tamil Nadu.\n\nAccording to Mr Chandrahasan, the return of a large number of refugees will take place only if ships or ferry services are operated.\n\nTwo disadvantages\n\nIn the present arrangement of air travel, there are basically two disadvantages. One, the stipulation on the quantity of baggage.\n\nEven though the baggage allowance has been increased to 60 kg per person in respect of returning refugees, this will not be adequate as many persons have been living in Tamil Nadu for a number of years and their belongings cannot be reduced to that quantity.\n\nTwo, if the ships or ferry services are resumed, the refugees will find it easier to return to their places of origin which are predominantly in the Northern Province.\n\nFor example, if the refugees are able to reach Kankesanthurai through ships or ferry services, they can very quickly get back to their places. Otherwise, Talaimannar and Trincomalee are the two places where they can disembark, he points out.\n\nAt present, by air, those who want to come back will have to reach Colombo [in the Western Province] first before leaving for their destinations in the Northern or the Eastern province.\n\n[On Tuesday, 43 refugees, including 19 women, are coming back from Tamil Nadu and will leave for places such as Vavuniya, Mullativu and Killinochchi].\n\nHarim Peiris, chairman of the Resettlement Authority in the Sri Lankan government, favours the idea of a task force, consisting of representatives of the two countries, to enable expeditious voluntary repatriation of the refugees.\n\nR. Sampanthan, Tamil National Alliance chief, who also discussed the issue of the return of refugees with Ms. Swaraj, says that only the resolution of the Tamil question will facilitate the return of the refugees in a big way.\n\nStipulation on baggage and distance of native places from Colombo hampers air travel", 
    "section": "national", 
    "title": "Sushma asks OfERR for list of refugees", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}