{
    "author": [], 
    "text": "RELIGION\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Sri Desikan Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6 p.m.; Sri Krishnar Sannidhi, 7 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama nama parayanam, 15, III Cross, Renga Nagar, 6 p.m.\n\nCULTURE\n\nSri Ranga Vittala Bhajan Mandali : Sri Purandaradasar aradhana, sampradaya unchavruthi, Sri Vyasaraja Mutt, Srirangam, 8 a.m.; Akanda nama dasa sangeerthanam, 9 a.m.; prize distribution, 6 p.m.\n\nGENERAL\n\nDistrict Administration : Public grievances meeting, K.S.Palanisamy, Collector, presides, Collector’s Office, 10 a.m.\n\nTiruchi Corporation : Civic grievances meeting,A.Jaya, Mayor, presides, Corporation office, 11 a.m.\n\nMSME Development Institute and TIDITSSIA : Valediction of industrial motivational campaign and entrepreneurship development programme, P.Veerabhadran, Branch Manager, SIDCO, Tiruchi, distributes certificates, TIDITSSIA Office, 10.30 a.m.\n\nPeriyar EVR College : Training and Placement Cell, Online test for Accounts Trainee position, 10 a.m.\n\nMaster Mind 2016 : Inaugural ceremony, J.Radhika, principal, Srimad Andavan Arts and Science College, chief guest, Hotel Sangam, 10 a.m.\n\nBishop Heber College Department of History: National conference on Recent trends in prohibition movement in India, D.Paul Dhayabaran, principal, inaugurates, Rev.C.Joe Arun, anthropologist, delivers key note address, 10 a.m.\n\nBio Design Farm and M.A.M.School of Architecture : Workshop on Bio mimicry architectural application, A.Parisutha Rajan and Vivin Agarwal, resource persons, 10 a.m.\n\nKongunadu College of Engineering and Technology : Lecture on Mechanical properties of recycled coarse aggregate concrete with fly ash by M.Vijay, assistant professor, Tholurpatti, 5 p.m.\n\nRotary Club of Tiruchi: Rev. Fr. Eugene, Vicar General, Tiruchi Diocese speaks on ‘Enn kadan pani seyithu kidapadhae’, Hotel Femina, 6.30 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}