{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Tamil Nadu will be developed as a well connected State, says Railway Minister Suresh Prabhu\n\nUnion Minister of Railways Suresh Prabhu (centre) launching various projects in Chennai on Sunday. State Minister for Animal Husbandry T.K.M. Chinnayya (left) and DMK MP Tiruchi Siva are present.— Photo: B. Jothi Ramalingam\n\nTamil Nadu has not got its due share in railway projects over the years resulting in backlog of development and the Centre was committed to correct it, Union Minister of Railways Suresh Prabhu said on Sunday.\n\nLaunching various railway projects here, Mr. Prabhu said the Union Cabinet had approved a proposal for having joint ventures with state governments and Tamil Nadu had already given its in-principle consent. “We want to take this idea forward. In addition to budget allocations, all regions in the State will get their due share of development. Tamil Nadu will be developed as a well connected State,” he said.\n\nThe Minister added that he was willing to work with the State for developing the suburban system in Chennai. At least 28 major stations in Southern Railway would be modernised through PPP model.\n\nMr. Prabhu said the Railway was consistently losing its share of passengers and freight traffic in the recent years. While the quality of services got deteriorated, the large network was getting saturated raising safety issues. “We decided to reverse the trend by making investments. Last year, we invested Rs. 1 lakh crore plus in the railway network. The ticketing system was simplified and passengers could book tickets on their mobile phones in less than five minutes. The concept of e-catering had improved the quality of food on trains. If people cooperate, we can make railways the cleanest mode of transportation.”\n\nJoint venture\n\nMr. Prabhu said a new joint venture company will be launched soon involving the Ministry of Railways and the Tamil Nadu government to identify, prioritise and expedite development projects. Since both the Centre and State had little funds to cater to the demands of the people, innovative ways of financing would be identified. New city terminals on the outskirts would be developed on the PPP lines.\n\nThe Minister earlier laid the foundation stone marking the beginning of work on laying a third 30-km broad gauge line connecting Tambaram and Chengalpattu at a cost of Rs. 256 crore.\n\nBesides, through video conferencing, Mr. Prabhu laid the foundation stone for a broad gauge line between Kallakurichi and Chinna Salem (16 km) at Kallakurichi (Rs. 116.6 cr) and also flagged off a Suvidha train service between Chennai Central and Shalimar.\n\nE-bedroll facilities at Trivandrum Central and Chennai Central were also launched on the occasion. He also announced additional stoppages at Nayudupeta and Sullurupeta for Chennai Central-Vijayawada Pinakini Express and Chennai Central-Ahmadabad Navjeevan Express respectively.\n\nMr. Prabhu said allotment of funds for projects has increased this year by 18 per cent, which is Rs. 997 crore as against Rs. 850 crore last year.\n\nMembers of Parliament, K.N. Ramachandran and K. Maragatham, and Southern Railway General Manager Vashishta Johri spoke on the occasion.\n\nBJP State president, Tamilisai Soundararajan and party’s State functionaries participated.", 
    "section": "national", 
    "title": "‘TN has not got due share in rail projects’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}