{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Tribal communities in the district have heaved a sigh of relief following the Supreme Court’s recent clearance of the Interim order of Madras High Court staying the issue of title deeds under the Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights) Act, 2006 (in short, FRA) on an application filed by the Ministry Tribal Affairs.\n\nThe standpoint of the Ministry of Tribal Affairs was that when the FRA is being implemented across the entire country, there was no need for restricting its operation in only one State.\n\nAccording to official statistics, 21,781 claims have been filed in the State and 3,723 titles deeds are ready for distribution. Erode district must take the lead in implementing the Act, P.L. Sundaram, MLA of Bhavani Sagar in whose constituency there are a number of forest settlements in the jurisdiction of Sathyamangalam Tiger Reserve, said. Titles deeds for the land that had been tilled by the tribal communities for three generations (75 years) are to be granted in the nine forest settlements in STR.\n\nThe Forest Department had last year itself scrutinised 411 applications and completed measurements for 337.8 hectares. The titles, official sources said, will be helpful for cultivators to avail themselves of loan and subsidy benefits under government schemes.\n\nGeddaisal near Hassanur accounts for the highest number of 90 applicants (56.02 hectares), followed by Nagalur forest settlement with 86 applicants (121.62 hectares). Tribal communities in Mavanatham, Uginiyam, Ramaranai, Uppupallam, Nandhipuram, Vilankombai and Kembanur settlements are also entitled to title deeds.\n\nThe Act bestows on them individual rights to cultivated land in forest area and community rights over common property resources. The Act integrates conservation and livelihood rights of the people. Last year, Mr. Sundaram made a representation to the Chief Secretary of Tamil Nadu who is the Chairperson of the State Level Monitoring Committee (SLMC) constituted under the Act to ensure establishment of Gram Sabhas, constitution of Forest Rights Committees, and determine Community Forest Resources rights by the Gram Sabhas, expressing concern over the slow pace of clearance of title deeds for the forest settlers.\n\nTraining\n\nThe Tribal Welfare Department is expected to organise training about the Act to all the members of the Forest Rights Committees along with the members of the Sub-Divisional Level Committees and District Level Committees.", 
    "section": "national", 
    "title": "Tribal communities in STR looking forward to early grant of title deeds", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}