{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The members of the Tamil Nadu B.Ed., Computer Science Unemployed Graduate Teachers’ Association from across the State observed a fast in front of the Collectorate here on Sunday to press their five point charter of demands.\n\nThey demanded the government to provide computer science education from Class I to X in government schools from the current academic year, on the lines of private schools. When Samacheer kalvi programme was introduced in the State in 2011, computer science education was introduced in classes VI – X and books were also printed and distributed to students, much to the delight of the parents and students.\n\nHowever, the subject was withdrawn from the syllabus soon without any rhyme or reason. They demanded the government to reintroduce computer science in schools and distribute the books already printed.\n\nThe newly upgraded government higher secondary schools do not teach computer science. The government should introduce computer science in these upgraded schools and appoint fresh teachers for the same. The government should also fill the existing vacancies of computer science teachers.\n\nThe computer science subject should be introduced compulsorily from the primary school level itself under the Central Government scheme and also under the Digital India scheme.\n\nThe matriculation and CBSE schools teach computer science subjects from the primary level itself. The government schools in all the States except Tamil Nadu have computer science, they said adding that more than 21,000 B.Ed computer teachers are unemployed in the State, despite having pucca degrees from the universities.\n\nS. Muthusamy, former MLC and general secretary of the Tamil Nadu Aasiriyar Koottani, inaugurated the fast, led by S. Ramachandran, state president and V. Kumarasamy, state secretary of the association. The office-bearers of various teachers’ associations spoke expressing their solidarity with the agitating graduates.", 
    "section": "national", 
    "title": "Unemployed B.Ed graduates observe fast in Salem", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}