{
    "author": [
        "Deepa H"
    ], 
    "text": "As the countdown to the elections begins and parties are hitting the road, the various wings of the AIADMK too reaching out to the voters. The party’s IT wing that has two alumni of the Indian Institute of Management among its office-bearers is looking at a fresh approach to canvassing.\n\nAfter a State-wide tour by office-bearers, the wing has chosen 2,000 youngsters from all the party districts units and formed an IT task wing for every Assembly constituency. These are graduates, who are computer and internet savvy and have smart phones.\n\n“We have had one-on-one meetings with these volunteers and after assessing their skill-sets have given them a road map for the next 110- 120 days. We have mapped out what they have to do on an hourly basis and not just daily basis. They will do demographic and psychographic mapping of the voters along with regular online propaganda,” explained ‘Aspire’ K. Swaminathan, secretary of the IT wing.\n\nOther wings too are trying to outdo each other in taking AIADMK general secretary and Chief Minister Jayalalithaa’s achievements to the voters. The Amma Peravai for instance has decided to distribute copies of her reply to the Governor’s address in the Assembly in January, 2016 to 5.5 crore voters.\n\n“We are taking out rallies in all the 50 party districts and distributing the 30-page booklets. It was an emotional speech that outlines everything that Amma has done for the people,” said Amma Peravai secretary and Revenue Minister R.B. Udayakumar.\n\nWooing women\n\nMembers of the Women’s wing are ensuring that they reach the women in homes. “We have the privilege to enter homes and talk to the homemakers. Every house has something of Amma ’s schemes… we remind them about how she takes care of the people. Women voters also take this opportunity to ask for any kind of help they need. Some ask for health care in hospitals or government certificates, we ensure that it is done,” said the women’s wing secretary and Handloom Minister S. Gokula Indira.\n\nThe Unorganised Drivers’ wing has been creating awareness of the need to wear helmets while riding two-wheelers using a van that has audio visual aid. It uses cultural programmes to canvas for road safety and to take information about Ms. Jayalalithaa’s schemes to the masses.", 
    "section": "national", 
    "title": "Various wings of AIADMK reaching out to voters", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}