{
    "author": [], 
    "text": "AINRC cadre waiting outside the party office in Puducherry on Sunday.— Photo: S.S. Kumar\n\nRangasamy was almost 3 hours behind schedulefor his party's anniversary celebrations\n\nReporters, photographers and television crew had a frustrating time on Sunday as they had to wait more than three hours for the arrival of Chief Minister N. Rangasamy at the AINRC office for the sixth anniversary celebrations of the party.\n\nParty secretary and MLA N.S. Jayabal alias Ayyanar had sent an invite to all mediapersons a day earlier requesting them to be present at 9 a.m. MLAs, chairmen of public sector undertakings and Ministers began arriving in time and the area was milling with cadres.\n\nExasperated over the inordinate delay, some mediapersons even toyed with the idea of walking out of the event.\n\nHowever, the hosts requested them to wait a bit longer. Meanwhile, pictures of a huge crowd waiting anxiously for the celebrations to start made their way to the social media.\n\nMr. Rangasamy arrived at 11.55 a.m., about three hours behind schedule. The crowd rushed into the mini hall, making it difficult for the Ministers and MLAs to reach the Chief Minister to greet him with a shawl or bouquet.\n\nUnion Urban Development Minister Venkaiah Naidu’s sense of humour came to the fore during the inauguration of Arts and Crafts village recently.\n\nHe said that Prime Minister Narendra Modi and Chief Minister N. Rangasamy formed an ‘ideal Jodi’ on several counts.\n\n“We have a stable government and an able Prime Minister in Delhi. Similarly, people of Puducherry have a stable government and able Chief Minister. This is an ideal Jodi,” he said to thunderous applause from the audience, including Lieutenant Governor A.K. Singh and Ministers.\n\nMr. Naidu also said that he was very impressed to see ‘Bommalattam’ at the venue. “I have seen political ‘Bommalattam’ in Delhi but this one was a real cultural feast,” he quipped.\n\nReporting by R. Sivaraman and S. Prasad", 
    "section": "national", 
    "title": "When CM made media wait for hours", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}