{
    "author": [
        "K Lakshmi", 
        "R Srikanth"
    ], 
    "text": "It must be ensured that seats reserved for the aged are not usurped by others\n\nSixty-eight-year-old P.G. Manivasan carries a small plastic footstool around whenever he is travelling, because he finds it difficult to board the buses as the footboards have a high ground clearance and each step is too high.\n\n“I have no choice but to carry a footstool when I have to board buses. My wife too has knee pain and the steps are a bit too high for her to climb,” said Mr. Manivasan, a resident of Villivakkam. While several elderly commuters welcomed the move to provide connectivity to the interior areas through small buses, they said that the steps in these buses were high too.\n\nMany other elderly commuters note that Metropolitan Transport Corporation (MTC) buses are not senior-friendly.\n\n‘Crowded’\n\nV. Subramanian, a resident of Old Washermanpet, said: “I often travel by bus to visit the hospital and various temples. I cannot always afford autorickshaw rides and wait for MTC buses that are not crowded as I cannot board a bus in a hurry.”\n\nMany senior citizens also complained that the seating facilities were poor in MTC buses.\n\nD. Bhakthavatchalu, president of North Chennai Senior Citizens Welfare Association, said, “There are seats reserved for the elderly and the physically challenged. But, these seats are often occupied by others. Seeing a senior citizen, some may be courteous and kind enough to vacate the seat. But, conductors do not come for our help if the seats are not given to us.”\n\nMTC staff members must be instructed to ensure that seats allotted for aged commuters are provided to them.\n\nAnother suggestion is that these seats be given a different colour so that they are easily identified.\n\nThe association members said that there was a need to introduce many low-floor buses across the city.\n\nAt present, only air-conditioned buses operated by the MTC have low floors.\n\nBut these are operated only on a few routes and are few in number.\n\nThough the proposal for low-floor buses have been chalked out, they are yet to be inducted into the fleet operated by the MTC.\n\nI have no choice but to carry a footstool when I have to board buses\n\nP.G. Manivasan\n\nResident of Villivakkam", 
    "section": "national", 
    "title": "With high steps and poor seats, bus ride not smooth for elderly", 
    "subsection": "tamilnadu", 
    "date": "2016-02-08"
}