{
    "author": [
        "M K"
    ], 
    "text": "A six-year-old boy, Sivaram, was beaten to death by his schoolmate who was all of 12 years in a school in Tirupur city on Wednesday.\n\nThe murder came to light after a student found the body behind the school toilet.\n\nThe police have conducted a preliminary inquiry. The murder has sent shockwaves among the local residents and has raised many serious questions about children’s safety in schools and child psychology. The police, who have conducted a preliminary inquiry at the school, said that there were not many students in the school when the incident took place, but an 11-year-old girl saw the two boys quarrelling.\n\nPolice Commissioner M.N. Manjunatha conducted preliminary inquiries at the school.\n\nA senior police officer told The Hindu that the victim, the boy who assaulted him and another schoolmate were friends and they would reach the school at 8 a.m. and play until classes began at 8-45 a.m. On Monday, Sivaram and his older friend were playing together when a quarrel erupted between them. They beat each other and fought in the ground.\n\nThe 12-year-old allegedly dragged Sivaram to a corner of the ground behind the toilet and pushed his head against a big stone. He was also hurt. Police added that there were not many students in school when the incident took place, but an 11-year-old girl saw them quarrel, through a classroom window.\n\nThe murder came to light after another boy who went to the toilet found Sivaram and the older boy behind the building. He reportedly found Sivaram unconscious, and bleeding, but also the older boy, standing beside, and some minor injuries and blood on his uniform. He immediately informed the physical education master and the two boys were rushed to the Government Hospital in Tirupur. Sivaram was declared as brought dead.\n\nThe boy accused of committing the murder was booked under Section 302 (murder) of the Indian Penal Code and produced before the Juvenile Justice Board in Tirupur.\n\nFollowing the incident, the school management asked parents to take back their children from school and declared a holiday on Wednesday.\n\nWhile the management could not be reached in this connection, it is learnt that the institution would remain closed for a few days.\n\nIt has raised serious questions about children’s safety in schools and child psychology", 
    "section": "national", 
    "title": "6-year-old boy beaten to death at school", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}