{
    "author": [
        "Lalitha Ranjani"
    ], 
    "text": "The tea is sold out of mobile stalls in various locations in the city—Photo: R. Ragu\n\nNo wonder it is called the people’s drink. At just Rs. 5 a cup, hot tea helps to refresh several hundred people sold through mobile stalls in a few locations in Chennai.\n\nTea manufactured by Tamilnadu Tea Plantation Corporation Limited (TANTEA), a government of Tamilnadu undertaking, are sold through mobile tea stalls at a subsidised rate of Rs. 5 a cup, while it is sold between Rs. 8 and 10 at most roadside stalls. These mobile stalls, functioning out of mini cargo trucks, can be seen on V.O.C. (Walltax) road near Chennai Central railway station and outside Rajiv Gandhi Government General Hospital.\n\nFrom Wednesday, the mobile stores also started serving three different flavours of tea – masala tea, green tea and ginger tea — besides the regular variety. The flavoured tea will be sold as dip tea, which is packed and distributed by TANTEA. The three-month-old mobile tea stalls, which open at 4 a.m. and function up to midnight, plan to sell iced tea at Rs. 15 per cup during summer.\n\n“Among them, the stall located outside the Government Hospital sees a good sale owing to its strategic location and there are many regulars who visit the stall here more than once. Every day, we easily sell over 2,500 cups of tea,” stated A. Venkatesh, the wholesale dealer of mobile TANTEA tea stalls.\n\n“I prefer buying my daily tea here as it is just Rs. 5 and the quality is very good. They also give tea parcelled in plastic packets, which is easy for me to carry it hot for my relative admitted at the hospital,” said Shanmugam. “There are plans to expand, as we await government nod to set up similar stalls outside Egmore railway station, High Court and Kilpauk Medical College Hospital,” Mr. Venkatesh said.\n\nTANTEA tea packets of different varieties are also sold at subsidised rates here.", 
    "section": "national", 
    "title": "A satisfying cup of tea for just Rs. 5", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}