{
    "author": [
        "K Manikandan"
    ], 
    "text": "Damaged compound walls along railway lines have contributed significantly to mishaps in 2015\n\nImproving access to sanitation facilities for the urban poor living along railway tracks and preventing damage to protective fences and compound walls around stations will go a long way in reducing accidents on the railway tracks.\n\nOf the 743 people who were killed in train-related accidents in Chennai and its suburbs in 2015, many were crossing railway tracks to reach open spaces as they did not have toilets at homes, railway police sources said.\n\nThis problem is particularly pronounced on the city’s northern suburban sector.\n\nAnother pattern that has emerged from a study of last year’s mishaps: compound walls along railway tracks that are damaged by miscreants to walk across the railway tracks and avoid taking long circuitous route have also led to many fatal accidents, Government Railway Police (GRP) told The Hindu.\n\nThese two forms of train-related accidents is ahead of all others, which include falling down from compartments and slipping and falling from platforms while trying to board a moving train, by a long chalk.\n\nThe figure from 2015 suggests a drop in number of accidents, as the previous two years — 2013 and 2014 — recorded 923 and 859 accidents respectively.\n\nActivists say a zero-tolerance attitude towards train-related accidents should be developed and efforts to further bring down the number should be taken.\n\nOne of them is awareness programmes.\n\nGRP sources say that they have stepped up awareness programmes among students and hope this will help further check accidents on the tracks.\n\n“College students and office-goers are a vulnerable group. They rush to bus stops and auto stands after getting down from trains,” explains P. Vijayakumar, Superintendent of Police, Railways.\n\nAccording to him, poor visibility early in the morning during the winter months is also a reason for accidents as people crossing tracks cannot spot the approaching trains.\n\nStatistics reveal that most fatal accidents take place on the stretch between St. Thomas Mount and Chennai Beach — 193 people were killed last year, accounting for one-fourth of total number of fatalities in Chennai and its suburbs.", 
    "section": "national", 
    "title": "Accidents dip, problems persist", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}