{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here on Wednesday issued non-bailable arrest warrants (NBW) against 12 of the 17 accused in the 2007 Dinakaran newspaper office attack case for “playing hide and seek” with the court and delaying the hearing of an appeal preferred by the Central Bureau of Investigation (CBI) in 2010 against their acquittal by a trial court here in 2009.\n\nA Division Bench of Justices P.R. Shivakumar and V.S. Ravi spared the prime accused, V.P. Pandi alias ‘Attack’ Pandi, Deputy Superintendent of Police V. Rajaram (charged of having failed to prevent the attack) and three others from being arrested and produced before the court on February 4 since they had engaged counsel to represent them in the appeal proceedings.\n\nThough counsel for three more accused M. Thiruchelvam, V. Sudhakar and Thirumurugan alias ‘Kattuvasi’ Murugan entered appearance for them even as the order for issuance for NBW was being dictated, the judges refused to accept the plea and said that their appearance at the eleventh hour itself was an indication of the “dilatory tactics” being adopted by the accused for the last five years.\n\n“You may ask your clients to appear before this court tomorrow and file petitions for recalling the warrant,” Mr. Justice Shivakumar told the three advocates. The judges also withdrew an order passed by a Division Bench of Justices S. Nagamuthu and V.S. Ravi on August 19 appointing a legal aid counsel to represent the accused who had not engaged counsel to defend them in the appeal.\n\nThey, however, appointed legal aid counsel N. Anandakumar as amicus curiae to assist the court in disposing of the appeal. During the course of arguments, Mr. Justice Shivakumar warned the accused against “intimidating” the court and said: “They (accused) wanted me to recuse from this case. They cannot dictate it. It is for the judge to decide whether to recuse from a case or not.”\n\nReacting to it, advocate Rupert J. Barnabas, appearing for the sixth accused, S. Vijayapandi said: “I do not know what intimidation you are talking about. I actually do not know what is happening in this case.” To this, Mr. Justice Shivakumar replied: “You need not know that because you have entered appearance. You would not have done that… The accused cannot take the court for a ride. ”\n\n‘Counsel’s appearance at eleventh hour an indication of dilatory tactics’", 
    "section": "national", 
    "title": "Arrest warrants against 12 in Dinakaran case", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}