{
    "author": [
        "Deepa H", 
        "Ramakrishnan Aloysius Xavier Lopez"
    ], 
    "text": "TNPCB sets March 31 as deadline for city restaurants to tackle food waste\n\nTamil Nadu Pollution Control Board (TNPCB) has set March 31 as the deadline for restaurants in Chennai to take effective steps to dispose of food waste.\n\nDuring a recent meeting of stakeholders – including hoteliers, resource persons, and TNPCB and civic body officials – senior officials in the board instructed hotel and restaurant owners to set up a biogas plant for the purpose by March. A special purpose vehicle would be formed for the same and technology would be provided by Bhabha Atomic Research Centre (BARC), Mumbai.\n\n“Initially, Teynampet zone will be taken up. There are 130 restaurants here and they generate 60 tonnes of food waste a day. We have set March 31 as the deadline and if steps are not taken, we will initiate action. The Municipal Solid Waste Management Rules have provisions regarding regulation of food waste for action,” said an official.\n\nBased on the principle of ‘polluter pays,’ food waste should be collected and disposed of safely by hotels that were responsible for the waste, said the official, adding that hotel and restaurant owners would also have to bear the cost of transporting the waste. Hoteliers had been asked to install a biogas plant.\n\n“If need be, the Chennai Corporation will provide space for the plant. We are awaiting a proposal from the TNPCB,” said a source in the civic body.\n\nFood waste forms around 16 per cent of municipal solid waste and also leads to formation of landfill gas that can cause fires in landfills. “Such waste too leads to formation of leachate,” an expert said.\n\nBARC is already working on biogas plants that are capable of producing about 100 kilograms of organic manure and generate up to 100 units of electricity or methane gas equivalent to more than two domestic Liquefied Petroleum Gas cylinders from every tonne of biodegradable waste.\n\nBased on ‘polluter pays’ concept, food waste must be collected and disposed of safely", 
    "section": "national", 
    "title": "Bio-gas plant, a must for hotels", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}