{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Four institutes to collaborate with Japanese university\n\nFlush with a large grant, researchers from four institutes in the country will undertake an ambitious international project to use stem cells to study and treat disorders of the brain and blood.\n\nCalled ‘Accelerating the application of Stem Cell Technology in Human Disease’ (ASHD), the programme has received Rs. 141 crore from the Union government’s Department of Bio-Technology (DBT) and Rs. 6 crore this year from the Pratiksha Trust, set up by IT mogul Kris Gopalakrishnan.\n\nThe National Centre for Biological Sciences (NCBS), the National Institute of Mental Health and Neurosciences (NIMHANS), the Institute for Stem Cell and Regenerative Medicine (inStem) — all in Bengaluru — and the Christian Medical College (CMC) at Vellore will collaborate with the Centre for iPS Cell Research and Application of Kyoto University, Japan.\n\n“This brings together cellular-level genetic research with clinical practices… This has not happened on such a large scale anywhere in the world,” said K. Vijay Raghavan, secretary, DBT.\n\nHow it works\n\nThe programme will utilise the large patient base of NIMHANS — which sees more than 5 lakh people traversing its campus every year — as well as CMC College, which specialises in blood disorders, to create a database of blood and body fluid samples.\n\nOnce processed, they will be analysed by researchers at NCBS and inStem, along with those from Kyoto University, where the ‘defects’ in the gene code will be identified and edited out. The promise is that this understanding of genes can eventually lead to treatment techniques that can be clinically tested.\n\nNeurological disorders such as schizophrenia remain grossly under-researched in the Indian context while blood disorders like haemophilia (an estimated 60,000 suffer this in India) and Beta Thalassemia (more than 60,000 children a year) remain virtually untreated as the costs are prohibitive.\n\n“While this process can be replicated for epilepsy, Parkinson’s and Huntington’s among others, the offset benefits can also be the creation of diagnostic tools or neuropsychiatric chips that can be commercialised,” said Mahendra Rao, scientific advisor for inStem.\n\nImportant role\n\nKris Gopalakrishnan believes that stem cell research will harbour the next stage of the industrial revolution, and India with its large skilled force and low cost will play an important role in accelerating research.\n\nFour institutes will collaborate with a Japanese university to study brain and blood disorders", 
    "section": "national", 
    "title": "Boost for stem cell research", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}