{
    "author": [
        "M K"
    ], 
    "text": "Prepared by TTK Maps, it has police station jurisdictions marked accurately\n\nThe new map prepared by the city police on display at the Police Commissioner's Office in Coimbatore.- Photo:S. Siva Saravanan\n\nCoimbatore City Police have prepared a map with jurisdiction of the police stations identified and marked in a scientific manner. “It will help people who are new to the city to identify police stations at ease and get their grievances redressed at the earliest,” City Police Commissioner A. Amalraj said.\n\nThe maps that were earlier displayed at the chamber of the Police Commissioner and in 15 police stations in the city were hand-drawn and not to scale. This resulted in confusion in identifying the jurisdiction of the police stations if a crime was reported. At times there was even confusion between the city and district police, covering areas close to the city.\n\nOn Wednesday, a copy of the newly prepared city map was displayed at the Commissioner’s chamber. The Commissioner told The Hindu that the map was prepared by a team of experts from Chennai-based renowned map makers, TTK Maps. The team spent a week in the city and conducted separate surveys from all the police stations, using the Global Positioning System.\n\n“The map is to the scale. It also has important residential areas, commercial establishments, police outposts, police check posts, traffic signals, and hospitals marked,” Mr. Amalraj said.\n\nThe map has separate markings to distinguish the 247 sq.km covered by the city police and the 267 sq.km covered by the Coimbatore Corporation. It is because some areas covered by Podanur, Singanallur and Peelamedu police stations in the city are outside the corporation limits.\n\nOn the other hand areas such as Vadavalli and Thudiyalur that are in the corporation limits are not covered by the city police. For this purpose areas under the jurisdiction of the police stations in Coimbatore District that are close to the city police limits – Madukkarai, Vadavalli, Thudiyalur, Kovilpalayam, Chettipalayam and Sulur – have also been marked.\n\nCopies of the map will be displayed at the police stations in the city in a couple of days. A digital copy of the map is also available for the perusal of policemen.\n\nA section of the public has suggested that the map could be uploaded to the official website of Coimbatore District.", 
    "section": "national", 
    "title": "City police come up with new map", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}