{
    "author": [
        "M K"
    ], 
    "text": "Apart from the multi-speciality ESI Hospital in the city that is all set for inauguration in the first week of February, the Coimbatore Medical College Hospital (CMCH) is also gearing up for the inauguration of the 700-bed ‘Centenary Building’.\n\nHospital sources said that a major portion of the work has been completed and hinted that it would be inaugurated in the second week of February. “It could take two months to install equipment worth about Rs. 4 crore as part of the Rs. 61 crore centenary building project and to make it fully functional,” says CMCH Dean A. Edwin Joe.\n\nThe construction of the building on an area of 3.23 lakh sq.ft. at an estimate Rs. 57 crore began in October 2012. It was scheduled to be completed in two years but it got delayed due to various reasons.\n\nDepartments\n\nOn completion, the new building will have departments such as cardiology, cardio thoracic, neurosurgery, neurology, plastic surgery, medical and surgical gastroenterology, nephrology and urology. Casualty, toxicology, intensive coronary care unit and intensive medical care unit will also be shifted to the new building. The centenary building will also have trauma and orthopaedic wards in addition to the existing trauma and orthopaedic wards.\n\nOperation theatres\n\nThe centenary building has 13 state-of-the-art operation theatres. It will take number of operation tables in CMCH to 44 – including 31 tables in the existing buildings – and facilitate performing more than 100 surgeries a day.\n\n“While the existing buildings in the hospital have 1,182 beds, the hospital has more than 1,300 admissions. The additional patients occupy the floor.\n\nThe 700 beds in the new building will help in accommodating them and in meeting the unexpected increase in inflow of patients,” Medical Superintendent of the hospital B. Asokan said.\n\nThe other buildings from where the wards are shifted to the new building will be utilised based on the Medical Council of India (MCI) norms, hospital authorities said.", 
    "section": "national", 
    "title": "CMCH gears up for opening of 700-bed centenary building", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}