{
    "author": [
        "L Renganathan"
    ], 
    "text": "The handloom major rolls out 25 shades of silk saris as a tribute to M.S.\n\nSilk saris will be the special focus of Co-optex during its marriage season sale in the next few months. Handloom major's Managing Director T.N. Venkatesh takes a look at one of the silk saris at its outlet in Thanjavur on Wednesday.— PHOTO: R.M. RAJARATHINAM\n\nThe Co-optex is planning a series of silk exhibitions across the State to cash in on the marriage season in the Tamil months of Thai and Vaikasi.\n\nBeing the centenary of the music legend M.S. Subbulakshmi, Co-Optex as a tribute to her has rolled out silk saris in 25 unique patterns that the singer had worn during her concerts, according to the Co-optex Managing Director T.N. Venkatesh.\n\nIn an interaction with The Hindu here on Wednesday, Mr. Venkatesh said the Co-optex Design Studios in Chennai had hired expert designers trained at the National Institute of Designs to focus on the urban clients and customers by attracting them with combinations and patterns involving pastel shades, zero zari silk saris and combining two or more traditional silk weaving centre novelties.\n\nThe zero zari silk sari with threaded work has become a hit with the upmarket customers and working professionals who prefer elegance with simplicity. Since most saris are double jacquard woven, they stand out for their durability, appeal, and utility, Mr. Venkatesh said.\n\nWith the Co-optex focusing on silk as well, silk alone accounted for Rs. 4 crore during the last Deepavali season sale, up from Rs. 1.90 crore the previous year.\n\nPlans are afoot to produce exclusive silk salwars and paavadais to increase the product range in the Co-optex’s bouquet.\n\nThe Co-optex is supporting more than two lakh handloom weavers throughout the State who have been organised under 1,180 weavers cooperative societies by channelling them various governmental benefits.\n\nThe exposure visit of weavers in the Co-optex fold to other major traditional weaving centres has resulted in the rise of a new brand of saris involving the best of those cultures.\n\nIn silk variety, the Tamil Nadu weavers are blending Nuapatra (Odisha) motifs and in cotton items, they are dovetailing the Chirala (Andhra Pradesh) patterns and the blended varieties are a real hit with the customers, Mr. Venkatesh added.", 
    "section": "national", 
    "title": "Co-optex upbeat about silk", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}