{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "Kuppaimedu, a short film entry from Karur college, wins second place\n\nVisitors take a look at the exhibits at a photo exhibition organised on the sidelines of 'First Clap 2016', a film-making and photography festival, at the Bharathidasan University in Tiruchi on Wednesday.— PHOTO: A. MURALITHARAN\n\nTwo hundred and forty three participants representing 38 colleges in Tamil Nadu were given a platform to showcase their film-making and photography skills at a competition-cum-festival organised by the Bharathidasan University’s Department of Educational Technology on Wednesday.\n\nBilled as “First Clap 2016”, the day-long event was the department’s maiden effort for students of media and visual communication courses. It was inaugurated by film director and producer Anthony Tirunelveli on the department’s Khajamalai campus.\n\nOf the 17 entries, two short films — The Foresight directed by P.S. Arunagiri of Sree Krishna Arts and Science College, Coimbatore, and Kuppaimedu directed by V. Ramesh of Sree Amman College of Arts, Erode — were adjudged first and second place winners respectively. The Foresight dealt with the subject of helmets and road safety while Kuppaimedu discussed drug addiction.\n\nA photography contest, including an exhibition of prize-winning journalistic pictures from around the world, was held on the sidelines of the film festival.\n\nDaranidaran of Government College of Fine Arts, Chennai, won the first prize while Jayaprakash of Jairam Arts and Science College, Karur, won the second prize in the photography contest. Each prize-winner was felicitated with a citation and a cash prize.\n\nThe morning session started with the screening of the production Karna Motcham (Karna’s Salvation) directed by S. Murali Manohar, which won the National Award for Best Arts and Cultural Film in 2008. In the 13-minute movie, actor George plays Govindhan, a theru-koothu artiste who is hoping to make some money with his performance as the Mahabharatha character Karna at a city school. What happens when his recital gets cancelled forms a subtle commentary not only on the slow death of Tamil Nadu’s folk arts in the face of globalised entertainment, but also a fine character study of how jobs define a person’s life.\n\nThis was followed by Bubble , a 2012 short film directed by the UAE-based Faisal Hashmi. Using four actors to play two sets of characters and with just a line of dialogue, the polished production tries to highlight finding peace in regret through two seemingly different stories.\n\nDiscussions on the techniques and content of the films, mediated by N. Rajendran of Nimai Ghosh Film Society, were held after the screenings.\n\n“Most entries showed that whatever they do, film-makers must take cognisance of public social awareness,” E. Ramganesh, professor and head, Department of Educational Technology, told The Hindu .\n\n“We hope to make this an annual event to give students a platform to show their skills and meet experts in the field,” he added.", 
    "section": "national", 
    "title": "Coimbatore team wins top spot at ‘First Clap 2016’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}