{
    "author": [
        "Annie Philip"
    ], 
    "text": "Workshop for government officials on effective stray dog population management in Puducherry\n\nRahul Sehgal, Asia Director, Humane Society International, at a workshop for Government officials on dog population management in Puducherry on Wednesday —Photo: T. Singaravelou\n\nA high volume, high impact Dog Population Management programme of 24 months followed by continued sustained efforts will help stabilise the population of stray dogs in Puducherry, and effectively tackle related problems, said Rahul Sehgal, Asia Director, Humane Society International.\n\nHe was speaking on the sidelines of a workshop for government officials on dog population management in Puducherry on Wednesday. The workshop was organised by the Animal Welfare Board of India and HSI.\n\nScientific solution\n\nThe Dog Population Management (DGM) programme is a scientific and solution-oriented approach, said Mr. Sehgal. It involves implementing Animal Birth Control (ABC) and vaccinating the dogs against rabies. There will be a decline in rabies outbreak within the first year of implementing DGM and a decline in number of stray dogs by the fifth year, he said.\n\nMr. Sehgal cautioned against discontinuing the ABC midway, citing the example of Ahmedabad, where funding for the ABC was discontinued and there was an increase in dog bites some years ago.\n\nHe gave examples of cities like Chennai, Jaipur, Kalimpong which have run successful ABC programmes, and Sikkim which has a State-run programme, Sikkim Anti-Rabies and Animal Health (SARAH) programme.\n\nIn Chennai, deaths from rabies were brought to zero following the implementation of the ABC programme in 1996. Through a sustained DGM, 70 percent of the population of stray dogs can be reached, said Mr. Sehgal.\n\nIt is also equally important to reduce resources like food wastes lying on the road and other areas to tackle the issue of stray dogs, he said. When there is limited resources, breeding of pups also go down.\n\nThere must be efforts on working on people’s attitudes to look at a solution-specific point of view.\n\nSterilising of a dog brings down chances of dog bites, said Mr. Sehgal.\n\nThe female dog is not in heat and the male dogs are not following it, reducing their aggression, and other reasons why dogs usually bite are also reduced through sterilisation.\n\nIn the workshop, he highlighted the role of stray dogs in prevention of disease, control of population of smaller mammals and rodents, and as community companion roles.\n\nElimination or pounding of dogs are not a solution and will only postpone the problem, adding to costs and waste of taxpayers’ money said Mr. Sehgal.\n\nAt present, Puducherry is working on the finalities of initiating an ABC programme by roping in NGOs targeting the nearly 25,000 stray dogs, said Dr. K. Coumarane, Veterinary Medical Officer, Puducherry Muncipality.\n\nWorkshops in 15 States\n\nSimilar workshops are being held in 15 States and a national-level programme is being organised by AWBI and HSI in Hisar on February 5. This workshop was also attended by Local Administration Department Director P.T. Rudra Goud, Puducherry Municipality Commissioner R. Chandirasekaran, Oulgaret Municipality Commissioner M.S. Ramesh, and Deputy Collector S. Rajamanickam.\n\nThe programme involves implementing Animal Birth Control and vaccinating dogs", 
    "section": "national", 
    "title": "‘Eliminating stray dogs won’t solve problem’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}