{
    "author": [], 
    "text": "SALEM\n\nPeriyar University: Career Counselling and Placement Cell, Periyar University-Infosys combined campus recruitment drive (CCRD-2016) in collaboration with Infosys technologies, university premises, 7.30 a.m.; Department of Food Science and Nutrition, Visiting Faculty Programme, 10 a.m.; Department of Psychology: IQAC sponsored faculty development programme on ‘Advanced counselling skills’, valediction, L. Sam S. Manickam, Professor of Clinical Psychology, JSS Medical College, Mysuru, chief guest, M. Manivannan, Registrar, presides, 3.30 p.m.; Department of Microbiology: national seminar on ‘Frontiers in bioprocess technology and microbial ecology’, K. Karthikeyan, Dean, Faculty of Marine Science, Annamalai University, inaugurates, C. Swaminathan, Vice-Chancellor, presides, 10.15 a.m.; Department of Sociology and Centre for Village Adoption Scheme conducts motivational and leadership programme for students of Sangeethapatti Panchayat Union Middle school, school premises, 10.30 a.m.\n\nPeriyar Institute of Management Studies (PRIMS) of Periyar University: International conference on ‘Role of management education in promoting entrepreneurship in the globalized business environment’, technical sessions, 10 a.m.; valediction, M. Manivannan, Registrar, delivers valedictory address, 2.45 p.m.\n\nDepartment of Tamil Development: Essay writing and oratorical competitions for school students, Fort Government Girls Higher Secondary School, 10 a.m.\n\nSree Parshwanath Jain Trust: Sri Kesariya Swetambar Jain Temple Maha Kumbabishekam, poojas, 9 a.m.; devotional songs concert, temple premises, Sankar Nagar,\n\n6 p.m.\n\nDhirajlal Gandhi College of Technology: Workshop on ‘Towards creative programming’, T.N. Raj Vignesh, Head, Research and Development, and partner Salieabs Electronics Engineers LLP, resource person, 10 a.m.\n\nKnowledge Institute of Technology: Department of ECE conducts hands-on training in Logic Design, Roopa Ramaswamy, Consultant for RV-VLSI, Bengaluru, chief guest, 9 a.m.; Department of Computer Science and Engineering: Hands-on training in IOT platform in association with INTEL, Abdul Samad and Raghav, FICE Education Career Private Limited, Bengaluru, resource persons, 10 a.m.; Department of Placement and Training: Off campus interview by Wipro Technologies, 10 a.m.; National Book Trust and New Century Book House: National Book Festival book exhibition, Bose Maidan, 9.30 a.m. and 9.30 p.m.\n\nSalem College of Engineering and Technology: Department of Training and Placement conducts campus drive, Vernalis, Chennai, recruiter, 9.30 a.m.\n\nSri Ganesh College of Arts and Science: Department of English conducts national-level seminar on ‘Indian fiction in English’, K. Mohamed Umar Farooq, Assistant Professor of English, Jamal Mohammed College, Tiruchi, resource person, M. Thangavel, Correspondent, presides, 11 am.\n\nCooptex: New Year and Pongal handloom textiles exhibition, Bose Maidan, 10 a.m. to 8 p.m.\n\nNAMAKKAL\n\nMahendra Engineering College, Mallasumudram: Department of Computer Applications, guest lecture on Current trends and challenges in Image Processing, K. Sasirekha, Research Scholar, Department of Computer Science, Periyar University, resource person, M.G. Bharathkumar, Founder and Chairman, Mahendra Educational Trust, presides, 10 am.; Department of IT and Computer Society of India, workshop on Software Engineering and Design Thinking, Senthil Jayavel, Associate Professor, School of Computer Engineering, VIT University, Vellore, resource person, 11 a.m.\n\nDepartment of Handlooms and Textiles: Pongal Festival handloom exhibition, Sri Namagiriamman Thirumana Mandapam, Kulakkarai, 9.30 a.m.\n\nTIRUCHENGODE\n\nVivekanandha Institute of Engineering and Technology for Women: Inauguration of three-day Entrepreneurship awareness camp, M. Maran, Treasurer, Murugesan Institute of Technology, chief guest, M. Karunanithi, Chairman and Secretary, Vivekanandha Educational Institutions and Vivekanandha Medical Care Hospitals, presides, 10 am\n\nRASIPURAM\n\nMuthayammal College of Arts and Science: College Bazaar 2016, Ramanujam hall, 10.30 a.m.\n\nKOMARAPALAYAM\n\nExcel Group of Institutions: On-campus drive by Allsec Technologies, Chennai, 9.30 a.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}