{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "Man, who suffered a freak accident after giving up his train seat, is struggling with expenses\n\n33-year-old Mohammed Thahir lost both his legs after he fell from the train — Photo: M. Vedhan\n\nTwo years ago, 33-year-old Mohammed Thahir, rose to offer his seat for an elderly couple in a crowded unreserved compartment of an express train. Moments later, he fell from it and lost both his legs.\n\n“I still remember the day when the train ran over my legs. It was dark and all I remember is that I woke up in acute pain at a hospital,” recalls Thahir at his rented home at TNHB Colony in Avadi.\n\nHis father Mohammed Salam, a parotta master and mother Waheeda Begum, a homemaker were by his side when he spoke to The Hindu on Wednesday morning.\n\nTwo years after the accident, he is yet to receive a First Information Report (FIR) from Government Railway Police.\n\nHe is struggling to meet his medical expenses and buy light-weight prosthetic legs.\n\nIn the absence of an FIR, he is also unable to get compensation from the State government or through legal means.\n\n“I was travelling from Paramakudi to Chennai in April 2014 when the accident happened. I was rushed to Paramakudi Government Hospital and then, admitted to a private hospital in Madurai, where my legs were amputated,” says Thahir, who worked in a hotel.\n\n“My job is not fixed, however when I do get work, I earn Rs. 500 per day. After paying our house rent and groceries, we are left with no money to meet my son’s medical needs,” laments Salam.\n\nHoping for help\n\nThahir hopes help will pour in from somewhere.\n\nA senior GRP officer said that there was no necessity for a FIR in such accident cases. “They can approach the railway claims tribunal and seek compensation,” says an officer.\n\nAdvocate V.S. Suresh, who handles a number of accident cases, says the FIR will create authenticity for the case.\n\nHe has not got an FIR and is hence unable to get compensation from the government", 
    "section": "national", 
    "title": "Good Samaritan’s long wait for relief", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}