{
    "author": [
        "M K"
    ], 
    "text": "The 67th Republic Day celebration at The Nilgiris was different from how it used to be.\n\nThis was because 90-year-old J. Halli Gowder of Nanjanad, the lone surviving freedom fighter in that district, did not turn out for the celebration on Tuesday.\n\nIll-health\n\nHis family cited ill-heath as the reason for his inability to make it to the event, which the nonagenarian considers to be very important.\n\nAccording to the protocol the District Collector, after accepting the ceremonial guard of honour, honours the freedom fighters and dependents in recognition of their sacrifice for the freedom of the country. In the absence of Mr. Halli Gowder this event was removed from the agenda in the last minute.\n\nThen number of freedom fighters drastically came down in the last few years in the district. Mr. Halli and his friend and freedom fighter L. Ari Gowder from Sholur Village were the only survivors honoured at the Independence Day in 2014.\n\nIn October that year Mr. Ari Gowder died at the age of 90, leaving Halli Gowder as the lone surviving freedom fighter in The Nilgiris.\n\nAs a man with Gandhian ideologies Halli Gowder, now a widower, had taken part in the freedom struggle.\n\nHe was even lodged in the prisons in Bengaluru and Coimbatore for a few days for taking part in the struggle.\n\nHe now lives with his second son. Last week, a Tahsildar and two other officials went his house and formally invited him to take part in the R-Day celebration.\n\nOn Tuesday (January 26) a government vehicle was sent to his house to pick him up for the R-Day celebrations.\n\n“He had difficulty in waking up as he complained of knee pain and tiredness,” his daughter-in-law M. Kalavathy said.\n\nUpset\n\nShe said that he was upset that he could not take part in the event, even after the person who came to pick him up waited for sometime.\n\nStating he only had mild breathing difficulty and minor bodily ailments he claimed that he was in sound health.\n\n“I will not miss the Republic Day celebrations next year,” he added with confidence.", 
    "section": "national", 
    "title": "He misses Republic Day function this time around", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}