{
    "author": [
        "S Senthalir"
    ], 
    "text": "Jipmer, one of the premier medical institutions in Pondicherry that provides treatment for patients from low socioeconomic groups, is reeling under shortage of staff especially to attend to emergency services.\n\nOf the 70 sanctioned posts for the OT (operation theatre) attenders, at least 48 have been vacant for the last four years.\n\nThere are 14 posts vacant out of the 48 sanctioned posts for the OT assistants and they in dire need of atleast four OT technicians.\n\nJipmer Hospital Employees Union is planning to put forth these demand to fill the vacancies during the two-day Central Health Employees Federation meeting to be held on January 30 and 31.\n\nJipmer Hospital Employees Union general secretary K. Srikanth said that the housekeeping staffs are being appointed on contract basis and they change frequently.\n\nNeed for trained staff\n\nin OT\n\n“We need trained staff who will be able to handle instruments in the operation theatre. However, the frequent change of contractual workers poses a challenge while operating on patients.\n\nThe staff need at least three to six months of training but this becomes impossible when there is a constant change of personnel,” he said.\n\n“Hence, we are demanding the relaxation of recruitment rules in Jipmer to meet the present demands and requirements. Jipmer having acquired the autonomous status could afford to relax certain procedures to fill these vacancies,” he said.\n\nThe multi tasking staff (MTS) including sweepers, cleaners, cobblers, blacksmith, painters, carpenters, turners, fitters etc are essential to attend to the needs of patients in a hospital.\n\n1000 vacancies in MTS catefory\n\nBut, there are 1000 vacancies in this category alone. There are only 450 recruited and many are from other states.\n\nAt least 150 to 200 MTS from other states have quit their jobs.\n\n“We are going to place a request before the Jipmer director to also fill the 40 posts vacant under the compassionate category,” he said.\n\nSpread over 192.2 acres, Jipmer also has a shortage of security personnel. It has only 25 security personnel employed as against the sanctioned post of 73.\n\nOf the 25 currently present, at least six personnel are retiring this year.\n\nMr. Srikanth said the recruitment rules were framed in 1970s and needs to be changed in accordance with the present situation.\n\nHe further added that they will also discuss the Seventh Pay Commission Report during the two-day meet and the cadre restructuring.\n\nThe institution has only 25 security personnel against the sanctioned post of 73", 
    "section": "national", 
    "title": "Hospital reeling under shortage of staff", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}