{
    "author": [
        "Udhav Naig"
    ], 
    "text": "The Tamil film ‘ Gethu ’ in which DMK treasurer M.K. Stalin’s son Udhayanidhi Stalin plays the lead, was denied entertainment tax exemption for misspelling the title in English, the State government informed the Madras High Court on Wednesday. The government contended that the correct spelling of the title in English was ‘ Kethu ’.\n\nAs per Government policy, films which have a Tamil title are granted entertainment tax exemption.\n\nThe producer of the film, Red Giant Movies, challenged the government decision in the High Court.\n\nPhonetically different\n\nThe government counsel contended that ‘ Kethu ’ and ‘ Gethu ’ are phonetically different words.\n\nThe word preferred by the petitioner in the application for exemption does not phonetically refer a Tamil word. The counsel sought time to file a counter affidavit.\n\nCounsel for the petitioner argued that the phonetic correctness of the words spelled in English is not the subject matter of the plea.\n\n“The subject matter is to decide whether the title is a Tamil word or not,” he added. Recording the submission, Justice R. Mahadevan posted the matter on January 29 for filing counter.\n\nThe judge added that the petition will be disposed of on the same day.\n\nAll the six officials sitting on the government’s panel, which decides whether a Tamil film qualifies for entertainment tax exemption, had unanimously concurred that the film cannot be given an exemption because the title ‘ Gethu ’ is not a Tamil word. The entertainment tax amounts to 30 per cent of a film’s revenue.\n\nThe tax tangle\n\nAsked about the government’s stand, Udhaynidhi Stalin said as the matter was sub judice he preferred not to comment.\n\nIn the past when his films were denied entertainment tax exemption, he had claimed that it was due to political vendetta.\n\nWhile questions have been raised about some of the decisions taken by government panel in dealing with various film titles, another case is pending in the Madras High Court about who should benefit from the tax exemption – the producers, theatre owners and distributors or the paying public?\n\nIf the benefit it to be passed on to the consumer, then the ticket for an entertainment tax exempted film must be sold at 30 per cent less than its actual price.\n\nThe theatre owners have challenged such a contention.\n\n(Inputs from Sangeetha Kandavel)", 
    "section": "national", 
    "title": "It should have been ‘Kethu’, not ‘Gethu’: Govt. tells High Court", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}