{
    "author": [
        "M K"
    ], 
    "text": "To express their disappointment over the rate fixed for the lands to be acquired from them\n\nA section of people whose lands in Singanallur, Kalapatti and Uppilipalayam in the city are to be acquired for expansion of Coimbatore International Airport, have decided to petition Prime Minister Narendra Modi during his visit to the city next week.\n\nP.R. Jaganathan, who leads a few land owners, said that in their petition they would mention that they were ready to handover their lands, but for a fair price. “We request that the acquisition should be according to the Right to Fair Compensation and Transparency in Land Acquisition, Rehabilitation and Resettlement Act, 2013, wherein we should get two times the market price of the land,” he said.\n\nMeeting\n\nMeanwhile, there was disappointment at the sixth of the series of land acquisition rate fixation meetings held at the Collectorate here, on Wednesday. The negotiation was conducted for 115 acres in Irugur area, coming under four blocks (20, 21, 22 and 23) – of the total 24 blocks under which the land is to be acquired.\n\nD. Gowtham, who owns 13 acres in this stretch, said that he was offered a mere Rs. 22,500 per cent while the market value of a cent there was around Rs. 10 lakh.\n\n“There is a vast difference in rates for the land to be acquired for the airport expansion, though all the 24 blocks are within a stretch of one kilometre,” he said. It is learnt that the State Government has offered Rs. 3.94 lakh per cent in another block.\n\nOpposing the discrepancy in price, nearly 200 land owners who took part in the meeting wanted the government to offer them an equal share. They also threatened to return their ration cards as they would not be able to buy a place and build a house with the price offered by the government.\n\nDistrict Revenue Officer for airport land acquisition S. Gunasekaran and an Airport Authority of India (AAI) official took part in the meeting on Wednesday. So far not even a single land owner has agreed for the rate offered by the Government. Negotiation will soon be conducted for block 16 to 19 in Irugur. Land owners of block seven are awaiting notification for acquisition to be published in the gazette.\n\nAAI officials have also asked the authorities concerned to fix a realistic price for the lands, else the land acquisition would get delayed. The officials also pressed for speedy disbursal of compensation after the rates were fixed.", 
    "section": "national", 
    "title": "Land owners to petition Prime Minister", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}