{
    "author": [
        "Vasanth Srinivasan"
    ], 
    "text": "For all the heat and controversy that pre-election opinion surveys and exit polls manage to generate, the political research market in India still appears very nascent.\n\nIn Western countries, pre-poll and exit surveys form just a small part of the bouquet of services that specialised research agencies offer including, political party positioning, candidate and constituency profiling, public opinion shaping and weekly performance tracking of sitting legislators.\n\nThis lack of scientific approach to polls could sometimes make all the difference between winning and losing, particularly in an election where there are no clear winners or where there is no singular dominant political theme. For instance, in the 2011 Assembly elections, the margin between the winner and the loser in as many as 16 constituencies was less than 3,000 votes, with the lowest being 202 (Egmore).\n\nIt is fair to assume that with a continuous data-driven approach to polls, the results in some of the constituencies could have been different.\n\nYashwant Deshmukh, Founder of Center For Voting Opinions and Trends in Election Research, says that on the one hand, the political leadership in India does not understand the importance of data, and on the other, whenever it uses the data it “pollutes” (the data) to support its line of action.\n\n“Every political party has its own factions, and each faction tries to churn up some numbers to get a ticket for its candidate.\n\n“The other problem is everyone here is only interested in the number of seats that a party would win. We just do extrapolation and there is no foolproof way of converting vote share into number of seats unless you poll in every constituency. What research could do is spot a trend,” Mr. Deskhmukh explains.\n\nSurprisingly, regional parties are said to have a better data culture compared to national parties, a fact which he attributes to their no-nonsense, centralised leadership which puts winning above everything else.\n\nIt is in this context that the work of the likes of Prashant Kishor, who successfully handled the election campaigns for both Prime Minister Narendra Modi and Nitish Kumar, assumes importance.\n\nIt is perhaps the first signal from the political class that it is ready to listen to professionals who can squeeze strategy from statistics.\n\nLack of scientific approach to polls could sometimes make the difference between winning and losing", 
    "section": "national", 
    "title": "Looking for that data edge", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}