{
    "author": [
        "Annie Philip"
    ], 
    "text": "Reconstruction can set precedence for heritage reconstruction projects in the country\n\nThe proposal to reconstruct the iconic Mairie building in Puducherry following its collapse in November 2014 has set the stage for a new debate on the methodology and the materials to be adopted, which could form a template for similar projects in the country, say stakeholders.\n\nBuilt in 1870-71, the Mairie, considered a symbol of French colonial power, has served as the Town Hall, office of Mayor of Pondicherry, the local Assembly, the Municipal Council, and as Registrar of Births and Deaths, besides being witness to several key events in the political history of this coastal town.\n\nA restoration project of the government with a financial assistance of Rs. 7.5 crore from the World Bank had begun just days before the collapse of the building. The World Bank agreed to continue support and lend assistance to the reconstruction of the Mairie.\n\nThe reconstruction has now sparked a debate among stakeholders and decision makers in the State-Level Heritage Conservation Advisory Committee (SLHAC), dividing opinion on whether to use the traditional brick and lime-mortar construction as in the original or reconstruct the Mairie as a Reinforced Cement Concrete (RCC) framed structure with a new foundation. While the proposal for reconstruction by the Indian National Trust for Art and Cultural Heritage (INTACH), Puducherry, chapter recommends using traditional materials, the proposal by the Public Works Department recommends an RCC structure.\n\nExamples of reconstruction\n\nSays S. Kothandaraman, Professor of Civil Engineering Pondicherry Engineering College and member, SLHAC, “If appropriate specifications are drawn and construction procedure is followed, the safety, serviceability, ductility, durability and sustainability of the RCC structure could be ensured simultaneously. Modern building materials are flexible to accommodate any desired form, shape and finish. Today, we have enough trained artisans with expertise on material for heritage finish. With the blend of the above, the Mairie could be given a robust rebirth for the benefit of Puducherrians.”\n\nOn the other hand, those in favour of traditional materials cite the example of the 55 Window Palace in Bhaktapur, Nepal, which suffered immense damage in an earthquake in 1934.\n\nIt was rebuilt, and then once again reconstructed in 2006 using traditional craftsmanship reviving not just local traditional crafts but the local economy as well.\n\nThey also cite the St Mark’s Campanile, Venice, which was destroyed and rebuilt multiple times. Closer home, they cite the reconstruction work of a palace in Anegudi near Hampi, Karnataka, involving architects Nilesh Thakkar and Ravi Gundu Rao, using lime mortar and Madras terrace roofing. “Puducherry itself is not new to restoration using traditional materials as seen with Aayi Mandapam, poet Subramanya Bharati’s museum and the Old Court building,” says A. Arul, senior architect, INTACH.\n\nAccording to SLHAC member and architect Devangi Ramakrishnan of Urban Design Collective, “There are many examples around the world of adaptive reuse of heritage buildings that successfully incorporate modern infrastructure with traditional building techniques.”\n\nA meeting on the future use of the Mairie building, attended by architects, residents, students, INTACH and civil and cultural organisations, arrived at the consensus that the Mairie should be a multi-functional site, active and accessible throughout the year, with public and cultural events.\n\nSunaina Mandeen of citizens group, People for Pondicherry’s Heritage, says that materials used in a building contain ‘atmosphere’ and are not ‘dead.’\n\n“This is a landmark of our French heritage. It has to be reconstructed with traditional materials following the original design which is in keeping with ASI guidelines, keeping in mind its adaptive reuse,” says Ms. Mandeen.\n\n“The Mairie, if reconstructed using long-lasting traditional materials, can be an example and legacy for projects in other places,” says Mr. Arul.\n\nThe reconstruction of the Mairie poses not just a challenge, but the opportunity to set precedence for future heritage reconstruction projects across the country.\n\n‘Puducherry not new to restoration using traditional materials as seen with Aayi Mandapam’", 
    "section": "national", 
    "title": "Mairie poses challenge and opportunity", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}