{
    "author": [], 
    "text": "It will ENSURE more student participation\n\nV. Poornakala, a second year student of a city college, went to the institution on Tuesday to participate in the Republic Day celebrations. She was one among the 15 of the 50 students in her class who did so. “I attended the flag hoisting ceremony because I wanted to do so.”\n\nSaundarya Lakshman, a first year student of another college, chose to remain at home to watch the Republic Day parade and celebrations in New Delhi. “I did so because I have never had an opportunity to watch the parade on Raj Path all these years.”\n\nThere were many students who did not go to college. Colleges give the freedom to students, who exercise it by doing what they like the best, says M. Logesh Anand, a first year student.\n\nMr. Anand went to his alma mater, attended the Republic Day function there and also caught up with his teachers, juniors and best buddies.\n\nThe students say that in colleges, national functions like Independence Day, Gandhi Jayanti, etc. come with freedom to attend or not to and the students choose what suits them.\n\nIn schools they did not have a choice because they would most be participating in one event or the other and attendance was must.\n\nBut should participation be made compulsory? Ms. Poornakala says that some amount of discipline is necessary because it is on such occasions that students get to know more about their nation and also showcase their patriotism.\n\nMay be not, says Ms. Lakshman. There are numerous other ways where one can be patriotic. She and her college friends have begun planting saplings to green the campus to celebrate Republic Day. This too is a patriotic act.\n\nCollege faculty on condition of anonymity say that celebration of national days does have significance and students must attend. But, for that to happen, institutions should make the events more innovative and interesting.\n\nKarthik Madhavan", 
    "section": "national", 
    "title": "Making programmes interesting", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}