{
    "author": [
        "Sunitha Sekar", 
        "R Sujatha"
    ], 
    "text": "CMRL’s land acquisition notice to Sir Theagaraya College draws flak; students protest\n\nStudents of Sir Theagaraya College in Old Washermanpet staged a road roko on Wednesday against the Chennai Metro Rail Limited’s (CMRL) efforts to acquire land from the college. The students raised slogans and demanded that the college not be apportioned off.\n\nSir Theagaraya College was built on five acres of land donated by the Sir Pitti Thyagaraya family in 1937. It was initially a school which was elevated to a college in 1950.\n\nCollege authorities said they had held discussions 20 days ago with the deputy collector and the district revenue officer and had refused to part with land as it was an educational institution. The CMRL is extending the rail link by 9 kilometre from Mint to Wimco Nagar. The phase I extension of Chennai Metro Rail from Washermanpet to Wimco Nagar is estimated to cost about Rs. 3,000 crore, running underground from Washermanpet to Korukkupet and then continuing as an elevated corridor.\n\nThe principal said: “On Saturday, when we were not there, the land acquisition officer pasted a notice, saying it has taken 1,12,000 sq. feet land for temporary/permanent use. They have asked us to reply within a month. The notice is for three acres.”\n\nAccording to college officials, acquisition will not only prevent access to the zoology and botany blocks but also result in the demolishment of physics and commerce blocks. The institution has 2,500 students, 85 per cent of whom are on SC scholarship.\n\nP. Kumarasamy, secretary and correspondent, Sir Theagaraya Chetty Educational Institution, said: “We are not going to give (theland). The institution was started to educate people in this area.”\n\nMeanwhile, Metro Rail officials said they had forwarded the requests for land acquisition to the State government in various areas along the stretch from Washermanpet to Wimco Nagar.\n\n“There is no choice but to ask for some area of land from the college. Instead of acquiring lands from residents we thought we could ask permission for this one since it is huge,” an official said.\n\nHe added they have floated tenders for the underground stretch sometime back and will do it again for the elevated corridor soon.\n\nThough the State government gave its approval for this project in 2010 after the soil tests the Ministry of Urban Development had only recently forwarded it to the Finance department.", 
    "section": "national", 
    "title": "Metro on a collision course with college", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}