{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "The tie-up that the National Handloom Development Corporation Ltd., Union Ministry of Textiles, has entered into with two Bengaluru-based e-commerce firms: Chasing Sun and GoCoop, envisaging broad-basing of the market to global customers is expected to enhance the returns substantially for the weaving community in Chennimalai town.\n\nThe cooperative societies have been selling bed spreads, towels, and other products for a modest profit margin.\n\nCo-Founder of Chasing Sun Vineeth Ravindran said the company was a platform for the cooperative societies to showcase their products to an expanded customer base, secure much higher returns, and route the monetary gains directly to the manufacturers.\n\nThe advantage for the cooperative societies is that their products are sold by the e-commerce companies to customers throughout the country and in other countries in their respective brand names.\n\nMr. Vineeth said the cooperative societies would be exposed to the methodology of photographing the images of their products for effective showcasing and strong packaging in order to avoid possible damages in transit.\n\nThe money will be transferred to the societies within seven days of despatch, Mr. Vineeth said.\n\nAccording to Siva Devireddy, Chief Executive Officer of e-commerce portal GoCoop, a product manufactured for Rs. 1,000 by the Cooperative Societies is sold for as much as Rs. 4,000 to Rs. 5,000 at the retail end.\n\nWhile the societies have been restricting their margin to 8 per cent to 12 per cent, the retailers and traders made huge profits to the extent of 200 to 300 per cent.\n\nThrough the tie-up, a chunk of the profits could be realised by the societies themselves, he explained recently at the time of the signing of the agreement with the NHDC.\n\nGoCoop, he said, has similar tie-ups with 35 apparel clusters throughout the country, and was pursuing a goal to empower 10 lakh weavers in the next five years.", 
    "section": "national", 
    "title": "More margins for handloom cooperatives", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}