{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: Madhivannan, Shreeradi Sai Temple, 16{+t}{+h}St., Thillaiganga Nagar, Nanganallur, 6.30 p.m.\n\nMahabharatham: B. Sundarkumar, Asthika Samajam, Venus Colony 1{+s}{+t}St., Alwarpet, 6.30 p.m.\n\nGita: R. Aravindan A1 118/18, Creation Ragas Apartments, 8{+t}{+h}Main Rd., Anna Nagar 6.45 p.m.\n\nNarayaneeyam: Damal Ramakrishnan and Perundevi, Ayodhya Mandapam, Arya Gowda Rd., West Mambalam, 7 p.m.\n\nKenopanishad: Suprajnananda, Ramakrishna Math, Mylapore, 5.30 p.m.\n\nNamasangeerthanam: Jayatheertha, Sri Krishna Gana Sabha, T. Nagar, 6.30 p.m.\n\nVanchi and War: K. Venkatesan, Kanchi Shri Krishna College of Arts & Science, Kilambi, Kancheepuram, 11 a.m.\n\nGENERAL\n\nDepartment of Media Science CEG, Anna University and UNICEF: Presentation of award for the community radio programme and short film on ‘Hand Washing and Sanitation’, Guindy, 3 p.m.\n\nValliammai Engineering College: Lecture on ‘Combined Reconfiguration of a Microstrip Antenna’, Kattankulathur, 9 a.m.\n\nHindustan College of Arts and Science: Inter-Collegiate cultural fest ‘Hindotsav 2k16’, Rajiv Gandhi Salai, Kelambakkam, 9 a.m.\n\nThe Chartered Accountants Study Circle: Discussion on ‘Practical Approach to Assessment’, Prince Arcade, Cathedral Rd., 6.30 p.m.\n\nSt. Peter’s University: Inauguration of awareness programme on disaster management for school students, Avadi, 9 a.m.\n\nGuild of Service (Central): Inauguration of Mary Clubwala Jadhav memorial Block, Casa Major Rd., Egmore, 5 p.m.\n\nMedical Research Foundation: Dr. Nagamani Dharmapuri endowment lecture on ‘How and what we learned from Studying Nystagmus in Infancy & Early Childhood’, Sankara Nethralaya, College Rd., Nungambakkam, 5.30 p.m.\n\nSree Ayyappa Bhaktha Sabha: Inauguration of 5{+t}{+h}Srimad Bhagavatha Dasaha Sathram, Mahalingapuram Ayyappan – Guruvayurappan Temple, Nungambakkam, 5 p.m.\n\nKumara Rani’s Chettinad Vidyalaya: Annual day celebration, Kumararajah M.A.M. Muthiah Hall, Chettinad Vidyashram, R.A. Puram, 5 p.m.\n\nVidya Matriculation School: Cultural programme, Kamarajar Arangam, Teynampet, 4 p.m.\n\nSri Krishna Sweets and Uravu Sangam: Sigarathai Thotta Sivasankari programme, Bharatiya Vidya Bhavan, Mylapore 6.30 p.m.\n\nYMCA Royapettah Toast Masters Club: Meeting, West Cott Rd., Royapettah, 6 p.m.\n\nNarcotics Anonymous: Meeting, Keep It Simple Group, St. Joseph High School, Vepery High Rd., Vepery, 7 p.m.\n\nAl-Anon: Meetings, Divine School, Perumal Koil St., Pudur; CSI Inbarasu Aalayam, Tollgate; Puthiya Shakthi Group, Ezhil Nagar 3{+r}{+d}St., Kodungaiyur; Santhome Boys HSS., Santhome; and Philomina MHSS., Injambakkam, 7 p.m.\n\nAlcoholics Anonymous: Meetings, Church of Christ, Anna Nagar; Chennai School, Arunachalam St., Chintadripet; Victory Child Development Centre, Muthalamman Koil St., Selaiyur; Church of Victorious Cross, Jawaharlal Nehru Salai, Ashok Nagar; St. Joseph Church, Cholapuram Rd., Ambattur; St. Sebastian Church, Madhavaram; Ganapathy Sachidananda Ashram Hospital, Baby Nagar, Velachery; C.S.I. Church, Thiruvottiyur; and Christ Church, Porur, 7 p.m.", 
    "section": "national", 
    "title": "MRR/CHENNAI TODAY FOR JANUARY 28 (THURSDAY) FOR CHENNAI CITY FOR PAGE 4", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}