{
    "author": [
        "B Kolappan"
    ], 
    "text": "As doubts are raised over the quality of the seeds and saplings distributed for cultivation in rooftop gardens, the Horticulture Department clarified that the seeds were improved and hybrid varieties resistant to diseases.\n\n“There is a campaign in the social media that we have distributed genetically modified seeds. It has no basis. We have distributed hybrid varieties as per order issued by our department as farmers in the State have been using only hybrid varieties,” said L. Sitherasenan, director, Horticulture and Plantation Crops.\n\nThe department has selected short duration and nutritious vegetable crops including bhendi, bush type lab, radish, palak, coriander, arakeerai and thandukeerai for “Do it yourself” scheme aimed at promoting vegetable cultivation in urban areas.\n\nSeeds of bhendi, bush type lab, ‘arakeerai’ and ‘thandukeerai’ were procured from Tamil Nadu Agricultural University (TNAU) while coriander, palak and radish seeds were sourced from private sector. ‘Arakeerai’ can be harvested in 30 days, ‘thandukeerai’ in 40 days, radish in 45 days, palak in 35 days and coriander in 30 days.\n\n“They are less prone to pests and diseases. Some pest and diseases which infect in early stages of the crop can be managed by organic control measures,” Mr. Sitherasenan said. Among the vegetable crops selected for this scheme five vegetable crops are improved variety.\n\nThe hybrid radish is also a short duration crop and may not require pesticides and fungicides.\n\nBhendi hybrid released by TNAU is resistant to Yellow Vein Mosaic virus and does not require much pesticide to control the vector.\n\n‘We have distributed hybrid varieties as per order issued by our department’", 
    "section": "national", 
    "title": "‘No genetically modified seeds in rooftop garden scheme’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}