{
    "author": [
        "K Lakshmi"
    ], 
    "text": "The number of cool days in January is also coming down in the city —Photo: K.V. Srinivasan\n\nMaximum temperature has remained above normal in January over the past three decades\n\nThe winters in Chennai, a coastal city, are usually short. The increase in day temperature over the recent decades seems to have further shrunk the number of cool days in winter, observe meteorologists and weather bloggers.\n\nThe city is growing warm during January, the coldest month, as the maximum temperature has remained above normal in the past three decades. While Chennai’s average day temperature during January is 29.1 degree Celsius, the city has been experiencing warmer weather as the maximum temperature has been steadily hovering over 30 degree Celsius, according to data of Meteorological department and weather bloggers.\n\nThis January too has had many warm days as the day temperature stayed close to 30-31 degree Celsius owing to the south-easterly winds.\n\nK. Srikanth, who blogs at Chennaiyil Oru Mazhaikalam, said: “Winter in Chennai is getting warmer in the recent decades. The day temperature has been steadily on the upward trend, touching even 31 degree Celsius in some years since 1999. The average minimum temperature too has been around 19-20 degree Celsius unlike the 1990s when it dipped below 18 degree Celsius.”\n\nHe had analysed the data obtained from Climate Change Institute, University of Maine, USA between 1979 and 2015 using the Climate Forecast System Reanalysis model. Meteorologists note that the mean maximum temperature has not dipped below 28 degree Celsius since 1986 at Nungambakkam and Meenambakkam. Generally, Meenambakkam records colder temperature level as it is away from the sea.\n\nCiting IMD data between 1969 and 2015, Y.E.A. Raj, former deputy director general of meteorology, Chennai said: “If we have 20 degree Celsius as a threshold for night temperature, the city has not witnessed many cold days after 1999.”\n\nThere has been a sharp dip in the number of cold days when Chennai used to record below 19 degree Celsius. Long-time residents would remember the city being cold for at least a fortnight during 1970s. Since 2000, Chennai hardly has five or six days when the temperature dips below 19 degree Celsius.\n\n“The day temperature level going above average by 0.8 degree Celsius to one degree Celsius may look normal. But, it is enough to indicate that the city is getting warm during winter months,” he said.\n\nMeteorologists and weather bloggers cite urban heat island effect as a reason for the steady increase in the day temperature. “Increase in traffic, less green cover and rapid urbanisation particularly around the weather observatories could be the reasons,” he added.", 
    "section": "national", 
    "title": "Now, winter in Chennai is warmer too", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}