{
    "author": [
        "Special Correspondent"
    ], 
    "text": "‘Government has an alternative plan, in case fishermen refuse to lend boats’\n\nThe district administration discussed the arrangements for Katchatheevu pilgrimage for the annual festival at St Anthony’s Church, scheduled to be held on February 20 and 21, notwithstanding the fishermen’s decision to boycott the function and not to lend their boats.\n\nRevenue Divisional Officer (RDO) Rama Pradeepan chaired a meeting at the taluk office here on Wednesday and discussed the arrangements with Verkodu Parish authority, which was coordinating the pilgrimage and representatives of various security agencies such as Intelligence Bureau (IB), Indian Coast Guard (ICG), Indian Navy, Q Branch police and the district police, represented by the local Deputy Superintendent of Police (DSP).\n\nWhen Rev. Fr. L. Sahayaraj, Verkodu Parish Priest, the chief coordinator of the pilgrimage, raised the fishermen boycott issue, the RDO said that the district administration had taken up the matter with the government and assured the meeting that the impasse would be broken before the pilgrimage started on February 20.\n\nThe fisheries department and the IB also exuded confidence of finding a solution, the Parish Priest said.\n\n“They assured to convey a favourable reply in the first week of February,” Fr. Sahayaraj said.\n\nThe government had also chalked out an alternative arrangement in the event of fishermen refusing to lend their boats, but the officials did not disclose the arrangement, he said.\n\nThe RDO, however, clarified that ‘vallams’ (country boats) would not be allowed to take the pilgrims for security reasons. The RDO asked the parish authority to restrict the number of pilgrims to the maximum of 3,500 and submit all the filled-in applications to the taluk office by February 10 for security clearance, he said.\n\nAll pilgrims should bring their original identity cards and those from other States should obtain no-objection certificates from the respective police stations, he added. Sri Lankan Tamil refugees and children below 10 years of age would not be allowed for the pilgrimage, he said.\n\nThe parish had so far distributed 3,250 applications and would stop issuing applications at the end of the week, Fr Sahayaraj said.\n\nLocal fishermen were not invited for the meeting, which went on for an hour.", 
    "section": "national", 
    "title": "Officials discuss arrangements for Katchatheevu pilgrimage", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}