{
    "author": [
        "B Kolappan"
    ], 
    "text": "There is no date yet for the conduct of polls, and there is no clear pattern regarding political alliances. Yet, parties in the State have already swung into election mode, inviting applications from aspiring candidates.\n\nThe ruling AIADMK, the DMK, and the PMK which is projecting itself as an alternative to both the Dravidian parties, have started inviting applications.\n\n“We cannot wait for others because the EC may announce the dates in 15 days. We have always been ahead of others when it comes to releasing our manifesto and doing other election-related work,” said PMK’s chief ministerial candidate Anbumani Ramadoss.\n\nOn the possibility of erstwhile allies of the BJP under the National Democratic Alliance regrouping, following the re-election of Amit Shah as BJP president, Dr. Anbumani said the BJP and others were welcome to join the PMK alliance.\n\n“In Tamil Nadu, we will lead the alliance. All parties except the DMK and the AIADMK can join us,” he said. The PMK has received over 600 applications and 124 of them have requested Dr. Anbumani to contest in various constituencies.\n\nEven though the election is likely to witness a four-cornered contest, the permutations and combinations will be clear only after Chief Minister Jayalalithaa and DMDK leader Vijayakant indicate their stands on the issue.\n\n“Besides the stand of Ms. Jayalalithaa and Mr. Vijayakant, the realisation of the People’s Welfare Front that it cannot throw any real challenge to either the DMK or the AIADMK will also bring about changes in the alliance pattern,” said DMK spokesperson T.K.S. Elangovan.\n\nHe said his party had started the process of issuing applications as it had to carefully study the background and viability of the aspirants in all the 234 constituencies.\n\n“In the DMK, we will not pick and choose our candidates at random. All prospective candidates will be interviewed by our leader Kalaignar,” he said.\n\nWhile the DMK and the AIADMK in the past had succeeded in creating an impression that they had an edge over the other in the run-up to the elections by cobbling together an apparently winnable alliance, the situation is somewhat different now. Their potential allies, who used to accept the leadership of one of these main parties, have now formed their own alliance.\n\nThe PMK, the MDMK, the CPI and the CPI(M) have constantly changed their loyalties, shifting between the DMK and the AIADMK in the past. However, now they have projected themselves as alternatives to the Dravidian majors.\n\n“We are yet to decide on inviting applications as we are currently concentrating on our campaign on February 7, 8 and 9,” said CPI(M) State secretary G. Ramakrishnan.\n\n‘Permutations and combinations will be clear only after Jayalalithaa and Vijayakant indicate their stands’", 
    "section": "national", 
    "title": "Parties go into poll mode sans clear alliance pattern", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}