{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Both the Dravidian parties make sure that a crop of Vanniyar MLAs region-wise gets to be Ministers\n\nt is a given that caste plays a vital role in selection of candidates during elections in Tamil Nadu, with parties nurturing “heavyweights” in specific regions to strengthen their hold. The two principal Dravidian parties have strategically resorted to caste appeasement to keep at bay the attempts at intrusion by parties which have openly identified themselves with a particular community.\n\nNo other region in Tamil Nadu exemplifies this crowded “heavyweights” scene than the Vanniyar belt starting in the North and spilling over the some districts in the West.\n\nWhile the PMK has now announced Anbumani Ramadoss as the chief ministerial candidate, ostensibly expecting a surge in support from the OBC Vanniyar community, experts feel the task is cut out for the party as both DMK and AIADMK also have deep penetration in the region.\n\nPolitical commentator Ravindran Duraisamy, who was once with the PMK, contends that the fact that the party has never been able to sweep the Vanniyar belt, containing over 80 Assembly seats, in any election was proof enough for the strength of the two Dravidian outfits in the region.\n\n“Both the Dravidian parties make sure that a crop of Vanniyar MLAs region-wise get to be Ministers. This helps retain local patronage,” he adds. While DMK has senior leaders like Durai Murugan, M.R.K. Panneerselvam and T.M. Selvaganapathy, the AIADMK government Cabinet at present has Vanniyar names such as M.C. Sampath and K.C. Veeramani.\n\nThe situation is such that multiple parties field Vanniyars in the same constituency, eating into the PMK’s pie.\n\nFurther, there was also the presence of other OBC groups as Udayars and Gounders in the Northern districts who become decisive voters in a close contest. Here too, the Dravidian parties have covered ground with prominent leaders like K. Ponmudy holding fort in Villupuram.\n\nR. Manivannan, Professor of Politics at the University of Madras, says this would be the first time the PMK could contest alone in the past 20 years. “In consecutive elections, they have enjoyed the support of the two major Dravidian parties, which too have a strong presence in the Vanniyar belt. Now we have to see if they could win big,” he adds.\n\nAlso, Mr. Manivannan says the situation was unlike any the PMK has encountered in the recent elections. “In the 1990s and early 2000s, they became sympathetic to the Dalits and got a section of the community’s votes by holding hands with the VCK. Dalits are the other majority in this region. Without their support, it will be difficult for the PMK since both the DMK and AIADMK have significant presence in that community,” he feels. Adding to this is the emergence of other smaller caste-based political groups for Udayars and Gounders which has hindered the PMK from cobbling together a larger OBC movement.\n\nPMK spokesperson K. Balu, however, insists that majority of the Vanniyar community identify themselves with the PMK since it was the party that had traditionally taken up crucial issues affecting the people.\n\n“First, we do not see people as Vanniyars and others. For us, the idea is to ensure the issues of the majority are well represented. But we fight for all people,” he said.", 
    "section": "national", 
    "title": "PMK may find it tough in its own terrain", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}