{
    "author": [
        "Deepa H"
    ], 
    "text": "K. T. Ravindran, conservation architect, has strongly come out in favour of conserving the Mairie using traditional materials that will last and not fake history by using cement concrete.\n\nIn an interview to The Hindu , Mr. Ravindran, who also chairs INTACH’s Architectural and Heritage Advisory Committee, says: “We know that for 145 years this building has stood with lime and brickwork. And we all know that concrete has a limited life, cement undergoes a molecular change after 60 to 80 years.\n\nIn a saline moist environment, it could be shorter. The PWD should seek expertise in the reconstruction rather than take a shortcut and do a historical error, which will then crumble in 60 years.”\n\nAs a person, who has a long connect with the town, he says, “if we think we can recreate the building using cement and concrete, it reveals a disease in our system. The moment you start faking, you are not conserving, you are just trying to tell a lie in history. That is something should not be acceptable to any citizen who has any sense of pride about the history of the place.”\n\nThe building that will be reconstructed from the old foundations can be adapted to new uses.\n\n“The first principle is that the building should be seen as a public asset with public access, in which the people can enter, interact and consider as one their assets. It should not become an exclusive domain like a hotel or a government office that is closed down. It is a city asset that should not be destroyed by privatising its use,” Mr. Ravindran says.\n\nThe second principle is that when you introduce toilets and kitchens, you have to be extremely cautious because water is the biggest enemy to any construction. Very often in these adaptive reuse buildings, these things are thoughtlessly added and it ruins the structure. The third principle is that if they want to air-condition the building — it was not an air-conditioned building — it can be selectively done with extreme caution and without jeopardising the original aesthetics of the building.\n\nCiting examples of many ASI buildings and museums that have been partly-reconstructed and partly-restored and made good for re-use, he says that conservation-driven reconstruction of the building will be very much possible.\n\n“The traditional materials and skills are still in existence. The most critical thing is the process of preparation of the materials. Reconstruction of the building using traditional materials, including lime and brick will also offer an opportunity for PWD engineers to be trained in such techniques,” says the architect.\n\nMairie stood\n\nwith lime and brickwork over a 100 years, says INTACH member", 
    "section": "national", 
    "title": "PWD should seek expertise: INTACH", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}