{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Nettukuppam and Thalangkuppam are under threat from the advancing Bay of Bengal\n\nResidents stalled traffic on Ennore Expressway for nearly three hours demanding a solution to the problem —Photo: B. Jothi Ramalingam\n\nAngry at alleged government apathy over sea erosion, residents of Nettukuppam and Thalangkuppam staged a protest on Ennore Expressway on Wednesday.\n\nFor over a decade now, residents have been living in fear of losing their homes to the advancing Bay of Bengal. Nearly 1,000 families in Nettukuppam and 2,000 in Thalangkuppam are facing this threat. Traffic came to a standstill for over three hours on Ennore Expressway as hundreds of residents gathered on the road seeking action.\n\nThough the Water Resources Department has provided seawalls till Thalangkuppam, it is not sufficient to prevent sea erosion and reclaim the beach.\n\nAdvancing closer\n\nA. Kumar of Nettukuppam, said the sea is advancing closer to the hamlets every day. In the last one year alone, the sea has inched closer by 50 metres. The problem has worsened after the northeast monsoon. The Ennore estuary mouth has become wide after the recent floods and the sea is advancing in the unprotected hamlets.\n\nResidents charged that it has been over three years since the Water Resources Department proposed to construct groynes, structures that are perpendicular to the shoreline, near the Ennore creek to retrieve the lost beach. The Rs. 32-crore project involves construction of 10 groynes for a stretch of two kilometres near the creek but it has been put on hold due to the delay in getting clearance from Union Ministry of Environment and Forests.\n\nOfficials promise action\n\nResidents dispersed after WRD officials assured them of action to prevent sea erosion. Sources in the WRD said the MoEF has communicated that it would approve the project along with the comprehensive shoreline management plan.\n\n“We are planning to seek direction from the National Green Tribunal to construct at least three groynes on emergency grounds. Groynes are the only solution now to control wave action near the creek,” an official said.\n\nProtesters demand immediate construction\n\nof groynes to reclaim the beach", 
    "section": "national", 
    "title": "Residents seek action on sea erosion", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}