{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The former CBI Director R.K. Raghavan has expressed concern over the “alarming drop in integrity levels” among civil service officers.\n\nDelivering the Rajaji Memorial Endowment Lecture on “Maintaining Integrity in Public Services” at the National College here on Wednesday, he said recent happenings at high places in the senior civil services were a matter of concern.\n\nSardar Vallabhai Patel, who was the first Home Minister of the country, pioneered the creation of the Indian Administrative Service and Indian Police Service as successors to the Indian Civil Service and Indian Police after Independence. He said these two services would lend stability to the nation, as they provided a honest administration to the common citizen. The first objective had been reasonably fulfilled. The second objective remained a dream.\n\nWhile a majority of the IAS officers had been a model of probity, the same thing could not be said of the rest, who, though in a minority, accounted for a significant number, he said.\n\nMr. Raghavan said there was perception that enormous political corruption was a cause for civil service corruption. It was only partially true. It was undeniable that some IAS and central officers had been pliable and willing accomplices to corruption in high places. This had to change swiftly. Only then the country could hold its head high in the comity of nations.\n\nWhile terming the corruption at the cutting edge level was “equally disturbing”, he said the offices of tashildar and the police station were two fundamental units of administration. If these were transparent centres, where all services were provided without expectations of illegal gratification, the country would win half the battle. “We are still looked upon as a nation where corruption starts from birth and lasts until one reaches the grave. The charge is that one has to grease somebody’s palm to obtain a birth certificate as well as a death certificate,” Mr. Raghavan.\n\nPaying rich tributes to Rajaji, he said he was unique in many ways. He never chased offices. He was a man for the crisis, and hence, public office chased him. He steered the administration in most difficult times. There was so much to learn from his life for the current generation.\n\nK. Raghunathan, secretary, and K. Anbarasu, principal of the college, participated in the programme.", 
    "section": "national", 
    "title": "R.K. Raghavan laments drop in integrity levels", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}