{
    "author": [
        "M K"
    ], 
    "text": "Road accidents have claimed more than 4,000 lives last year in West Zone comprising Coimbatore rural, Salem rural, Tirupur rural, Nilgiris, Erode, Namakkal, Dharmapuri and Krishnagiri districts. .\n\nStatistics from the office of the Inspector General of Police (IG) for West Zone shows as many as 4,129 persons were killed in road accidents in 2015, against the 3,869 in 2014.\n\nCoimbatore District (excluding the city) recorded 725 accident deaths in 2015 against 703 in 2014. There was a drastic drop in the number of deaths in Dharmapuri from 377 in 2014 to 291 in 2015. The other district to record a drop in accident was The Nilgiris, where it went down from 61 in 2014 to 46 in 2015.\n\nSpeeding vehicles on the vast stretch of national highway connecting Tamil Nadu with Kerala was cited as one of the reasons for most accidents in Coimbatore District. While deaths came down by around 21 in the city due to a chain of measures such as enforcement of wearing helmets, not much was done in the outskirts.\n\nDistrict police officers cite inadequate police force as a major reason for the inability to enforce road rules strictly. There are only two traffic teams – one each in Mettupalayam and Pollachi – with the district unit, against the dedicated team of 250 personnel led by a Deputy Commissioner in the city.\n\nSuperintendent of Police (SP) of Coimbatore District R.V. Ramya Bharathi said that the police led by the Deputy Superintendent of Police (DSP) of all the five sub divisions were conducting a study on the accident zones under their jurisdiction. “The DSPs have been asked to come out with a practical solution to reduce accidents,” she said.\n\nCameras\n\nThe police were also working on a proposal to fix cameras at main pockets to monitor hit-and-run accidents in which the vehicles involved in accidents go uncaught.\n\nThe police were also in the process of forming special teams that would separately register cases against persons involved in driving under the influence of alcohol, using mobile phones while driving, rash and negligent driving during the peak hours and non-peak hours.\n\n“Focus will be on registering cases at night as most accidents take place after dusk,” the SP said.", 
    "section": "national", 
    "title": "Road accidents claimed over 4,000 lives in West Zone last year", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}