{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "Headmasters and teachers of government high and higher secondary schools in the district are well into implementing a plan of action to regain Erode’ primacy in overall pass percentage at the State-level in SSLC and Plus Two public examinations.\n\nLast year, the district retained the top position in SSLC overall pass percentage, but was ranked third in Plus Two. In the previous year, Erode had recorded top performance in Plus Two as well.\n\nA review of the performance of schools that had scored below 80 per cent overall pass was carried out last year. The district’s Plus Two performance had come down last year because of the less than expected scores in History, Economics and Commerce. This time, special attention has been accorded for these subjects, Chief Educational Officer P. Ayyannan said.\n\nThe department had convened a series of meetings with headmasters and subject teachers in recent months to conceive and execute the plan of action. Accordingly, the department has reached out to almost all slow learners in government schools by providing them minimum material prepared by experienced subject teachers.\n\nLikewise, to secure State-level ranks in SSLC, 100 first-rankers at the school level were chosen, early on during the academic year, in each of the two educational districts: Erode and Gobi, for special coaching during weekends, under Rastriya Madhyamik Siksha Abhiyan.\n\nMoreover, top-scorers in general, were being engaged in morning and evening special classes at the individual school level.\n\nAnother reason why the expectation is more this year is the posting of additional teachers for filling vacancies during this year. Presence of full complement of teachers will particularly deliver positive impact in schools in remote hilly locations in the district.\n\nThe department’s focus, more or less, has been on government schools. As for the private schools, they have also been preparing students on an even keel, the CEO said.", 
    "section": "national", 
    "title": "Schools primed to assert supremacy in overall pass percentage", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}