{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Department of Horticulture has appealed to farmers to construct ‘pack houses’ for cleaning, grading and packing their produce so as to get the right price for farm products.\n\nFarmers can get the right price for their produce only if it is clean, graded and packed properly. Since most of the farmers are not aware of these things and are getting very low price even during the ‘peak season’, the Department of Horticulture has come to their rescue by providing 50 per cent subsidy, to a maximum of Rs. 2 lakh, under National Horticulture Mission (NHM) for grading and packing the farm produce in an attractive manner.\n\nThe NHM, which was introduced with the objective of increasing the area of cultivation and thus increasing production, also provides room for carrying out ‘project activities’ such as ‘pack house’ with which the farmer can get the right price for his produce.\n\nA ‘pack house’ can be used for temporarily storing, cleaning, grading and packing the farm produce. The ‘pack house’ should be 30 feet in length and 20 feet in breadth with a minimum surface area of 600 sq. m having galvanized iron, asbestos or concrete roof. It should have cement flooring, six windows and two double doors.\n\nEquipment such as weighing machine (to weigh up to 300 kg), grading table with provision to drain water, plastic or cement tubs, overhead or synthetic water tank with 2,000 litre capacity, etc. should be provided.\n\nAfter inspection by a team of officials, it will be recommended for subsidy.\n\n“Four ‘pack houses’ have been constructed in the district. Farmers, who want to get the right price for their produce, should construct a ‘pack house’, clean the produce and pack it in an appropriate manner,” said an official.", 
    "section": "national", 
    "title": "Subsidy for ‘pack house’ under National Horticulture Mission", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}