{
    "author": [
        "Staff Reporter"
    ], 
    "text": "People-friendly initiatives\n\nThe Union Government has announced three people-friendly measures for ease in appointment and verification of passport issuance.\n\nPassport applications for fresh applicants furnishing their Aadhaar Card, PAN card, Electoral Photo Identity Card and an affidavit in the form of Annexure-I, will be processed on Post-Police Verification basis without any additional fees subject to successful online validation of the above documents. ‘mPassport Police App’ has been launched to capture police verification report digitally, making it a paperless process and enabling verification to be completed within the stipulated time of 21 days.\n\nApplicants can now book an appointment from the earliest five working days for the selected Passport Seva Kendra.\n\nAction taken\n\nThe labour department has taken action against a multiplex situated on Tirupur Union Mill Road for selling water bottles with a maximum retail price (MRP) of Rs. 20 at Rs. 40 each.\n\nThis is in line with the department’s investigation on goods being sold at rates higher than MRP in places thronged by the public like bus stands, theatres, temples, etc., according to a press release. The department warned of legal action against all those who sell packaged commodities at rates higher than MRP.\n\nLaunched\n\nUnion Bank of India has launched the Internet Payment Gateway for the payment of water and property tax of the Coimbatore Municipal Corporation here recently.\n\nHonoured\n\nCRI pumps and No-Food Waste are some of the 50 organisations that ACC honoured for their contribution in providing flood relief in Chennai and Coimbatore. Awards were also presented to Coimbatore Corporation sanitary inspectors, supervisors and workers who helped clean the streets of a flood-hit Chennai. Awards were presented by Corporation Commissioner Vijayakarthikeyan and M. Sai Ramesh, Plant Director, ACC Madukkarai Cement Works.\n\nBranch office\n\nopened\n\nThe Edelwiess Group, which offers a range of financial products and services, has inaugurated its branch office here. The expansion is in tune with the company’s strategy to strengthen its presence in Tamil Nadu and to ensure convenience to its customers, according to a press release.\n\nInterface on exemption\n\nThe Commissionerate of Income Tax (TN & Pondicherry) and the Indian Chamber of Commerce and Industry will organise an interface on exemption, on January 28.\n\nThe programme will cover exemptions and other income tax laws. The programme will take placeat Nani Palkhivala Auditorium.\n\nWorkshop\n\nThe Department of Automobile Engineering, Kumaraguru College of Technology, along with Republic Motors,Punjab, will organise a three-day mega workshop on vehicle design and dynamics here from January 28.\n\nIt is to develop the skills of participants of International Go-Kart Championship IGC-2016 to be conducted at Lovely Professional University, SAEINDIA Collegiate Club, Punjab, in collaboration with Republic Motors, Punjab, and also for engineering students interested in design and manufacturing of Go-Kart vehicle.", 
    "section": "national", 
    "title": "TAMIL NADU", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}