{
    "author": [
        "K Manikandan"
    ], 
    "text": "Error message informs visitors that ‘tickets cannot be dispensed at the moment’\n\nA commuter gets a ticket from a new coin machine installed at Chennai Central recently —Photo: R. Ragu\n\nThe recently installed Cash/Smartcard operated Ticket Vending Machine (CCoTVM) in many railway stations in the city seem to be having ‘teething troubles.’\n\nFrequent errors making it unusable and printing of blank white sheet of paper instead of journey tickets are some complaints commuters have.\n\nOn Wednesday morning, the machine installed at Chennai Central station displayed an ‘error message’ informing visitors that it cannot dispense tickets at the moment. However, passengers did not have a problem as the manually operated platform ticket counter was functioning at the time.\n\n(The platform ticket counter was shifted a couple of months ago closer to the main entrance and was moved back to its original spot recently).\n\nSrini Swaminathan who inserted a Rs. 5 coin at the CCoTVM in St. Thomas Mount got only a blank white sheet. He then got a ticket from the counter to Chennai Beach.\n\nHe shared his experience on twitter (@srini091), tagging @RailMinIndia, the official account of the Ministry of Railways.\n\nThe Ministry in turn tagged the Divisional Railway Manager, Chennai, who replied to the tweet asking for his contact number.\n\n“I gave my phone number to them. No one got back,” Mr. Swaminathan said.\n\nSouthern Railway officials said CCoTVMs were easy to operate compared to the Automatic Ticket Vending Machines, which required commuters to swipe a smart card.\n\nCommuters can get suburban train and platform tickets apart from recharging smart cards.\n\nIt was just about a month since the new machines were installed and they were getting feedback on the errors and problems faced by commuters, they added.\n\nSoon after the machines were installed, engineers briefed the staff of the Commercial department of the Southern Railways at length about how the machines had to be operated.\n\nAll the technical defects would be sorted, officials said, and hoped the machines will function without a glitch soon.\n\nMany commuters complained that the machines printed out blank sheets of paper", 
    "section": "national", 
    "title": "Technical glitches plague newly installed ticket vending machines", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}