{
    "author": [
        "R Rajaram"
    ], 
    "text": "The airport here has decided to harness green energy for its power requirements as part of its effort to conserve power and protect environment.\n\nThe Airports Authority of India (AAI) management has given its approval for a proposal to establish a 10 mega watt capacity solar power plant at the airport. So, the airport authorities have entrusted the Bharat Heavy Electricals Limited the task of preparing a Detailed Project Report (DPR) for the power project.\n\nA team of BHEL officials from Bangalore and New Delhi inspected the airport in the first week of this month and surveyed the spot. The plan is to put in place a ground mounted solar power plant at a cost ranging between Rs. 60 crore and Rs. 70 crore at the airport.\n\nThe BHEL would shortly submit the DPR containing a host of aspects to the airport authorities, sources told The Hindu .\n\nThe plan is to complete the project by the end of the 2016-17 financial year. The plant would come up in the operational area of the airport.\n\nThe solar power would be a back up for the requirements of the airport, a unique non-metro airport with more overseas flight operations than domestic services.\n\nThe objective was not only to cut down power bills but also as an environmental protection measure, said an official. In addition to meeting the energy requirements, the excess solar power generated would be sold to the State government for which the airport authorities would sign a memorandum of understanding. The airport where passenger movement is expected to cross the 12 lakh mark by the end of the current fiscal consumes 15,000 units power per day, said the sources.\n\nThe airport which is one of the major customers of the Tamil Nadu Generation and Distribution Corporation Limited pays Rs. 50 lakh to Rs. 55 lakh per month as its power bill, said the sources.", 
    "section": "national", 
    "title": "Tiruchi airport to get 10 MW solar plant", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}