{
    "author": [], 
    "text": "RELIGION\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Ranganayaki Thayar Sannidhi, Srirangam Sri Ranganathaswamy Temple, 6 p.m.; 24, East Chithra Street, Srirangam, 7 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama nama parayanam, Sri Murugan Temple, Sathanur Main Road, 6 p.m.\n\nGovindammal Tamil Mandram : U.Thandapani speaks on Kandpuranam, Pappammal Anna Chathram, Keezha Chinthamani, 6.30 p.m.\n\nCULTURE\n\nSri Sathguru Thiagabrahma Aradhana Trust and Sri Sathguru Sangeetha Sabha : 169{+t}{+h}aradhana celebrations of Sathguru Sri Thiagaraja Swamigal, pancharathna goshti ganam, Sri Sathguru Thigaraja Bhavanam, Srirangam, 8 a.m.; guru aradhana, Kodiyalam Seshadri Iyengar Kalyana Mandapam, South Devi Street, Srirangam, 10 a.m.; vocal concert by Patthangi brothers and party, 4.30 p.m.; vocal concert by Sangeetha Sivakumar and party, 6 p.m.; violin duet by G.J.R.Krishnan-Vijalakshmi and party, 8 p.m.; Anjaneya utsavam, 10 p.m.9\n\nGENERAL\n\nThe Hindu Young World Quiz : School quiz competition, MD Hall, BHEL campus, 2 p.m.; prize distribution by G.Natarajan, Director, Postal Services, Central Region, Tamil Nadu, 4 p.m.\n\nTiruchi Corporation: Council meeting, A.Jaya, Mayor, presides, Corporation office, 11 a.m.\n\nSeshasayee Institute of Technology : Annual day celebrations, R.Mananathan, Managing Director, Manatec Group Companies, delivers annual day address, R.Gopalakrishnan, Senior Deputy Director, CPF Board, distributes prizes, V.K.Seshasayee, chairman, Governing Council, presides, 10.30 a.m.\n\nNehru Yuva Kendra Sangathan : Valediction of National Youth Corps volunteers induction training camp, S.V.Ingersoll, Chairman, Nalanda Group of Institutions, distributes prizes, Youth Hostel, near Anna Stadium, 11 a.m.\n\nUrumu Dhanalakshmi College : National seminar on Role of yoga and technology in enhancing sports performance and populace health, K.Chandrasekaran, Head, Department of Physical Education, Madurai Kamaraj University, delivers key note address, G.N.Srinivasan, college secretary, releases the proceedings, 10 a.m.\n\nBharathidasan University Institute of Entrepreneurship and Career Development and Shrimati Indira Gandhi College: Valediction of orientation training programme on promotion of youth entrepreneurship, N.Kanagasabapathy, vice president, TIDITSSIA, distributes prizes, college campus, 4.30 p.m.\n\nSeethalakshmi Ramaswami College : Seminar on History blooms out of archaeological sources, M.Jayanthi, principal, presides, 10 a.m.\n\nVetri Vinayaha College of Engineering and Technology, Tholurpatti : ISRO Space science exhibition, P.Palvannan, Deputy General Manager, Safety and Fire Services, ISRO Propulsion Complex, Mahendragiri, chief guest, 10 a.m.\n\nBishop Heber College Department of Social Work and Tiruchi Diabetes Speciality Centre: Awareness programme on diabetes, Palakkarai, 10 a.m.; programme on Moral thoughts, Panchayat Union Primary School, Pagalavadi, 3 p.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti : Seminar on Recent trends by T.K.Revathi, 5.30 p.m.\n\nDepartment of Social Welfare : Senior Citizens Day, Collector K.S.Palanisamy presides, YWCA Hall, Cantonment, 10 a.m.\n\nAIMAN College of Arts and Science for Women : Prize distribution ceremony of essay writing contest, Ahamed Hussaini, president, Jamaat-e-Islami Hind, chief guest, 3 p.m.\n\nDepartment of Information and Public Relations : Government exhibition, St.John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}