{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Just back from a trip to Andhra Pradesh and previously Odisha, Sreemathy Mohan, a resident of Chennai who works with an IT major, is now planning a trip to Coimbatore. But these aren’t just visits to merely sightsee – they are trips specifically to delve into the textiles of each region, to learn about the skills involved, to explore how fabric is made, designed and crafted into a product that eventually makes its way to a store.\n\nEven as the people of Chennai are beginning to explore textile trails both in Tamil Nadu and other parts of the country, there is a new revival of interest in the traditional weaves of Tamil Nadu, say travel agencies.\n\nA growing movement for the revival of the Sungudi sari in Madurai, vintage Kanjeevaram designs and Chettinad cotton for instance, are bringing in textile enthusiasts from across the country, said Ms. Mohan. A member of the Crafts Council of India that has been working with weavers to revive handmade Madurai Sungudi, Veeravanallur saris and Koranadu saris said a niche section of tourists made it a point to meet the artisans.\n\nOver the four years that Breakaway Tours, an experiential travel venture has been organising textile tours to Tamil Nadu, there has been a 40 to 50 per cent growth in the sector, said Shilpa Sharma, founder.\n\n“Our day trips to Kancheepuram are also very popular – we have at least one trip a month with between four to 10 tourists,” she said.\n\nWhile tourists are mostly from Mumbai, Delhi, Pune and West Bengal, there are some foreigners too, said Ms. Sharma. A trip to Kalakshetra to see Kalamkars at work, weaver interactions and visits to looms in Kancheepuram, and learning about sustainable textile in Puducherry are some of the many experiences offered to tourists, she said.\n\nUma Prajapathi of Upasana in Auroville, whose unit promotes sustainable fashion, said several tourists visited them to see their work with handlooms, organic cotton, natural fibres and khadi.\n\nChennai Magic too, conducts textile tours in Tamil Nadu and south India and this sector is increasing in popularity, said Deepa Krishnan, founder of the company.\n\n“Our clients are all overseas visitors to India and NRIs and are very interested in this. The textile tours are usually combined with exploration of other crafts too such as Athangudi tile making and bronze casting,” Ms. Prajapathi said. Chettinad and Kancheepuram are the major areas explored, she said.\n\nVisits to temples and sampling of various kinds of cuisines too are usually part of the itineraries.\n\nCooptex too is now beginning to venture into the textile trail sector, said T.N. Venkatesh, Managing Director.\n\n“In a first project of its kind, we are taking a group of textile enthusiasts on a Kovai Kora trail – to Vadambacheri and Sirumugai. This is being done solely to promote awareness of handlooms,” he said, explaining that the trail would explore the links – from the weavers to Cooptex. “There is a lot of interest in this now,” he said.\n\nThere is also a growing demand for textile trails in Chennai – especially Mylapore and T. Nagar, said Ms. Mohan. “People want to know how to shop smarter and where to get the best buys. In March, we are planning a textile trail of Mylapore,” she said.\n\n( with inputs from Deepa H. Ramakrishnan )\n\n‘There is a new revival of interest in the traditional weaves of Tamil Nadu’", 
    "section": "national", 
    "title": "TN grows as textile tourism hub", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}