{
    "author": [
        "Udhav Naig"
    ], 
    "text": "The Tamil Nadu Thowheed Jamath’s (TNTJ) decision to go ahead with ‘Shirk Ozhippu Maanadu’, a campaign against what it terms as superstitions and un-Islamic beliefs, on January 31 in Tiruchi has come in for criticism from certain sections of the community.\n\nCreate awareness\n\nTNTJ has said it would strive to raise awareness about how praying in dargahs, belief in astrology, black magic and other occult practices are un-Islamic. This has angered many Islamic groups, including Sunnath Jamath Federation of Coimbatore District (a federation of 70 Jamaths in the district) which filed a petition against TNTJ claiming that it had “hurt the sentiments” by speaking against certain mosques and other religious practices of a section of the community.\n\nWhile TNTJ’s state president Fakir Mohammed Al-Thafi maintained that the outfit is only spreading the ‘right Islam’, other Muslim outfits claimed that such a conference would only create more divisions within the community and between other religious communities in Tamil Nadu. “We are against dargah worship, astrology and other superstitious beliefs because they are not Islamic. Those who are opposing it are doing so to safeguard their financial interests and people are being exploited. We are confident that the courts and the law enforcement agencies will give us police protection and let us conduct the conference,” said Fakir Mohammaed Al-Thafi.\n\nStating that the opposing Muslim groups are right in saying that “we are trying to promote one form of Islam”, he said that the outfit is doing it because it believed that this is the right way of practicing the faith. “Just because there is a tradition, we don’t have to continue to follow it. What’s there in the Holy Koran is the right form of Islam,” he added.\n\nIndian National League leader J. Abdul Rahim said that any talk of ‘eradicating shirk’ is not possible without discussing anti-idol worship message of Islam.\n\nThameemun Ansari, general secretary, Manithaneya Makkal Katchi, made it clear that the party would not get involved or take sides in controversial religious debates taking place within the community.", 
    "section": "national", 
    "title": "TNTJ’s meet creates rift among Muslim outfits", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}