{
    "author": [
        "S Senthalir"
    ], 
    "text": "(Top) Miranda Hederson and Alister O'Loughlin of Urban Playground, London, along with members of Parkour Circle, Chennai; (below): the theatre team with children of Satya Special School during a workshop in Auroville —Photos: T.Singaravelou and Special Arrangement\n\nThe stories of train journey that excite everyone will soon come live through a performance that will be beyond your imagination. With a combination of Parkour, dance and theatre, a team from the United Kingdom (UK) will recreate the fascinating journey in a steam train from Ooty to Chennai.\n\nThe Urban Playground team from the UK, a performance-parkour company which combines French free-running with dance and physical theatre, is travelling across Tamil Nadu.\n\nThey are collaborating with Chennai-based Parkour Circle to research and experience the travel in a steam locomotive train.\n\n“The people who use the train here in this region are different from how people interact with train in UK,” says Alister O’Loughlin, co-founder of Prodigal Theatre in the UK.\n\nProdigal Theatre is an associate company of the Brighton Festival and Dome, and the Nightingale Theatre which contributes to the development of dance and theatre in the UK. Miranda Henderson, co-founder, Prodigal Theatre, adds that their performance and set will be based on the train. “Our performance is all about journeys through time and its journeys through different countries as well. We had staged a performance in UK based on the train journey of people set in World War II titled Steam. The Indian version of it will be on the steam locomotive train,” she said.\n\nTitled the Indian Steam, the Urban Playground team will actively engage with the Chennai-based Parkour Circle and youngsters in India for this show and tour it by rail in 2017. Alister O’Loughlin informed that the fusion of different styles will be used to tell the stories. “In 2017, we will return to Tamil Nadu and tread the line from Ooty to Chennai and along the way work with different groups of people to create new versions of performance which tell their stories,” he said.\n\nThey are travelling across Tamil Nadu for 40-50 hours in the two weeks of their stay in India. They are beginning the journey from Salem, move to Erode and Nammakkal to meet people. From there, they will take a train to Coimbatore up to Ooty and back to Coimbatore. Starting again from Coimbatore, they will travel to Chennai via Vellore. Along the way, they will interact with people working in the railway station and their families and engage with the youngsters. For instance, they conducted workshop with Satya Special School children in Puducherry.\n\nThe Urban Playground team also has Malik Diouf, one of the co-creators of Parkour, an activity of free running through an area in an urban space, negotiating obstacles by running, jumping and climbing. There are four core performers in the team.\n\nSlowly, they want to replace the existing performance with a new Indian performance.\n\nLater in 2017, they plan to take the Indian performers to the UK and perform a final British and Indian version to Indian Diaspora audiences there.\n\nBeginning their performance career purely on movement without any story, the Urban Playground team moved on to use the different styles to tell stories. They say that the team chose trains because everyone understands about the train including children and they can identify with the stories. The idea of performance based on train was conceptualised in 2014 and they premiered the first show in 2015.\n\n“We chose the steam train because people still have romantic connotations about this train. As soon as you present the theme to the audience, people are open to a story. It is the beginning of many stories. As performers we want to place the audience in that moment where they are open. We want to play to the things that are familiar but also take them to unexpected places in that process,” says Alister.\n\nThe British Council and Arts Council England is supporting this artistic exchange and collaboration between artists, arts organisations in India and England under this the project Re:Imagine India.", 
    "section": "national", 
    "title": "UK team plans theatre at full ‘steam’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}