{
    "author": [], 
    "text": "In 2015, the identity of 292 people killed in rail accidents in the city and its suburbs could not be established\n\nDealing with the aftermath of an accident on a railway track is often tough even for railway policemen, who have seen their share of gore. From arranging an ambulance to take the body to a government hospital to organising a post-mortem, their litany of woes is endless.\n\nIf the identity of the victim cannot be established, the task becomes even more daunting.\n\nIn 2015, there were 292 victims killed in rail-related accidents in the city and its immediate and extended suburbs, whose identity could not be established.\n\nWith shortage of space in government hospital mortuaries to preserve bodies over a long period of time, policemen bury the bodies after a proper procedure.\n\nThough the photographs of such unknown victims are widely circulated, their immediate relatives or friends do not turn up to claim them.\n\n“We preserve post-mortem reports and also bone fragments. This is for DNA profiling in case the bodies need to be exhumed under rare circumstances,” explains a police officer.\n\nAccording to official records, the maximum number of unclaimed bodies was in Egmore police limits with 66, followed by 47 at Tambaram and 42 at Chennai Central.\n\nShare autos, a major hassle for motorists\n\nShare autorickshaws encroaching upon crucial public places pose a major problem for motorists and traffic policemen alike with tussles at bus stops and other places that witness heavy traffic becoming a common a sight.\n\nEarlier this week, a few commuters at Mylapore Tank bus stop were faced with a unique problem after the driver of a share auto they had entered asked all of them to get down and instead board a bus.\n\nThe driver told all of them that he had agreed to go on the route even though it wasn’t his regular one because there were a few passengers he thought he could take, but changed his mind after seeing the bus.\n\nA long argument ensued between the passengers and the driver.\n\nWhile a few bus stops in the city have barricades which other vehicles cannot bypass, spots like these which see a heavy flow of traffic and which are not manned by traffic police need to be regulated, commuters say.\n\nAccording to traffic police, they have been manning bus stands where this has been a problem and at junctions where the autos stop abruptly to take in passengers, not keeping in mind the traffic.\n\n“The share autos however continue to do so once we move away from the spot. We are trying our best to streamline their movement near bus stops or regulate their parking,” a senior police official said.\n\n(Reporting by K. Manikandan and S. Poorvaja)", 
    "section": "national", 
    "title": "Unclaimed bodies of train victims pile up", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}