{
    "author": [
        "R Sujatha"
    ], 
    "text": "Four doctors who visited Villupuram college submitted report last month itself\n\nThe suicide of three girl students of SVS College of Naturopathy and Yoga Science in Villupuram has taken a political twist. Students staged a protest to condemn the lack of facilities at the college administration. —File Photo\n\nIf only the Tamil Nadu Dr MGR Medical University had taken cognisance of the report of an inspection team last month damning the SVS Medical College of Yoga and Naturopathy and Research Institute and acted with record speed, the lives of three girl students of the institution would not have been lost.\n\nActing belatedly on repeated complaints from the students of the college that the institution lacked in academic and physical infrastructure (besides exploiting students monetarily), the university had on December 30, sent a team of four doctors to inspect the college in Villupuram district. The very next day, the team submitted its report pointing out deficiencies including fudging of faculty records. However, the university sat on the report.\n\nAsked, why the university did not act on the report immediately or at least assure the protesting students that their complaints have been taken on record, the university Registrar P. Arumugam said, “the inspection report had come only at the end of last month and there were holidays for Pongal. Before we could take action, the matter had turned serious.”\n\nThe Registrar said a “routine inspection” was conducted at the institution on July 8 last year which revealed a few deficiencies. “Since these deficiencies were minor in nature, we had orally informed the college to rectify them and seek affiliation,” he said. The official was unable to explain how these minor deficiencies have since grown into major deficiencies in less than six months.\n\nHe also did not explain why the university continued to the list the college as an “affiliated” institution on its .\n\nMeanwhile, a series of protests were held in the city on Wednesday in support of the three girl students who were found dead .\n\nRepresentatives from organisations under the Indian medical system protested outside the Government Siddha Medical College and Hospital in Arumbakkam, and the Revolutionary Students Youth Front held all senior health officials including the health minister accountable for their death.\n\nD. Ganesan, state coordinator of the Front said the students of SVS College of Naturopathy and Yoga Science, had repeatedly complained to the Dr. MGR Medical University yet no action had been taken . “The students had complained to the then Vice Chancellor Mayilvahanan Natarajan (He was V-C between 2009 and 2012) about the lack of facilities and the exorbitant fees collected. But nothing has been done, though the college has been regularly receiving affiliation,” he said.\n\nK. Senthamizhselvan, president of AYUSH Medical Practitioners Welfare Association, which held a protest in Arumbakkam blamed the State government for the students’ death. “Every year inspection has to be done. None of the colleges for Indian systems of medicine follow the norms laid down by the Central Council. The norms for affiliation of a college are the same as that of allopathic medicine but even government colleges woefully fall short of all facilities. Right from the minister to the registrar all are responsible for the deaths,” he charged.\n\nDespite protests for the past 33 years the Tamil Nadu Board of Indian Medicine had not held any elections .", 
    "section": "national", 
    "title": "University sat on inspection report for nearly a month", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}