{
    "author": [
        "Special Correspondent"
    ], 
    "text": "For Muslim and Scheduled Caste and Scheduled Tribe judges in collegium\n\nViduthalai Chiruthaigal Katchi (VCK) leader Thol. Thirumavalavan on Wednesday demanded representation for Muslim and Scheduled Caste and Scheduled Tribe judges in the Supreme Court and High Court collegiums (comprising senior judges) which select candidates for appointment as judges in those courts.\n\nAddressing a meet organised by Madurai Bar Association–Madurai Bench of Madras High Court on the role of advocates in social issues, he said: “The collegium system is dangerous, anti-democratic, illegal and against social justice. Let there be an Indian Judicial Service to select judges like Indian Administrative Service and Indian Police Service.\n\n“However, if collegium is to continue then there must be representation for all sections of society in it. Only then, social justice could be achieved.”\n\nHe also expressed grief over 42 advocates in the State having been suspended from practicing in courts for protesting against the helmet rule and demanding introduction of Tamil as official language of the High Court.\n\n“I urge the Chief Justice to intervene in the issue and make sure that the suspension orders are immediately withdrawn,” he said amidst loud cheers. On the political front, he said decentralisation of power could be achieved in its real sense only if the marginalised get representation in ministerial cabinets and not by mere allotment of seats in the Legislative Assembly and Parliament.\n\nIn his speech, Justice D. Hariparanthaman, a known supporter of communal and caste-based reservation in higher judiciary, said that there was huge hue and cry after The Hindu quoted him to have termed all those who oppose reservations “scoundrels” while addressing the members of Madurai Bench High Court Advocates Association on January 18.\n\nPointing out that the Oxford dictionary defines ‘scoundrel’ as a dishonest person, he said that all those who objected to the word were actually unaware of its meaning.", 
    "section": "national", 
    "title": "VCK leader demands representation", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}