{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Appealing to the administration to save them from sea erosion, a group of villagers from Thillaivanathoppu submitted a petition to District Revenue Officer M.G. Kulandaivel .\n\nThe petitioners, led by M. Thillaipandi, said that sea erosion, after devouring a sand dune that had been protecting the hamlet from the menacingly advancing sea, was threatening their hamlet. As this problem would worsen during the windy season between May and September, safety of the residents and their properties would be under serious threat, they said.\n\nHence, the district administration should initiate steps for constructing groyne in their village, they also demanded.\n\nIn a petition submitted to the official, villagers from Perunkulam and Rammathapuram under Urumankulam panchayat said that the contractor identified for laying the seriously damaged five-km-long rural road between Perunkulam and Thoppuvilai had heaped the blue metal on the road and left it there for the past three months. The delay in starting the work had forced the villagers to cross this distance only on foot since the blue metal was obstructing vehicular traffic. Hence, Urumankulam panchayat administration and the contractor concerned should be ordered to start the road laying work immediately, they said. Thalavaipuram villagers said that some antisocial elements were quarrying sand illegally from the government poromboke land along the road connecting Valliyoor and Thalavaipuram via Soottupoththai in the nights using heavy equipment. Consequently, shepherds could not take their cattle to this pasture, which had been damaged, they said.\n\n“Moreover, the granite beneath the red soil is also being quarried with the help of heavy equipment. Those who oppose this illegal activity are being attacked and their properties ransacked. Hence, the Collector should take action against the illicit sand miners,” the villagers said.\n\nAnother group from Palayamkottai submitted a petition to the DRO against the proposal to construct police quarters on the ground, known as ‘Yerumaikida Maithanam’, near Palayamkottai All Women Police Station.", 
    "section": "national", 
    "title": "Villagers urge district administration to construct groyne at Thillaivanathoppu", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}