{
    "author": [
        "T Madhavan"
    ], 
    "text": "The proposal to widen the road has not taken off due to lack of coordination between the Corporation and the Highways department —Photo: B. Jothi Ramalingam\n\nResidents and traders of Kamarajar Salai and Valluvar Salai in Ramapuram complain that the traffic police have been unable to come up with proper solutions to traffic problems for many years now.\n\nValluvar Salai, Kamarajar Salai and Ramapuram Main Road, which are the only exit and entry points for motorists, are very narrow, but though four feet of clearance on road margins on both sides is available, it still becomes very difficult when two vehicles need to negotiate a spot simultaneously.\n\nPartially effective\n\nThe setting up of a traffic signal at the intersection of Valluvar Salai and Ramapuram Main Road 18 months ago was useful, but did not resolve the problem, said T. Suryanarayana, a resident.\n\n“With impatient motorists taking shortcuts, policing becomes very difficult,” he said. College buses, water tankers and light motor vehicles travel past this intersection throughout the day, he said.\n\nTraders at Valluvar Salai pointed out that as a first step, Kamarajar Salai should be widened.\n\nThis proposal has been pending due to lack of coordination between the Chennai Corporation and Highways department, they alleged. According to them, proposals were sanctioned three years ago, but the project has not taken off.\n\nChennai Corporation officials said the proposed road widening work was getting delayed due to lack of funds and they were waiting for money to be sanctioned by the Department of Municipal Administration and Water Supply department.\n\nThe proposal to widen the road has not take off due to lack of coordination between the Corporation and the Highways", 
    "section": "national", 
    "title": "‘Widening Kamarajar Salai could resolve traffic issues’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}