{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Residents relying on Vaigai dam for drinking water needs may face shortage\n\nWith no rainfall in recent days in the catchment areas and release of water for irrigation, storage in the Vaigai reservoir is fast depleting and has slipped below 50 feet (maximum level is 71 feet).\n\nAs there was good rainfall during the northeast monsoon in the region the storage level in the dam almost touched the maximum. Officials had issued flood warning thrice and instructed residents in low lying areas to move away from the river bank.\n\nHowever, the release of water for agricultural crops over an area of 65,000 hectares had led to steady fall in storage. The Public Works Department engineers said that turn system introduced for irrigation had begun a week ago, which had helped to lower the quantum of water released from the dam.\n\nGoing by last year’s storage level, the water level appeared to be comfortable now. However, the cultivable area had expanded now in the district, which may require water for irrigation for at least another six weeks before harvest, they said.\n\nMeanwhile, agriculture department officials in the district have started counselling farmers to use water judiciously. A majority of the paddy crops would require at least two more wettings. With use of technology, the yield is also expected to be high this season, they added.\n\nThe Water Users’ Association in Vadipatti block said that farm ponds and water conservation through watershed development projects had facilitated recharging of ground water table. “We are hoping to make a rich harvest this season,” Balusamy, a progressive farmer in the village, said.\n\nWhile it looks like the farmers would sail through, residents relying on Vaigai dam for drinking water needs may experience problems of shortage during April-May. However, PWD engineers said that during Chitirai, summer showers would come to their rescue.", 
    "section": "national", 
    "title": "With no rain, Vaigai dam level falls below 50 feet", 
    "subsection": "tamilnadu", 
    "date": "2016-01-28"
}