{
    "author": [
        "Serish Nanisetti"
    ], 
    "text": "Nearly 11 days after the suicide of research scholar Rohith Vemula on the University of Hyderabad campus, acting Vice-Chancellor Vipin Srivastava defended the decisions taken so far by the varsity officials.\n\nReading out from a written statement at a press briefing, he said: “The university is facing its biggest crisis since its inception in 1974.”\n\n“We have resumed administrative activities from Thursday afternoon and from tomorrow the students will return to their research labs. The students are showing signs of cooperation,” he said\n\n“The university is vast and there is a problem in communication. Today, we had three meetings, one at the School of Life Sciences, another at Shopcom area and yet another at DST Auditorium. The proposal to resume classes was put to Students’ JAC but there has been no response,” he added.\n\nEarlier in the day, a large section of students staged a protest outside the School of Life Sciences demanding that the classes resume and research labs reopen. It ended in an impasse.\n\n“Actually, the five students were not suspended. They were given an advisory not to use the hostel facilities,” said Prof. Srivastava, who has been teaching at the university for the past 36 years.\n\nAbout the demand for him to step down, Prof. Srivastava dismissed it by saying: “According to the Acts and norms of the university, the senior-most faculty member becomes the acting VC when the incumbent goes on leave. So, I cannot do anything about the demands for my removal. There is no question about me quitting.”\n\nOn the occasion, the university officials released a chronology of events that begins with the Facebook post by ABVP president N. Susheel Kumar on August 3, 2015 and the 12.30 a.m. knock on his doorstep by activists of the Ambedkar Students’ Association on August 4, 2015. This disconnects the action of the students from the narrative that it began with the funeral prayers for terrorist Yakub Memon who was hanged on July 30, 2015.", 
    "section": "national", 
    "title": "Acting V-C defends decisions", 
    "subsection": "general", 
    "date": "2016-01-29"
}