{
    "author": [
        "Radhakrishnan Kuttoor"
    ], 
    "text": "Kerala’ s second largest river, Pampa, has turned into a pool of filth during the last lap of the just-concluded annual Makaravilakku pilgrim season.\n\nThe pollution has crossed all permissible limits, posing alarming health risk to the multitude of pilgrims taking their customary holy dip as part of the pilgrimage as well as the five million population residing on the riverbanks up to Kuttanad. And not to speak of its ill-effects on the flora and fauna in the Periyar Tiger Reserve.\n\n‘Criminal negligence’\n\nThe daily monitoring of the river by the Kerala State Pollution Control Board (PCB) at Sabarimala and Pampa on the directions of the Kerala High Court has exposed the criminal negligence on the part of the authorities concerned in checking the river pollution this year too.\n\nThe PCB analysis has found the total count of coliform bacteria in every 100 ml of water in the Pampa at 5,50,000 where as that of the Njunangar stream that carried all sorts of filth from the Sannidhanam at 5,70,000 on the Makaravilakku day on January 15. This is against its maximum permissible number of 500 for every 100 ml of water for bathing purpose, says Paulus Eapen, District Environmental Engineer.\n\nThe faecal coliform count in the Pampa and the Njunangar was 4,60,000 and 4,80,000 respectively in every 100 ml which, according to Mr. Eapen, is highly hazardous.\n\nThe PCB river monitoring on January 13, 14, and 16 too has shown more or less the same coliform and faecal coliform count in the Pampa and Njunangar.\n\nThe PCB analysis in 1997 had put the coliform count in the Pampa at 96,000 in every 100 ml. The Kerala High Court had taken suo motu proceedings against the State government and the Travancore Devaswom Board on the basis of The Hindu reports 19 years ago.", 
    "section": "national", 
    "title": "Alarming rise in coliform count in Pampa", 
    "subsection": "general", 
    "date": "2016-01-29"
}