{
    "author": [
        "Jacob Koshy"
    ], 
    "text": "Met department initiative to warn farmers about anomalous weather\n\nThe India Meteorological Department (IMD) will begin to issue weather forecasts at the block level later this year, Laxman Rathore, Director General, IMD, told The Hindu .\n\nThrough this farmers could be warned, three to five days ahead, of potentially anomalous weather in their localities that could threaten their crops. The IMD currently issues such short-term forecasts in 100 districts across States and so-called agro-climatic zones. These are contiguous districts that are known to have similar weather conditions.\n\nOn an average, 8-10 blocks make up each of India’s 688 districts but often the weather can vary quite significantly within a district, to the extent, that farmers need different types of forecast even if say 40 km apart.\n\n“The skill of our [weather] models for block-level forecasts needs to improve but we expect it to be able to give usable forecasts by next financial year,” Mr. Rathore said. The skill of a model refers to how accurately it predicts the weather.\n\n“At the agro-climate zone level, the models have a skill of 80% but at the block levels it hovers around 60%,” he said.\n\nThe IMD generally relied on a bank of statistical data, collected over two centuries, to prepare its weather forecast. However with complaints and concerns over its accuracy — such as in predicting droughts — it has started to rely on so-called numerical weather models.\n\nThese rely on the processing power of super-computers but, according to those who work with them, they are yet to become reliable enough to consistently simulate monsoon and Indian climate conditions. “We still have to go a long way in improving the models at the district level,” said Madhavan Rajeevan, Secretary, Ministry of Earth Sciences. The IMD reports to this Ministry.\n\nMr. Rathore, however, clarified that the IMD would be employing ensemble models for their forecasts, a kind of a halfway house between statistical and dynamic techniques.\n\nThe IMD’s initiative comes even as a study by the National Council for Applied and Economic Research (NCAER) found that India has posted an improved agriculture-performance in rain-fed farming with a sizeable number of farmers attributing a 25% rise in their net income to improved meteorological advisory services.\n\nOn the other hand, the report notes that nearly 75% of Indian farmers lacked reliable access to these services.\n\nIndia saw consecutive droughts in 2014 and 2015, a rare event said to be at least partly due to climate change. This in turn is said to induce changes in the monsoon that also makes local weather even more unpredictable.", 
    "section": "national", 
    "title": "Block-level forecasts soon", 
    "subsection": "general", 
    "date": "2016-01-29"
}