{
    "author": [
        "Dennis S"
    ], 
    "text": "The first batch of women Coast Guard officers, who completed their training at ICGS Mandapam, ready for deployment on board hovercraft.— Photo: Special Arrangement\n\nIn a first-of-its-kind initiative, the Coast Guard, which has already deployed women officers to operate its fixed-wing aircraft and helicopters, has now trained them for operations on board hovercraft — an amphibious craft that patrols in shallow water to check illegal activities in seas, especially near international maritime boundary lines.\n\nIn the first batch, four women officers were trained in a 10-day first-phase training capsule at ICGS Mandapam in Ramanathapuram district.\n\n“The Coast Guard decided to train women officers in hovercraft. The training of the four concluded on Thursday and all have passed the aptitude test,” Inspector-General Satya Prakash Sharma said.\n\nIn the first batch, Assistant Commandants Sneha Khatayak, Anuradha Shukla, Shirin Chandran and Vasundhara Chouksey from Coast Guard stations in Paradip, Mumbai, Chilika and Chennai respectively, completed their training.\n\n“The 10-day training was in familiarising with the way sea patrol is undertaken. Other basics of operating the hovercraft and other procedures were part of the training. We are honoured to be in the first batch of women trained,” said Ms. Khatayak.\n\nMs. Chouksey was also part of a different team that underwent training under Commander Dilip Donde, the first Indian to circumnavigate the globe on board the sailing boat INSV Mhadei .\n\nCommandant S. Bhattacharjee of ICGS, Mandapam, said these officers, after completing their first phase of training at Mandapam would proceed to receive further training at various places.\n\n“This is the first time, women in the forces, would be posted in craft operating from sea,” he said.\n\nHovercraft or Air Cushion Vehicles are amphibious vehicles that can move in land and sail at sea at a maximum speed of 40 knots to intercept any boat or ship suspected to be involved in illegal activity.\n\nPresently, a total of 18 hovercraft serve in the Coast Guard, attached to units in Okha and Jakhua in Gujarat, Mumbai in Maharashtra, Mandapam in Tamil Nadu, and Haldia in West Bengal.", 
    "section": "national", 
    "title": "Coast Guard women officers trained to sail hovercraft", 
    "subsection": "general", 
    "date": "2016-01-29"
}