{
    "author": [], 
    "text": "Priyanka Chopra on what keeps her at the cutting edge of entertainment\n\nActor Priyanka Chopra, who is a Unicef Goodwill Ambassador, at an awareness programme on prevention of anaemia in adolescents.— File photo: A.M. Faruqui\n\nCross-continental travel and “insane” timelines are a part and parcel of Priyanka Chopra’s life as a celebrity, as she juggles her Bollywood assignments in Mumbai with her life in Montreal as the protagonist on an American TV show.\n\nWith her roots in Bareilly, Priyanka’s first big win came when she clinched the Miss World title in 2000 when she was just 18.\n\nAt 33, Priyanka is a National Award winner, the first South Asian actress to win a People’s Choice Award, and a Padma Shri recipient. Excerpts from an interview:\n\nIs your current life the dream that you ever hoped for?\n\nNobody hopes about these things, but yes, nobody knows where life will take you or how successful you will become. I was so nervous when Quantico got released. I never knew it would become popular. But here I am, happy about the choices that I have made. Being chosen for the Padma Shri is extremely special.\n\nI came into the business knowing nothing, and I’ve learnt a whole lot. I just kept my head down and kept working.\n\nDoesn’t travelling take a major toll on you?\n\nMore than anything, the actual cross-continental travel used to take a toll on me but now I’ve got accustomed to it.\n\nI’ve found ways to handle it both physically and mentally. The key here is that I want to do all of it and that’s enough of a reason to push myself. Also, I’ve always thrived on pressure and insane timelines, so it makes it a whole lot easier to handle now.\n\nYou’ve always been fearless about treading the unbeaten path. Producing original content for mobile apps is also a fairly new field. What made you take this leap of faith?\n\nBecause it offers such a wide canvas. There are no rules or formulae to creating content for this space and that’s what makes it so exciting for me.\n\nThere’s news that you’re producing regional films. When do we see a full-fledged Bollywood film from your banner?\n\nWe have a lot of projects under discussion and you can expect an announcement from us shortly. We don’t want to rush into anything. The vision is to create a platform for great stories to be told and for new talent to be discovered and promoted.\n\nHow do you relate to the ethos of It’s My City (mobile series), especially since you came to Mumbai from another city?\n\nThere is definitely a parallel that can be drawn to my own story. I came to this city not knowing a single person. I lived as a paying guest, travelled by local trains, pursued my ambitions and chased my dreams. This story is of four girls who are unrelated to each other, yet through the course of the series form a strong bond and friendship.\n\nTo correlate to that, one of my very best friends today is someone I met as a flatmate in my paying guest digs.\n\nWhen you set out to build your future, you will always face challenges — everyone does. The point is to not back down. Face it head on, build a good support system and just work damn hard.\n\nIn what ways did Mumbai, the film industry and its people help you in the journey?\n\nI think it equips you to handle all kinds of pressure. It is called the city that never sleeps for a reason. I love Mumbai and everything it has given me. The industry is my home now and one I am privileged to be a part of.\n\nYou’re almost reliving that experience while in Montreal for your international assignment. But the experience may be different considering you are a star now?\n\nIt is not the same. I have come to Montreal after creating a certain position for myself, so things are way different from when I started out. The work environment is similar except for the difference between shooting for a TV series and film. I don’t pay much heed to the bells and whistles of being a star. It’s my creative environment that matters and currently it’s absolutely amazing. — IANS", 
    "section": "national", 
    "title": "‘Face it head on, just work hard’", 
    "subsection": "general", 
    "date": "2016-01-29"
}