{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "‘Rajkhowa ordered sealing of offices, seizure of official files’\n\nPost imposition of President’s rule in Arunachal Pradesh, the former Chief Minister Nabam Tuki moved the Supreme Court on Thursday about how Governor J.P. Rajkhowa has ordered a clampdown on civil protests in the border State, dismissed “political appointees” and sealed the offices of the former Chief Minister, Ministers and Parliamentary Secretaries.\n\nIn an office memorandum issued on January 26, Governor J.P. Rajkhowa ordered that “wherever justified, prohibitory orders under Section 144 CrP.C. may be imposed in public interest.”\n\n“No bandhs, road blocks, gheraoes or such other illegal activities are to be allowed and laws must be enforced strictly without any discrimination and law breakers are to be booked under appropriate provisions of the law and brought to justice at the earliest,” the memorandum said.\n\nHe further ordered the Chief Secretary to seal the offices of the former Chief Minister Nabam Tuki, his Ministers and Parliamentary Secretaries and take into “safe custody” official files, even from their residential offices. Their official cars were also ordered to be taken into custody and their security cover to be “immediately assessed.”\n\nThis office memorandum is a documentary part of a writ petition filed by Mr. Tuki in the Supreme Court to quash the proclamation of President’s Rule in the State.\n\nMr. Tuki contended that the memorandum is evidence to show how the Governor acted beyond the terms of the President’s “unconstitutional” proclamation of emergency. He submitted that the court should declare all consequential actions taken by the Governor during the period of President's Rule to be “illegal and void ab initio”.\n\nHe said the January 26 memorandum is simply “without jurisdiction, illegal and unconstitutional and even beyond the terms of the Proclamation and shows malice and want of bonafide on the part of the Governor.”\n\nThe petition comes on the eve of the deadline given by the Supreme Court to the Centre and Mr.Rajkhowa to explain on what basis they recommended the President to proclaim emergency in Arunachal Pradesh.\n\nThe Bench led by Justice J.S. Khehar had asked the Governor to submit in sealed covers his report to the President giving reasons to show that there has been a breakdown in the constitutional machinery of the State warranting President's Rule.\n\nMr. Tuki said the Governor had sent two reports on January 15 and January 18. However, he said that the “Governor’s representative” refused to divulge to him the contents of the two reports saying it was a “secret”.", 
    "section": "national", 
    "title": "‘Governor has clamped down on civil protests’", 
    "subsection": "general", 
    "date": "2016-01-29"
}