{
    "author": [], 
    "text": "The system played millions of games against itself to get ready\n\nThe Chinese board game ‘Go’ is complex with more configurations possible than there are atoms in the universe.— File Photo: AFP\n\nIn a milestone for artificial intelligence, a computer has beaten a human champion at a strategy game that requires “intuition” rather than brute processing power to prevail, its makers said Wednesday.\n\nDubbed AlphaGo, the system honed its own skills through a process of trial and error, playing millions of games against itself until it was battle-ready, and surprised even its creators with its prowess.\n\n“AlphaGo won five-nil, and it was stronger than perhaps we were expecting,” said Demis Hassabis, the chief executive of Google DeepMind, a British artificial intelligence (AI) company.\n\nA computer defeating a professional human player at the 3,000-year-old Chinese board game known as Go, was thought to be about a decade off.\n\nThe clean-sweep victory over three-time European Go champion Fan Hui “signifies a major step forward in one of the great challenges in the development of artificial intelligence — that of game-playing,” the British Go Association said in a statement.\n\nThe two-player game is described as perhaps the most complex ever designed, with more configurations possible than there are atoms in the Universe, Mr. Hassabis said.\n\nPlayers take turns placing stones on a board, trying to surround and capture the opponent’s stones, with the aim of controlling more than 50 per cent of the board.\n\nThere are hundreds of places where a player can place the first stone, black or white, with hundreds of ways in which the opponent can respond to each of these moves and hundreds of possible responses to each of those in turn.\n\n“But as simple as the rules are, Go is a game of profound complexity,” Mr. Hassabis explained in a blog. The possible positions are almost infinite.\n\nSuch a search base is “too enormous and too vast for brute force approaches to have any chance,” added his colleague David Silver, who co-authored the paper in the science journal Nature .\n\nSo the team sought to create an AI system with a “more human-like” approach to a game Hassabis said “is played primarily through intuition and feel”.\n\nAlphaGo uses two sets of “deep neural networks” containing millions of neuron-like connections to reduce the search base to something more manageable. The first, “policy network”, narrows the search at each turn to only those moves most likely to lead to a win.\n\nThe second, “value network”, estimates a winner from each move made, “rather than searching all the way to the end of the game”, said Mr. Silver.\n\n“AlphaGo looks ahead by playing out the remainder of the game in its imagination many times over,” he explained. — AFP", 
    "section": "national", 
    "title": "‘Intuitive’ computer has a go at mind game, wins hands-down", 
    "subsection": "general", 
    "date": "2016-01-29"
}