{
    "author": [], 
    "text": "Lambasting the Jammu and Kashmir government for municipal waste scattered across Srinagar, the National Green Tribunal on Thursday warned it would order dumping of all trash in the Secretariat complex if its orders were not implemented within a week.\n\nAsserting that it would hold top officers including the Chief Secretary personally responsible for ensuring compliance of its orders passed a year ago, the green panel took the state administration to task over delay in setting up of a waste-to-energy plant in Srinagar despite its order, saying all this was ruining the area known for its beauty.\n\n“It is one of the most beautiful cities,” a Bench headed by NGT Chairperson Justice Swatanter Kumar said and asked “where are you using the money allotted to you? You are just putting the common man in trouble.\n\n“At least have a provision for municipal solid waste (MSW) collection and segregation or else we will direct Srinagar Municipal Corporation to dump all the waste in the Secretariat.”\n\nThe Tribunal granted one week to the state government to comply with its order and ensure there is no scattering of MSW in the city.\n\nIt warned that in the event of default, the Chief Secretary, other concerned secretaries and commissioner of Srinagar Municipal Corporation (SMC) would be personally held responsible.\n\n“Why don’t you have dustbins and waste collection provisions? Does that require Cabinet approval? We are shocked to see that there is no dustbin in the entire Srinagar area.\n\nThere are stray dogs and municipal waste lying everywhere. Why don’t you set up MSW plant? You cannot block everything and let people suffer and die. “We understand the financial aspects but you have to find some solution. This project will generate energy in lieu of waste and still you are doing nothing,” it said.\n\nThe green panel expressed displeasure over government’s attitude in the matter and noted that tenders were awarded by the state as per its own terms but the entire project remained stalled for a considerable period on the pretext that the rate of power purchase demanded by the bidder was higher.\n\n“You better do something or we will appoint a court commissioner to ascertain the actual condition of Srinagar. If there is a drop of waste or lapse found in collection of MSW, your Secretary will pay for it. In January 2015, we had passed order for establishment of waste-to-energy plant. Whole year has passed and still you have done nothing,” it said.\n\nContinuing its tirade against the J&K government, the green panel said “You are just interested in making your files thick. Tourism is the soul of Jammu & Kashmir and you are doing this to your state. Why should common people be always the sufferer. There has to be some sense of working. It is a matter of state’s health. We are sick and tired of this case.”\n\nThe Tribunal noted that on an average 500 metric tons of waste was produced a day in Srinagar and it was a statutory obligation on government to ensure that MSW waste is dealt in a manner that it does not cause health hazard. - PTI", 
    "section": "national", 
    "title": "J&K govt. draws NGT’s ire over scattered trash in Srinagar", 
    "subsection": "general", 
    "date": "2016-01-29"
}