{
    "author": [
        "Peerzada Ashiq"
    ], 
    "text": "The ‘Agenda of Alliance’ promised to include Jammu and Srinagar in the Smart Cities project.— File photo: Nissar Ahmad\n\nAbsence of Jammu and Srinagar from 20 cities, to be taken up under the first phase of Smart Cities’ project by the Union Development Ministry, on Thursday is likely to further fuel disenchantment between coalition partners, the Peoples Democratic Party and the BJP, in the State, where government formation remains elusive due to growing differences.\n\nIn March last year, the common minimum programme, ‘Agenda of Alliance’, agreed upon by the PDP and the BJP prior to government formation promised to “include the winter capital, Jammu, and the summer capital, Srinagar, in the ‘Smart Cities project”.\n\nA top PDP leader told The Hindu , on condition of anonymity, that both the former Chief Minister Mufti Muhammad Sayeed and his daughter Mehbooba, also PDP president, pointed out the need to adopt the two cities of J&K as ‘Smart Cities’ to the top BJP leaders, who visited the ailing Mufti in AIIMS, where he passed away on January 7.\n\nThe delay in the government formation in the State, under Governor’s rule since January 9, is the result of the PDP’s unhappiness over the lack of progress on the ‘Agenda of Alliance’ in the past 10 months of the PDP-BJP government.\n\nIn August last year, an 18-member panel, headed by BJP leader and former Deputy Chief Minister Nirmal Singh, awarded 45 marks each to Srinagar and Jammu, while recommending its case.\n\nWith no J&K city making it to the list, the National Conference has taken on the coalition partners.\n\n“So much for the ‘Agenda of Alliance’ being a sacred document. Once again the PDP-BJP has let down the State. No smart city for J&K today,” wrote the former Chief Minister and NC working president Omar Abdullah on Twitter.", 
    "section": "national", 
    "title": "J&K not making it to Smart Cities list may widen coalition rift", 
    "subsection": "general", 
    "date": "2016-01-29"
}