{
    "author": [
        "Afshan Yasmeen"
    ], 
    "text": "A general surgeon, recruited by the Health Department through the Karnataka Public Service Commission (KPSC) to the Madhugiri general hospital early this month, resigned after a day’s work. Another gynaecologist, who joined the community health centre (CHC) in M.N. Kote near Gubbi, remained absent from the second day.\n\nThese are just two of the many instances of recently recruited doctors choosing to stay away from work in rural areas from the second or third day of joining duty.\n\nDespite enhanced salaries and incentives, there are not many takers for medical posts in the department. The recent recruitment drive conducted through KPSC has only validated this. Of the 1,122 applicants, only 597 have reported for duty.\n\nThis is striking, especially when the number of applicants is many times more than the existing posts in other government departments.\n\nWhile attractive salaries offered by private hospitals and an opportunity to work in urban areas are responsible for keeping doctors away from government hospitals, senior doctors say there are other factors at play.\n\n“Absence of a conducive atmosphere that includes assault by patients’ relatives and harassment by followers of local politicians have also created a sense of fear and phobia among doctors, who are ready to work for even lower salaries in a small hospital in urban areas,” said a noted government doctor.\n\nWith many rural hospitals being controlled by zilla panchayats, doctors are worried that they have to depend on the panchayats for almost everything, including salaries. “Inadequate infrastructure in rural hospitals and specialists having to function as casualty medical officers are also reasons for the poor response to the department’s recruitment drive,” said another senior doctor.\n\nDespite enhanced salaries and incentives, there are not many takers for medical posts in the State’s health department", 
    "section": "national", 
    "title": "Karnataka doctors reluctant to serve in rural hospitals", 
    "subsection": "general", 
    "date": "2016-01-29"
}