{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "Foreign Secretary parleys were put off in the aftermath of the Pathankot attack\n\nA fortnight after Foreign Secretary talks between India and Pakistan were postponed, the governments have been unable to find a “mutually convenient date” for them to meet, the Ministry of External Affairs said on Thursday.\n\nThe talks, that were put off in the aftermath of the Pathankot attack on January 2, were due to be held on January 15. At the time, the government said they would be rescheduled in the “very near future.” On Thursday, Pakistan’s High Commissioner Abdul Basit told a TV channel that he hoped the talks would take place “sooner rather than later,” and indicated they could be held in the first half of 2015.\n\nSpeaking to another TV channel, Pakistan Prime Minister Nawaz Sharif’s Foreign Affairs Adviser Sartaj Aziz said the “ball was in India’s court,” as Pakistan had suggested dates for the talks in early February. However, MEA spokesperson Vikas Swarup said while there was “always a possibility” of the talks taking place next month, “No mutually convenient dates have been found for the talks yet.”\n\nThe delay in holding talks is giving credence to speculation that India still awaits more action by Pakistan against those responsible for the Pathankot attack in which 7 Indian soldiers were killed by terrorists believed to belong to the Jaish-e-Mohammad group and masterminded by JeM founder Masood Azhar.\n\nSpeaking to the media, Mr. Swarup said India and Pakistan were in “continuous communication” over the probe on Pathankot. Mr. Basit also said, “If the Pakistan team gets proper evidence, then I am confident that Masood Azhar will not meet the same fate as [LeT operations chief Zaki-ur-Rahman] Lakhvi,” who got bail in the 26/11 trial last year. “No individual or organisation will be spared. I can assure you that,” he told CNN-IBN.\n\nMr. Basit’s remarks came a day after a Pakistani court rejected the government’s plea for voice samples of the 26/11 accused to try and match them with Indian intercepts. In a sharp response to the court decision, Mr. Swarup, who contended that India was yet to be notified of the decision officially, said the Mumbai attack trial was “a test of Pakistan’s sincerity in combating terrorism directed against India.”\n\n“The planning, training and financing of the Mumbai terrorist attack was done in Pakistan where 99 per cent of the evidence is. It is Pakistan’s responsibility to unearth and present the requisite evidence in the ongoing trial so that the perpetrators are brought to justice,” the MEA spokesperson said.", 
    "section": "national", 
    "title": "No dates yet for India-Pakistan talks", 
    "subsection": "general", 
    "date": "2016-01-29"
}