{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It will fix accountability in the context of UGC norms that address discrimination in universities\n\nThe Human Resource Development Ministry on Thursday appointed Ashok K. Roopanwal, a former judge of the Allahabad High Court, as the one-man commission of inquiry into the circumstances that led to the January 17 suicide of Hyderabad University research scholar Rohit Vemula.\n\nThe Dalit scholar had taken his life after the university’s executive council expelled him and four other students from the hostel. His death led to widespread protests by students nationwide.\n\nThe commission has also been asked to fix accountability in the context of the UGC guidelines, framed in 2012, which addressed discrimination at universities and colleges. The UGC (Promotion of Equity in Higher Educational Institutions) Regulations, 2012, were drafted after two suicides in institutes of higher learning. But the suicide among young students continued, leading to questions about the implementation of the rules.\n\nIn its report submitted on January 22, a two-member fact-finding committee, set up by the Ministry, faulted the university administration for failing to address the situation, leading to the suicide. But the committee did not say anything against the HRD Ministry, though students alleged that pressure from the Ministry forced the university authorities to expel the students.\n\nThe students of the university have been on strike since the suicide of Vemula, demanding the resignation of Vice- Chancellor Appa Rao Podile and Union Minister Bandaru Dattatreya. They have questioned the Ministry’s decision to appoint Vipin Srivastava as interim Vice-Chancellor, alleging that he played a role in the expulsion of five students.\n\nThe UGC notification deals with specific acts of discrimination on the basis of caste, creed, religion, language, ethnicity, gender, and disability. And the guidelines have spelt out the mechanism to address discrimination on campuses.\n\nAgitating students are demanding resignation of VC, and Union Minister Bandaru Dattatreya", 
    "section": "national", 
    "title": "One-man panel to probe Rohith suicide", 
    "subsection": "general", 
    "date": "2016-01-29"
}