{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "President records in memoirs how he had to attend them despite his misgivings\n\nPranab Mukherjee with other dignitaries during the Victory Day commemoration along with Russian President Vladimir Putin in May 2015. Mr. Mukherjee says in his memoirs that attending such functions is an insult to the Independence movement.— PHOTO: Special Arrangement\n\nParticipating in World War II Victory Day commemorations is an insult to the Indian independence movement and particularly to Netaji Subhas Chandra Bose, writes President Pranab Mukherjee in his latest memoirs. The President records his opposition to the ceremonies in the second volume of his autobiography that deals with what he calls The Turbulent Years – 1980-1996 , despite having to attend them internationally.\n\nIn the chapter dealing with his short first tenure as Minister of External Affairs in 1995-96, Mr. Mukherjee recounts his discussions with the then Prime Minister P.V. Narasimha Rao on invitations received by the government from Russia and the U.K. to participate in VE (Victory-Europe) Day 50th Year celebrations.\n\n“I told the Prime Minister [Rao] that there were several reasons why the government should not participate in Victory Day celebrations for the Second World War,” writes Mr. Mukherjee, explaining that among those were that Bose’s Indian National Army (INA) had fought Allied forces. He also pointed out that in 1939, all Congress party-led provincial governments had resigned in protest against India’s participation in the Second World War as a part of the Allies’ armies.\n\nFinally, Mr. Mukherjee told Rao that the British government had even banned the Congress party and put leaders including Mahatma Gandhi in jail for their protests during the War. “Knowing all this, how can our government celebrate victory in the Second World War as a Victory Day?” Mr. Mukherjee asked the PM.\n\nDespite his protests, however, the book records how Mr. Mukherjee was himself sent to represent India at the Victory Day parade in Red Square and proceed from there to the VE Day parade in London, as bilateral relations with those two countries outweighed the then External Affairs Minister’s concerns.\n\nMr. Mukherjee’s stern view of the World War is particularly significant given that the present NDA government has chosen to ensure India’s participation in World War celebrations in 2015 that marked the 70th year of the Victory Day. As President, Mr. Mukherjee represented India once again in Moscow in May 2015 at the Victory Day celebrations. Asked by The Hindu during the visit if his representation overturned the Congress’s traditional position of opposing what it saw as an “imperialist war”, President Mukherjee had said that regardless of that position, he had as Defence Minister visited the memorials of Indian soldiers who sacrificed their lives in the wars.", 
    "section": "national", 
    "title": "Pranab against attending V-Day parades", 
    "subsection": "general", 
    "date": "2016-01-29"
}