{
    "author": [
        "National Bureau"
    ], 
    "text": "Pranab’s memoirs also say Masjid demolition was Rao’s biggest failure\n\nPresident Pranab Mukherjee says the opening of the Ram Janmabhoomi temple site in Ayodhya was an “error of judgement” by the then Prime Minister Rajiv Gandhi and the demolition of the Babri Masjid was an act of “absolute perfidy, which should make all Indians hang their heads in shame”.\n\n“The opening of the Ram Janmabhoomi temple site on 1 February 1986 was perhaps another error of judgement. People felt these actions could have been avoided,” the President has written in the book titled The Turbulent Years: 1980-96 , released by Vice-President Hamir Ansari at a function attended by senior BJP leader L.K. Advani, who was at the helm of the Ram Janmabhoomi movement that resulted in the destruction of the mosque.\n\nMr. Mukherjee called the Masjid demolition “PV’s [Narasimha Rao’s] biggest failure.” “The inability to prevent the demolition of the Babri Masjid was one of PV’s biggest failures. He should have entrusted the task of tough negotiations to other political parties to a more senior and seasoned politician familiar with politics in U.P., like N.D. Tiwari,” the President writes.\n\nThe news of the demolition was conveyed to Mr. Mukherjee, who was then Deputy Chairman of the Planning Commission, by his then Officer on Special Duty (OSD), former Minister Jairam Ramesh. Mr. Mukherjee was in Bombay at that time.\n\nHe also recalls the controversy over stories that he wanted to succeed as Prime Minister after the death of Indira Gandhi. “...Many stories have been circulated that I aspired to be interim Prime Minister, that I had staked claim and had to be persuaded otherwise … these stories are completely false and spiteful,” he writes.\n\nThe President says that former President Giani Zail Singh wrote in his memoirs that Narasimha Rao and Mr. Mukherjee gladly assented to Rajiv Gandhi being sworn in as Prime Minister.", 
    "section": "national", 
    "title": "‘Rajiv erred in opening Ayodhya site’", 
    "subsection": "general", 
    "date": "2016-01-29"
}