{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Heeding the Chief Justice of Allahabad High Court’s objections, the Supreme Court on Thursday recalled its order appointing Justice (retired) Virendra Singh as Uttar Pradesh Lokayukta.\n\nA Bench of Justices Ranjan Gogoi and Prafulla C. Pant then appointed another former High Court judge, Sanjay Misra, as the State’s anti-corruption ombudsman.\n\nThe decision follows a prolonged litigation that saw the Bench, fed up with the “lack of consensus” among the State’s constitutional authorities — the Chief Minister, the Opposition leader and the Chief Justice of the Allahabad High Court — went ahead with a rare display of its extraordinary powers vested under Article 142 of the Constitution to appoint Justice Singh as Lokayukta from a list of five names presented to it by the State government on December 16.\n\nHowever, the appointment triggered a row when news reports surfaced that the State government had included Justice Singh’s name in the list of five shown to the apex court despite objections raised by High Court Chief Justice D.Y. Chandrachud about Justice Singh’s integrity.\n\nSubsequently, the controversy returned to the Bench after the State agreed to freeze Justice Singh’s swearing-in until the apex court cleared it.\n\nIn his short judgment for the Bench, Justice Gogoi said Chief Justice Chandrachud’s reservations have to be given primacy over that of the Chief Minister and the Opposition Leader in the consultative process for the selection of Lokayukta.\n\n‘Order inaccurate’\n\n“We are persuaded to hold that our order appointing Justice Virendra Singh (retd.) as Lokayukta was on the basis of the statement made on behalf of the State of Uttar Pradesh which now appears to be somewhat inaccurate,” the judgment said.\n\nFormer HC judge, Sanjay Misra, is\n\nnow the State’s\n\nanti-corruption ombudsman", 
    "section": "national", 
    "title": "SC recalls order appointing Justice Virendra Singh as U.P. Lokayukta", 
    "subsection": "general", 
    "date": "2016-01-29"
}