{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "She is not cooperatingin probe, claim CBI and Gujarat police\n\nThe Gujarat police and the CBI accused Teesta Setalvad and her husband of notco-operating with the probe.\n\nA routine hearing for extension of bail granted to social activists Teesta Setalvad and her husband on Thursday at the Supreme Court turned volatile when the Gujarat police and the CBI accused the couple of not co-operating with an ongoing embezzlement investigation against them.\n\nMs. Setalvad’s lawyers, senior advocate Kapil Sibal and advocate Kamini Jaiswal, reacted strongly by submitting that seven volumes of documents covering over 14,000 pages of financial details had been handed over to the investigating authorities.\n\nMr. Sibal told a three-judge Bench led by Justice Anil R. Dave that investigating authorities had begun to make “unreasonable” demands for cash vouchers of purchases dating back to 2004.\n\nSolicitor-General Ranjit Kumar countered that the couple was not handing over documents relevant to the probe like utilisation certificates showing how they spent money they received from overseas organisations.\n\n“What we are asking for, they are not giving. We have 4,723 documents, but none of them relates to the documents asked for,” Mr. Kumar submitted.\n\n“If they got money through a grant, they have to spend the money as required by the grant ... they would have given documents showing this to the grantor ... We are seeking these documents and not the expenses on liquor and wine,” Mr. Kumar said.\n\n“For two months, we have been asking them to take the documents from us. They say, come later today, come tomorrow ...” Mr. Sibal said alleging non-co-operation by the probe agencies.\n\n“We will pass an appropriate order giving time for supply of documents and if the order is not complied with, we can even vacate our order [granting anticipatory bail],” Justice Dave observed.\n\nThe court then extended the couple’s bail to March 18, while directing their lawyers to provide detailed response to a list of documents sought for by the probe agencies since April 11, 2015. The court said the couple should clearly answer whether they had given or were unable to hand over each document listed. Next hearing is scheduled for March 9.", 
    "section": "national", 
    "title": "Teesta, probe agencies cross swords in court", 
    "subsection": "general", 
    "date": "2016-01-29"
}