{
    "author": [
        "Kallol Bhattacherjee"
    ], 
    "text": "The novelist had travelled to the Western African country to sell a family painting.\n\nAward-winning Chennai-based novelist, playwright and scion of the erstwhile royal family of Travancore, Shreekumar Varma, who was taken hostage on January 23 when he was travelling in Senegal has been rescued. Family sources indicated to The Hindu on Thursday that he was now back at the Indian embassy in capital Dakar. However, confirmation is still awaited.\n\nThe Ministry of External Affairs (MEA) which had been extremely cautious about the sensitive case and the negotiations around it, was not available for comment, but the family of Mr. Varma, confirmed that he had been freed from the group which had abducted him.\n\nEarlier, diplomatic sources had said that the Indian embassy in Dakar was tracking the case and working with the local authorities to have him freed.\n\nLured by kidnappers\n\nMr. Varma, the great grandson of the legendary 19th century painter Raja Ravi Varma, apparently was lured to Senegal to negotiate the sale of one of the canvases by the painter, which is part of the Travancore inheritance.\n\nHe reportedly was supposed to negotiate the deal with one Subramaniam Seshadri who works in an India-owned construction firm in Senegal. But problem began as soon as Mr. Varma landed in Dakar on a commercial flight via Dubai.\n\nHe was received by a Senegalese man named Abdul, who informed him that his expected contact, Mr. Seshadri, would no longer be able to meet him. According to a market source, an original Ravi Varma painting is worth nearly $2 million now.\n\nMr. Varma, who landed in Senegal on January 18, contacted his son last on January 23 to inform him of brewing trouble with the people who had invited him for negotiation but apparently he was taken away by a group immediately thereafter.\n\nA letter written to the MEA by Vinayak, the novelist’s son, said that Mr. Varma’s trip to Senegal was part of a family-backed attempt to sell the original Ravi Varma painting with the help of Mr. Seshadri.\n\nMr. Varma tried to escape but failed and subsequently his passport was also taken away by Abdul.\n\nSenegal is located in Western Africa and borders Mali which has been repeatedly targeted by terrorist groups in the recent past.\n\nAccording to a market source, an original Ravi Varma painting is worth nearly $2 mn", 
    "section": "national", 
    "title": "Varma was in Senegal to negotiate sale of painting", 
    "subsection": "general", 
    "date": "2016-01-29"
}