{
    "author": [
        "Roli Srivastava"
    ], 
    "text": "Dancers in distress as Maharashtra government delays granting licences\n\nThe Maharashtra government’s ban on dance bars, which rendered about 75,000 girls jobless 11 years ago, marked the beginning of the end of a skill that communities such as nat, bediya and kanjar — once famous in performing arts — possessed. It also turned the clock back for many.\n\nSince the mid-1980s, dancing in Mumbai’s bars became the escape route from sex work for thousands of girls who came from States such as Rajasthan, West Bengal, Bihar and Madhya Pradesh. The ban, imposed in 2005, cut short their dream, ending their chance to earn their livelihood from the only skill they had — dancing.\n\nPinky of the nat community, hailing from Tonk in Rajasthan, said: “I moved to Mumbai in 1991 and earned a tip of Rs. 100 during my very first performance.” She told The Hindu that she had joined the flesh trade, like most of the girls from her community, when she was 13. Two years on, she was a mother of two daughters. “I hated sex work, and dance bars gave me the opportunity to leave it,” she said. With the closure of the bars, many girls have been forced to return to their old lives.\n\nVarsha Kale, honorary president of the Bar Dancers Union, who has been doing research on the communities of traditional dancers, said: “when I visited Rajasthan, I was told about the girls dotting the 100-km stretch from Alwar to Bharatpur on the national highway. They are involved in sex work with truckers and this could lead to a rise in the incidence of HIV. This is a complicated social problem.”\n\nSita Ram Gupta, executive director of Lupin Foundation in Bharatpur pointed out: “The girls who have come back are either involved in sex work or stay in touch with hotels. Delhi is only 180 km from here so they move frequently.” The foundation works on migration issues. The Supreme Court asked the Maharashtra government on March 2 to issue licences to dance bars to enable them to resume within a fortnight. The State issued licences to four bars on March 15, but revoked them later for ‘non-compliance’ with norms. The State has laid down 26 conditions, mainly about maintaining distance between the dancers and customers, to these bars.\n\nThe Dance Bar Association has said it will move the Supreme Court if the Maharashtra government fails to issue licences. Owners said they had complied with the conditions to hold dance performances in their bars, but the State government was adding to the conditions and making the process longer. Bharat Thakur, president of the association and owner of three bars that got a licence on March 15, told The Hindu that bar owners had complied with all the 26 conditions. He said a meeting for the no-objection certificate from the Rangbhumi Prayog Parinirikshan Mandal — one of the 26 conditions — was scheduled to be held on March 18. “But the State is using delaying tactics. The meeting has been postponed to March 28,” he said.\n\nMembers of the association argue that Mumbai’s nightlife has been hit. Interestingly, they had no rehabilitation schemes for the girls who were affected by the ban. The maximum the girls could do was to stand in the bars or wait at tables. What has remained largely unnoticed is the end of the dancing tradition among communities that were once known for it.", 
    "section": "national", 
    "title": "A ban that has pushed them to the margins", 
    "subsection": "general", 
    "date": "2016-03-27"
}