{
    "author": [
        "Michael Cooper"
    ], 
    "text": "100 sheep that appear in a staging of De Materie are the unlikeliest stars of New York’s spring opera season\n\nThe unlikeliest stars of New York’s spring opera season were raised humbly in rural Pennsylvania on pop and country-western music, but they are already showing prima donna tendencies. Not only did a whole new dressing room have to be built for them backstage, but it also had to be soundproofed and kept fully stocked with their favourite snacks: grain and a hay mixture of timothy, orchard grass and red clover.\n\nThe scene-stealers in question are the 100 sheep that appear in an eerie, endearing section near the end of Heiner Goebbels’s dreamlike staging of Louis Andriessen’s De Materie , a Dutch avant-garde work from 1988 being performed in the cavernous Drill Hall at the Park Avenue Armory.\n\nAnd while the sheep are garnering great reviews — Anthony Tommasini, the chief classical music critic for The New York Times , wrote that “their occasional bleating lent a lovely natural touch to the score” — their farm-to-stage odyssey has been anything but straightforward. Simply getting hold of so many stage-ready sheep was an exceptionally difficult bit of opera casting. You cannot simply call the usual power-agents in New York or London.\n\n“It was a ‘Mission Impossible’ kind of thing,” said Paul Novograd, the large-animal coordinator with All Tame Animals, an agency that provides animals for theatre, operas, film and photo shoots. “The performance was scheduled in the middle of lambing season, so to find sheep that weren’t pregnant or weren’t still lactating was doubly difficult.”\n\nHis hopes were raised when a farmer with a large flock, usually used for sheepdog trials, expressed an interest in the project — and then dashed when the farmer decided not to let his animals tread the boards after all.\n\nA curious farmer\n\nCassie Schweighofer, a sheep farmer at Twin Brook Farms in Tyler Hill, Pennsylvania, recalled seeing one of Mr. Novograd’s pleas last fall on a Listserv for sheep and goat producers — and deleting it. “I thought it was ridiculous,” she said. “I thought there was no way a farmer would want to do it.”\n\nBut when she saw another request again in January — with added urgency, if not desperation — her curiosity was piqued, and she reconsidered.\n\nThe bane of international opera stars is a visa system that can be difficult to navigate. For opera sheep, it is getting the right veterinary certificates, exhibiting permits, humane handling paperwork and the like. “The number of logistics we had to iron out was incredible,” Ms. Schweighofer said.\n\nThen there was the question of where to house them. The ovine troupers could not sleep at the Armory; could not commute from Pennsylvania; and would not have been welcome at the hotels that usually cater to visiting sopranos. So accommodations were found at the Bronx Equestrian Center, which has stables in Pelham Bay Park. The New York City Department of Health and Mental Hygiene, which has jurisdiction over animals in performances, issued a permit to allow the project to go ahead. Then the Armory had to be readied. A backstage paddock was built and soundproofed, said Rebecca Robertson, its president and executive producer. “You can’t have, in the middle of the third act, a ‘baaa’ at the back of the hall,” she said.\n\nStars that they are, the sheep have a later call time than the rest of the cast. Their trailers pull up to the Armory after De Materie has begun, and they arrive through a kind of sheep chute. Snacks await them in the paddock and they are generally eager to enter.\n\nThere is no indication of sheep in Mr. Andriessen’s score, which was first staged by Robert Wilson in 1989. The Armory production, which originated at the Ruhrtriennale in Germany in 2014, is directed by Goebbels, who said that he had decided to use the sheep as part of his effort to “build a space onstage in which the imagination of the audience can take place.”\n\n“I’m not interested in circus, and taming, and animals doing things that they were not meant to do,” he said, describing his first meeting with the original woolly interpreters at a rehearsal in Germany as one of the most beautiful moments in his life as a director. “I just wanted animals to do what they do. It’s very poetic, and unpredictable. You never know what they’re doing next.”\n\nThere was some concern about getting the flock offstage at the right time, and Ms. Schweighofer calls to it from backstage. “I kind of clack the feed buckets,” she said.\n\nMuch in demand\n\nNow that the sheep have become divas, they have different kinds of handlers. They are apparently in demand: publicity representatives for the Park Avenue Armory initially declined to cooperate for this article, saying that the story of the sheep had been promised to another news outlet. But feats of investigative journalism, and the biggest sheep hunt since Little Bo-Beep, traced the flock to Pelham Bay Park and led the Armory to reconsider.\n\nWhat next for the sheep? An old song about soldiers returning from World War I was called “How Ya Gonna Keep ‘Em Down on the Farm? (After They’ve Seen Paree).”\n\nMs. Schweighofer said that she thought their biggest adjustment once they returned to Pennsylvania would not be the lack of the limelight, but returning to their old hay diet after getting so much grain backstage. “I think that they’re going to put up their noses at us for the first day,” she said. “But I think after a few days, they’ll fall back into the regular old farm routine. That’s the beauty about sheep.” — New York Times News Service", 
    "section": "national", 
    "title": "A new breed of opera diva takes centre stage", 
    "subsection": "general", 
    "date": "2016-03-27"
}