{
    "author": [
        "Smita Gupta"
    ], 
    "text": "In the run-up to the Bihar elections last year, a rebellion in the Congress in Assam saw senior leader Himanta Biswa Sarma, Chief Minister Tarun Gogoi’s brains trust and troubleshooter walking over to the Bharatiya Janata Party (BJP) in August 2015 along with several other party MLAs. If the BJP’s target was the upcoming Assam elections, the party had also hoped that the rebellion would help it in Bihar.\n\nNow the Congress government in Arunachal Pradesh has been toppled, and there is dissidence brewing in two other States ruled by the Congress, Manipur and Uttarakhand.\n\nIndeed, currently, the BJP is working to capture power in Manipur, where an unstable Congress Chief Minister is finding it hard to keep rebel MLAs in check, especially worrying as State elections are due in 2017.\n\nComing as it does ahead of a slew of Assembly elections in West Bengal, Assam, Tamil Nadu, Puducherry and Kerala, the BJP — currently in election mode after last year’s major electoral losses in Delhi and Bihar — hopes that projecting its principal political rival at the national level as one beset with internal problems could come in handy. If factionalism and its fallout, rebellion, in the Congress is a natural consequence of the ignominious defeat the party faced in the general elections in 2014, the BJP seems willing to fish in troubled waters, in some cases, using a friendly Governor to push things along.\n\nOf course, States such as Arunachal Pradesh, Manipur and Uttarakhand, especially the first two, have historically been more prone to being affected by who is ruling Delhi. Being more dependent on the Centre than the larger States, the tendency is a desire to be aligned to Delhi. Moreover, in smaller States, it is easier to split parties as their numbers are fewer.\n\nThe BJP has, therefore, found it relatively easy to foment trouble in Congress-ruled States where ruling party legislators are at odds with the Chief Ministers.\n\nNow, all eyes are on Uttarakhand, where beleaguered Chief Minister Harish Rawat faces a vote of confidence on March 28. The nine dissident Congress MLAs were disqualified on Saturday night under the anti-defection law, which was what the party was desperately hoping for.\n\nThe Congress is putting on a brave face with its communication chief, Randeep Surjewala, accusing the BJP of luring away its legislators, “bypassing all constitutional norms”.\n\n“The duo of Mr. Modi and Mr. Shah are infamous for forcible eviction of elected governments in this country,” Mr. Surjewala told journalists recently. “Elected governments are being destabilised by a sinister conspiracy. After Arunachal Pradesh, it is Uttarakhand.” The BJP, he said, was resorting to such actions as after its disastrous showing in Delhi and Bihar, it was “convinced” it could not come to power in any State through popular vote.\n\nRebels in camp\n\nBut the Congress needs to improve its management, even as it rejuvenates the organisation. For in Arunachal Pradesh, the dissidents broke ranks only after innumerable complaints to the Congress leadership were ignored.\n\nCongress needs\n\nto improve its management, even as it rejuvenates\n\nthe organisation", 
    "section": "national", 
    "title": "BJP makes the most of domino effect in Cong.", 
    "subsection": "general", 
    "date": "2016-03-27"
}