{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Demand removal of University of Hyderabad V-C\n\nStudents of JAC for Annihilation of Caste being removed by the police when they staged a protest in front of Shastri Bhavan in Chennai on Saturday. —Photo : S. R. Raghunathan\n\nA group of students from different colleges staged a protest at Nungambakkam here on Saturday morning, demanding action against the Vice-Chancellor of the University of Hyderabad (UoH) in connection with the assault on Kanniah and the Rohit Vemula suicide issue.\n\nThe students marched towards Shastri Bhavan intending to stage a hunger protest. They shouted slogans against institutional and caste discrimination and sought action against Vice-Chancellor Appa Rao Podile.\n\nThe protesters were detained and released in the evening, according to a police officer attached to Nungambakkam police station.\n\nA statement drafted by a movement called Academics For Democracy, comprising faculty members of leading university, states that they condemned the Hyderabad episode and demanded that all arrested protesters be released and action taken against the police personnel who assaulted the protesters on the campus as well as in police vans and Mr. Podile be removed.\n\nIt states that various incidents starting with the de-recognition of the APSC in IIT-Madras to the recent assault and arrest of students at UoH, clearly demonstrates the increasing intensity with which liberal and democratic spaces inside campuses are shrinking.\n\n“The students in question were protesting the return of the Vice-Chancellor who, according to the student community at UoH, was one of the key persons responsible for Rohith Vemula’s suicide. During this period, no action was taken against any university official for Rohith's death,” reads the statement.\n\n“In addition to the assault on members of UoH, the attempt to turn the campus into a prison yard by blocking water and food supplies as well as the alleged blocking of debit cards is a worrisome development. It should serve as a warning to all students and members of faculty across the country: if they are to fight to preserve liberal democratic spaces on campuses, these are the challenges they will face,” they said in the statement.", 
    "section": "national", 
    "title": "Chennai college students raise Vemula suicide issue", 
    "subsection": "general", 
    "date": "2016-03-27"
}