{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A new milestone towards expanding full immunisation coverage: Nadda\n\nInching a step closer to universal immunisation, the Health Ministry on Saturday launched the country’s first, indigenous rotavirus vaccine to combat diarrhoeal deaths.\n\nHealth Minister J.P. Nadda called it an ‘historic moment’ for the country, adding that the launch of Rotavac was “a new milestone towards expanding the coverage of full immunisation in the country aimed at reducing child mortality”.\n\nDiarrhoea caused by Rotavirus is one of the leading causes of severe diarrhoea and death among children less than five years of age. In India, between 80,000 to one lakh children die due to Rotavirus diarrhoea annually while nearly 9 lakh children are admitted to hospital with severe diarrhoea. Another 32.7 lakh children visit the hospital as out patients due to the disease.\n\nThe vaccine was being introduced initially in four States — Andhra Pradesh, Haryana, Himachal Pradesh and Odisha — and would be expanded to the entire country in a phased manner, Mr. Nadda said. “Adding this life-saving vaccine to our immunisation programme will not only improve the health of our children but also reduce hospitalisation and other conditions associated with diarrhoea due to Rotavirus such as malnutrition, delayed physical and mental development among children. Reduced hospitalisation lower the economic burden on the family and the health cost burden on the country,” he added. The Rotavirus vaccine was developed indigenously, under a public-private partnership between the Ministry of Science Technology and the Health Ministry.\n\nThe Rotavac is in addition to three new vaccines that have been introduced in India’s Universal Immunis-ation Programme (UIP) including Inactivated Polio Vaccine (IPV), Measles, Rubella (MR) vaccine, and Adult Japanese Encephalitis (JE) vaccine. With these new vaccines, India’s UIP will provide free vaccines against 12 life threatening diseases, to 27 million children annually, the largest birth cohort in the world. The IPV was intro-duced in six States from Nov. 30, 2015 for double protection against polio.", 
    "section": "national", 
    "title": "India’s rotavirus vaccine launched", 
    "subsection": "general", 
    "date": "2016-03-27"
}