{
    "author": [
        "Dinakar Peri"
    ], 
    "text": "Kamovs will replace Cheetah and Chetak helicopters which are in service with military for many decades\n\nIndia and Russia are on track to conclude two helicopter deals together worth over $ 2 billion by year end for which discussions are in an advanced stage, a senior official of Rostec said. These include the final deal for Kamov utility helicopters and additional Mi-17 medium lift helicopters.\n\nThe two countries had signed an Inter-Governmental Agreement (IGA) during Prime Minister Narendra Modi’s visit to Moscow in December last year for joint production of the Kamov-226T utility helicopter in India.\n\nRecently there was a big delegation from Russian Helicopters and Rostec in India for technical discussions on how to implement the agreement and modalities of the joint production.\n\n“The delegation signed a protocol fixing the timelines… the final agreement is expected by year end,” Viktor Kladov, Head International Cooperation of Rostec told The Hindu in a telephonic conversation.\n\nRussia has already selected Hindustan Aeronautics Limited (HAL) as the Indian partner for the deal. HAL has begun constructing a new helicopter manufacturing facility which will cater to the utility helicopters.\n\nStating that India is good at composite materials, electronics and avionics among others, Mr. Kladov said “the extent of localisation is being discussed.”\n\n“The Inter-Governmental Agreement on manufacture of Kamov 226 helicopter in India is the first project for a major defence platform under the Make in India mission,” Mr. Modi had said during his visit.\n\nThe Kamovs will replace the ageing Cheetah and Chetak helicopters which have been in service with the military for several decades. Over 400 of these helicopters are in service in India.\n\nWhile the agreement states that a minimum of 200 helicopters will be produced the number is expected to go up significantly given the large requirement. Mr. Kladov said the first 40 would be assembled in Russia for faster deliveries and the rest would be done in India.\n\nOn the deal for 48 additional Mi-17 V5 medium life helicopters Mr. Kladov said the “commercial technical offer has already been submitted” to the Indian side and a contract could be concluded by middle of this year.\n\nLocal service centre\n\nIn a bid to maintain its hold on the Indian helicopter market, Rostec has offered to set a local service centre for Mi-17’s to ensure comprehensive life support and spares availability along with local production of certain components, Mr. Kladov added.\n\nIn the recent past, several Russian companies have announced local support centres to improve the serviceability of equipment, one of the major complaints from the India with Russian equipment.\n\nDefence expo in Goa\n\nIn a bid to maintain its lead in the Indian defence market, Russia is sending the “biggest ever delegation,” comprising 60 major companies and over 500 members, to the defence expo beginning in Goa from March 28.", 
    "section": "national", 
    "title": "India, Russia to conclude helicopter deals this year", 
    "subsection": "general", 
    "date": "2016-03-27"
}