{
    "author": [
        "T Nandakumar"
    ], 
    "text": "Indigenous species are being edged out, putting aquatic biodiversity in peril\n\nFarmed illegally and revered as sacred, the invasive North African catfish is proliferating in water bodies across Kerala, edging out native aquatic species.\n\nA survey conducted by the Department of Aquatic Biology and Fisheries, University of Kerala, and the Directorate of Environment and Climate Change, has found that the species abounds in many of the reservoirs in Kerala. The presence of the fish in large numbers has led to the disappearance of many of the indigenous species, posing a threat to the aquatic biodiversity.\n\nGenerally known as African catfish ( Clarias gariepinus ), the species has been found to thrive well in the Kundala, Mattupetti, Anayirankal, Munnar head works, Shengulam , Ponmudi, Kallarkutty and Lower Periyar dams and in all the tributaries of the Periyar river. Juveniles weighing 150 grams and adults weighing 2 kg to 7 kg were caught during the survey, indicating that the fish was breeding continuously in the open waters. Native to Africa and the Middle East, where it inhabits freshwater lakes, rivers, swamps and urban sewage systems, the African catfish was introduced all over the world in the early 1980s for aquaculture purposes.\n\nThe nocturnal predatory fish feeds primarily on living as well as dead animal matter, including fish, invertebrates, and small birds. Its ability to survive in shallow mud for long periods of time and its high tolerance for poorly oxygenated water give it an edge over other native species. It is also capable of hybridising with other catfish, though there is no evidence of that in India.\n\nInterestingly, the African catfish are considered sacred in many temple ponds like the Thiruvachira Sreekrishna Temple, Kozhikode, where they are fed by the temple authorities.\n\n“There is an urgent need to prevent the spread of aquatic invasive species that pose great risk to the environment, economy, or human health,” says A. Biju Kumar, Head, Department of Aquatic Biology and Fisheries, University of Kerala.\n\n“Steps should be taken to prevent the culture of species like African catfish and Nile tilapia ( Oreochromis niloticus ) that are not formally introduced in the country.”", 
    "section": "national", 
    "title": "Invasive catfish rules Kerala’s reservoirs", 
    "subsection": "general", 
    "date": "2016-03-27"
}