{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Modi keeps the focus on development in election rallies in the State\n\nWhich way is the wind blowing?Prime Minister Narendra Modi with the BJP’s chief ministerial candidate for Assam, Sarbananda Sonowal, in Majuli in Assam on Saturday.— Photo: Ritu Raj Konwar\n\nPrime Minister Narendra Modi kept his focus firmly on development issues in the first series of election rallies he addressed in Assam on Saturday, and said his fight was “not against Chief Minister Tarun Gogoi, but Garibi [poverty], corruption and destruction of the State.”\n\nHe addressed five public meetings in the State, in Tinsukhia, in upper Assam, Majuli (the constituency of the BJP’s chief ministerial candidate, Sarbananda Sonowal), Bihpura, Borakhat and Jorhat. In all these rallies, the focus appeared to be development, attacking the 15-year-old Congress government’s record in governance, and projecting Mr. Sonowal as a fresh face in the politics of the State. By keeping the focus on development, party sources said the Prime Minister was avoiding the mistakes of the Bihar polls, that became a contest between him and Chief Minister Nitish Kumar.\n\n“I have three agendas. Development, fast development and all round development,” he said. “I don't want to waste time fighting an individual. I have no fight with Tarun Gogoi. My fight is against poverty, unemployment, corruption, absence of education, sickness, backwardness, Assam’s destruction. I seek people’s blessings to take Assam on the road of progress,” he said.\n\nTinsukhia is also considered an area where the dominant Ahom community, to which Mr. Gogoi belongs, holds sway and Prime Minister Modi was careful not to ruffle any feathers by personal remarks. “Gogoiji, in a few years you will be 90 years. You are my elder. I come to Assam to pranam [respect] you and not fight with you. According to our tradition, the elder blesses the younger,” said Mr. Modi.\n\n“There is only one ‘anand’ [joy] in Assam, it is Sarbananda [Sonowal],” he said praising the Union Minister for Sports and Youth Affairs. “You give me five years, you give Sarbananda five years and BJP and its allies will pull Assam out of its difficulty,” he said.\n\nHe tried to strike a cord with voters in the tea producing State by recalling his days as a tea seller brewing Assam tea. “It was your tea I sold to people and spent my childhood,” he said.\n\nDespite the fact that sealing of the Indo-Bangladesh border is a big promise made by his party in these polls, Mr. Modi did not make any mention of it.\n\n“With you I want to bring development to Assam, provide job opportunities to the youth, electricity to villages. We have given funds for development of Assam's infrastructure, railway. To fulfil the dreams of the youth I ask for your blessings,” he said.", 
    "section": "national", 
    "title": "Issue is Garibi, not Gogoi: PM", 
    "subsection": "general", 
    "date": "2016-03-27"
}