{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "Deepak Jaiswal, a journalist from the Hindi newspaper Dainik Dainandini , was arrested by the police in Dantewada district on Saturday. He is the fourth Bastar-based journalist to be arrested in the past six months.\n\nMr. Jaiswal was arrested in a case registered last year in which he was accused of “entering the examination hall, trespassing, obstructing public servant in discharge of public function.”Mr. Jaiswal is a close associate of journalist Prabhat Singh, who was arrested by the police earlier this week. He was reportedly held when he visited the court in Dantewada to attend the proceedings in Mr. Singh’s case. Asked about the arrest, Dantewada Superintendent of Police Kamlochan Kashyap told The Hindu : “Mr. Deepak Jaiswal is not a journalist. We asked the publicity wing of the government about him and they have given us in writing that he was not registered with them as a journalist. He runs a hotel business here. He has been arrested in a case in which Prabhat Singh is a co-accused. He was a close friend of Prabhat Singh. We produced Deepak Jaiswal in court and he has been sent on four days of judicial remand.”\n\nThe South Bastar Reporters’ Association came down heavily on the police for the arrest.\n\n“Deepak Jaiswal has been a full-time journalist for thee past two years and I can personally testify for that. We have decided that from now on, no coverage will be given to the police or the Maoists by reporters based in Dantewada. Why should we report about them if they do not even consider us journalists? We will speak to our counterparts in neighbouring Bijapur, Sukma and Bastar district and ask them to join us in boycotting the police and the Maoists,” the organisation’s president Bappi Roy said.\n\nDeepak Jaiswal\n\nis the fourth\n\nBastar-based scribe to be held in the past six months", 
    "section": "national", 
    "title": "Journalist held in Dantewada", 
    "subsection": "general", 
    "date": "2016-03-27"
}