{
    "author": [
        "George Jacob"
    ], 
    "text": "A nurse from Kottayam in Kerala and her 18-month-old child were killed in a shell attack on Friday in the ancient city of Sabratha, in strife-torn Libya.\n\nThe deceased are Sunu Sathyan (29), a nurse at Zawiya Medical Centre, and her son Pranav. They, along with a few others in the same complex, were killed when a shell reportedly fell into their apartment during an air strike.\n\nMs. Sunu’s husband Vipin Kumar was not in their apartment at the time.\n\nVipin Kumar of Vandematharam Thulaseebhavan, Veliyannur, near Kuravilangad, and his family were staying at the four-storeyed office quarters of the hospital. The attack occurred around 7.30 p.m. on Friday, according to reports reaching here.\n\nConflicting reports\n\nHowever, their distraught kin say they have been getting conflicting information on how they died “The first bit of information came early Saturday morning,” said Thulasidharan, Vipin Kumar’s elder brother. “We were initially told that it was a missile attack. Then they said it was a shell attack. Later on Saturday, Vipin’s friends in Libya called us from there to say that they died when some explosives where hurled during a fight between two group of Libyans staying in the same apartment,” said Mr. Thulasedharan, who is a small farmer and also works on the side in a local tea shop.\n\nMr. Thulasidharan said that Vipin’s friends told him that he had gone out of the apartment to a friend’s flat nearby on Friday, only to hear the explosion in his flat a few minutes later.\n\n“My brother’s last WhatsApp message came at about 3 p.m. on Friday, and it said they were enjoying the weekly holiday. He had gone to a flat where his friends stay, about 12 km from his apartment,” Mr. Thulasidharan said. Mr. Vipin Kumar, he said, was in a state of shock, and had not contacted the family afterwards.\n\nVipin, a qualified male nurse, had gone to Libya in 2010 to join the Zawiya Medical Centre. He came back in 2012, married Sunu, a nurse herself, and then went back. His wife joined him in January 2013 after she too managed a job in the same hospital. Their son was born in the Sabratha. “They celebrated the child’s first birthday in Libya. We were all eagerly waiting to have him with us here for his second birthday on May 2,” Mr. Thulaseedharan said.\n\nBodies sent for\n\npost-mortem\n\nAccording to Mr. Thulasidharan, the bodies were being taken to a hospital in Tripoli for post-mortem. “We have been told that the bodies will be brought here within a week,” he said.\n\nMeanwhile, Chief Minister Oommen Chandy’s office informed that it was in touch with External Affairs Minister Sushma Swaraj after the news of the deaths came in. More than 20 Indian families, all of them working in the same hospital, are stranded in Sabratha.", 
    "section": "national", 
    "title": "Kerala nurse, son killed in shell attack in Libya", 
    "subsection": "general", 
    "date": "2016-03-27"
}