{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A nurse from Kottyam in Kerala and her 18-month-old child were killed in a shell attack in the ancient city of Sabratha in Libya on Friday night, according to reports reaching here.\n\nSunu Sathyan and her son Pranav were killed in the rocket attack on their apartment block at Zawiya, 45 km from the Libyan capital, Tripoli, External Affairs Minister Sushma Swaraj said in a tweet from New Delhi.\n\n“On 25 March 2016, around 4 p.m. Ms. Sunu Sathyan an Indian nurse from Kerala and her son Pranav were killed when a rocket hit their apartment. We have got in touch with her husband, Vipin Kumar. There are 26 more Indians working in Zawiya hospital,” Ms. Swaraj said.\n\nSunu (29) was working as a nurse at Zawiya Teaching Hospital. She was staying with her husband and son at the four-storey office quarters of the hospital.\n\nReturn delayed\n\nAccording to her family back home, Sunu had been in Libya since 2012 after her marriage.\n\nMr. Kumar is also working as a nurse in the same hospital. They were trying to return to Kerala in the face of the worsening situation in Libya on account of war.\n\nHowever, the return was delayed as the hospital authorities had refused to part with their documents and their outstanding remuneration. They were hopeful of returning by mid-April, relatives said.\n\nMore than 20 Indian families, all of them working in the same hospital, are stranded in Sabratha, where the fight between the rebel forces and the U.S. has intensified since last month.\n\nThe bodies have been moved to hospital’s mortuary. But clearance was yet to be obtained for bringing the body back and for the rescue of other Indians, the office of the Kerala Chief Minister, Oommen Chandy, said.\n\nChandy steps in\n\nMr. Chandy had got in touch with the External Affairs Minister, the CMO added.\n\nMs. Sunu is the daughter of Sathyan Nair and Sathi of Karoth Karoor House, Kondadu. She had completed her nursing course in Bengaluru.\n\nMs. Swaraj made a fresh appeal, urging people in conflict zones to move out.\n\n“We have issued advisories many times. I request you once again — please move out of the conflict zones,” she said.\n\nMr. Nair has sought the Kerala government’s help to bring back the mortal remains of his daughter and grandson.\n\n(With additional\n\ninputs from PTI)\n\nHer father has sought Kerala government’s\n\nhelp to bring\n\nback the bodies", 
    "section": "national", 
    "title": "Kerala nurse, son killed in rocket attack in Libya", 
    "subsection": "general", 
    "date": "2016-03-27"
}