{
    "author": [], 
    "text": "Japanese artist Tatsuo Miyajima tries to convey a profound message through his new work “Time Waterfall” displayed onHong Kong's tallest building\n\nJapanese artist Tatsuo Miyajima’s new work “Time Waterfall” has been shrouded in dense fog for most of the week, his trademark numbers partly hidden as they cascade down Hong Kong’s tallest building.\n\nBut despite the heavy weather, Mr. Miyajima is still hopeful that his creation will deliver a message to the bustling city’s residents: to be in the moment. The 59-year-old’s newest work is designed to convey the flow of human life through large luminous numbers which work their way down the 490-metre tall International Commerce Centre (ICC), a beacon by night in the centre of the southern Chinese city.\n\nEach separate digit, in various sizes and falling at different speeds, represents the trajectory of different individual lives, and Mr. Miyajima felt Hong Kong was the best place for the exhibit.\n\n“I found this city full of energy, vitality. It was the ideal place to reflect on the questions of life and death,” Mr. Miyajima said.\n\n“The numbers from nine to one scroll gradually, then comes the darkness, then the countdown starts over. The countdown represents life. Darkness symbolises death. It’s the cycle of life that repeats itself.”\n\nThe artist is in town for Art Basel, which has been exhibiting more than 4,000 artists from over 200 galleries around the world all week.\n\n“I’m basically telling the story that life is going on and life and death is happening at this very moment... this very moment is very precious,” he said. “The are three messages in my artwork: to keep changing, connect with everything and continue forever, and it’s hand-in-hand with Buddhist philosophy.”\n\nThe Hong Kong edition of Art Basel, which also takes place in Basel and Miami, has helped feed the city’s reputation as an art hub for Asia.\n\nMr. Miyajima’s work was co-commissioned by Art Basel and will be displayed intermittently over two hours every evening until the end of April. — AFP", 
    "section": "national", 
    "title": "LED number art tells tale of life in Hong Kong", 
    "subsection": "general", 
    "date": "2016-03-27"
}