{
    "author": [], 
    "text": "Asked why this had not been reflected in the statement given to the NIA, he alleged that the statements were not recorded in his “exact” words. Asked why, he said: “I cannot explain why the NIA did not record my statement in my exact words... They never read out the statement to me after recording... I did not ask for the copy and they never gave me a copy.”\n\nThe 55-year-old terrorist deposing from an undisclosed location through a video link said the LeT did not have a women’s wing for combat but it had a wing for social purposes. He said the wing worked on women’s issues like education and health. Appearing before Judge G A Sanap, he said the wing took Quranic classes for women and took care of widows.\n\nOn the fourth and last day of his cross-examination, Headley said one of the reasons for the 26/11 attacks was his school was bombed by Indian planes in 1971. He said he believed that the U.S Israel and India were enemies of Islam. He said it was not true that he wanted Islamic rule for India.\n\nAfter having told the court that he had conducted surveillance of the military cantonment area and the State police headquarters at Colaba, Headley on Saturday said he had also visited the CBI office, the Assembly and the Blue Synagogue in Mumbai.\n\nVisit to Thackeray house\n\nHeadley had already revealed that Shiv Sena supremo Bal Thackeray was on the LeT’s hit-list, and added: “I visited the gate of Bal Thackeray’s house and spoke to the guards there. I told Hafiz Saeed [an LeT operator]that I could complete work on Bal Thackeray within six months. I videographed the CBI office, the Assembly and the Blue Synagogue. I did not take videos of Delhi Darbar and the Israel Consulate. I did not take extensive footage of the Israeli embassy inDelhi,” Headley said.\n\nWhen Advocate Abdul Wahab Khan questioned Headley whether he and his associates were planning to assassinate the former Pakistani President, Pervez Musharraf, he said it was wrong and snapped at Mr. Khan by saying: “I will not comment on questions on Denmark or Pakistan; it is none of your concern.”\n\n“I have not played a very serious role in 26/11,” Headley said. He ended his deposition by telling Mr. Khan: Wahab sahib, Kaha suna maaf [Forgive me for whatever was said].\n\n( With additional\n\ninputs from PTI)", 
    "section": "national", 
    "title": "LeT informed me about Ishrat, says Headley", 
    "subsection": "general", 
    "date": "2016-03-27"
}