{
    "author": [], 
    "text": "The Aam Aadmi Party asked PDP chief Mehbooba Mufti on Saturday to clarify her party’s “deal” with the BJP even as it dared her to publicly denounce Parliament attack convict Afzal Guru as an anti-national.\n\nThe AAP also began a social media campaign #SpeakUpMehbooba.\n\nA series of tweets put out by the party’s official account accused Ms. Mufti of betraying Kashmiris and “Kashmiriyat” by indulging in political opportunism. “Relationships of convenience make ideology irrelevant as PDP forms govt with BJP. BJP and PDP are allies PDP is Afzal sympathizer. So now, BJP too is Afzal sympathizer? Mehbooba shatters the confidence of the kashmiris, leaves them like orphans,” the tweets said.\n\nDelhi Chief Minister Arvind Kejriwal also tweeted, “Mehbooba ji shud publicly clear her stand on this deal with BJP.”\n\nMs. Mufti met Governor N.N. Vohra on Saturday and staked claim for government formation in Jammu and Kashmir.\n\nIn an open letter to Ms. Mufti, AAP leader Kumar Vishwas asked her to accept as “mistake” her “hailing” Guru as a martyr in the past.\n\n“We have come to know from sources that you have changed your stand on traitor Afzal Guru. According to the terms of the alliance, you now consider him an anti-national and you regret your old stand. It is praiseworthy and we appreciate it,” the letter said.\n\nAlleging that action against Kashmiri students who had raised “anti-national” slogans at JNU was stalled owing to Ms. Mufti, the AAP hoped that following government formation in the State, she would arrest them or assist the Centre in doing so.\n\n“You now consider Kashmir an integral part of India like patriots like us. Please clarify to the media stating that hailing Afzal Guru as a martyr was your mistake and you consider him an anti-national,” it said. — PTI\n\nAAP begins social media campaign #SpeakUp\n\nMehbooba", 
    "section": "national", 
    "title": "Mehbooba betrayed Kashmiris, says AAP", 
    "subsection": "general", 
    "date": "2016-03-27"
}