{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "Three months after the terror attack on the Pathankot airbase, the Indian government in a first, will allow access to a team of Pakistani Military Intelligence and ISI to the sensitive military installation on Monday.\n\nThe team which will arrive in New Delhi on Sunday, will be escorted to Pathankot by the NIA. An officer said, “We are hoping to conduct this case in a constructive and open manner.”\n\nIn another first, official sources said the Pakistani SIT is being facilitated without a Letter Rogatory (LR) having been sent to India. An LR is a formal request sent by a country’s judicial officers asking for permission to take evidence in a foreign country. “In that sense, this is a goodwill visit,” said an official, adding that without an LR being presented, the evidence collected by the Pakistani team would only be preliminary.\n\nOfficials say India has already sent its LR to Pakistan, and hopes to receive an invitation to visit Pakistan to collect evidence soon. “All courtesies that are being extended are on the basis of reciprocity,” a source said.\n\nThe team, which is expected to travel to Pathankot on Monday by a special BSF helicopter, will be shown “the scene of the crime”, and allowed to interrogate non-military witnesses, but would not be allowed to speak to NSG, BSF or military personnel who were present during the attack.\n\nThey would not be able to move freely around the base, and would be restricted to the area that the terrorists had been in, officials said.\n\nStrict conditions\n\nSources told The Hindu the area would be “visually barricaded” and the team taken only to places on the air base that the NIA “deems fit”.\n\nThe strictures have come after concerns were raised by officials, including from the Ministry of Defence, to the team gaining access to India’s forward base that abuts one of the army’s largest cantonments.\n\nIn January, Defence Minister Manohar Parrikar had even ruled out letting the Pakistani team into the base, saying all the evidence on the culprits was in Pakistan.\n\nShortly after their arrival in India on Sunday, the Pakistani visitors will be given a “90-minute briefing” by the NIA officials on the evidence collected so far, including the route of infiltration over the India-Pakistan border, identities of the killed militants, and the information that links them to Jaish-e-Mohammad facilitators in Pakistan.\n\nOfficials confirmed that Pakistani officials haven’t asked to meet NSA Ajit Doval, who has been named in the FIR filed in Pakistan as the informant in the case, as he had given details to his counterpart Lt. Gen. (Retd) Janjua.\n\n“We have pinned the route taken by the terrorists on a map and will be presenting it before the JIT. The riverine route and the village through which they entered along Pakistan border have all been identified by us,” said the official.\n\nAs reported by The Hindu earlier, former Gurdaspur SP Salwinder Singh whose vehicle was snatched by the terrorists to reach the airbase on the intervening night of December 31-January 1 would be presented as a ‘witness.’ It was on Mr. Singh’s complaint that an FIR was registered by the local police.", 
    "section": "national", 
    "title": "NIA to brief Pak. investigation team", 
    "subsection": "general", 
    "date": "2016-03-27"
}