{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A day after Pakistan claimed to have arrested an Indian spy in Balochistan, Indian officials said they were still awaiting consular access to the man identified as retired naval commander Kulbhushan Yadav in Islamabad.\n\nHowever upping the ante over the issue, Pakistan raised accusations against the Indian external intelligence agency R&AW in Balochistan, which borders Iran, with the visiting Iranian President Hassan Rouhani. According to an official statement tweeted by the Military’s ISPR (Inter Services Public Relations), “COAS (General Raheel Sharif) highlighted challenges being faced by Pak. and discussed involvement of the R&AW in Pak.’s internal affairs especially in Balochistan.”\n\nGood ties with India: Iran\n\nAsked about General Sharif’s comments at a press conference in Islamabad, Iranian President Rouhani denied he had “any discussion on this issue.” “We had talks about how we can expand Iran-Pakistan ties. Also we have good relations with India. So there is no problem. The problems of this region cannot be solved militarily, and must be solved through talks, like the Iranian nuclear problem was,” Mr. Rouhani said to a question.\n\nThe MEA officials declined to comment on the Pakistani Army Chief’s comment, and whether it was related to the arrest of the Indian national along the Afghan-Pak. border on March 21 for what Pakistan called “subversive activities.”\n\nDocuments released by military officials included an Indian passport under an assumed name and a valid visa from Iran. Mr. Yadav is believed to have been based in Iran. Pakistani officials claimed he was working with R&AW and the Afghan agency NDS, and was “placed in Chahbahar, Iran in 2003 to work against Pakistan.”", 
    "section": "national", 
    "title": "Pakistan ups the ante, raises Balochistan issue with Iran", 
    "subsection": "general", 
    "date": "2016-03-27"
}