{
    "author": [], 
    "text": "Samajwadi Party on Saturday came out in full support of beleaguered Parliamentary Affairs Minister Azam Khan whose competence was questioned by Uttar Pradesh Governor Ram Naik, alleging communal forces were behind his character assassination.\n\n“Communal forces wanting to gain political mileage are behind the character assassination of Khan,” SP spokesman Rajendra Chaudhary said in a release, apparently peeved over Mr Naik’s remark.\n\nHis statement, in which he did not name Mr Naik, came a day after the Governor questioned Mr Khan’s abilities as the Parliamentary Affairs Minister while taking strong exception to his comments against him in the Assembly.\n\n“Azam Khan is a competent player of parliamentary politics, impressive orator who effectively answers to the criticism of opposition parties,” Mr Chaudhary said, adding he is committed to secularism and has complete faith in SP chief Mulayam Singh Yadav’s leadership.\n\n“Even opposition leaders praise his parliamentary skills in the House...he has rare oratory skills and it is not right to question his competence and abilities,” Mr Chaudhary said.\n\nPublic life is transparent and Azam Khan’s life is an open book, he said, adding Mr Khan has been in politics since the past several decades and his life has been that of struggles since the days of student politics.\n\n“He has acquired the present position in politics through hard work and has earned fame at the national level,” Mr Chaudhary said.\n\nThe SP spokesman also said Chief Minister Akhilesh Yadav has complete faith in Mr Khan, who has successfully managed the “Mahakumbh” in Allahabad which was acknowleged all over the world.\n\nMe Chaudhary said politics is based on some ideology and values in which criticisms take place over policies but in the recent times, ideology has taken a back seat and attempts are made at character assassination. “Some people are out to spoil the image of Samajwadi Party fearing its growing popularity and they have been targeting one minister after the other depicting their cheap mentality”, he added.\n\nTaking strong exception to Mr Khan’s comments against him in the Assembly, Mr Ram Naik had questioned his competence as the Parliamentary Affairs Minister and said he would take up the matter with the Chief Minister. The Governor, who went through the CD and script of the remarks made by Mr Khan on the floor of the House during discussions on March 8, wrote to Speaker Mata Prasad Pandey.\n\n“After going through the edited and unedited copies it is clear that of the 60-line typed comments of Azam Khan against the Governor, 20 lines have been removed. Removal of 33 per cent lines of Parliamentary Affairs Minister’s statement shows that his language is not in keeping with the dignity, decorum and traditions of the House,” Mr Naik said in the letter. Mr Naik had taken serious note of Mr Khan’s hard-hitting remarks against him in the House and had written to the Speaker the next day asking him to provide the unedited printed copies and audio/video CD. — PTI", 
    "section": "national", 
    "title": "SP backs Azam after Governor questions competence", 
    "subsection": "general", 
    "date": "2016-03-27"
}