{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Ruling that beef eating is not an offence under the Indian Penal Code, the Madras High Court bench here said that there is no restriction on the eating habits of people belonging to different religious denominations under any other law as well.\n\nJustices S. Manikumar and C.T. Selvam made the observation while dismissing a public interest litigation petition that sought eviction of shopkeepers who eat beef on the Girivalam (circumambulation) pathway around the Dhandayuthapaniswamy Temple at Palani in Dindigul district.\n\nThe judges said: “Claiming to be a practising lawyer and under the garb of president Hindu Munnetra Kazhagam, K. Gopinath, party-in-person, is before us, seeking for a writ of mandamus.\n\n“Nowhere in the Indian Penal Code it is stated that eating non-vegetarian food is an offence. There is no law touching eating habits of any religion and in such a view of the matter, the contention of the petitioner that eating beef is an offence cannot be accepted,” the Bench said.\n\n“He wants a direction to the respondents (Hindu Religious and Charitable Endowments Department officials) to remove shops run by persons belonging to Islam, and other religions, where they are eating beef insulting the religious faith of the devotees and creating disharmony,” Justices S. Manikumar and C.T. Selvam said in the order.\n\nThough the petitioner had contended that causing discomfort to the devotees by consuming beef on the pathway was a punishable offence, the judges said that he had not produced even a scrap of paper to prove that Muslims had put up shops around the temple.\n\n“The petitioner has also not substantiated that people belonging to religions other than Hinduism cannot have any shops in the property… The further contention that by eating non-vegetarian food, they have created discomfort to Hindu devotees is also not substantiated.”\n\n‘There is no law\n\nin the country\n\nthat touches upon eating habits\n\nof any religion’", 
    "section": "national", 
    "title": "Statutes don’t say eating beef is an offence: HC", 
    "subsection": "general", 
    "date": "2016-03-27"
}