{
    "author": [], 
    "text": "Punjab Chief Minister Parkash Singh Badal on Saturday said the Sutlej Yamuna Link (SYL) canal was not merely a political issue but an emotive one and demanded that it be tackled as top priority with utmost sensitivity as river water was the lifeline of every Punjabi.\n\nTalking to media persons on the sidelines of the first convocation of Sri Guru Granth Sahib World University held here at its campus, Mr. Badal said Punjab had been discriminated against on every issue be it political, social, economic or religious by the successive Congress governments at the Centre. Punjab was denied its rightful share in river water during the water distribution done thrice in over five decades in brazen defiance of an internationally and nationally accepted riparian principle, he said.\n\nCustodians of river\n\nRebuking the Congress leadership for accusing the SAD-BJP government of deliberately raking up the SYL issue ahead of the 2017 Assembly polls, the Chief Minister said the people of the State were custodians of the river water and would not allow sharing of a single drop with any other State as Punjab didn’t have spare water to share. Mr. Badal asked Congress to stop doing politics on the issue and criticising the alliance which had already made clear its stand that their leadership was prepared to make any sacrifice to save the river water.\n\nMr. Badal castigated the Congress for dubbing former Chief Minister and president PPCC Amarinder Singh as the ‘saviour of waters’ for passage of Punjab Termination of Agreements Act, 2004, claiming that in reality this legislation was an unintentional admission of guilt by Congress government for betraying the people of the State.\n\nEarlier in his convocation address, the Chief Minister said the State government would soon come out with a policy within the legal framework to regularise the services of its adhoc/contract employees for ensuring job security to them. - PTI", 
    "section": "national", 
    "title": "Stop doing politics on SYL issue, Badal tells Congress", 
    "subsection": "general", 
    "date": "2016-03-27"
}