{
    "author": [
        "Brooks Barnes"
    ], 
    "text": "Franchise is expanding with toys that reflect diversity\n\nThomas (right) with one of his new friends, Ashima from India.— Photo: Mattel/NYT\n\nThomas’ friends are finally getting a little more diverse.\n\nWith more than $1 billion in annual retail sales, Thomas the Tank Engine and his locomotive pals constitute one of the world’s largest preschool toy and television franchises. Created in 1946 by a British clergyman, Thomas has charmed generations of boys and girls — especially boys — by teaching gentle life lessons on the fictional island of Sodor.\n\nBut the property’s old-fashioned sensibility makes some parents angry. In 2014, for instance, an essay attacking the Thomas & Friends series for a lack of diversity, among other things, spread quickly online after publication in The Guardian .\n\nMattel, which bought Hit Entertainment, the owner of Thomas & Friends, for $680 million in 2012, lists about 100 characters on the brand’s official website. The vast majority are male and apparently white.\n\nAt the same time, Mattel has been eager to capitalize on its investment by finding ways to make the franchise more popular in fast-growing markets around the world. In an expansion two years in the making, Mattel is giving Thomas 14 new friends, with many coming from countries such as India, Brazil, China and Mexico. Four are female trains.\n\nThe characters will be introduced in a DVD movie called The Great Race that is scheduled for staggered global release starting in August; related merchandise will jointly arrive worldwide in stores. Consumers are demanding more diversity — just ask the Academy of Motion Picture Arts and Sciences — and preschool entertainment is no exception.\n\nTo go with quaint stalwarts like Winnie the Pooh, Disney has introduced series like Doc McStuffins , about a creative little girl who happens to be black; Disney will soon introduce a Latina princess, a first for the company.\n\nHere is a closer look at some of Thomas’ new friends.\n\nRaul of Brazil\n\nAttributes, according to Mattel materials: “feisty,” “strong and agile.”\n\nVincent D’Alleva, who oversees Thomas & Friends for Mattel, said in a phone interview that The Great Race movie was made with this summer’s Olympic Games in Rio de Janeiro in mind.\n\nCompetitors from different countries coming together as one was a way to make Thomas more culturally aware. “This story is a way to help him understand that there is a bigger world out there,” Mr. D’Alleva said.\n\nYong Bao of China\n\nAttributes: “driven to achieve and make progress.”\n\nMost of the existing locomotives have names that are basic (Edward, Emily, Sam) or sound British (Fergus, Duncan, Bertie). So Yong Bao stands out right away. China has become a crucial growth market for the franchise.\n\n“Three years ago, we weren’t even in China,” Mr. D’Alleva said. “Now it’s the second-largest territory for us,” behind the United States, with Britain falling to third.\n\nAshima of India\n\nAttributes: “shows no fear,” “happy to help out.”\n\n“She is the first one who can take on Thomas in terms of being the fastest engine,” Mr. D’Alleva said. “It’s not a romance story because, well, that’s not something for our target audience. But it is about developing a relationship. How does Thomas develop a relationship with someone who looks very different from him and in some cases can do things better than he can?”\n\nCarlos of Mexico\n\nAttributes: “proud,” “always wearing a smile.”\n\nIf Carlos seems to have a Frida Kahlo-style unibrow, that may be intentional. Mattel went to great lengths, Mr. D’Alleva said, to make sure each new character had a colour palette and personality reflective of a particular country’s culture.\n\nWherever possible, each locomotive was designed after a train from the country it represents. Carlos is patterned after a Ferrocarriles Nacionales de Mexico locomotive known as No. 903. — New York Times News Service", 
    "section": "national", 
    "title": "Thomas the Tank Engine now has an Indian friend", 
    "subsection": "general", 
    "date": "2016-03-27"
}