{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Industries, non-Government organisations, and the public can use the India Energy Security Scenarios (IESS) 2047 tool to find out the energy security scenario in the country, said Ripunjaya Bansal, young professional of NITI Aayog, here.\n\nHe said at a stakeholders’ consultation meeting on the IESS 2047, organised by FICCI, Indian Chamber of Commerce and Industry, Coimbatore, and NITI Aayog, that the tool was an open source Excel-based one that gave the current installed capacity and generation targets and projections of various sources of energy in the country till 2047.\n\nThe first version of the tool was released in 2014 and the second version in August last year. The NITI Aayog developed the tool jointly with knowledge partners and data was collected from various agencies. While this was a national-level tool, States can also develop a similar one. Odisha had already done so and Gujarat had just initiated a project. Similar efforts could be made at the city-level too. The meeting held here on Friday was to disseminate information and create awareness. Any citizen in the country can use the tool (www.indiaenergy.gov.in)\n\nCoimbatore Corporation Commissioner K. Vijayakarthikeyan said the city needed such a tool as many of the projects proposed under Smart Cities initiative were energy based.\n\nThe Swachh Bharat, Smart Cities and National Solar Mission were all related as it involved generation and use of different sources of energy. A tool that would give clear indications of the demand and supply position would help plan the projects better.\n\nR. Shantha Kumar, member-energy panel of FICCI Tamil Nadu, spoke about the IESS programme. D. Nandakumar, president of Indian Chamber of Commerce and Industry, Coimbatore, said the tool estimated the future energy needs of the country and the current position.", 
    "section": "national", 
    "title": "A tool to assess energy security", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}