{
    "author": [
        "S Sundar"
    ], 
    "text": "(From left) Collector K. Veera Raghava Rao, left, inspecting vehicle checking at Mattuthavani in the city on Sunday as model code of conduct has come into force for assembly elections. Men covering wall paintings on Panangal Road. — Photos: R. Ashok and G. Moorthy\n\nWith the model code of conduct in force, official machinery’s focus has shifted to check malpractices\n\n“Free and fair” is the buzzword heard during elections.\n\nBut, many a time it becomes very difficult for officials to check free flow of liquor, biriyani and money distribution.\n\nThough these violations used to happen in isolation here and there in the past, the three by-elections to Madurai Central (2006), Madurai West (2007) and Tirumangalam (2009) made it more organised.\n\nA real challenge\n\nIt went to the extent of Madurai district earning the ‘nation-wide notoriety’ of having ‘invented’ a “Tirumangalam formula”— innovative ways of bribing voters to garner votes during the by-election to Tirumangalam. Now, it would be a real challenge for officials to contain money distribution in the run-up to the May 16 polling.\n\nThe by-elections also kicked up controversies of reported partiality shown by officials.\n\nAnd these complaints of bribing voters have come up in every other elections held in the district there after.\n\nStage set\n\nIt is against this backdrop that the stage is set for the democratic exercise of polling to elect 10 members of Legislative Assembly from Madurai district.\n\nThe district administration is geared up with all required infrastructure in place for the mega event.\n\nA total of 2,685 polling stations in 1,104 locations have been almost kept ready.\n\nIn the laborious task of purification of electoral rolls, around 25,000 double entries or names of dead persons and those who had migrated have been identified.\n\nWith the model code of conduct in force, the district administration’s focus has shifted to check malpractices.\n\nFlying squads\n\nIt lost no time in deploying flying squads and static surveillance teams (SST) across all the 10 Assembly segments.\n\n“We have formed three teams each for flying squad and SST for each of the 10 Assembly constituencies to keep round-the-clock vigil against violations of the model code of conduct,” Collector K. Veera Raghava Rao said.\n\nAction against violators\n\n“We have started erasing the wall writings in the district. It will take a couple of days for our officials to find those graffiti in every nook and cranny of the district. If the political parties do not come forward to erase wall writing themselves, the district administration will take it up and also book violators,” the Collector said.\n\nMeanwhile, the ruling party had employed men to cover wall paintings of Chief Minister Jayalalithaa on Panagal Road to escape action by the officials.\n\nHowever, the announcement of election schedule, over 70 days ahead of Tamil Nadu going to polls, has brought about some pleasant surprises for the residents.\n\nFor, most of the hoardings that remained a hindrance on arterial roads have vanished overnight.\n\nDespite a long list of dos and don’ts on erection of hoardings, these norms were followed more in breach in the city by political parties, especially the ruling one, who cause all inconvenience to road-users.\n\nBesides the shopkeepers, it was the pedestrians who were the worst affected as the huge hoardings were kept across the pedestrian pathways.\n\n71 cases registered\n\nThe district police have registered 71 cases for disfigurement in open places.\n\nThey have registered 62 cases for prohibition-related offences and arrested 57 persons.\n\nThe city police also seized 189 bottles of IMFL from one person in Lemon Market on East Masi Street on Saturday.\n\n“Containing liquor bottle distribution during electioneering will be one area we will be focussing on, since it is a gross violation of the code,” a city police officer said.\n\nTroublemakers identified\n\nBoth the city and district police units have identified over 3,000 criminal elements and troublemakers.\n\nThe police have formed special teams to execute arrest warrants pending against absconding criminals.\n\nThe police have also asked the licensees of arms to deposit their arms in police stations immediately.\n\n“So far, over 200 of 490 licensed arms (in the rural police limits) have been deposited,” Superintendent of Police Vijayendra Bidari, said.\n\nThe police will soon bring all marriage halls and lodges under their vigil to prevent any illegal activity during the electioneering.\n\nThe officials feel tempers will run high only after electoral alliances are forged and candidates announced. As the mercury level goes up, it is only expected that the officials will feel the heat of heightened political activities this summer.", 
    "section": "national", 
    "title": "Administration gearing up infrastructure for elections", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}