{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "Doctors say an increasing number of youth also require hip replacement surgeries\n\nOver the last few years, doctors in the city have begun to notice a worrying trend – an increasing number of young people are losing movement in their hips, and many require hip replacement surgeries.\n\nThe reasons, doctors say are due to the excessive use of alcohol, an increased use of anabolic steroids in sports and bodybuilding and also, the unregulated use of steroids. These patients are mostly in their early twenties and thirties.\n\n“What large amounts of alcohol or steroids can do is block the blood supply to the hip joint. This eventually causes pain, and loss of movement. As the disease progresses, the pain becomes worse. Eventually, if the patient is in the later stages, a hip replacement is required,” said Samuel Chittaranjan, former head of the orthopaedics department at Sri Ramachandra University.\n\n“When blood supply is blocked, tissue in the ball of the hip joint or the head of the femur begins to die. This is known as avascular necrosis. As a consequence, the joint becomes irregular, and patients in the prime of their life can become disabled. In India, the most common reason for hip replacement is avascular necrosis — completely opposite to what is in the West,” said Vijay C. Bose, consultant orthopaedic surgeon at SRM Institutes for Medical Science. In the last year, Dr. Bose said, he has seen around 200 such cases.\n\nA lot of young people, especially men, use steroids for body-building, and often this is unsupervised, said Dr. Chittaranjan. “There is also a rise in the instances of substance abuse, including alcohol and the giving out of steroids by quacks,” he said. Some young people are on steroids for medical disorders, and avasuclar necrosis could be an unfortunate side effect of this too, said Dr. Bose\n\nIn the last five years, Prakash Selvam, consultant orthopaedic surgeon at Soundarapandian Bone and Joint Hospital, has seen about 50 such patients. “These cases were not very common 20 years or so ago, but now, 40 per cent of the avascular necrosis cases I see are alcohol or steroid related,” he said.\n\nOne of the problems, said Dr. Chittaranjan, is that many of the patients come in only during the late stages.\n\n“At first, there may be no symptoms or a mild pain in the groin area. They may take painkillers for this. Another problem is that the condition is not visible in an X-Ray in the early stages – an MRI is needed. So it’s only when the pain is unbearable that they come in for treatment, by which time hip replacement is usually needed,” he said.\n\nThe surgery is expensive, said Dr. Chittaranjan, and while patients do go back to work and even sports afterwards, an implant can never be as good as the natural hip, he said.\n\n“And with young patients, the issue is that the implant may last 15 or 20 years but after this, they’d need another revision surgery. And, this is even more expensive and complex. The more surgeries that are done, the more that natural bone is lost,” he said.\n\nOther options in the early stages include medical therapy said Dr. Bose.\n\n“About 40 per cent of patients do well on this,” he said.\n\nDecompression surgery to encourage blood supply to the joint is also done in the early stages and stem cell therapy to help regenerate damaged tissue is now being tried out, said Dr. Chittaranjan.\n\nWhile newer, more sophisticated implants for surgery are now available that could last up to 30 years and offer better range of motion, these are expensive, said Dr. Bose.\n\nMore studies, he said are needed in India to find ways to salvage the joint early, especially as the disease seemed to affect the Asian population more than those in the west.\n\nFor 29-year-old Rishi,* the pain began five years ago. “But as time went on, it became worse. I could not use an Indian toilet and when I sat on the floor, I had difficulty getting up again,” he said. Both of Rishi’s hips are affected and while the left has been replaced, he is waiting for a surgery on the right.", 
    "section": "national", 
    "title": "Alcohol, steroids affect hip movement in youth, say doctors", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}