{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "Project completed at Vivekanandar Illam is one among many sanctioned to beautify the beach\n\nhe Chennai Corporation has given a facelift to Vivekanandar Illam — an important landmark in the city along Kamarajar Salai — by creating a new bus bay.\n\nThis is part of a larger project to beautiful spots along the Marina beach.\n\nThe project includes a new bus bay near Vivekanandar Illam, restoration of greenery on either side of Kamarajar Salai, creating new bus shelters, development of wider pavements and completion of heritage pillars. Greater Chennai Corporation has created bays for buses, carving out land from a park at the intersection of Dr. Besant Road and Kamarar Salai. “The bay will also ease congestion on Kamarajar Salai. New pavements and bus shelters will improve conditions for pedestrians,” said an official.\n\n“We have conducted a study of the roads and designed the bays. The design will actually address the concern of some who feel that the speed of buses would reduce because of the bus bays,” said an official. “We have done a study on six places. We require six to seven grounds. But acquisition is a problem,” the official said.\n\nMost of the work on 300 heritage pillars, each 1.2-metre tall, has been completed. Most of the eyesores near heritage buildings along the Marina beach have been cleared out for the project. The work started in 2014 and was delayed because of fund crunch, causing hindrances to pedestrians last year. The heritage pillars have been designed to replace existing walls of various institutions to improve the aesthetics along the Marina beach.\n\nThe civic body also started improving the greenery along the beach with introduction of new species of plants. “The selection of species was made to withstand dry spells also. The conditions may improve this summer,” said an official.\n\nProject includes restoration of greenery, completion of heritage pillars, wider pavements and new bus shelters", 
    "section": "national", 
    "title": "Bus bay at Marina to ease congestion", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}