{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Inspired by Harish who donated organs after being severed by truck\n\nThe State government is set to launch a cashless treatment plan for road accident victims in memory of 23-year-old Harish Nanjappa. To be named Mukhyamantrigala Santwana Harish scheme, it entitles accident victims to immediate cashless treatment at hospitals for up to 48 hours with a cap of Rs. 25,000. It will be launched on Monday.\n\nHarish was severed after coming under the wheel of a truck.\n\nWhile lying on the road waiting for assistance, he pledged to donate his eyes and other organs. This gesture inspired several hundred people in his village to donate organs.\n\nThe scheme will look at providing assistance to victims of road traffic accidents across the State irrespective of their financial status or nationality.\n\nThe victim will receive medical care for 48 hours and will be able to receive treatment from a set of 25 treatment and ancillary packages, which were recommended for accident victims by an expert committee.\n\nIn order to ensure proper implementation, it will employ a software covering hospital registration, patient registration, claims submission and packages. Participating hospitals have been categorised into Level 1, 2 and 3 trauma centres based on the facilities available with Level 3 hospitals being accorded the status of major trauma centres.\n\nThe packages covered under this scheme include treatment for simple injury, complicated facial injury, injury of extremities, fractures, head injuries, blood transfusion and burn related injuries among others.\n\nUnder existing schemes, poly-trauma cases covered include only non-medico-legal cases, which contribute only 1 per cent of the total cases.\n\nMore information on the scheme can be obtained by calling 108 or 104.\n\nHighlights\n\nCashless treatment for\n\n48 hours after mishap\n\nCap of Rs. 25,000\n\n25 treatment packages\n\nInjuries covered\n\nComplicated facial injury\n\nInjury of extremities\n\nFractures\n\nHead injuries\n\nBurns", 
    "section": "national", 
    "title": "Cashless treatment plan for road accident victims", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}