{
    "author": [
        "T Madhavan"
    ], 
    "text": "Install signals at Madipakkam Main Road and Velachery Main Road, residents tell traffic police\n\nThere is an urgent need for a traffic signal at Kaiveli bus stop intersection —Photo: G. Krishnaswamy\n\nMotorists and residents want a traffic signal to be installed at the intersection of Madipakkam Main Road and Velachery Main Road.\n\nThe absence of a traffic signal at the intersection — Kaiveli bus stop — has been resulting in chaos, especially in the morning rush hours. Until a traffic signal is installed, policemen should regulate traffic, residents said. The intersection is marked by heavy vehicular traffic throughout the day.\n\nResidents said that the Highways Department started building a minor bridge connecting the huge water channel with the Pallikaranai marshland on the eastern side of Velachery Main Road.\n\nTo make way for the work, the existing traffic signal was removed and vehicles from Velachery were made to travel 300 metres ahead towards Pallikaranai to take a ‘U’ turn to reach Madipakkam Main Road, they said.\n\nThough the work was completed, the signal was yet to be restored.\n\nHighways officials said they had requested Tamil Nadu Generation and Distribution Corporation (Tangedco) to relocate a ‘supporting post’ to create extra space for motorists on the Madipakkam side, but there was no further development. Traffic police (enforcement) officials said that once they received a response from the Highways Department on completion of the project, they would re-install the signal.\n\n“Motorcyclists swerve to the right in order to avoid taking a detour, unmindful of the consequences. A few even sneak through the small gap between the iron barricades,” said Kalaiselvi Rajendran, a motorist.\n\nWith vehicles indulging in speeding, pedestrians find it extremely difficult to negotiate the busy intersection.", 
    "section": "national", 
    "title": "Chaos marks these traffic intersections", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}