{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "In a significant judgment, the Madras High Court Bench here has held that a marriage involving a bride below 18 years of age and groom below 21 does not become void automatically without either of them approaching the Family Court concerned and obtaining a decree.\n\nA Division Bench of Justices S. Manikumar and C.T. Selvam passed the ruling while setting aside an order passed by a Tirunelveli court, which, on April 9, 2015, refused to take on file a 36-year-old woman’s divorce petition, filed on grounds of cruelty, since she was a minor on the date of her marriage in 1995.\n\nWriting the judgment, Justice Selvam pointed out that though the Hindu Marriage Act, 1955 prescribes a minimum age for marriage; it does not state that the breach of such prescription of age would render the marriage either void under Section 11 or voidable under Section 12.\n\n(Section 11 states that a marriage shall be void if either of the party had a spouse living at the time of marriage or if the parties were within the degrees of prohibited relationship and Section 12 lists out instances when a marriage could be annulled by a decree of nullity.)\n\nEven Section 13, which lists out valid grounds for divorce, states that every child marriage shall be voidable at the option of the contracting party provided that her marriage, whether consummated or not, was solemnised before she attained 15 years of age and she repudiates it between 15 and 18 years of age.\n\nFurther, dealing with the provisions of the Prohibition of Child Marriage Act, 2006, the Bench said that the legislation defines a child to mean a person who, if it was a male, had not completed 21 years of age and a person who had not completed 18 years of age in the case of a female.\n\nSection 3 of the Act states that every child marriage, whether solemnised before or after the commencement of the Act, shall be voidable at the option of the contracting party who was a child at the time of marriage provided a petition for annulling the child marriage was filed in the district court concerned.\n\nThe provision also imposes a restriction that such a petition should be filed before the child completes two years of attaining majority. This would mean that a man could file such a petition before he completes 23 years of age whereas a woman should file the petition before she completes 20 years.\n\nPointing out that this anomaly was taken note of by a Full Bench (comprising three judges) of the High Court in another case on October 3, 2011, the Division Bench recalled that the Full Bench had disposed that case with the hope that the Parliament would carry out necessary amendments to avoid complications.\n\nSubsequently, reverting to the case on hand, the Division Bench said: “It is apparent that the court below was under the mistaken impression of a marriage involving a child being void.” Hence, it directed the Family Court in Tirunelveli to number the divorce petition and proceed in accordance with law.", 
    "section": "national", 
    "title": "“Child marriages do not become void without court order”", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}