{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Coimbatore Corporation at its latest council meeting on February 25, 2016 passed a resolution for construction of shops near the VOC Park and zoo. It said that it would take the State Government approval before constructing the shops because as per the development plan the area had been earmarked for agriculture and recreation.\n\nThe corporation also said that before taking up construction of shops near the zoo, it would take the approval of the Directorate of Town and Country Planning as the area was bound by the Parks and Playfield Notification, which prohibits such construction.\n\nBut the very same corporation had admitted in a Right To Information Act reply that it had not abided by the rules in taking the Directorate and Town and Country Planning approval.\n\nThe corporation admission relates to the shops it constructed in the last two years to increase its revenue.\n\nThe civic body had stated that it had constructed 240 shopping complexes in the last two years with Rs. 8.79 crore loan from Tufidco on 25 vacant plots. They include shopping complexes near the zoo, Shastri Maidan, R.S. Puram, near the school on T.V. Samy Road and other places.\n\nTamil Nadu Reserved Site Protection Committee Organiser S.P. Thiyagarajan says that the civic body’s action was patently illegal because it did not follow rules by submitting plan and civil design construction details to the Local Planning Authority and the other concerned authorities.\n\nThe directorate officials have said that the Corporation should apply for permission as per the Town and Country Planning Act, 1971 though it need not pay the infrastructure and amenities charges.\n\nBut they are silent when asked through RTI if they had initiated action by sealing such illegally constructed buildings.\n\nMr. Thiyagarajan says that the LPA or the concerned authority should have acted against the corporation by placing under lock and seal such buildings. But now the corporation has set a bad precedent by throwing open those buildings to highest bidders for rent and increasing its income.\n\nSources in the civic body say that the corporation increased its revenue by Rs. 3 crore a year since constructing the shops.", 
    "section": "national", 
    "title": "Coimbatore Corporation constructs shops without approval", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}