{
    "author": [
        "S Senthalir"
    ], 
    "text": "10 artists are joined by volunteers in their green campaign\n\nArtists paint the shutters of a shop and a door on Perumal Koil Street in Puducherry on Sunday.— Photos: S.S. Kumar\n\nAs the coastal town was still asleep on a lazy Sunday morning, a team of 10 artists carried their paint brushes to visually convey the message of conserving environment.\n\nArt students from Bharathiar Palkalaikoodam and professional artists together sketched an outline on a piece of chalk to visually show the decreasing fodder for cattle in the fast urbanising town. As artists finished the outline, volunteers joined them to assist in painting.\n\nThey were not just beautifying the shutters, doors and wall spaces on the Perumal Koil Street, but attempted to draw public attention to our indifference towards environment. Shilpataru Foundation for Arts organised this public art programme as part of their annual event.\n\nKriti Chandak, founding member of Shilpataru Foundation for Arts, who coordinated this event said: “This year, the emphasis is on public art.”\n\nRaja Perumal, a Puducherry-based artist, says: “We are not here to just decorate the private walls or doors. We have volunteered to paint in order to convey a message to public through art.”\n\nHe was painting a tree in black without leaves or fruits with plastic cans and bags entangled in the roots.\n\n“This is to show how we are destroying our environment. We need to reduce consumption of plastic. Every individual should to stop using these non-degradable materials,” said Mr. Perumal.\n\nAnother artist K. Mounissamy added that it was a responsibility of the artists to create awareness among people through their art.\n\nSeventy-year-old Saroja Thirunavukkarasu arrived around 8 a.m. and joined the youngsters to paint.\n\n“I went to sleep at 3 a.m. so I could not join them early,” she said as she dabbed her brush with white paint and moved it up and down on the shutter.\n\nShe says: “Painting for her is like meditation. Public art is very important and I am extending support to this project for the love of it.”\n\nT. Padmanabhan, a professional artist, said: “We have started this as a small initiative towards public art. We are talking to the government to use public spaces to create visual art with a message. It will take longer time. Today is not going to be the last day. We will continue our work and bring in more artists to this forum to engage in public art.”\n\nOn March 8 evening, Shilpataru Foundation of Arts is screening a film on the artist Bansky.", 
    "section": "national", 
    "title": "Conserving environment, stroke by stroke", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}