{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Karunanidhi says Jayalalithaa has announced projects just before the term of the government comes to an end.\n\nDMK chief M. Karunanidhi on Sunday hit out at Chief Minister Jayalalithaa over the recent announcement of various projects before the announcement of the Assembly election schedule and termed it an eyewash.\n\n“Just before the term of the government comes to an end, Ms. Jayalalithaa has laid the foundation stone for many projects. In just five days, the total worth of projects she has inaugurated is to the tune of Rs.15,192 crore. When will these projects come into effect? Has this allocation been shown in the interim budget? Does it have the sanction of the State Assembly,” Mr. Karunanidhi asked in a statement.\n\nQuestioning the inauguration of various projects, he said the “Own your house” scheme for uniformed services personnel was announced in May 2012. “She had announced that 36,000 houses would be constructed for police personnel. But, of these, she has inaugurated only 2,673 houses,” he said.\n\nThe Uppur thermal plant, for which Ms. Jayalalithaa laid the stone on February 27, was announced in August 2011. “The project was announced when Ms. Jayalalithaa came to power, but she is laying the stone when her term is about to end. The cost of the project in 2011 was Rs. 9,600 crore. Now, it has escalated to Rs. 12,778 crore,” Mr Karunanidhi said.\n\nHe also raised questions about the allotment of land for Karur medical college, the announcement of the State bearing 3 per cent interest on loans for flood-affected small and medium enterprises, and the distribution of flood relief money. The government does not care about the plight of farmers and agriculture, Mr. Karunanidhi alleged.\n\nWith no time to implement any project, Ms. Jayalalithaa had announced these projects in a hurried manner in February knowing fully well that elections are just two months away and the model code of conduct would come into force, Mr. Karunanidhi said.", 
    "section": "national", 
    "title": "DMK chief slams CM for project announcements", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}