{
    "author": [], 
    "text": "(Clockwise from top left) Students of SASTRA University in Thanjavur receiving a trophy in Tiruchi; students of Ayya Nadar Janaki Ammal College in Sivakasi receiving a trophy at Jamal Mohamed College in Tiruchi; National Science Day celebration at Srimad Andavan Arts and Science College in Tiruchi and students of National College in Tiruchi receiving a trophy from Sanjay Mathur, Commissioner of Police in Tiruchi.\n\n(Clockwise from top left) Students of SASTRA University in Thanjavur receiving a trophy in Tiruchi; students of Ayya Nadar Janaki Ammal College in Sivakasi receiving a trophy at Jamal Mohamed College in Tiruchi; National Science Day celebration at Srimad Andavan Arts and Science College in Tiruchi and students of National College in Tiruchi receiving a trophy from Sanjay Mathur, Commissioner of Police in Tiruchi.\n\nAyya Nadar Janaki Ammal College, Sivakasi, emerged winners of JAMATICS 2016, a State level inter-collegiate meet, organised by the PG and Research Department of Mathematics, Jamal Mohamed College.\n\nAround 275 students from various colleges participated in the meet. Events such as ‘Dumb-c,’ ‘Math Rangoli,’ ‘Math Wonder,’ ‘Guess Me’ and quiz were conducted. A.K. Khaja Nazeemudeen, secretary and correspondent, Jamal Mohamed College, and T. Nallathambi, Syndicate Member, Bharathidasan University, gave away the prizes.\n\nManagement meet\n\nSASTRA University, Thanjavur, emerged overall winners of “MancoN 2016,” an inter-collegiate management meet, organised by St. Joseph’s Institute of Management. Lady Doak College, Madurai, finished overall runner-up. Eleven teams from various colleges took part. Events such as quiz, ‘Best Manager,’ ‘Ad-Zap,’ slogan writing, and ‘Mr. / Ms. MancoN,’ were conducted. Rev. V. Joseph Xavier, Director, St. Joseph’s Institute of Management, Rev. G. Pushparaj, Administrator, and A. John Peter, Dean of Academics, spoke at the inaugural function. R.V.S. Muralidhar, MD, Seekers Educational Services Pvt. Ltd. and Vignesh Manohar, Director, Rockfort Honda, distributed the prizes.\n\nScience Day celebrated\n\nStudents from various schools in Tiruchi district took part in National Science Day celebration organised by the PG and Research Department of Physics, Srimad Andavan Arts and Science College. Science quiz, painting, and elocution competitions were conducted for the students. Mohan Kumar, Assistant Professor, PG and Research Department of Physics, Presidency College, gave away prizes in the presence of J. Radhika, Principal, Srimad Andavan Arts and Science College.\n\nSports meet\n\nDepartment of English bagged the overall championship at the 97th annual sports meet of National College. Sanjay Mathur, Commissioner of Police, was the chief guest. Ravi Murugaiah, Chairman, Vasan Estates, and R. Elangovan, Registrar (in-charge), Tamil Nadu Physical Education and Sports University, Chennai, were the guests of honour. K. Raghunathan, secretary of the college, K. Anbarasu, Principal, and D. Prasanna Balaji, Head, Department of Physical Education, were present.\n\nCompetitions conducted\n\nAbout 1,000 students from 50 schools in Pudukottai and Sivaganga districts and 30 students from 10 colleges participated in competitions conducted in connection with National Science Day by Mount Zion College of Engineering and Technology, Pudukottai, Tamil Nadu Science Forum, and the Rotary Club of Pudukottai Central. A. Manavalan, district president, Tamil Nadu Science Forum, presided. Drawing, poem writing, and essay writing competition for school students and poem writing competition for college students were conducted. Jayabarathan Chelliah, chairman, Mount Zion Educational Institutions, gave away the prizes in the presence of Basheer Mohamed, president, Rotary Club of Pudukottai Central and S.T. Balakrishnan, State Secretary, Tamil Nadu Science Forum.\n\nConvocation\n\nThe convocation of the Naina Mohamed College of Education at Rajendranpuram near Aranthangi was held recently. V. Balachandran, Registrar of Alagappa University, Karaikudi, delivered the convocation address and conferred degree on the students. He appealed to outgoing candidates to work hard in shaping the future of our country. He underlined the role of teachers in moulding the character of students and in acting them as a catalyst for their career growth and progress. N. Mohamad Farook, Correspondent of the college, presided over the function. P. Naina Mohamed, N.S. Naina Mohamad and K. Naina Mohamad, all members of the Trust were present.\n\nCivil engineering symposium\n\nCivil engineering lends itself to help resolve the growing infrastructural vulnerabilities of the country,\n\nG. Narayanan, former General Manager of Southern Railways, said at Moments’16, a national-level civil engineering symposium of National Institute of Technology, Tiruchi, in association with Tata Structura. He highlighted the challenging roles that many civil engineers are taking up, exemplifying the Chenab rail bridge in Jammu and Kashmir as one such project where “engineers are risking their lives” to meet the needs of the nation. He explained how the Chenab rail bridge was specially designed to enhance safety and security as the region witnesses frequent terrorist attacks. The concrete pillars of the bridge are designed to withstand explosions. Mr. Narayanan also mentioned a number of career opportunities for civil engineers, including in the IES, civil services and Railways. Six workshops, eight events and three guest lectures were part of Moments’16.\n\nManagement meet\n\nThe Department of Management Studies of M. Kumarasamy College of Engineering, Karur, organised a State-level inter-collegiate management meet “JANANAM 2K16.” Students from 18 colleges took part. Events such as young entrepreneur, best management team, dance, mime, and quiz were conducted. N. Sai Prasad, former Director, Lakshmi Vilas Bank, inaugurated the meet. M. Rajhendran, Regional Head, Lakshmi Vilas Bank, S. Kuppusamy, Executive Director of the college, and V. Kavitha, Principal, spoke.\n\nMeet on big data science\n\nAn international conference on “Big data science and analytics’’ was organised by the Sengamala Thayar Educational Trust Women’s College, Mannargudi. Omar Al Hayasath from Jordan elucidated prospects of students opting those courses.\n\nQuoting global statistics, he said more than 4.5 lakh jobs were up for grabs in the field. He inaugurated a post graduate course in big data analytics in the college recently.\n\nStating that data pile up has crossed the one trillion mark and the daily use of Internet and data analysis has been growing rapidly, he said the demand for safeguarding the data and handling it properly has risen.\n\nPointing out that Indians were engaged worldwide in handling big data, he lauded the role of Indian universities in moulding students and preparing them for higher and more intense assignments. He lauded the launch of big data analytics PG course in a rural college. Correspondent Divakaran presided. Principal Amudha welcomed the gathering. Coordinator Srinath spoke.\n\nIGNOU study centre\n\nThe Indira Gandhi National Open University under the purview of the Union Ministry of Human Resource Development caters to the needs of all sections of the society. It has 3,000 study centres and three million students. It is the endeavour of this university to reach remote and rural areas by establishing a study centre in every district of the country, said IGNOU Regional Director, Madurai, S. Mohanan. He was speaking at the launch of the study centre at the Bo Secours College for Women, Thanjavur. This centre offers programmes like M.A. (English), M.Com, B.Com., B.A., Bachelor Preparatory Programme meant for school dropouts keen in continuing UG programme in IGNOU, Diploma in Tourism Studies, Diploma in value added products in fruits and vegetables, certificate in teaching of English, Certificate in Guidance, Certificate in Functional English, Certificate in Business Skills, Certificate in Consumer Protection, Certificate in Tourism Studies, Certificate in Communication and IT Skills, Certificate in Arabic Language, Certificate in Performing and Visual Arts. D. Victoriya, Principal, Bon Secours College for Women, and Dr. N. Anuradha, Coordinator, IGNOU Study Centre were present.\n\nMeet on budget\n\nA meeting to analyse the components of the Union Budget was organised by the Department of Economics, A.V.V.M. Sri Pushpam College, Poondi, Thanjavur. Former president of the Thanjavur Chamber of Commerce and Industry K. Padmanabhan said the budget presented a roadmap for implementation of a progressive economic framework by listing the priorities. A chartered Accountant A. Guhaneswaran spoke on betterment of the nation’s economic pursuit and promising results on all perceivable financial fronts. The real development of the nation largely rested on the rural economy. The nation’s happiness could be determined by the hardworking creative minded middle class entrepreneurship, he said.\n\nA senior faculty at the Indian Overseas Bank Training Centre, Thanjavur, Purushothaman, highlighted the significance of cashless and transparent transactions. He explained how the society could evolve non-cash business transactions successfully. R. Rajendran, Head, Department of Economics Government Arts College, Kumbakonam, lauded the stress on rural development. R. Gayathri from the Department of Management Studies, NIT, Tiruchi, spoke on the governments mismatching policies. Principal S. Udayakumar, Dean Robert Alexander, Head, Department of Economics, R. Palanivelu, Prof. S. Sangeetha and P. Nadimuthu of the same department spoke.\n\nContributed by\n\nM. Balaganessin,\n\nL. Renganathan\n\nand G. Prasad", 
    "section": "national", 
    "title": "Inter-collegiate meet", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}