{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "Students of Avila Convent Matriculation Higher Secondary School performing at Car-Free Sundays on NSR Road in Coimbatore on Sunday.— Photo: S. Siva Saravanan.\n\nResidents of Saibaba Colony woke up to a bright Sunday morning, thanks to Car- Free Sundays – an initiative of The Hindu in association with Coimbatore Corporation and the City Traffic Police.\n\nAbout 800 metres on NSR Road turned into a huge black board for many children; it was a playground for some others; a platform to showcase talents for school and college students; and a workout area for those interested in yoga and fitness programmes.\n\nAs the police blocked the road for vehicles from 6.30 a.m., Krish Beethovan from Beethovan’s Body Zeal Fitness Studio took the participants through a fitness regimen.\n\nOver 15 women, led by Radha, conducted yoga for an hour. Another group led by Kishore Yoga Jain also had a yoga session. Students of National Model Matriculation School gave an enthralling band performance. And members of Laughter Club also occupied a space on the vehicle-free road.\n\nAnd, students of Avila Convent Matriculation School also marched in with a band performance. Encouraged by the presence of the school Principal Sr. Shalini and assisted by the teachers, nearly 200 students performed a series of programmes for more than an hour.\n\nA mind blowing performance by Tharun Iyer, street play by Hindusthan College students, music by DPS and races for children were some of the other activities at the Car-Free Sundays. Students of Lisieux Matriculation Higher Secondary School also took part.\n\nC.R. Swaminathan, president of Residents Awareness Association of Coimbatore, and Councillor Gayathri encouraged the participants at various programmes.\n\n“My grand children are all out here. It is such a wonderful experience for the residents of Saibaba Colony,” said P.S. Rangasamy of PSR and Sons.\n\nMark 1 Events is the Event Manager and Radio City is the Radio partner. The three hour-long event recorded by Radio City will be aired on Friday as a prelude for the next Sunday and to listen to the capsule of the first Car-Free Sundays just tune into 91.1\n\nSchools and those interested in organising activities and events can contact Madhan (9715063000) of Mark 1 Events.", 
    "section": "national", 
    "title": "It’s fun, frolic and…no vehicles on NSR Road", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}