{
    "author": [
        "Special Correspondent"
    ], 
    "text": "AIADMK general secretary and Chief Minister Jayalalithaa on Sunday interviewed aspirants who had applied for party tickets to contest in the coming Assembly elections in Tamil Nadu, Puducherry and Kerala. A party press release was ambiguous on whether the interview process for all applicants was completed or would continue.\n\nAmong the aspirants Ms. Jayalalithaa interviewed at her Poes Garden bungalow were P. Vetrivel, who had vacated his R.K. Nagar constituency last year to facilitate her re-election to the Assembly; Chitalapakkam Rajendran, former South Chennai MP; Benjamin, Chennai Deputy Mayor; Noorjahan Beevi, Chennai Corporation Councillor; and Manoranjitham Nagaraj, the Uthankarai MLA.\n\nSenior party leaders including party presidium chairman E. Madhusudhanan, governing council member Tamizhmagan Hussain and party minority wing’s Justin Selvaraj from Kanyakumari were also present during the interviews chaired by Ms. Jayalalithaa.\n\nParty insiders said some senior ministers, who have been vested with certain key organisational responsibilities, were not part of the interview process.\n\nSources said the candidates were asked basic questions including their age, educational qualification, name of the constituency they had applied for, and the chances of victory for the party in the constituency. Party leaders indicated that the first list of candidates would be released soon. Ms. Jayalalithaa usually chooses an auspicious day for such important things. Monday is Maha Shivarathri and Tuesday is a new moon day ( Amavasya ).\n\nA total of 26,174 applications were received from cadres interested in contesting in the Assembly elections in the two States and the lone Union Territory from January 20 to February 6. On behalf of AIADMK general secretary and Chief Minister Jayalalithaa, 7,936 applications had been filed.\n\nOffice-bearers shuffled\n\nClose on the heels of shuffling of office-bearers in Kancheepuram district, several changes were effected in Chennai North (North) district of the party on Sunday. The core team of the IT wing was also expanded by including six more members and the number of office-bearers in the wing was increased bringing the total to 720 across the 50 party districts.\n\nMs. Jayalalithaa expelled the party’s Sivakasi Assembly constituency secretary E.S. Sivakumar from the organisation and removed Nattarasankottai municipality unit secretary M. Ravi from the post. She also condoled the death of Sivakumar Kennedy, husband of Congress MLA Vijayadharini.", 
    "section": "national", 
    "title": "Jayalalithaa interviews aspirants", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}