{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Sivarathiri celebrations, 7 p.m. onwards.\n\nPanniru Tirumurai Mandram: Discourse on ‘Sivagnana Botham’ by N.S. Sundararaman, South Avadi Street, 7 p.m.\n\nMeenakshi Sundareswarar Temple: Discourse on ‘Tiruvilaiyadal Puranam’ by M. Gnanapoongothai, Thirukalyana Mandapam, 5 p.m.\n\nMadurai Tiruvalluvar Kazhagam: 27th anniversary celebrations of Youth Literary festival, Discourse on ‘Tirumandiram’ by S. Thirumavalavan, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nThe Divine Life Society: Maha Sivarathiri special satsang bhajans, Swami Sivananda Sundarananda presides, South Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Kantha Puranam’ by N.S. Sundararaman, Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Amarnath Lingam darshan, Victoria Edward Hall, West Veli Street 7 a.m., Kedarnath Lingam darshan, 408 North Masi Street 7 a.m. and 4 p.m.\n\nSri Swami Tatwananda Ashram: Gita class by Swami Samanandar, Ayiram Vaisyar Primary School, South Avani Moola Street, 6.45 p.m.\n\nSri Sri Jagadguru Shankaracharya Mahasamasthanam Dakshinamnaya Sringeri Sharada Peetham: Maha Sivarathiri ‘4 Kaala Puja’, Jagadguru Sri Sringeri Shankaracharya Mahasamasthanam, Amman Sannidhi Street, 5 p.m. onwards.\n\nCULTURE\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar P and T Nagar; 40 Sambandamoorthy Street, 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nArsha Parampara: Mundakopanishad 7 a.m. and Bhaja Govindam, Yagasalai Andalpuram, 6.30 p.m., Lalitha Sahasranamam and spiritual heritage classes by Swamini Vidyananda Saraswathi, Old Kalyana Mandapam, Meenakshi Temple, 10 a.m.\n\nGENERAL\n\nLady Doak College: Prof Anna Abraham Endowment Lecture Series-V, Lecture on ‘Urban History of Tamil Nadu of 18th and 19th Centuries – An Overview’ by G.J. Sudhakar, Professor and Head of Historical Studies at C.P.R Institute of Indological Research, college premises, 2:30 p.m.\n\nFatima College: Young Woman Scientist Award-2015, S. Krishna Kumar, Senior Technical Officer, DRDO (Madurai), chief guest, Jubile Hall, 1:30 p.m.\n\nThiagarajar College: NSS camp, Silaiman Panchayat, 9 a.m.\n\nGandhi Memorial Museum : Spoken Hindi class for public, IGSR Building, Gandhi Museum, 11:30 a.m.; Seminar for diploma students of Gandhian Thoughts, Sri Meenakshi Government College for Women, 2.30 p.m.\n\nKaviarasu Kannadasan Narpani Mandram: Meeting to commemorate death anniversary of Suddhandha Bharathi, T.P.K. Road, 8:50 p.m.\n\nAlcoholics Anonymous: Meeting, Holy Redeemers Church, Pondy Bazar, 7 a.m., Quality Care Hospital, Ellis Nagar, 7 p.m., A.G. Church, Gomathipuram, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}