{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Thousands of devotees from Kanyakumari, Tirunelveli and Thoothukudi districts, and Kerala participated in Mahasivaratri ‘Sivalaya ottam’.\n\nThey started the run at midnight of Saturday to cover 12 Siva temples situated in Kalkulam and Vilavancode taluks in the district. Devotees took part in Sivalaya ottam after observing fast for a week.\n\nDevotees began their run after worshipping Lord Siva at Tirumalai Mahadevar Temple in Munchirai. During the run, they took holy dip in temple tanks. The 12 temples covered during the run are located at Tirumalai, Tikkurichi, Tirpparappu, Tirunandikkarai, Ponmanai, Pannipakam, Kalkulam, Melangodu, Tiruvidaikkodu, Tiruvithancodu, Tirupannikodu and Tirunattalam.\n\nAs legend has it, Vyakrapadan, the son of Doumaya Maharishi, was a staunch believer of Lord Siva. Lord Krishna engaged Bhima to invite Vyakrapadan for an ‘Aswamedayagam.’ Lord Krishna handed over 12 ‘Lingams’ to Bhima and directed him to chant the name of Vishnu while he met Vyakrapadan. On hearing the chanting of ‘Govinda, Gopala,’ an irritated Vyakrapadan chased Bhima. Bhima dropped the Lingams one by one on the way, and it is believed that temples were constructed around them. Devotees chant “Govinda, Gopala” during the entire run.\n\nOfficials of the Department of Hindu Religious and Charitable Endowments provided basic facilities in the temples. The district administration has declared local holiday on Monday. Tamil Nadu State Transport Corporation operated special buses to Siva temples from various destinations in the district and Tirunelveli. Basic amenities such as wayside toilets and drinking water facilities were provided by respective local bodies all along the route.\n\nAt many places, the devotees were offered food, butter milk and juices.", 
    "section": "national", 
    "title": "Mahasivaratri: thousands participate in ‘Sivalaya ottam’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}