{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Enthusiastic visitors at the ‘Museum on Wheels’ bus that was stationed near the District Museum in VOC Park in Coimbatore on Sunday. —Photo: S. Siva Saravanan\n\nIt was not the usual Sunday at VOC Park here. People who expected to visit the zoo and have a tasty snack or ice cream got a glance of Indian history, taking them down a few hundred years was the ‘Museum on Wheels’ bus.\n\nThe Department of Museums, Government of Tamil Nadu, had sent the bus to the city as part of its project to take museums to the people, says District Museum Curator C. Sivakumar. “It is no longer people going to museum; it is museums going to people.”\n\nWindows\n\nStationed in front of the District Museum, the ‘Museum on Wheels’ had windows that showcased the richness of the Chennai Museum, its brief history and sections therein.\n\nIt also had archaeology, numismatics, art, anthropology, botany, and geology.\n\nEach window had a brief write-up in Tamil and English to inform the visitors of what they were looking at.\n\nThe architecture section had drawings of various hand postures – mudras. The numismatics section had on display a few coins from the Gupta and Moghul periods. There were also write-ups on copper plates.\n\nMr. Sivakumar says that the practice of mentioning year of minting in coins was first introduced during the Mogul period where the hijri was mentioned.\n\nThe art and painting section had paintings of Raja Ravi Varma and paintings of the Tanjore style. The Chennai Museum has the best collection of those, the Curator says.\n\nThe ‘Museum on Wheels’ bus will be in VOC Park on Monday and Tuesday. But, only after 3 p.m. as it will go to various schools. At present, two schools have expressed their willingness to have the bus on their campuses.\n\nIf more schools are interested, the department will consider, Mr. Sivakumar says and adds that schools can get in touch with him on 86809-58340 for having the bus. On Tuesday, the bus will leave for Erode.\n\nVisitor C. Karnan says that as a tourist to the city he was surprised to see the bus. He got in only because people were curiously looking at what was displayed. But having entered, the exhibits got him interested. This should go to all schools in the State and all district headquarters, he adds.", 
    "section": "national", 
    "title": "‘Museum on Wheels’ draws people in VOC Park", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}