{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "It will not be completed until 2017, Union Minister Venkaiah Naidu informs Parliament\n\nFive years on, 84 per cent of the Chennai Metro Rail project has been finished and it is expected to be fully complete only in 2017, Union Minister for Urban Development Venkaiah Naidu informed the Lok Sabha.\n\nResponding to a question in the lower house of Parliament, the Minister gave details of the project and the reasons for the delay for its completion. He noted that there was delay in acquiring land and non-performance of some contractor that lead to re-tendering process.\n\nThe project, the cost of which is Rs. 14,600 crore, spans 45 km through both elevated and underground corridors. Of the total project cost, Japan International Cooperation Agency (JICA) is contributing 59 per cent, Centre, 20 per cent and the State government is funding the remaining portion. The Minister noted that the amount released as on 31 January stands at Rs. 1,773.59 crore.\n\nThough the original deadline for the project was 2015, it faced various delays during the course of its construction. So, only a small portion of the project, a 10-km stretch between Koyambedu and Alandur, was launched in July last, officials of the Chennai Metro Rail Limited (CMRL) said.\n\nInitially, the contract of Consolidated Construction Consortium Limited (CCCL)’s contract (whose role was crucial to the completion of the stations from Koyambedu to Alandur) was terminated owing to the delay in failing to keep up with deadlines of the project, sources said. Then, the retendering process took sometime.\n\nLater, Gammon India, along with the Russian firm Mosmetrostroy that had to carry out the construction of stations and tunnelling work on Anna Salai, too ran into trouble because of tardy progress of work, they said. After Mosmetrostroy left the project, Gammon India’s contract was terminated. CMRL is now in the process of fixing up new contractors for completion of work, sources added.", 
    "section": "national", 
    "title": "No finish line for Metro this year", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}