{
    "author": [
        "Aditi R"
    ], 
    "text": "This development follows a job fair organised exclusively for them by the police\n\nShobana Ramesh of the Bharathi Foundation (left) along with members of the transgender community who got their offer letters on Friday —Photo. M. Moorthy\n\nIt was a great day for Preethi* as she landed a job at a private firm.\n\n“I can’t tell you how much getting this job offer means to me,” said a teary-eyed Preethi, who fled her village in Kerala after the mysterious death of her close friend, who was also a transgender.\n\n“Since then, life has been a struggle. I did every job that a transgender does in this big city. It broke my spirit, but now, I’m looking forward to a great beginning,” said Preethi, who along with nine other transgenders from across the city, have been offered jobs at private firms.\n\nThe nine were selected from over 300 transgenders who attended a job fair, conducted last month by the police, exclusively for the community. “As of now, they have got jobs, but we are in talks with other employers to ensure more opportunities for them. As a matter of fact, following the fair, several employers have been calling us to find out if they could recruit them,” said Shobana Ramesh, vice-president of Bharathi Foundation, while handing out offer letters to the selected candidates at St Anthony’s centre on Friday.\n\nSpeaking on the occasion, Shyamala Devi, Additional Superintendent of Police, CCB, said the job fair had helped ease the tension between police and transgenders.\n\nOf the 20 transgenders who assembled at the venue, three received loan sanctions. Sujatha received a loan sanction of Rs. 3 lakh, which she had been struggling to get for many years. She’s now ready to open her own catering business. “It’s a dream come true. I will make the best use of this opportunity,” she said.\n\nSenior advocate R. Gandhi and S. Ramachandran, Regional Joint Director, Department Of Industries And Commerce, were also present at the event.\n\n*Name changed on request\n\nNine transgenders, who got jobs at a fair organised by the police last month, look forward to new beginnings", 
    "section": "national", 
    "title": "Of offer letters and the promise of dignity", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}