{
    "author": [
        "R Sujatha"
    ], 
    "text": "An ambitious project to upload all Ph.D theses of research scholars of the University of Madras has failed to take off due to lack of policy push from the authorities concerned. The database of theses would not only provide research scholars an easy access to reference materials but also prevent plagiarism.\n\nNearly a decade ago, the University of Madras had earlier signed a memorandum of understanding with Shodhganga@INFLIBNET, an initiative of the University Grants Commission, to create a repository of research theses that can be accessed across the country.\n\nThe non-implementation of the project figured in the last academic council meeting of the university. A member wanted to know why only one thesis submitted in 1996 had been uploaded till date. Prof. Jothi Sivagnanam, who chaired the meeting, said the process of uploading all theses was in progress and would be completed shortly.\n\nAccording to university authorities, there are over 5,000 theses and they are being run through an anti-plagiarism software before they could be uploaded. It was a long process and hence the delay.\n\nFormer professors say the process of digitisation began in 2007, with the university receiving around Rs. 30 crore, as part of the UGC’s University with Potential for Excellence scheme. Since then the university has received its second round of funding for the project too.\n\nNo progress in bar coding\n\nThe funds were supposed to be used for automating the library also by introducing bar codes for books. But the work of bar coding did not progress after the death of the librarian in 2008. The library in the university is so neglected that even its centenary celebrations were not held although three Vice Chancellors have completed their tenure. Sources claimed that the university library, the custodian of the theses, has no record for all theses. For instance, one of the theses submitted was by former Army chief General Sundarji on the nuclear weapon programme of India and Pakistan. The source who was trying to read it for reference was told it was not available.\n\n“The thesis was submitted in 1994-1995. But when I asked for it I was told it was not available. It is no secret that politically connected persons manage to borrow a thesis for as long as they deem fit,” a former professor said.", 
    "section": "national", 
    "title": "Online database of theses remains a pipedream", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}