{
    "author": [
        "Aditi R"
    ], 
    "text": "Study finds 32% had problems in receiving regular wage\n\nKasturi Munirathnam who lost her arm while working as a domestic help in Saudi Arabia last year —Photo: M. PRABHU\n\n28-year-old Thavarimuthu was leading a hand-to-mouth existence in his village near Tiruchi, when a lucrative job offer came his way.\n\n“I was told by a friend that a manufacturing company in Qatar was looking for welders, and it offered a good salary. And, I went for it,” said Thavarimuthu.\n\nToday, Thavarimuthu is without a passport and a job, and he did not receive much money either. “I got my salary only for the first two months,” he said.\n\nHe is not alone — there are many other migrant workers who are facing a similar situation.\n\nAccording to a special study conducted among return emigrants by Centre for Development Studies, as part of the Tamil Nadu Migrant Survey 2015, 60.1 per cent respondents reported that they had not received the promised salary. Out of the total number, 39.1 percent were women.\n\nPamphlets\n\n“We have given out pamphlets with full instructions and precautions, we also have interactions, but somehow, many continue to get entangled and duped by unregistered agents and employers abroad,” said a senior official from the Commissionerate of Réhabilitation & Welfare of Non-résident Tamils.\n\nSimilarly, 32 per cent had problems in receiving their regular wage – it was either delayed or denied.\n\nHowever, 91 per cent of both men and women did not approach the Indian Embassy in the countries where they faced problems.\n\n“Once, my colleague in Saudi Arabia objected to the irregular payment. The employer got together a few men and they beat him up. He was later jailed for causing brawls. We all remained silent and accepted whatever paltry sum we received. They seized all our documents and threatened to jail us. It’s not easy to seek help,” recalled Raja. UAE and Saudi Arabia have received 4 and 3.5 lakh workers respectively.\n\nUnited States of America, the most sought-after destination for high-skilled emigrants, has 3 lakh natives of the State.\n\n“In the case of employment in the Gulf countries, most agents do not even have the exact job information and are not even registered with the commissionerate. Hence, the workers get duped,” said Josephine Valarmathi from National Domestic Workers Movement (NDWM).\n\nShe also emphasized the need to have a policy or an Act that secures the monetary and social security of workers abroad.\n\n“The current Emigration Act provides no such security, we desperately need an improved bill as our country does not supply cheap labour,” she said.", 
    "section": "national", 
    "title": "‘Over 60% of emigrants do not receive promised pay’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}