{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Trains to Puducherry\n\nRailway Minister Suresh Prabhu has announced four new categories of trains in the railway budget. It is learnt that the divisional railway managers themselves are empowered to take decision in this regard.\n\nHence, they can consider introducing ‘Antyodaya’ Express trains between Puducherry and Kakinada via Tiruvannamalai and Tirupati.\n\nThe same category should also be introduced between Puducherry and Ernakulam via Coimbatore.\n\nWith regard to ‘Deen Dayal’ coaches in long distance trains should also be added to the weekly and biweekly trains running between Villupuram and Purulia or Kharagpur after extending the same to Puducherry.\n\nFurther, priority should be given to revive the defunct line between Peralam and Karaikal.\n\nThis will help to reduce the distance between Chennai and Karaikal besides providing a direct link to the famous Tirunallar shrine.\n\nB.Balasubramanian\n\nAvvai Nagar, Lawspet, Puducherry\n\nEnsure safety measures\n\nat beaches\n\nIn a gruesome tragedy last week three youths from Bangalore (two were identified as staff in a private bank and the other one from an IT company) drowned while taking bath in the sea during their weekend trip to Puducherry. The police, tourism department or Indian Coast guard should deploy personnel in such places and on the beach considered unsafe and dangerous to allow people to swim.\n\nThey should be deployed during the weekends when a large number of tourists visit Puducherry and turn away tourists intending to swim in such risky zones.\n\nWhenever such tragedy strikes, it is not only the tourists who die but even the locals who try to save them.\n\nS.Nadarajan,\n\nIII Cross Jawahar Nagar, Puducherry\n\nClear the garbage\n\nIt is high time the government authorities reviewed the performance of the Swatchada Corporation, which has been entrusted with the responsibility of clearing garbage in various areas. It is highly doubtful whether the corporation has made any survey with regard to the quantum of garbage that is collected and removed area-wise.\n\nEarlier, tractor trailers were used to remove large quantum of garbage from each area.\n\nNow, the corporation uses small cartages, bucket vans to collect the garbage from the inner lanes with inadequate manpower.\n\nTheir idea of using these vehicles could be to undertake many sorties to remove the garbage, streetwise.\n\nHowever, this is really not happening. When the practice of tractor trailer was in vogue, the garbage was removed in our area on daily basis.\n\nBut now, the corporation vehicles come only when they are constantly being reminded to clear the garbage.\n\nThis has resulted in accumulation of huge mounds of garbage.\n\nHence, the authorities concerned are requested to take necessary action for maintaining the town clean.\n\nD. Muthukumarasamy,\n\nMohan Nagar, Puducherry", 
    "section": "national", 
    "title": "Page 3 06MARPYSSM01 READERS’ MAIL 165900406--file", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}