{
    "author": [
        "Vivek Narayanan"
    ], 
    "text": "A victim of a theft in which he lost his mobile phone, H. Riaz Basha wanted to lodge a ‘mobile phone stolen’ complaint with the Government Railway Police (GRP).\n\nHe however found to his dismay that he could file only a ‘mobile phone missing’ complaint.\n\nMany claim that this is not an issue with the GRP alone.\n\n‘Mobile phone stolen’ cases are often not registered as such at most police stations.\n\nRiaz Basha, a resident of Royapuram, works as a designer at a software firm in Taramani.\n\n“Every day, he parks his motorbike at the Beach railway station and takes the Mass Rapid Transit System train (MRTS) to Taramani. On February 26, he was travelling by an MRTS train and sitting in a seat near the door. Another person was sitting opposite him,” said Sajith Basha, his brother and an advocate at the Madras High Court.\n\n‘Phone missing’\n\nWhen the train moved out of the Light House railway station, the stranger snatched Riaz’s phone and jumped off the train.\n\n“My brother could not follow him and he went to the Tiruvanmiyur police station to file a complaint with them. They, however, asked him to make a ‘phone missing’ instead of a ‘phone stolen’ complaint,” he said.\n\nFinally, a CSR copy was given to him on March 2.\n\n“When Riaz asked the police officers why they did not want to register it as a theft, they said he would not be able to come for the identification parade. My brother also asked them if they could take out the CCTV footage from the station, but the officer said there was no camera,” Sajith added.\n\nAccording to a senior GRP officer, the policemen have been instructed to take the complaint as it is and then determine through investigation if the phone has been stolen or missing.\n\n“We will look into the issue,” said another officer.\n\nMany instances\n\nMeanwhile, this seems to have been the experience of many of those whose mobile phones have been stolen in the city.\n\n“The policemen do not wish to register it as stolen as they have to show recovery or else it will be a black mark for them. I know a few people who have undergone a similar experience,” said V.S. Suresh, a Madras High Court advocate.\n\nVictims say that police often encourage\n\nthem to file ‘mobile phone missing’ complaints", 
    "section": "national", 
    "title": "‘Police wary of registering mobile phone theft complaints’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}