{
    "author": [], 
    "text": "Famous film songs that are recreated and put up on social media and online platforms gain a large audience\n\nFrom Youtube to Soundcloud, online platforms have been constantly giving a chance to amateur and upcoming musicians to share their compositions and take their talent to a wider audience.\n\n‘Covers’ or recreations of famous film songs are, at present, bringing together music fans on social media networks.\n\nMany Indians abroad have Youtube channels, including Vidya Vox, the Iyer sisters Vandana and Vidya whose Covers of Tamil and Hindi film chartbusters as well as English music have been doing the rounds on social media sites for the last few years.\n\nMusicians from Chennai too are now not far behind.\n\nRenaissance, a collective group, comprising of city-based singers Sudharshan Ashok and Vishnupriya Ravi, violinist Shravan Sridhar and keyboardist Anish Mohan have been uploading covers of a few popular Tamil songs on Youtube. They have been noticed by music director Anirudh Ravichander and director Gautham Vasudev Menon on social media platforms.\n\n“For musicians who are just starting out and wanting to make a mark, taking up popular songs and coming up with their own versions resonate better with a larger audience as they listen to something familiar but with unique touches. While the focus used to be only on audio, many musicians are coming up with innovative videos as well,” said Sudharshan Ashok.\n\nFollowing the popularity of their covers online, the group will be seen performing in Kappa TV’s Music Mojo programme.\n\nVideo games, a serious hobby for many youth\n\n“After coming back from work, the first thing I do is play games on my computer. And this lasts for several hours usually. But, it can vary everyday depending on the work pressure,” says R. Sharath, a software professional.\n\nAnd he is not alone. Video and PC gaming continues to be a rage among the youth in the city for the last few years.\n\n“Earlier, we used to play Mario and Dave on the computer, but ever since we have been introduced to playstations and other games, we are stuck to it,” says A. Arvind, a school student.\n\nWorld of warcraft, defense of the ancients, counter strike, star wars: the old republic are among thousands of games that are popular among the youth.\n\nWhile some play it for fun, there are those who take it rather seriously.\n\n“We make it a point to attend international symposiums and lectures on gaming, as it has in a way helped us latch on to the gaming mindset,” adds Aravind. Blur, FunMax, Gyspsy are some of the gaming centres frequented by enthusiasts. Despite the common notion about virtual gaming and its vices, youth continue to play undeterred.\n\n“It does tend to get very addictive but one must know where to stop,” says R Karthik, an engineering student.\n\n(Reporting by S. Poorvaja and Aditi. R)", 
    "section": "national", 
    "title": "Popular covers enthral artists and music lovers", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}