{
    "author": [
        "Staff Reporter"
    ], 
    "text": "In an effort to increase awareness and garner public support for the launch of Noyyalai Nokki project, to restore the river and its tributaries, Siruthuli released an audio jingle and promotion video at Brookefields Mall, on Sunday.\n\nThe launch was part of the Women’s Day celebration organised by the mall. It was launched by Siruthuli Managing Trustee, Vanitha Mohan, and Secretary of Residents Awareness Association of Coimbatore (RAAC) R. Raveendran. Noyyalai Nokki will be launched in the third or fourth week of the month close to the World Water Day celebrations (that falls on March 22). About the project, Chairman of Noyyal River Restoration Federation (NORFED) C.R. Swaminathan said that the federation was recently formed to bring together farmers and stakeholders of the river in four districts – Coimbatore, Tirupur, Erode and Karur – through which the river flows. Villagers on the banks of the river would be playing a key role in the project as preserving the river would be impossible without them.\n\n“In Coimbatore, the federation is promoted by Siruthuli, by Jeeva Nathi Noyyal in Tirupur, and Olirum Erode in Erode district. We are trying to bring together stakeholders in Karur before the launch of the ambitious project to revive the 162 km long river,” Mr. Swaminathan said.\n\nOn the restoration plan, he said the river would be surveyed and cleaned. The entire stretch would be divided into blocks for 500 metres each. NORFED is trying to get corporate and other sponsors for each block and the blocks will be maintained by a committee comprising the sponsors, villagers and government officials to prevent pollution of the river and to develop it, he added. Clearing shrubs and desilting the dozens of canals feeding the river from Coimbatore to Karur and diverting water to tanks and ponds to get them filled when the river floods are part of the project to protect the river in the long run.", 
    "section": "national", 
    "title": "Preparations on for launch of project Noyyalai Nokki", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}