{
    "author": [
        "M K"
    ], 
    "text": "Revenue and forest officials deployed for intensive vehicle checks\n\nAs code of conduct has been enforced in Tamil Nadu, wall painting of parties being erased by a Udhagamandalam municipal staff near the Collectorate. —Photo: M. Sathyamoorthy\n\nAs many as 21 teams have been deployed to check political activities, transportation of money and gifts and ensure proper implementation of the model code of conduct norms in The Nilgiris. It includes nine flying squads, as many static surveillance teams (at three each per assembly segment) and three video surveillance teams (one for every assembly segment).\n\nDistrict Election Officer (DEO) P. Shankar said that though there were only three assembly segments in the district, for better surveillance of the vast district the teams have been asked to cover a portion of the assembly not covered by the other teams. It is to ensure that the teams reached the nook and corners of the district without wasting time, when they come across any violation.\n\nIn addition to these teams, revenue and forest officials have been deployed for the intensive vehicle checking at the 10 police check posts that were established at the borders of the district.\n\nA team of five policemen would be available at these check-posts round-the-clock. “The CCTV cameras and floodlights installed at these check-posts to check intrusion by Maoists would be an additional check for the elections,” the DEO said.\n\nStating that most of the defacements by political parties have been covered or removed on the major roads and in the town areas, the Collector said that special teams are identifying and clearing defacements in remote places. Public can report model code of conduct violations or election related issues at the toll free number 1800-425-2781.\n\nVoters\n\nMore women voters will be casting their vote in the assembly elections in the district this year.\n\nThere is a commendable increase in the number of voters in the district from 4,95,209 voters in the 2011 assembly elections.\n\nThis time 5,77,661 voters – including 2,97,520 women voters – eligible voters would be deciding their MLAs in the three assembly constituencies in the district.\n\nApart from the regular arrangements officials are working on a two-pronged strategy to make polling peaceful and comfortable conduct of the elections. They are identifying facilities to be made at the polling centres and are also in the process of identifying trouble-makers at the village and hamlet level.\n\n“This will be done with the help of the police.\n\nWe will bind such persons by getting an undertaking from them under 109 and 110 of the Code of Criminal Procedures that they would not indulge in acts that would disturb normalcy or disturb polling,” the District Election Officer said and added that appropriate action would be taken on those who try to disturb polling.", 
    "section": "national", 
    "title": "Preparations under way for elections in The Nilgiris", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}