{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Despite his “unrivalled” consistency on policies and a vision that always factored long-term benefits for people, PMK founder S. Ramadoss was wrongly being labelled as leader of a particular community, his son and party’s chief ministerial candidate Anbumani Ramadoss said here on Sunday. “My father is the most misunderstood politician in the country,” he said.\n\nAddressing a gathering at the release of six compilations of Dr. Ramadoss’ statements under different topics, Dr. Anbumani said his father never compromised on efforts that would be helpful for the people of Tamil Nadu. “For the past 37 years, his policies on prohibition, social justice and common curriculum have guided policy making. He has been more of a reformist than a politician,” the PMK’s youth wing leader claimed.\n\nThe PMK’s over-three-decade battle for imposition of prohibition has finally yielded results given that all parties except the AIADMK had now agreed to the policy. “This is our greatest achievement. But this effort will not reach its conclusion till we take over the government and sign the order on prohibition,” Dr. Anbumani said adding that the PMK played a pivotal role in ensuring reservations for MBC in Tamil Nadu and OBCs in Central educational institutions at the national level.\n\nN. Ram, Chairman of Kasturi and Sons Limited, said there could not be any doubts that Dr. Ramadoss was a man of ideas. Commenting on one of the books containing compilation of his statements on the necessity of the creation of Tamil Eelam in Sri Lanka, Mr. Ram said while he had differences and did not agree to the concept of ‘Eelam’ being the only solution, he would nevertheless commend Dr. Ramadoss’ consistency in the matter. “Even in these statements, he has placed Eelam as the final solution. He has discussed intermediary steps that aim at equal rights for the Tamil population,” Mr. Ram pointed out.\n\nOn the rise of intolerance against freedom of speech after the Narendra Modi government took over, Mr. Ram said the “majoritarian” idea of portraying India as a Hindu nation ran against the Constitutional values of secularism and pluralism. He hoped the PMK, like on many other matters, will take a “clear and courageous” stand on the issue of protecting democratic rights. “I hope the PMK would make necessary interventions to stop this trend of growing intolerance,” he opined.\n\nVeteran journalist Maalan said the crux of the PMK’s ideology on social justice was that there should be no discrimination among equals and there should be no similar opportunities for unequals.\n\nSenior journalist R. Bhagwan Singh rued that the habit of reading newspapers was slowly declining. “While press is called the fourth pillar of democracy, people should help ensure that it is not weakened,” he said, adding that Dr. Ramadoss’ statements stood out for their scientific approach and the decency of language.\n\nLater, Dr. Ramadoss said the PMK had put together more than 25 well-researched documents and had steered hundreds of campaigns on people’s issues. But despite all this, the media had not given the party its due.\n\nJournalist Tirupur Krishnan also participated.", 
    "section": "national", 
    "title": "‘Ramadoss most misunderstood politician’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}