{
    "author": [
        "K Raju"
    ], 
    "text": "Bird enthusiasts in Dindigul and nearby districts got an opportunity to see and buy rare breeds of roosters and hens at an event organised at a farm in Rajalakshmi Nagar near here on Sunday.\n\nAbout 300 roosters, which were once used for cockfights, were brought from vaarous parts of Tamil Nadu, Kerala, Andhra Pradesh and Karnataka for the event, organised for the second year here. ‘Kili Mooku’ and ‘Visiri Vaal’ roosters were the star attractions.\n\nThe event provided an opportunity to those who rear rare breeds to meet, display their birds and share their experience.\n\nThe roosters were tall and muscular and aggressive in nature. The selling price depended on factors such as eye colour – white or pearl, short combs and thick beaks and long and beautiful tail. Each bird weighed around 5.5 to 7.5 kg. The price of the cocks ranged from Rs.25,000 to Rs.1.25 lakh.\n\nAseel, a native breed from Andhra Pradesh, became extinct in that State. But since Puravilapalayam zamins had popularised the breed in Tamil Nadu, bird enthusiasts from even Andhra Pradesh come to Oddanchatram weekly market to buy Aseel roosters, said P. Nelson, one of the organisers of the event.\n\nWith a total ban on cockfight in the State, many had stopped rearing Aseels and sold their birds. Now, these breeds were facing the threat of extinction.\n\nSuch events would motivate enthusiasts to continue their hobby, said S.M. Navas Khan, All India Aseel Association secretary and the event organiser.\n\nShort beak, red comb, yellow, red and white feathers, long tail and neck, and strong legs were Aseel’s unique features, said V. Vasu Durai, a breeder from Tiruchi. “Good care must be taken to rear such birds.\n\nSince they were costly and can be easily stolen, a safe room or enclosure should be provided for the birds,” said Sekar from Virupatchi, who owns a cock worth Rs.75,000.\n\nOwning ‘jallikattu’ bulls and rare breed of roosters were a source of pride at villages.\n\nThey were symbols of affluence, said A. Murugan from Oddanchatram.\n\nBird enthusiasts from Bengaluru, Kerala, Nellore and different parts of Tamil Nadu took part in the event. Best roosters and their owners were honoured with certificates and medals.", 
    "section": "national", 
    "title": "Rare breeds of roosters on show", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}