{
    "author": [], 
    "text": "Need pedestrian crossings\n\nThe stretch of Medavakkam Main Road between Madipakkam Koot Road and Vanuvampet is badly damaged and needs to be re-laid in the interest of road users at the earliest. Also, there are no marked pedestrian crossings despite repeated pleas from motorists, pedestrians and civic groups here. Senior citizens are put to much hardship. I request the authorities concerned to do the needful.\n\nA. Raghavan\n\nNanganallur\n\nA foot overbridge at Egmore\n\nSeveral passengers, including government staff, school and college-going students and the elderly, use the train service from Chengalpattu to Chennai Beach at Egmore. However, all commuters find it difficult to cross the Gandhi Irwin Road from the railway station due to the constant flow of traffic with several buses, share autos, jeeps and two-wheelers using the road. So, there is an urgent need for a foot overbridge from the station for people to cross over to the opposite side of the road, like the one near Chromepet station. Will the railway authorities sanction an overbridge for the safety and the benefit of all the people?\n\nV.L. Ganapathy\n\nOld Perungalathur\n\nMisleading advertisements\n\nWhile travelling from Vadapalani to T. Nagar on MTC route No.27C (No. TNJ 0359), I saw a Tamil advertisement behind the driver’s seat by an Ayurvedic doctor who claimed that a new drug was invented by the doctor which will make white patches on the skin disappear in 20 hours.\n\nThis is a false and misleading claim violating The Drug and Magic Remedies Act. Even a scar on the skin due to minor injuries takes a few days to disappear. Further white patches on the skin are of various types, some are symptoms of certain underlying syndromes and some white patches are due to pigment deficiency which are harmless but won’t disappear on treatment with drugs. On any earlier occasions also, I have seen misleading advertisements on MTC buses. MTC needs to carefully scrutinise all advertisements before allowing them to be displayed on buses.\n\nK. Srinivasaragavan\n\nT. Nagar\n\nMerge Pallavaram with Corporation\n\nPallavaram is a special grade municipality with a population of around 2.75 lakh in 42 wards. There are more than 30 educational institutions including a women’s college and a medical college. Pallavaram has an underground drainage system.\n\nAnd in another six months, the residents will get water from Chembarambakkam reservoir. It is time that Pallavaram is merged with Greater Chennai Corporation.\n\nOr, separate Corporation should be formed for Tambaram, Pallavaram, Pammal, Anakaputtur, Pozhichalur, Sembakkam, Madambakkam and Chitlapakkam. The CMDA announced in 2009 that a separate Corporation can be formed and even sought public opinion regarding it.\n\nV. Santhanam\n\nChromepet\n\n(Readers can send feedback and pictures about civic issues to reporting.thehindu@ gmail.com)", 
    "section": "national", 
    "title": "READeRS’ mail", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}