{
    "author": [
        "R Srikanth"
    ], 
    "text": "The Smart City project of the Central government — in which Chennai is among the selected cities — lays a lot of emphasis on pedestrian safety, but civic agencies hardly give enough importance to the maintenance of pavements that were built spending a lot of money, residents complain.\n\nThey pointed out that over the years, city pavements were reduced in width to create space for parking of vehicles, forcing pedestrians to walk on the carriageway. In Egmore, Besant Nagar, Adyar, Nungambakkam, T. Nagar, Anna Nagar and Perambur, pavements were developed as per international standards, officials said.\n\nTo give an aesthetic appeal to the newly developed pavements and prevent unauthorised parking, bollards (protective short pillars) were installed. However, these pavements, in which huge money is invested, are beginning to get damaged at several places due to unauthorised parking, encroachment by commercial establishments, dumping of waste and installation of display boards, residents said, adding that in some places, bollards had even been removed or demolished.\n\nS. Gangadharan of Nungambakkam pointed to the pavement on Whannels Road that has been rendered unusable. Chennai Corporation officials said that while they were able to prevent encroachment on pavements by hawkers in Besant Nagar by employing wardens, they could not take steps against commercial establishments. He said instructions were issued to zone-level officials to take steps like even cancellation of trade licences or sealing the shops on Whites Road, Greams Road and Shanti Colony in Anna Nagar, where the pavements were encroached upon.\n\nSimilarly, the official also highlighted the plan to rope in Confederation of Real Estate Developers Association of India (CREDAI), to maintain 26 pavements, but it did not succeed. An office-bearer of the association said that they had initially taken up maintenance of a pavement in Egmore. However, on other pavements, encroachments were not cleared and hence they could not take their possession.\n\n“We wanted to be take it up as part of our corporate social responsibility schemes, but there were delays in taking over possession and other problems,” he said. On some pavements, the work of laying granite slabs was left incomplete and they did not agree with the maintenance cost per kilometre proposed to them.\n\n(Additional reporting by\n\nK. Manikandan)\n\nVehicle parking, encroachments, waste dumping, display boards cited as reasons", 
    "section": "national", 
    "title": "Reclaimed pavements again falling into disrepair", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}