{
    "author": [
        "R Srikanth"
    ], 
    "text": "The integration of BRTS and the Metro rail will result in improved commuting within the city —Photo: B. Jothi Ramalingam\n\nThe Institute for Transportation and Development Policy (ITDP) that conducted the feasibility study of the bus rapid transit system (BRTS) for Chennai in 2011 is pitching for a high-quality BRTS integrated with Metro Rail to provide seamless rapid transit service across the city.\n\nThe request for proposals by Pallavan Transport Consultancy Services (PTCS) to prepare a Detailed Project Report (DPR) was based on the feasibility report prepared by the ITDP.\n\n“BRTS is not just any bus running in a dedicated lane. Step-less passage between custom-built buses and high-quality stations, smart ticketing, and a host of other features make BRTS look, feel and operate like Metro Rail with the added benefit of flexible and direct services,” said Shreya Gadepalli, Regional Director, ITDP.\n\nA special purpose vehicle (SPV) would be required for the implementation and management of the BRTS. Ms. Gadepalli suggested that Chennai Metro Rail Ltd (CMRL) could be assigned the responsibility, making it easier to integrate the two systems. BRTS requires an investment of Rs. 20 crore per kilometre.\n\nOnce the DPR is ready, the system can be implemented within three years. At less than a tenth of the cost of the first phase of Chennai Metro, the reach of the integrated rapid transit system can be tripled by 2020, she said. Even with high-quality air-conditioned buses, BRTS operations can break even at fares as low as those of the Express services of the Metropolitan Transport Corporation (MTC) because of improved efficiency of operations.\n\nMs. Gadepalli said that to meet the State Government’s goal of 40% of trips by public transport, Chennai would require twice the existing fleet of around 3,800 MTC buses by 2020.\n\nMTC routes should be restructured so that city bus services and BRTS complement each other.", 
    "section": "national", 
    "title": "‘Seamless rapid transit will help city’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}