{
    "author": [
        "C Jaiankar"
    ], 
    "text": "Untreated water is being let into the Koraiyaru and the Cauvery. It is also pollutingthe environment.\n\nEfforts being taken to set right the engine failure, says a senior official\n\nhe plant, set up by the Tiruchi Corporation to treat the sewage water being generated through the Under Ground Drainage scheme in Tiruchi and Srirangam, has become dysfunctional due to engine failure and theft of power cables.\n\nA sewage treatment plant, a laboratory and six artificially created ponds are part of the sewage treatment complex that functioned at Panjapur, where the Corporation has about 550 acres of land. It was acquired even before the Tiruchi Corporation was created in 1994 by merging Srirangam and Golden Rock municipalities with the Tiruchi municipality.\n\nThough nearly 80 acre was originally earmarked for treating the sewage water and storing it on open ground, most of the idle ground was also used for it. Treated water was used for irrigating a farm.\n\nThe plant is supposed to treat sewage water on round-the-clock basis. However, its operation has stopped due to engine failure at the main treatment plant resulting discharge of sewage water on the ponds and farm without being treated. The open ponds have been overflowing with the treated and untreated sewage water.\n\nEnquiries revealed that the plant had not been operated for about a month since technical snag was noticed. Moreover, there was no power supply to the plant due to theft of power cables on the premises of sewage treatment plant.\n\nSimilarly, the laboratory set up by the Tamil Nadu Water and Drainage Board (TWAD) near the treatment plant has reportedly been idle for the last few weeks.\n\nStating that the sewage treatment plant was one of the premier assets of the Tiruchi Corporation established by spending huge sum, an environmentalist said that the Corporation should have taken repair and maintenance the moment the technical snag was noticed. The purpose of UGD would be defeated if sewage water was released on open grounds without treating it. Moreover, the untreated water was being let into the Koraiyaru and then in the Cauvery. It was polluting the environment too.\n\nWhen contacted a senior official of the Corporation told The Hindu that the plant had been temporarily closed due to engine failure.\n\nEfforts were being taken to set right the engine failure. It would be restarted as early as possible. It had been found that the power cables in the premises were stolen by unknown persons.\n\nThe Tamil Nadu Generation and Distribution Corporation officials had been asked to provide power cables so as to reconnect the power.\n\nUntreated water is being let into the Koraiyaru and the Cauvery. It is also polluting\n\nthe environment.", 
    "section": "national", 
    "title": "Sewage treatment plant closed", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}