{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "Madurai Corporation Shelter for Homeless Urban Poorat Sellur which has been designated as a polling boothin the area.— Photo: G. Moorthy\n\nManagement and residents of Madurai Corporation Shelter for Homeless Urban Poor operating in Sellur here have requested that the community hall housing the shelter should be not used as a polling booth for upcoming assembly elections as it will involve temporary evacuation of the residents, almost all of whom are aged destitutes.\n\nThe shelter, opened in 2010 by modifying a community hall, presently houses 52 people. As the community hall remained a polling booth for long, it continues to be one even after conversion into a shelter home.\n\n“We have been requesting since 2011 assembly elections. Local body and parliament elections happened later. But it has been designated as a booth even for upcoming elections,” said P. Ramar, Managing Trustee of Mother Teresa Educational Trust, which runs the home with the aid of Rs. 50,000 per month from Madurai Corporation.\n\nHe said that it was difficult during 2011 assembly and local body elections as no alternative arrangements were made and the residents had to spend three days in bus stands and railway station. “Some of the volunteers visited and provided them food,” he said.\n\nAfter repeated petitions, Madurai Corporation booked a marriage hall in the area during the parliament election in 2014 for the residents to stay for three days.\n\nHowever, Mr. Ramar said that even this alternative arrangement was difficult as all the belongings had to be shifted.\n\n“Earlier we had foldable cots which we could shift easily. But Corporation has recently provided steel cots,” he said. He added that arranging food is also a trouble as the home is run on a shoestring budget.\n\nWhen contacted, Collector and Election Officer K. Veera Raghava Rao said that the administration made earnest attempt to identify an alternative location nearby but could not find a suitable one. “Moreover, shifting the polling booth at this stage may lead to confusion among voters,” he added.\n\nHowever, he assured that suitable alternative arrangements without any inconvenience to residents of the shelter would be arranged during the elections.", 
    "section": "national", 
    "title": "Shift polling booth: shelter home inmates", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}