{
    "author": [], 
    "text": "The focus of Finance Minister Arun Jaitley in his Budget speech on organic farming has brought cheers to farmers who have been practising traditional methods to raise crops. Though the North-East leads in organic farming, leaders like M. Balasubramanian of Tirumangalam, who is popularly known as Pamayyan , have been promoting the disuse of chemical fertilizers and pesticides all over Tamil Nadu. In a conversation with S. Annamalai , Mr. Pamayyan ponders over how organic farming can be encouraged, mostly in rain-fed areas.\n\nThough farmers have been getting invaluable inputs from agricultural universities and colleges, there is a need to start an exclusive university to propagate organic farming in the country.\n\nPointing to the government’s initiative to increase crop yield in rain-fed areas, which account for nearly 55 per cent of the country’s arable land, by promoting organic farming, Mr. Pamayyan says that by nature rain-fed areas do not require chemical inputs.\n\nOrganic farming is the default method used by farmers in these areas. But only small farmers practise this farming now.\n\n“They do not exploit groundwater and their usage of fertilizers and pesticides is low. Unlike irrigated farming, organic farming follows poly cropping” he says.\n\nAt the same time, the subsidy for rain-fed crops is low. Mr. Pamayyan’s one-line solution to increase area under organic cultivation is: “Shift focus from productivity to health and food security.” The focus should be on local production and local distribution, rather than export.\n\n“Our farmers should be encouraged to produce food for our people. For this, they need holistic support from the government – from seed to produce.”\n\nThe Tamil Nadu government should come out with a policy for organic farming, since agriculture is a State subject.\n\nA fund should be created to offset the losses for the farmers due to price fluctuations, on the lines of Disaster Management Fund.\n\n“Now the Minimum Support Price announced by the government is below the market price. The farmer should be supported during price fluctuations like a government employee, whose Dearness Allowance is increased in tune with inflation index.”\n\nThe government should also advise the farmers on the choice of crop and volume of production in any given region, taking into account future needs.\n\nA vigilance wing should be formed in the Department of Agriculture to prevent entry of banned pesticides in the market.\n\nMore importantly, the farm tool manufacturers should design their tools to suit the needs of small farmers.\n\n“Above all, a university for organic farming should be started to primarily educate the farmers on appropriate practices.”", 
    "section": "national", 
    "title": "‘Start university for organic farming’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}