{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Thousands of devotees from various parts of the State took a holy dip in the Mahamaham tank, Portramarai tank and the Chakra Padithurai bathing ghat on the banks of the Cauvery here on Sunday, a fortnight after the Mahamaham festival was observed.\n\nEven by conservative estimates, more than one lakh devotees would have thronged the Mahamaham spots on Sunday with all important thoroughfares and bylanes filled with milling crowds and vehicles jostling for parking space. Section of the officials here said that the number of devotees who visited Kumbakonam on Sunday could even be double that number considering the steady flow of pilgrims since early morning. ``When we enforced a closure of bathing at the Mahamaham tank, there could have been around 3,000 pilgrims’’ says an official entrusted with the job of maintaining the tank.\n\nPolice personnel were able to monitor and regulate the crowds capably while the devotees felt that the civic officials could have performed a better job. “We had seen and heard in the media about the efficient and hassle-free manner the Mahamaham rituals were conducted here on February 22. That emboldened us to visit Kumbakonam this weekend. We had a good time here at the Mahamaham Tank and Chakra Padithurai where some water was flowing. But the officials could do something to operate the temporary toilets for the benefit of the visiting devotees,’’ opined S. Aarti from Valasaravakkam, Chennai.\n\nWe thought that a fortnight after the Mahamaham there would be little crowd in Kumbakonam but we are pleasantly surprised to encounter mammoth crowds even 15 days after the main rituals are over, her relative S. Priya, accompanying her, noted. Though water being let into the main Mahamaham tank is said to be recycled, the quality remains questionable but we understand the constraints of the officials in ensuring optimal quality water in the tank, Mrs. Priya said.\n\nMeanwhile taking note of such complaints, the civic officials have been working on recycling water in the tank periodically besides testing the quality parameters in the water. Department of Public Health officials and Kumbakonam Municipal officials tested the quality of water in the Mahamaham tank and Portramarai tank and poured hypo chloride compound liquid in the sacred spots frequently as a safety measure. With Shivarathri falling on Monday and a solar eclipse occurring on Tuesday, locals expect more people take bath in the sacred spots over the next two days.", 
    "section": "national", 
    "title": "Still, thousands of devotees throng Mahamaham tank", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}