{
    "author": [
        "K Raju"
    ], 
    "text": "Hundreds of families in Thalakadai and Velampannai villages on Sirumalai Hills, which is part of Natham constituency in Dindigul district, have been living under darkness since independence. What makes their plight even more poignant is the fact that the constituency is represented by Minister for Power R. Viswanathan who has been claiming that there is no power cut in the State. In the 2011 Assembly election, Mr. Viswanathan had promised these families that power supply would be arranged.\n\n“We are forced to wind up all our activities by sunset. School-going children depend on kerosene lanterns for their studies at night. With high prices of kerosene in open market and meagre supply in the ration shop, we languish in dark for several days in a month,” said K. Velmurugan, a farm labourer.\n\nHowever, Kadamankulam, which is far off from Thalakadai, has power supply as it has a few affluent estate owners. The Tamil Nadu Generation and Distribution Corporation (TANGEDCO) had taken pains to establish a transformer at Kadamankulam to ensure uninterrupted power supply. But fervent appeals of hundreds of families at Thalakadai are not even heard, complained another says resident K. Karuppaiah.\n\nThough power supply is available till Pazhaiyur, the forest department’s permission is needed to lay underground cables. The irony is that TANGEDCO could not get forest clearance for the past five years, he added.\n\nBut people at Thenmalai were little blessed. Even as they had lost all hopes of getting power supply, the Election Commission came to their rescue. TANGEDCO hurriedly completed cable laying work and conducted trial run just before the announcement of assembly election date.\n\nBut the agony of people at Thalakadai does not end with it. They get neither health care nor transport facility. The Dindigul Government Hospital, the nearest hospital, is 30 km away from Thalakadai. The worst affected are pregnant women; many women hire a house in Dindigul one month before delivery time and stay there till delivery to reach hospital quickly, say local people.\n\nJust three months ago, Thalakadai received its first gift since independence – an asphalt road connecting Thalakadai from Pazhaiyur village laid by the Forest Department.\n\nStill, with no transport facility, they trek 7 km to reach the nearest bus stop at Pazhaiyur.\n\nThe entire Sirumalai Hills has neither private nor government hospital. The entire population depends on a village health nurse for its medical needs.", 
    "section": "national", 
    "title": "Stranded on the hills, these villages are still ‘powerless’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}