{
    "author": [
        "Rajalakshmi Padmanabhan"
    ], 
    "text": "Subashini Parthasarathy sang Tamilisai to conclude the 10-day anniversary celebrations held at Raja Muthiah Mandram in the city.\n\nBeginning with the shloka “Vaakundam, nalla manamundam”, she sang Sivan’s popular “Devi neeye thunai” in ‘Keeravani’. Two of Andal’s lyrics “Men nadai annam”, the fifth pasuram from Nachiar Thirumozhi, and “Thoomani madathu”, the ninth one from Thiruppavai, came next. The well-liked “Ramanukku mannan” by Arunachala Kavi in ‘Hindolam’ was well appreciated.\n\nAn old favourite, Papavinasa Mudaliyar’s, “Nadamaadi thirindha” in ‘Kambodhi’ was the main song. The singer’s earnest attempt of raga alapana, neraval of the phrase “Thiruneerai sumandheero”, the support from accompanists, R. Govindarajan on the violin and K. Thiagarajan on the mridangam, all contributed to a satisfying presentation.\n\nKathadi Ramamoorthy’s comedy, “Whatsapp Vasu”, a fun and fantasy mix, wherein clicking a link on Whatsapp transforms a young man into an unrecognisable version of himself. It is entertaining to watch two men play the same character.\n\nThe setting of the play is a middle class family, with a typically old fashioned father, prudent and conventional mother, cranky relatives and the young son, a workaholic working on a high pressure, hi- tech job and his Whatsapp friend. Although some of the characters are stereotypical, the acting skills of the troupe keep the pace of the play going. The characters also surprise their viewers by their quickness in changing costumes.\n\nThe play tries to draw a parallel between a devise driven lifestyle, whereby people shop, queue, listen to music, watch movies and read books without having to leave their seats, and a leisurely life from long ago, in which people gossiped while they stood in actual queues, went to theatre to watch movies and concerts and moved around physically to play games.\n\nWritten, scripted and directed by S.L. Naanu, the play provided light-hearted fun poked at the obsession of today’s generation with devises and applications.\n\nRajalakshmi Padmanabhan", 
    "section": "national", 
    "title": "Talented troupe holds the audience spellbound", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}