{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Programme for\n\nNSS officers\n\nAn orientation programme for National Service Scheme Programme Officers and volunteers was conducted at the regional campus of Anna University in Madurai on February 26. One hundred and fifty participants from 29 engineering colleges attended the event, which was inaugurated by C. Swarnalatha, Dean. Samuel Chelliah, Regional Director; S. Raju, former NSS Coordinator, Madurai Kamaraj University; Kannan, Director, MK University; R. Ramesh, NSS Programme Coordinator, Anna University, and V. Joseph Paul Raj, Regional NSS Coordinator, were the resource persons.\n\nWorkshop\n\nA national workshop on “Acquiring important skills in operation and maintenance of laboratory equipment” was conducted by the Department of Botany and Microbiology, Lady Doak College, Madurai, from February 15 to 19 in which faculty members, laboratory technicians and research scholars from different institutions participated. Muthusubramanian, Chairperson, School of Organic Chemistry, MK University, delivered the inaugural address. Mary Esther Rani, Head, Department of Botany and Microbiology, explained the objectives of the seminar. A. Mercy Pushpalatha, Principal, in her introductory remarks, highlighted the importance of basic instruments and the need for knowing the repair mechanisms. B. L. Jadhav from Mumbai explained the skills required for the maintenance of laboratory equipment. G. Priscilla Sweetlin proposed a vote of thanks.\n\nSports meet\n\nThe 63rd annual sports meet of Fatima College, Madurai, was declared open by Shailesh Kumar Yadav, Police Commissioner, on February 20. K. Samidurai, secretary, Indian Association of Lawyers, gave away prizes to winners of various events. Asha Priyadharshini welcomed the gathering. Students presented a colourful march past, which was followed by yoga demonstration, gymnastics and a cultural programme. The Olympic flag and the college flag were unfurled by the secretary of the college, Rev. Sr. Francis Pauline, and Principal Rev. Sr. Fatima Mary respectively. Addressing the students, the Commissioner said that they should develop themselves physically, mentally and spiritually during the prime of their youth. Velankanni Matharasi, Directress of Physical Education, presented the annual sports report. Pavithra Shri proposed a vote of thanks.\n\nSeminar\n\nA State-level students’ seminar on “Emerging issues in health sector of Indian economy” was organised by the PG and Research Department of Economics of Thiagarajar College, Madurai, on February 23. The chief guest, A. Pragatheeswaran, former Chief Civil Surgeon, Government Rajaji Hospital, in his address, spoke about the challenges and opportunities in the Indian health sector and the spread of communicable and non-communicable diseases. He focused on the main health issues related to the student community. S. Kanagasabai, Head, Department of Economics, welcomed the gathering. M. Eyini, Principal, delivered the presidential address. A total of 115 papers were presented at the seminar in which over 400 students from 10 colleges participated. A. Kumudha, organising secretary, proposed thanked.\n\nRegeneration study\n\nThe Department of Zoology of Yadava College, Madurai, organised a lecture on “Regeneration study using earthworm as a model system” by S. Sudhakar, Professor, Department of Biotechnology, Manonmaniam Sundaranar University, Tirunelveli, on February 5. Dr. Sudhakar explained the important role played by Riboflavin in the regeneration of earthworm. K. Neethirajan welcomed the gathering. Principal (in charge) S. Dhanasekaran presided over the meeting.\n\nContest on model presentation\n\nThe Department of Mathematics of Velammal College of Engineering and Technology, Madurai, organised a State-level model presentation contest for school students on February 20. S. Vasuki, Head, Department of ECE, A. Shunmugalatha, Head, Department of EEE, and S. Poonkundran, Professor, CSE, acted as judges for the event in which 53 teams from 19 schools across Tamil Nadu participated. The students of Mahatma Montessori CBSE School, Madurai, won the first prize (Rs. 5,000); Velammal Vidyalaya, Theni, and Velammal Vidyalaya, Madurai, shared the second prize (Rs. 3,000) while Sethupati Higher Secondary School, Madurai, and Oxford Matriculation Higher Secondary School, Sivaganga, shared the third prize (Rs. 2,000). Sourashtra Girls Higher Secondary School, Madurai, received the consolation prize of Rs. 500. S. Velammal, Head, Department of Mathematics, welcomed the gathering at the prize distribution function. Vice-chairman of the college Ganesh Natarajan distributed the prizes to the winners. S. Karthikeyan proposed a vote of thanks.\n\nPearl jubilee\n\nPearl jubilee celebration of Royal Public School and Royal Vidyalaya Matriculation Higher Secondary School was held at the Vilangudi campus on February 20. A.P. Balachandran, District Judge, and K.K. Raja, former member of TNPSC, addressed the gathering, distributed prizes and released the pearl jubilee souvenir. Shakila Devi Rajaram, correspondent, presided over the function. P. Kanagaraj, Principal, welcomed the gathering and S. Amutha, Principal, presented the annual report.\n\nCase studies\n\nQuality Circle members of S.B.O.A Matriculation and Higher Secondary School, Madurai, presented their case studies at a function held recently. Selvi Santhosham, Administrator, Lakshmi Vidhya Sangam, the chief guest, interacted with student members of eight Quality Circle teams, who presented case studies of various issues pertaining to the functioning of the school. The Principal, S. Seethalakshmi, presided over the event. The two top teams, ‘Guide Post’ and ‘Tinkers,’ were presented with Ishikawa award and certificate. Guide Post helped to cultivate good manners among students and ‘Tinkers’ to make students realise their responsibility.\n\nScience expo\n\nA science expo was organised at Mepco Schlenk Nursery and Primary School, Tirumangalam, to mark ‘National Science Day’ on February 27. S. Baskaran, adviser, inaugurated the expo. M. Parameswari, Principal, presided over the inaugural function. The objective of the expo was to highlight the significance of scientific applications in daily life. Models displayed at the expo pertained to transport, sources of water, healthy food, space travel, communication and energy.\n\nAnnual Day\n\nMadurai Public School celebrated its first Annual Day on February 24 with R. Raja Govindasamy, Director, Mannar Thirumalai Naicker College, as the chief guest. He distributed prizes, medals and certificates for toppers in curricular and co-curricular activities. Green House got the overall rolling trophy for the year. Chairman L. Nachiappan presided over the celebration. Principal Mano Helena presented the annual report. Students presented a colourful cultural programme on the occasion.\n\nAnnual camp\n\nThe S.B.O.A. Matriculation and Higher Secondary School and S.B.O.A. CBSE School, Madurai, conducted the annual camp for Scouts and Guides at CESCI, Kadavur, on January 9 and 10. S. Seethalakshmi, Principal, SBOA Matriculation and Higher Secondary School, welcomed the participants. P. Vairavakumar, Scout Master, Sourashtra Higher Secondary School, inaugurated the camp. J. Joseph Stalin, correspondent, presided over the inaugural function. Daya Shyamala, Principal, SBOA CBSE School, offered felicitations.\n\nFine arts workshop\n\nCamlin Kokuyo conducted a workshop on fine arts for students of Nadar Mahajana Sangam Sermathai Vasan College for Women in Madurai on February 9. Resource persons trained students in fabric designing and vegetable printing.\n\nD. Karthiga Rani welcomed the gathering. R. Mutharasu, vice-president, offered felicitations.\n\nA. Arunkumar, Camlin Area Manager, presided over the workshop.\n\nS. Tamizharasi, Placement Cell convenor, proposed a vote of thanks.\n\nAnnual fiesta\n\nThe second annual fiesta of KMR International School, Madurai, was held on February 13. S. Ingersol, Group Director of ISRO, Mahendragiri, the chief guest, highlighted how science played a significant role in the betterment of life. Head Girl of the school Blessy Varadharaja of Grade VIII welcomed the gathering.\n\nThe correspondent, P. Krishnaveni, presided over the function. The Principal, Sakthivel Murugan, presented the annual report. Children presented a colourful cultural programme.\n\nVice-Principal Sabural Banu Ibrahim proposed a vote of thanks.", 
    "section": "national", 
    "title": "TAMIL NADU", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}