{
    "author": [], 
    "text": "RELIGION\n\nSri Srinivasa Perumal Temple, BHEL Township : Brahmotsavam, Hamsa vaganam, 6 a.m.; Hanumantha vaganam, 7 p.m.\n\nSri Ramakrishna Sarada Samithi : Maha Sivarathri, poojas, discourses and bhajans, Golden Rock, 8.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sahasranama parayanam, Sri Kothandaramar Sannidhi, Seshadripuram, Srirangam, 6 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama Nama parayanam, 1, Ganesan Street, Ayyappa Nagar, 6 p.m.\n\nCULTURE\n\nNaalathe Trust : Natyanjali, Jambukeswarar Akilandeswari Temple, Thiruvanaikovil, 11.30 p.m.\n\nGENERAL\n\nThe Booksellers and Publishers Association of South India: Book fair, Corporation grounds, Anna Nagar, Thennur, 11 am. to 9 p.m.\n\nShrimati Indira Gandhi College : Green walk – awareness programme on herbs, N.Murgeswari, professor, Bharathidasan University, and M.Prabavathy, assistant professor, Bharathidasan University, flag off, near college campus, 9.15 a.m.\n\nNational College, Department of Economics : Valediction of Economics Association, R.Narayanan, chief manager, Indian Bank, Srirangam, chief guest, 11.30 a.m.\n\nSri Sivananda Balalaya : Valediction of Bala Vigyan Utsav, M.Vasanthi, assistant professor, Bharthidasan University, chief guest, presentation of report on campus flora by S.Kalavathy and A.Vijayan, Adavathur campus, 10.30 a.m.\n\nSeethalakshmi Ramaswami College : Career oriented programme on industrial relations, K.Ramalingam, senior chemist, Dalmia Cement Ltd., speaks on Trade Union and Industrial Relations, 3.30 p.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti : Lecture on Groundwater quality monitoring and modelling for Madurai region using visual mudflow by A.Karthick, assistant professor, 5 p.m.\n\nMahalakshmi Engineering College, Thudaiyur : Mahatechies – state level project competition-cum-exhibition, V.Thiygarajan, academic director, MEC, chief guest, 9.30 a.m.\n\nM.A.M.College of Engineering and Technology : Career guidance programme, R.Lakshman Iyer, CEO, Iexam Centre, chief guest, 9.30 a.m.; workshop on Innovative electronics, 10 a.m.\n\nMaharishi Vidhya Mandir Service Centre and School for the Hearing Impaired and Pravaag Transitional Centre and School for Children with Autism : Women’s Day beauty contest, Aarathi Rajkumar, Ladies Circle No.33, chief guest, Rajaram Salai, K.K.Nagar, 10.30 a.m.\n\nJamal Mohamed College: National Service Scheme camp, valediction, N. K. Senthamarai Kannan, Inspector General of Police, delivers valedictory address, S. Mohamed Salique, Principal, presides, N.B. Abdul Gafoor A/c auditorium, 10 a.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}