{
    "author": [
        "R Sujatha"
    ], 
    "text": "With model code coming into force, 2 varsities will remain headless\n\nWith the election model code of conduct coming into force on Friday, there is uncertainty over the appointment of Vice-Chancellors to the University of Madras (UNOM) and Madurai Kamaraj University (MKU). The universities have remained headless for two months and eight months respectively.\n\nLast month, one of the members of the MKU Vice-Chancellor search committee, Mu. Ramasamy, had quit, levelling serious allegations against its convener C. Murukadas.\n\nSimilarly, a member of the UNOM VC search committee, Surendra Prasad, remained incommunicado following alleged difference of opinion with other members over finalising the shortlist of names for the top post.\n\nIn this backdrop, a cross-section of academics feels that the universities might have to remain headless till a new government is in place in May.\n\n“State universities have only academic autonomy. The administrative and financial powers are vested with the government. Since finance comes largely from the State government and a portion from the Centre, the universities must abide by the norms of the Election Commission,” feels former UNOM Vice-Chancellor S.P. Thyagarajan.\n\nExemption\n\nAccording to him, with the model code of conduct in place it would only be appropriate for the universities to seek special exemption from the Election Commission quoting the necessity for appointing a new Vice-Chancellor.\n\n“The government must justify the request for exemption from the model code of conduct, like if there is an impending evaluation of the university for accreditation or for (availing any statutory) status,” he explained.\n\nAssociation of University Teachers president M. Ravichandran said that since the Governor nominated a person to the search committee with the government’s help, it was for the government to take up a university’s case.\n\nThere has been at least one instance in the recent past when the Election Commission has given relief to a university.\n\nEarlier case\n\nFormer Vice-Chancellor of Anna University M. Ananadakrishnan recalled that the Rajasthan government had appealed to the Election Commission through the Governor-Chancellor that Rajasthan University had advertised a large number of faculty vacancies but since the model code of conduct was put in place interviews could not be held.\n\n“The Election Commission gave them a special permission to conduct the recruitment,” Prof. Anandakrishnan recalled. However, he was of the view that since only two more months were left for polling, the Election Commission might not find it appropriate to grant special permission for the appointments.", 
    "section": "national", 
    "title": "Uncertainty over appointment of VCs", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}