{
    "author": [
        "B Kolappan"
    ], 
    "text": "If forging electoral alliances is a tough task for political parties, seat-sharing exercises among poll partners is no less tedious as the party leadership is forced to do a balancing act between its larger interests and the aspirations of cadres. This election season too could witness some action on this front when parties with equal strengths in some constituencies stake claim for the same seat.\n\nWhen alliance talks progress into specifics of constituencies, it could lead to a breaking point or heartburns for individuals. Party functionaries who had nurtured a constituency are often reluctant to let go of the “winnable” seat in favour of an alliance partner.\n\n“Normally political parties will insist on getting constituencies represented by their candidates. More often than not it will not be a smooth affair. Sometimes the senior partner rejects the demand,” points out former Congress MP and MLA K.S. Alagiri. In his own case, in 2001, when the Congress-TMC forged ties with the AIADMK, he had to forego his sitting Chidambaram constituency.\n\nThere have been some historical flashpoints too. For instance, in 2001, MDMK leader Vaiko abruptly walked out of alliance talks with the DMK when the latter insisted that it would not part with the Sankarankoil constituency after initially agreeing to allot the seat. Sankarankoil is Mr Vaiko’s home turf but the DMK allotted it to Puthiya Tamizhagam, a minor ally.\n\nAnother Congress leader who had to forego his sitting constituency was Mr. Peter Alphonse, again in 2001 when the AIADMK refused to allot the Tenkasi constituency where he had previously won. In 2006, Mr. Alphonse had switched over to Kadayanallur.\n\n“There are some tricky constituencies. For instance, in Kanyakumari district, traditionally national parties are strong but local DMK leaders too have high stakes there,” says an observer. It would be interesting to watch how the DMK would negotiate with the Congress when it comes to allocating seats in the district this time.\n\nParties also seek to retain their stranglehold in traditional regions. The Left parties opt for seats in Kanyakumari, Tiruvarur, Nagapattinam, the industrial belt of Tirupur and Coimbatore, and Madurai districts as their cadre base is spread out here.\n\nSometimes, minor allies have to be content with allocation of seats outside their domains like the PMK, which was allocated Nanguneri by the AIADMK in 2001 and Dindigul, Cholavandan, Koilpatti and Alangudi in southern districts by the DMK in the last Assembly polls.\n\nThe BJP usually prefers seats in Kanyakumari and Coimbatore districts. The ruling AIADMK never makes a compromise on seats in the Kongu belt. At one point of time, the DMK maintained Chennai city as its citadel before the AIADMK made inroads in the urban areas.\n\nIn the 2011 polls, the Communist parties were forced to contest in constituencies like Vikkaravandi and Maduravoyal where they were not dominant. But the CPI (M) candidates won in both constituencies.\n\n“Sometimes winning in ‘outside’ constituencies helps to build our party organisation. But we cannot completely bring the constituencies under our control,” admits a senior communist leader.\n\nTamil Nadu has also seen individuals dominate in some constituencies. In 2001, when TMC founder G.K. Moopanar denied a seat to sitting MLA A. Appavoo (now in the DMK), he entered the field as an independent candidate and won in the Radhapuram constituency.", 
    "section": "national", 
    "title": "When forging alliances ‘unseats’ individuals", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}