{
    "author": [
        "T K"
    ], 
    "text": "With the State-run Arasu Cable Corporation set to offer affordable internet services in Tamil Nadu, cable operators now are in demand as various entities are hoping to make use of the last-mile connectivity provided by them to reach consumers.\n\nArasu Cable already has about 27,000 cable operators in their fold offering its cable television services in the State. There are nearly 31,000 cable operators across Tamil Nadu.\n\nReliance Jio is set to begin its operations in the State soon and the company has begun groundwork in certain areas in Chennai. “The Tamizhaga Cable TV Communications Pvt Ltd (TCCL) is looking to tie up with Reliance Jio to provide internet services. The company wants to roll out the services through cable operators,” P. Sakilan, President, Tamizhaga Cable TV Operators General Welfare Association (TCOA) said. TCCL has also applied for an ISP licence through a company formed for the purpose, Tamizhaga Internet Communications Pvt Ltd (TIC). “We will provide our own internet service and provide other ISP’s internet services as well. We want to give a wide range of options to the consumer,” he said.\n\nApplications pouring in\n\nArasu Cable has already started receiving applications from various cable operators in the State after the announcement of its broadband scheme ‘Arasu Fibre’ on Tuesday. Arasu Cable, in fact, initially had an MoU with RailTel Corporation that uses the large railway network to take internet to the masses and villages that run along railway lines. However, after spending time on promoting RailTel’s service and the effort going into it after running a pilot for a few months, Arasu Cable found it was prudent to use its own network, control rooms, in all the districts and the existing base of cable operators to roll out internet services.\n\n“In fact, Arasu Cable has put out a second tender to cover all the taluks. The first tender covered the districts. Now the cable corporation wants to connect all the taluks so that it becomes easy for local cable operators to source the bandwidth,” a State government official, who did not wish to be named, told The Hindu . PowerGrid Corporation and Vodafone have evinced interest, the official said.\n\nMeanwhile, RailTel, which has a few thousand customers in the State, is looking to tie up with cable operators to provide its internet services.\n\nIncidentally, a senior RailTel official made a pitch for cable operators at a meeting of TCOA last month.\n\nRailTel has proposed a revenue sharing agreement of 40-60 between cable operators and RailTel, a cable TV operator said.", 
    "section": "national", 
    "title": "With Net market growing, cable operators in demand", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}