{
    "author": [], 
    "text": "Before the model code of conduct kicked in,politicians pampered the youth with sports kits\n\nIn a state where the people have been used to a culture of freebies, political parties go to any length to woo the voters in an election year. Voters in some constituencies are already being pampered with goodies. Before the model code of conduct came into force, some AIAMDK cadres began distributing cricket, volleyball and basketball kits to college students in Bodi constituency, which is represented by Finance Minister O. Panneerselvam. Even senior schools students have been availing of these sports goodies. Clearly, the first time voters are in demand.\n\nMore than half-a-century after the historic Justice Party ceased to function in Tamil Nadu, a man in Uttar Pradesh has approached the Election Commission of India to register a party with the same name. As per a public notice, the party will have its headquarters in Rae Bareli, a constituency that has elected Congress leaders Indira Gandhi and Sonia Gandhi. If any old loyalist of the Justice Party wants to object to the name, he/she can do it by writing to the Election Commission of India by March 9.\n\nA recent notification issued by the School Education Department, which restricts the scope of three per cent reservation for differently abled candidates to be appointed as Assistant Elementary Education Officers in the State, has come in for sharp criticism from activists. A notification by the School Education Department dated February 25 states that candidates with disability in only one of his/her limbs can be accommodated under the three per cent reservation and candidates with disability of other nature would not be eligible. The State Secretary of Tamil Nadu Association for the Rights of All Types of Differently-abled and Caregivers S. Namburajan said that the notification was nothing but a clear violation of the Persons with Disabilities (Equal Opportunities, Protection of Rights and Full Participation) Act, 1995. “While persons with disabilities can become judges, civil servants and go on to hold high positions of the State machinery, how can they discriminate people based on disability? There are visually challenged teachers too. This notification is only an attempt to restrict differently abled persons. This notification is certainly a violation of the Act.”\n\nIf the arrest of Kanhaiya Kumar and other JNU students for allegedly raising anti-national slogans found resonance with the citizens, the students found support from another man charged with sedition in Tamil Nadu. Folk singer Kovan, who was charged with sedition for singing anti-Jayalalithaa songs, has now penned a song with the lyrics “Azaadi” (freedom). In the song, Kovan sings, “Why do you hate the term Azaadi? The term is another one for ‘democracy’...it is a word that your khaki force hates.”\n\nDealing with anonymous petitions is perhaps one of the major challenges in the administration of Tamil Nadu police. There have been instances when anonymous petitions were referred to the Directorate of Vigilance and Anti-Corruption or the Crime Branch CID for enquiry. Some were enquired by the State intelligence and disposed of. Now that elections have been notified in Tamil Nadu, it is petition time again. On Sunday too, a petition against a top police officer went viral in the social media. It came a day after the DMK made a representation to the Chief Electoral Officer seeking transfer of some officials ahead of the elections. Senior police officials say the culture of levelling serious allegations against top brass would not have gained any credence had the authorities concerned ignored them.\n\n(Contributions by\n\nK Raju, Dennis\n\nS Jesudasan, T.K. Rohit and S. Vijay Kumar)", 
    "section": "national", 
    "title": "With polls around, leaders try hard to be a good ‘sport’", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}