{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "The City Corporation has started removing political graffiti on Saturday, a day after the model Code of Conduct took effect after notification of polls by the Election Commission of India.\n\nWhite-washing of graffiti is turning out to be an onerous task for the civic body as the process has to be carried out at least twice to create the desired impact. The process will prolong for a few more days, sources said.\n\nWhile the official machinery could prevail upon the political parties to remove banners and hoardings put up to receive or felicitate leaders, the civic body is facing the ignominy of spending a huge amount of money for cleaning up the walls. Political parties have been informed strictly that banners, hoardings and wall writings have been prohibited in the urban areas, and that they need to take due permission to put up the advertisements in rural places.\n\nIn each of the eight Assembly segments in the district, three flying squads, static squads, and monitoring committees have been formed, for maintaining round-the-clock vigil in three shifts.\n\nThe Control Room established in the Collectorate attended to 12 of the 24 complaints on violations of model code of conduct within hours of registration, District Collector S. Prabakar said on Saturday.\n\nPublic have been informed that they could convey their complaints about model code violations to the Control Room over phone: Collectorate, Control Room, 0424-2267671 / 2267677 / 2267680, or toll free number 18004253757.\n\nOf the 2114 booths, five have been identified as sensitive. Money over Rs.1 lakh found in possession of the public without supporting documents during raids will be confiscated by the teams. Bank transactions exceeding Rs. 10 lakh were being monitored, the Collector said.", 
    "section": "national", 
    "title": "Works on to remove hoardings, political graffiti in Erode", 
    "subsection": "tamilnadu", 
    "date": "2016-03-07"
}