{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Madurai Corporation is hopeful of achieving target\n\nWith the financial year coming to an end by March 31, revenue authorities in the Corporation were hopeful of achieving the targeted collections, officials said. A major part of the revenue for the local body comes from property tax among others.\n\nWith 100 wards in the corporation limits, the annual tax targeted for the current fiscal is Rs. 89 crore and the officials have so far collected Rs. 66 crore, including 40 per cent towards arrears, which accounts for Rs. 6.27 crore (out of Rs. 15 crore).\n\nWith two more months (February and March) left, the officials are confident of achieving 100 per cent property tax collection by March 31. “We have collected 81 per cent as of January 30, while it was 71 per cent in corresponding period last year,” a senior official of the Corporation said.\n\nRecently, Mayor V.V. Rajan Chellappa, at a review meeting, urged the officials to recover the arrears as it would facilitate execution of many development works. Apart from remitting taxes online, computerised tax collection centres in the respective zones enabled easy remittance.\n\nFor the benefit of senior citizens, the Corporation introduced a mobile vehicle which goes to the doorsteps of tax payers for collection.\n\nOnce in 10 years, taxes were revised for the local bodies. The last time the property tax was hiked was in 2008. Hence, the next revision would be in 2018.\n\nWith a number of new buildings having come up in extension colonies, expansion of number of wards from 72 to 100 and multi-storey buildings replacing old buildings in commercial zones and other such developments added up to the revenues to the Corporation’s exchequer, officials said.\n\nApart from this, the annual rental revenue from markets situated at Mattuthavani, Arapalayam, Tirupparankundram and other places fetched close to Rs. 1 crore through open tender system. Further, with over 300 mobile towers installed atop buildings in the city by different mobile phone operators, the Corporation has now taken steps to vacate the court stay and from this, close to Rs. 5 crore, including arrears since 2010, would come in, the officials added.", 
    "section": "national", 
    "title": "81 p.c. property tax collected", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}