{
    "author": [
        "S Poorvaja"
    ], 
    "text": "I’m happy to go back home, says the soft-spoken M. Chandralekha at Chennai Central railway station on Tuesday afternoon. She says little else, but the happiness is evident in her face.\n\nOn 12 August 2014, Ms. Chandralekha was found at the Egmore Railway station by the Railway Protection Force. She had no recollection of who she was or where she was from and soon after, delivered a baby at a nearby hospital.\n\n“Since she seemed mentally-ill, we took her to the Shelter for Urban Homeless in Teynampet. The baby was taken to a government home where she died soon after due to ill-health,” said Mary Thomas, director of the Selvi Memorial Illam Society which manages the shelter.\n\nShe said that Chandralekha was then taken to the Kilpauk Medical College for psychiatric treatment over the next one-and-a half years following which she was able to regain her memory. “She told us that she was from a village in Varanasi and gave us her father’s name. We contacted the Lion’s Club there and asked them to track down the family,” said S.M. Venkatesh, a social worker and a member of the Lions Club in Chennai.\n\nSince she could not remember a phone number or any other contact information, a few members tracked down her family by visiting the village and informed Munnubhai Patel, Chandralekha’s father. “She had left home and boarded the train not knowing what she was doing. The family was very happy when we contacted them and are waiting to welcome her at the Varanasi station in two days,” said Mr. Venkatesh.\n\nNow 35, Chandralekha boarded the train with two volunteers as well as the coordinators of the Urban Shelter in Teynampet where she had been staying for the last two years. “There are several others brought to our homes under similar situations. With the intervention of volunteers and social workers, we have managed to reunite with their families around seventy such people, including Chandralekha, who were brought to our shelter,” Ms. Mary said.\n\nM. Chandralekha was found at Egmore station in August 2014 with no recollection\n\nof her identity", 
    "section": "national", 
    "title": "A belated but welcome return to Varanasi", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}