{
    "author": [
        "V S"
    ], 
    "text": "Decision of the Supreme Court on Tuesday to permit the Gas Authority of India (GAIL) to lay its pipelines through farm lands in seven western districts of Tamil Nadu with a compensation enhanced by a meagre 30 per cent is only seen as a problem returning to haunt and strip the farmers of their livelihood.\n\nIt came in 2011 and GAIL officials commenced convincing the farmers triggering an outburst, when the educated farmers came to know of the conditions and refusal of GAIL to run it along the highways. Agitations began in mid-2011 and it slowly gathered momentum when a farmer in Mullainaickanur in Tirupur got a compensation cheque for Rs 13 and another farmer in the same village attempted suicide. The farmer who attempted suicide was about to lose his bore well, cowshed, well and a house that was built at a cost of Rs 11 lakh.\n\nWhen the pipelines in Kerala could be run alongside National Highways, why alone it should be run through farm lands and a clause of responsibility in the GAIL agreement leaves the farm land owner as a guardian or watchman to safeguard the pipeline and fixes the accountability on the farmer. 10 per cent of the guideline value or market value offered as compensation is just a peanut, as the condition literally leaves the farmer with no major right to use the land for economical gains or monetary returns.\n\nGAIL which sought a Right of Use for 99 years imposed conditions which included; no raising of long term crops, no crop roots of which will disturb the pipeline should be raised, all wells should be closed and no permission for sinking bore wells.\n\nLiterally the land could not be used for anything other than raising maize and vegetables, this would literally ruin the economic prospects of the farming community, says G.K. Nagaraj of Kongu Jananayaka Katchi, who was part of the Western TN farmers livelihood protection Committee.\n\nIf the project had been allowed in its original form and shape, Western TN would have lost its predominant agrarian identity and the population would have faced a serious set back economically.\n\nThe Apex court’s decision to enhance the compensation from 10 per cent to 40 per cent of the market value is no big relief to the farmers and it just comes as a pittance, farmers here lament.\n\nThe proposed pipeline that would enter Tamil Nadu from Kerala near Walayar would pass through Tamil Nadu for 310 kms via Coimbatore, Tirupur, Erode, Namakkal, Salem, Dharmapuri and Krishnagiri districts. Initial plans of GAIL ran into rough weather, when farmers opposed the alignment.\n\nFarmers point out that 1,491 acres of 5,842 farmers had already been acquired and further acquisition would involved another 2,000 to 3,000 acres. PMK and other parties are planning to stage agitations.", 
    "section": "national", 
    "title": "After four years, project returns to haunt farmers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}