{
    "author": [
        "Staff Reporter"
    ], 
    "text": "“Administrative reforms, change of policy will bring about change in State”\n\nBoth the All India Anna Dravida Munnetra Kazhagam and the Dravida Munnetra Kazhagam did not have confidence to face the Assembly polls alone, and they had been waiting in the corridors of other parties for electoral alliance, Pattali Makkal Katchi leader Anbumani Ramadoss said.\n\nAddressing a public meeting here on Tuesday, he said that the 66-year-old DMK and the 44-year-old AIADMK were afraid of contesting the elections alone. The condition of the DMK, which was pushed to the third place in the 2011 Assembly elections, was very pathetic now as it was not at all in the race, he said.\n\nMr. Anbumani said: “We have the solution to all the problems plaguing Tamil Nadu. But the DMK did not have any solution because it was the real problem of the State.”\n\n“The PMK has self-confidence to face the elections alone. We are ready to have an alliance with any party, except the AIADMK and the DMK. We are not against any political party. We are only opposed to their policies.”\n\nHitting hard on the State government, he said that the State topped in liquor sale, road accidents and number of widows and suicides. The local Minister ruled out total prohibition. Even the DMK would not impose prohibition because its leaders owned liquor companies. Increasing liquor sale was the only the achievement of Dravidian parties,” he said.\n\nTo bring about change, Tamil Nadu did not need additional funds. Administrative reforms and change of policy would suffice, he asserted.\n\nMr. Anbumani announced that his party would not offer freebies, but provide free education and job for all, if elected to power.\n\n“We are not against Dalits. The PMK had made Dalits Ministers. There was no need for us to do politics using the Dalit card. The Communist Party of India (Marxist), which termed us caste outfit, did not have a single Dalit member in its politburo. Mr. Yechuri said that no qualified Dalit was available to occupy the post,” he charged.", 
    "section": "national", 
    "title": "AIADMK, DMK lack confidence to face election alone: Anbumani", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}