{
    "author": [
        "S Prasad"
    ], 
    "text": "Holds discussions on development of coastline\n\nChief Minister N. Rangasamy presenting a memento to Mohan Kumar, Ambassador of India to France in his chamber in the Legislative Assembly in Puducherry on February 02, 2016. Chief Secretary Manoj Parida is also seen in the picture.- Photo: T. Singaravelou\n\nMohan Kumar, Ambassador of India to France, made a courtesy call on Chief Minister N. Rangasamy in his chamber in the Legislative Assembly on Tuesday.\n\nMr. Kumar held discussions about the development of the Puducherry coastline and setting up an Immigration cell for addressing issues related to people of Puducherry origin residing in France and around the world.\n\nTalking to reporters, Mr. Kumar said that it was a courtesy call though he did discuss about the development of Puducherry’s coastline and providing facelift to heritage buildings in the city.\n\n“We also discussed about starting an Immigration cell on the lines of the Kerala Government which was important for providing services and issues related to people of Puducherry origin.”\n\nA dedicated officer in the rank of Deputy or Joint Secretary could be appointed as Nodal officer of the Immigration cell. Officials at the Indian Embassy in France can directly contact the Nodal officer, he said.\n\nThe Chief Minister has assured that he will favourably consider the issue and asked the Chief Secretary to explore the options for setting up the cell. The number of complaints related to land grabbing of property of French nationals in the city has reduced when compared with the previous years.\n\nMr. Kumar said that he had extended an invite to Mr. Rangasamy and Chief Secretary Manoj Parida to participate in the Puducherry Day celebrations. The event is likely to be held in August this year, he added.", 
    "section": "national", 
    "title": "Ambassador to France calls on Rangasamy", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}