{
    "author": [
        "S Sundar"
    ], 
    "text": "Bus driver, conductor escape with minor injuries\n\nThe bus that was damaged after a railway ballast screening machine rammed it at a level crossing gate near Rajapalayam on Tuesday.\n\nIn what is seen as a violation of railway safety norms, a railway ballast screening machine (BSM) on Tuesday hit a State-run bus at a manned level crossing (LC) near here in Virudhunagar-Shencottah section, as the LC gate was kept open for road vehicles to pass through.\n\nFortunately, only the driver and conductor were in the bus that was being taken from TNSTC depot to Rajapalayam bus stand. The accident occurred at the LC gate between Rajapalayam and Sankarankoil railway stations around 5.15 a.m., sources said.\n\nThe bus suffered damage on the front portion and the crew members – Mariaselvam (41) and Thannasi (49) – escaped with minor injuries.\n\nThe bus driver could not have expected any railway movement in that stretch since the LC gate was kept open for road vehicles, a railway officer said.\n\nAn officer said on condition of anonymity that the BSM was proceeding towards Rajapalayam railway station for stabling after completing maintenance work between Rajapalayam and Sankarankoil.\n\n“All the railway stations in Virudhunagar-Shencottah single line section are closed during night hours after the last train passes through the section. Since no other rail movement is scheduled in the section late in the night the stations are being closed for the last one year,” the official said.\n\nStating that railway officials and men returned to work only the next morning when railway operations began, the official said that the LC gates were left open for road vehicles. “The manned level crossings in the section are declassified as unmanned level crossing gates between 8 p.m. and 6 a.m.,” another railway official said.\n\nThough railway sources said that the BSM normally moved in a relatively slower speed, officials said that the operator should have been cautious and watched out for road vehicle movement. Railway sources said that if the BSM operator had operated the vehicle with line clearance, the accident could have been averted.\n\nTamil Nadu Railway Police Inspector (Virudhunagar) M. Kalanjiyam said that the BSM operator and railway senior section engineer were being enquired in connection with the accident. The bus driver and conductor were admitted to the Government Hospital here, he added.", 
    "section": "national", 
    "title": "Ballast screening machine rams bus at manned level crossing", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}