{
    "author": [], 
    "text": "RELIGION\n\nRamayanam: R. Rangan, Sri Arunagiri Nathar Arangam, Kumaran Kundram, Chromepet, 6-30 p.m.; R. Krishnamurthy, Sri Sankara Gurukulam, 8/20, C.P. Ramaswamy St., Abhiramapuram, 6-45 p.m.\n\nMahabharatham: B. Sundarkumar, Asthika Samajam, Venus Colony, Alwarpet, 6-30 p.m.\n\nGita: Satyavratananda Saraswati, Mylapore Club, Luz Church Rd., Mylapore, 11 a.m.\n\nRamanuja 108: Venu Raza Narayanan, Sri Santhana Venugopalaswamy Temple, Pedariyar Koil St., Broadway, 6 p.m.\n\nJeevan Mukti Vivegam: K.S. Maheswararn, Sri Sankara Gurukulam, 8/20, C.P. Ramaswamy St., Abhiramapuram, 5 p.m.\n\nSree Ayyappa Bhaktha: Bhagavatha Dasaha Sathram, Mahalingapuram Ayyappan – Guruvayurappan Temple, Nungambakkam, 8 a.m.\n\nGENERAL\n\nUniversity of Madras: Inauguration of seminar on ‘Significance of differently abled in Arabic Pedagogy and Literature, Platinum Jubilee Auditorium, Marina Campus, 10 a.m.\n\nRajiv Gandhi National Institute of Youth Development: Inauguration of workshop on ‘Women Connect for Leadership and Change’, Sriperumbudur, 10 a.m.\n\nTamil Nadu Open University and Kalki Groups: Inauguration of workshop on ‘Peridhunum Peridhu Kel’, Saidapet,, 10 a.m.\n\nSt. Peter’s University: Inauguration of workshop on ‘Applications of multimedia: Industrial perspective and hands-on training on photoshop and video-editing’, Avadi, 9 a.m.\n\nGovernment Arts College (Men): Inauguration of seminar on ‘Physics of Everyday Affairs’, Nandanam, 9-30 a.m.\n\nState Platform for Common School System: Seminar on ‘Education under WTO-GATS: The Republic in Peril’, Saliure Hall, Loyola College (Men) Hostel, Nungambakkam, 4 p.m.\n\nAl-Anon: Meetings, Police Community Hall, Walltax Rd.; Shrine of Divine Mercy Church, Anna Nagar East, Near Chinthamani; St. Andrews Church, Gandhi Rd., Guduvancherry; Ambedkar Manram, Ashok Nagar; The Lady of the Light Church, Mylapore; Jacob MHSS., Judges Colony, Periakuppam, Thiruvallur, 7 p.m.", 
    "section": "national", 
    "title": "Chennai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}