{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Ten children rescued from Assisi Snehalaya (a home for persons affected with AIDS) at Ettimadai in Coimbatore returned with their parents on Tuesday. It was alleged that they were not given proper care from persons running the home. They were among the 28 persons including 22 children rescued from that home last Friday.\n\nThe children were handed over to their parents before the Child Welfare Committee (CWC) after giving them counselling to help them continue education. “The parents were from Erode, Tirupur and Dharmapuri districts. We will assist them to enrol in schools at the respective places and get medical assistance through CWCs there,” said P. Samson, chairman of the CWC in Coimbatore. Officials are probing into complaints of continued sexual abuse of girl children and they said the chances for the same could be remote.\n\nChildren who returned with their parents included four girls, of whom three are in their 10{+t}{+h}standard. “We have asked the girls to stay with their parents for a few days and return before the board exams. Arrangements will be made for food and lodging for them till they write the exams,” he said. The CWC was expecting parents of two more children to take them back soon.\n\nTwelve children for whom the parents did not turn up before the CWC for the sitting on Tuesday were taken back to the Reception Unit of Don Bosco Anbu Illam. Steps are on to identify a home that will provide them shelter and help them get back to school without delay.\n\nIt is learnt that during the inquiry, the children gave oral complaints on the alleged ill treatment in the home from where they were rescued. A detailed report on the same will be submitted to the District Collector.\n\nDistrict Child Protection Officer G. Vijaya said that a home (located near the home from where the children were rescued) has come forward to provide food and lodging for the children who have not returned with their parents or don’t have takers, till the end of this academic year.\n\nOn that day when the inmates alleged that they were ill treated, tension moments prevailed at the home as catholic priests running it were attacked by a group of locals. Police arrested a few attackers as the issue was taking a communal angle.", 
    "section": "national", 
    "title": "Children rescued from home return with parents", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}