{
    "author": [
        "Aloysius Xavier Lopez"
    ], 
    "text": "AIADMK councillors attribute it to disease prevention measures; opposition blames lack of doctors\n\nAssistant health officers have been asked to find out the reason for the drop in number of patients —Photo: V. V. Krishnan\n\nIn the aftermath of the floods, all the 133 primary health centres run by Greater Chennai Corporation have reported an unusual dip in the number of patients. The Corporation has asked officials to study the reasons for the reduction in numbers in January, as compared to the corresponding period in 2015. According to Corporation sources, the number of residents who visited Corporation hospitals in January this year came down by 13,500 as compared to January 2015.\n\nOver 2.7 lakh residents had visited public health centres across the city in January 2015. The civic body has asked assistant health officers in each of the 15 zones to find out the reasons for this. A report would be submitted next week. AIADMK councillors in various wards attributed the dip in number to disease prevention measures taken in each of the neighbourhoods after the floods in December.\n\nA. Ezhilarasi, AIADMK councillor of ward 1 in Tiruvottiyur zone, said all streets in her ward had been visited by teams that conducted medical camps.\n\n“More than 25 camps were conducted in flood-affected areas of our ward. We also supplied Nilavembu Kashayam from door to door. Such efforts seem to have worked,” said Ms. Ezhilarasi.\n\nHealth officials have started investigation of the existing conditions and challenges to public health in the city.\n\nDMK councillors in some wards attributed the dip to the rising vacancies in medical officers’ posts in 133 hospitals. “Most of the doctors are not visiting hospitals regularly from 8 a.m. to 3 p.m. Medicines are not in stock. So, residents have stopped visiting the hospitals,” said Deva Jawahar, DMK councillor in Kolathur.\n\n“Residents need evening clinics. Corporation hospitals also do not remain open on Sundays. This is a disadvantage for residents. Construction of the 100-bed hospital in Padi which started a few years ago is yet to be completed,” said Congress councillor P. V. Tamilselvan of Ambattur zone. Chennai Corporation Council on Saturday passed a resolution to fill 64 vacancies of medical officers, 182 staff nurses and 74 lab technicians and 65 pharmacists in hospitals. But the officials said the hiring of such staff was likely to be disrupted owing to Assembly elections this year. Currently, as many as 169 doctors are on the rolls of Greater Chennai Corporation.", 
    "section": "national", 
    "title": "Corporation clinics see fewer patients", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}