{
    "author": [
        "P V"
    ], 
    "text": "Two environment groups have attempted to retrieve a tribal worship form for an ecological cause - the cause of saving our water bodies from encroachments and slow death.\n\nOn Tuesday, a group of 20 activists began their cycle campaign – Maari Amma Utharavu – a take off from the tribal worship of ‘Rain’ as ‘ Maari ’ – that predated the arrival of organised religions – to call attention of the government to our dying water bodies.\n\nThe activists from both the Salem Citizens Forum and the Dharmapuri People’s Forum embarked on the gruelling 300-km ride, all for the cause of ‘ Maari ’. Among them was Karthika, a Standard X girl from Salem, who has taken up the arduous journey.\n\nThe cycle campaign was aimed at drawing the attention of the State Government to the promise of retrieving water bodies from encroachments and garbage, made in the wake of the Cuddalore and Chennai floods, says Balasubramani of Dharmapuri People’s Forum. “Two months have passed, and nothing has come of it and no lessons were learnt.”\n\nThe campaign will cover from Dhamapuri to Chennai, pedalling home the message of saving water bodies from encroachments.\n\nAccording to Balasubramani, the spirit of naming the campaign as ‘ Maari Amma Utharavu ’ was to retrace the spiritual idea of ‘ Maari ’ and its worship by the tribal society. En route, the campaign will stop by schools, colleges, public places, bus stations and any place that hosts an audience to push for public voice to rid our lakes, ponds, rivulets, rivers, channels off garbage and encroachments. They will halt as and when they get a place to recuperate.\n\nThe Dharmapuri People’s Forum took shape a year ago after two ecology-conscious civil society groups, Thalirgal and Ainthinai , joined to revive the Elakyampatty lake. The Forum drew inspiration from the Salem Citizen’s Forum, a civil society initiative formed by local activists to revive water bodies.\n\nThe campaign will conclude in Chennai on February 21.", 
    "section": "national", 
    "title": "Cycle campaign to save water bodies", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}