{
    "author": [
        "Special Correspondent"
    ], 
    "text": "DMK treasurer M.K. Stalin on Tuesday said there was no basis for the allegation that his party was against North Indians because it opposed the imposition of Hindi.\n\n“It is a politically motivated campaign. The DMK is not against the North Indians. When Gujarat was ravaged by an earthquake, our leader M. Karunanidhi released a sum of Rs. 30 crore for the relief works,” he said during an interaction with North Indians settled in Sowcarpet in Chennai as part of his Namakku Naame campaign.\n\nMr. Stalin said he was aware of the difficulties faced by jewellers and other traders at the hands of police and commercial tax officers and promised to put an end to the harassment if the DMK was elected to power.\n\nHe also had a meeting with traders at the Koyambedu Wholesale Market in the morning. “The market will be upgraded into a world-class facility and there will be more cold storage facilities,” he said.\n\nMr. Stalin said that even though the AIADMK government had announced the construction of a new bus stand at Vandalur to ensure free flow of traffic in Koyambedu and a multi-storeyed complex at the market, nothing was done to implement the announcements.\n\nAccusing the police of harassing small traders, he said the maintenance fee for shops had also been increased. “The government has also hiked the entry fee for vehicles bringing goods to the market,” Mr. Stalin said.\n\nAs it was not clear who was the controlling authority of the market — the Chennai Corporation or CMDA — the market was not properly maintained. “Garbage is piling and there aren’t adequate cold storage facilities for fruits and vegetables,” he charged.\n\n‘Koyambedu market will be upgraded into a world-class facility if the DMK is elected to power’", 
    "section": "national", 
    "title": "DMK is not against North Indians: Stalin", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}