{
    "author": [
        "M Soundariya Preetha"
    ], 
    "text": "The Centre proposes to promulgate the new Employees Provident Fund (EPF) and Employees State Insurance Corporation (ESIC) Acts providing more choice, increased coverage among workers and employers and better and expanded range of services for organised sector workers, Prime Minister Narendra Modi said here on Tuesday.\n\nHe inaugurated a medical college and newly-constructed buildings of ESIC Hospital here.\n\n“Keeping in mind our commitment to minimum government and maximum governance, the ministry is simplifying central labour laws by consolidating the existing 44 laws into four labour codes — on wages, industrial relations, safety and security, and health. This will increase the ease of doing business and facilitate job creation, without compromising on genuine protections and rights available for workers,” he said.\n\n“We are progressing on the reforms path by building consensus on these reforms through extensive stakeholder consultations with employers, workers’ representatives and State governments,” he added.\n\nThe Union government launched the second generation reform agenda ESIC 2.0 last year. “My government is dedicated to the welfare of our brothers and sisters who are our Rashtra Nirmatas ,” he said.\n\nThe ESI scheme has been extended to Arunachal Pradesh, Mizoram, Manipur, Andaman and Nicobar islands. It is proposed to expand the coverage from industries and commercial establishments within a district to entire districts by March 31, 2016.\n\nSo far, 23 colleges across India have received the approval to increase the number of MBBS seats by over 1,700. This includes four State Government medical colleges in Tamil Nadu – at Coimbatore, Kanyakumari, Tirunelveli and Madurai - that have received approval to upgrade by adding 345 more seats.\n\nThe government is also keen on establishing AIIMS-like institutes across the country and has approved one for Tamil Nadu.\n\n‘No real issue’\n\nLater, speaking at a rally, Mr. Modi said the Opposition had no real issues to target him and have resorted to stalling the Rajya Sabha to block passage of crucial Bills.\n\n“We work hard and pass the laws in the Lok Sabha. But in the Rajya Sabha, they says let’s see what we could do to him and are blocking every thing. Is this good politics? They are hurting the people in trying to teach me a lesson,” Mr. Modi said.\n\nOn the economic front, he said there was an overwhelming global consensus that among the larger economies, India was the fastest growing.'FDI inflow gone up'\n\n“Under our government, FDI inflow has gone up by 39 per cent,” he claimed.\n\nThe Prime Minister also dwelt extensively on the welfare measures initiated by the Centre, including the new crop insurance scheme, the launch of ‘Make in India’ and ‘Start Up India’ and administrative reforms.", 
    "section": "national", 
    "title": "ESIC medical college, hospital buildings opened", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}