{
    "author": [
        "V S"
    ], 
    "text": "The decision of the Supreme Court on Tuesday to permit the Gas Authority of India (GAIL) to lay its pipelines through farm lands in seven western districts of Tamil Nadu has brought the farmers and political parties together once again for reviving the agitation.\n\nThe apex court’s decision to enhance the compensation from 10 per cent to 40 per cent of the market value is no big relief to the farmers and it just comes as a pittance, say leaders of regional parties who spearheaded the agitation against the pipeline earlier.\n\nThe proposed pipeline that would enter Tamil Nadu from Kerala near Walayar would pass through Tamil Nadu for 310 km via Coimbatore, Tirupur, Erode, Namakkal, Salem, Dharmapuri and Krishnagiri districts.\n\nInitial plans of GAIL ran into rough weather, when farmers opposed the alignment. While GAIL’s pipelines would run alongside the highways and railway lines in Kerala, it insisted in Tamil Nadu an alignment that would cut across farm lands.\n\nGAIL promised a compensation of 10 per cent of the guideline value for right of use permission for 99 years. “At this rate, a farmer in Mullainaickanur in Tirupur got a cheque for Rs 13. This speaks volumes about the setback for the farmers,” says G.K. Nagaraj of Kongu Jananayaka Katchi (KJK).\n\nChief Ministerial candidate of the Pattali Makkal Katchi and Dharmapuri MP Anbumani Ramadoss in a statement pointed out that 1,491 acres of 5,842 farmers had already been acquired and further acquisition would involved another 2,000 to 3,000 acres.\n\n“While land was being sold at Rs 2 to 4 crore per acre, GAIL wants right of usage at Rs 2 to 3 lakh,” he charged.\n\nTamil Manila Congress leader G.K. Vasan said the SC decision has shocked the farmers of the western region. “If gas pipes are laid on fertile lands, the soil will lose its fertility and value. Smaller farmers stand to lose a lot when their smaller-sized lands are taken over for laying the pipelines. It will hurt them economically,” he said.\n\nIt would result in the farmers losing their homes, wells and pumps which have been built and bought after years of hard work. “This project should not be implemented in a way that affects the livelihood of these farmers,” he said\n\nMoreover, the conditions imposed by GAIL included closing down of wells, no permission for borewell, no right to raise any long term crops among others. “For a pipeline of two feet diameter, the farmer would have to spare ten meters on either side, virtually taking away 60 ft of land right across the farm land,” said Nagaraj.\n\nThis will be a set back to 50,000 farmers directly and 4.5 lakh farmers indirectly. It also will lead to razing over 2,200 cow sheds and demolition of 3,000 odd houses of farmers. The farmers with small land holdings will be gravely affected, he claims.\n\nStating that it was a project mooted by the UPA, E.R. Easwaran of Kongu Makkal Desiya Katchi urged the Prime Minister to bring in an amendment to save the farmers in western Tamil Nadu. “It is unfortunate that the project in its original alignment is being pursued despite a resolution against it by the Tamil Nadu Legislative Assembly,” he said.\n\nM.R. Sivasamy of Tamizhaga Vivasayigal Sangham said the farmers were not opposed to the pipeline but only to the proposed alignment and imposition of anti-farmer conditions.\n\nThe PMK, KJK and KMDK have all announced agitations to prevent the pipelines being laid through farmlands.\n\n(With inputs from\n\nUdhav Naig)", 
    "section": "national", 
    "title": "Farmers with small land holdings will suffer, say political parties", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}