{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Shoe designers from across the globe including Italy, Spain, Brazil, Belgium and the US are looking for collaboration with leather industries here in Tamil Nadu. Over the next two days these designers would be visiting factories in and around Chennai and exchanging best practices. “Companies in India want these designers to come and work for them part-time,” said Naresh Bhasin, Chairman of Task Force on Design, at the sidelines of curtain raiser event of the nineteenth International Technical Footwear Congress.\n\nWalter Bettini one of the designers from Italy said, “I’m already working with few brands here in India. There is a huge potential for shoes here.” He has been providing support as art director to a firm in India for the last three years which he did not want to disclose.\n\nFocus on US market\n\nThe leather industry is also looking at increasing its exports to the United States and other countries. “The US market was served by China so far. With cost of production going up Chinese market is becoming expensive and we see an opportunity there,” said P.R. Aqeel Ahmed, regional chairman-South, Council for Leather Exports.\n\nIndia is the second largest footwear manufacturer and exports around 10-15 per cent of the production while the rest is consumed domestically. “Of this 10-15 per cent more than 65 per cent of the shipments were to the European market. But now we want to focus on US,” added Mr. Aqeel.\n\nCurrently, the size of the leather industry in India is around $12 billion. In the next five years, the industry is pegged to touch $27 billion.\n\nThe Technical Footwear Congress which will commence on February 3 will discuss the latest developments in footwear manufacturing, under the theme Future Footwear Factory, with topics including intelligent manufacturing and digital smart factory, sustainable and regulatory trends impacting factories and attractive footwear factories and new ways of management. Around 403 Indian delegates and 165 overseas delegates from 27 countries would be participating in the event.", 
    "section": "national", 
    "title": "Footwear congress to attract international designers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}