{
    "author": [
        "S Senthalir"
    ], 
    "text": "The 'Neer Kudam' will travel across Puducherry, Villupuram, Auroville and Cuddalore, where the water festivals are organised from Wednesday to March 22.— Photo: Special Arrangement\n\nA water festival with children as stakeholders inaugurated in Puducherry\n\nSchool children will now get to know the environment and identify heritage sites in their region.\n\nThe Water Festival 2016 inaugurated on Tuesday in Puducherry will take them through the importance of water conservation by methods of puppet shows, theatre, exhibition and banner painting.\n\nChildren from nearly 41 schools falling within Puducherry, Villupuram, Auroville and Cuddalore (PVAC) bioregion will be involved in the water conservation campaign beginning from Bahour on Wednesday.\n\nAll for Water for All, a collective network of citizens and organisations, organised the inauguration of The Water Festival 2016 in Puducherry on Tuesday on World Wetland Day.\n\nT.P. Raghunath of All for Water for All, said that the children are the primary stakeholders.\n\nNearly 25 schools in Puducherry region, four schools from each region including Cuddalore, Vaanur, Marakkanam and Auroville have been selected for the celebration of water festival.\n\nThese regions situated along the Coromandel Coast forms part of an integrated natural ecosystem which includes ponds, lakes, rivers, wetlands, beaches, estuaries, mangroves and forests.\n\nThe PVAC bioregion is closely interconnected through natural resources, climate, culture, tourism, trade and transportation.\n\nThe schoolchildren will involve in puppet shows and theatre.\n\nNot just that, they would also be taken for a heritage walk around their villages and encourage them to clean small tanks in their surroundings. “This festival is seen as a celebration of what we have now and an effort to bring together all positive forces for the protection, improving of water systems, its governance, sustainable use and augmentation,” he said.\n\nEducation pattern\n\nMr. Raghunath stressed on evolving an education pattern that cultivates environment friendly behaviour in children.\n\nPVAC bioregion face a host of serious threat which are caused primarily by human activity that includes pollution, industrial and other waste, decreasing ground water level, conservation of agricultural lands, encroachment of water bodies due to population growth, salt water intrusion into groundwater due to coastal erosion and over extraction.\n\nIn order to address this issue, the Water Festival will also hold meetings with the local community and other stakeholders to formulate recommendations that would be submitted to the government.\n\nProbir Banerjee of All for Water for All collective said that every region has general and specific problems.\n\n“Through this festival, efforts would be made to identify the problems and provide solution to these problems. Subsequently, on the last day of the festival on March 22, recommendations based on this would be sent to the government,” he said.\n\nThrough this festival, efforts would be made to identify the problems and provide solution to these issues.\n\nProbir Banerjee\n\nAll for Water for All", 
    "section": "national", 
    "title": "Getting positive forces closer to save water", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}