{
    "author": [], 
    "text": "The Madras High Court Bench here has directed Sivaganga Collector to initiate action against his subordinates who had colluded with a panchayat president and aided him in his attempts to escape from facing an enquiry into charges of misappropriating public money.\n\nDismissing a writ appeal filed by Alangulam panchayat president K. Ravichandran, a Division Bench of Justices V. Ramasubramanian and N. Kirubakaran ordered action against officials who had deliberately issued defective notices to the petitioner in order to help him.\n\nThe judges pointed out that the appellant had been issued with a show-cause notice under the Tamil Nadu Panchayats Act, 1994 on December 10, 2014 seeking explanation as to why should he not be removed from office. He replied to the notice and also filed a writ petition challenging it.\n\nA single judge of the High Court granted an interim stay of all proceedings pursuant to the notice. Subsequently, the writ petition was allowed by another judge on the short ground that the period of notice as stipulated under the Act was not provided in the notice.\n\nTherefore, the Sivaganga Tahsildar issued another notice on August 28, 2015 and that was also quashed by the High Court on the ground of insufficiency of notice period. Yet, “not frustrated,” the Tahsildar issued one more notice on October 17 but only to be quashed again within three days thereafter.\n\nFinally, a fourth notice was issued on December 4.\n\n“This notice was also obviously designed by a clerk in the office of the Collectorate in such a manner that the appellant could succeed. Perhaps finding out the collusion and the designs on the part of the staff of the Collectorate, the learned Judge refused to set aside the fourth notice. The judge, instead, rectified the defect pointed out by the appellant by postponing the meeting of the panchayat from December 17 to 21. Taken aback by such clever move, the appellant has come up with the above appeal. We find nothing wrong in the order of the learned Judge.\n\n“If notices for the initiation of the proceedings under Section 205 of the Tamil Nadu Panchayats Act, 1994 are cleverly manoeuvred, in collusion with the officials of the Collectorate, the Court has to necessarily find out an ingenious method to overcome the same,” the Division Bench said.", 
    "section": "national", 
    "title": "HC orders action against officials", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}