{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Prime Minister Narendra Modi handing over a scroll to mark the inauguration of the medical college and hospital of ESIC in Coimbatore to Ministers P. Mohan (third right), S.P. Velumani (second right) and C. Vijaya Baskar (right) at a function in Coimbatore on Tuesday. Governor K. Rosaiah (left), Union Ministers Pon. Radhakrishnan (second left) and Bandaru Dattatreya, (fourth right) are in the picture.—Photo: S. Siva Saravanan\n\nWith the efforts of the Government to expand Employees State Insurance Corporation (ESIC) and improve its services, persons insured under the scheme can book appointments online to select hospitals.\n\nUnion Minister of State for Labour and Employment Bandaru Dattatreya said here on Tuesday that India is now coming of age in the field of healthcare in harnessing technology and expanding infrastructure for affordable healthcare. ESIC is the only social security organisation in India that provides multiple benefits to insured persons and beneficiaries covered. ESIC has so far set up 151 hospitals and 1,459 dispensaries. It is modernising and constantly upgrading facilities.\n\nWith the launch of ESIC 2.0, there are facilities such as medical helpline for emergencies and seeking guidance.\n\nIt launched recently a website which facilitates insured persons to book appointments online in 36 hospitals. Last one year, the Government has initiated many actions to bring in efficiency, transparency and accountancy in ESIC operation. ESIC has also launched e-governance in many ways. Now, contributions can be made by net banking.\n\nUnion Minister of State for Road Transport and Highways Pon. Radhakrishnan said the ESIC hospital and medical college here will immensely benefit workers in this region.\n\nAccording to a press release, the ESIC Medical College has been constructed at a cost of Rs. 580 crore.", 
    "section": "national", 
    "title": "Insured persons can now book appointments online to select ESIC hospitals", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}