{
    "author": [
        "Zubeda Hamid"
    ], 
    "text": "The Supreme Court decision on Section 377 was widely celebrated\n\nMembers of the LGBT community in Chennai celebrate after the Supreme Court decision —Photo: Special Arrangement\n\nFor the LGBT (lesbian, gay, bisexual, transgender) community in Chennai, Tuesda yfternoon was special.\n\nAfter years of struggling against Section 377 of the Indian Penal Code, there seemed to be finally some hope.\n\nThe Supreme Court has referred a curative petition against the earlier verdict upholding the section to a Constitution Bench, signifying that there could a complete re-look at the case.\n\nSection 377 is a colonial-era law that criminalises “carnal intercourse against the order of nature”.\n\nThere were scenes of celebration at Sahodaran, an NGO working for LGBT rights in the city, with members of the community hailing the court’s decision as a positive step forward.\n\nLiving freely\n\n“A door has been opened with this, and we are hoping that in the future, no LGBT person will have to hide their identity in fear. We were bursting crackers and dancing,” said Jaya, general manager, Sahodaran.\n\nL. Ramakrishnan of SAATHI, an NGO working for health and human rights, said: “This is the best outcome we could have hoped for. It is good news for us and now, whether the section is repealed or read down to ensure consensual sex between adults is not criminalised, either way, it is a positive step,” he said.\n\nC. Moulee, a volunteer with Orinam.net, an LGBT online collective, said this step gave the community hope that attitudes were changing. “It re-affirms the country’s constitutional values,” he said.\n\nG. Sankari, an LGBT activist with Nirangal, an organisation that works for LGBTQ rights, said, “The 2014 judgment on transgenders, even though it was ostensibly only about transgender rights, made a very strong point citing international human rights law that sexual orientation and gender identity must be protected and that discrimination against both is unconstitutional.”\n\n“The weight of this and the current decision together augur well for the community,” she added.\n\nActivists say the step gave the community hope that attitudes\n\nare changing", 
    "section": "national", 
    "title": "LGBT community in city sees sign of hope", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}