{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Anmeega Jothidam’ by P.A. Ponniah, Railway Colony, 7.30 p.m.\n\nAdi Chokkanathar Temple: Yagasala puja, 7 a.m.; mahakumbabishekam, 10 a.m.; tirukkalyanam, Sakkudi, 10.30 a.m.\n\nSaiva Siddhantha Sabha: Discourse on ‘Tiruvarutpayan’ by A. Arumugam, South Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nPanniru Tirumurai Mandram: ‘Tiruvasagam’ mutrothal, 7 a.m.; Tiruppugazh recital, South Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Tiruvarutpa’ by M. Vijayaraman, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Sekkizhar Pillaithamizh’ by Arunachalam, Sakthi Velammal Nagar, S, S, Colony, 5 p.m.\n\nKamakoti Peravai: Maha Periyavar jayanthi; discourse by Dharani Vijay, Vasudhara, Tirupparankundram Road, Andalpuram, 6.15 p.m.\n\nBharathi Yuva Kendra Trust: Discourse on ‘Villi Bharatham’ by Tiruchi Kalyanaraman, Setupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nOur Lady of Lourdes Church: 96{+t}{+h}annual festival; holy mass, Rev. Fr. Bernard leads, 6 a.m.; Rev. Fr. Mani Lazar leads, K. Pudur, 6 p.m.\n\nCULTURE\n\nMeenakshi Sundareswarar Temple: Anna memorial day; special prayer and community lunch; ‘ Sellur’ K. Raju, Minister for Cooperation, K. Veeraraghava Rao, Collector, S. T. K. Jakkaiyan, Tamil Nadu’s Special Representative in Delhi, and V.V. Rajan Chellappa, Mayor, participate, Tirukkalyana Mandapam, 12 noon.\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nKadambavanam: Bharatanatyam, folk dance and puppet show, Parali, 6 p.m.\n\nGENERAL\n\nThe American College: Centenary celebrations of Daniel Poor Memorial Library, 10 a.m.; release of Rotaract Club’s magazine, Tweets, Alumni Hall, 5 p.m.\n\nYadava College National Service Scheme: C. Dhanasekaran, Principal (in charge), inaugurates tuberculosis awareness camp, 2.30 p.m.\n\nCapron Hall Higher Secondary School for Girls: 181{+s}{+t}anniversary celebration; A. Mercy Pushpalatha, Principal, Lady Doak College, addresses, 5.30 p.m.\n\nPonmani Matriculation Higher Secondary School: 27{+t}{+h}Annual Day; S. Raja addresses; K. John Moses, president, Bharathi Desiya Peravai, presides, Usilampatti, 5 p.m.\n\nEvidence: Seminar on ‘Educational institutions and caste discrimination,’ Tamil Nadu Theological Seminary, Arasaradi, 4.30 p.m.\n\nNala Dental Hospital: Programme on ‘Recent advancements in root canal treatment using microscope,’ Chokkikulam, 11 a.m.\n\nAlcoholics Anonymous: Meeting, AG Church, Melur, 6.30 p.m.; Deep Hospital and Loyola Technical Institute, Gnanaolivupuram, 7 p.m.", 
    "section": "national", 
    "title": "madurai today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}