{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "In stark contrast to speeches of other leaders at Coimbatore rally\n\nPrime Minister Narendra Modi is well known for his passionate speeches. But at the Coimbatore rally, which was being touted as the grand launch of the BJP's election campaign, it was his total silence on both Tamil Nadu and the upcoming Assembly election that has surprised many.\n\nThis was in contrast to the speeches made by other leaders, who came down heavily on the “misrule” of the Dravidian parties who have alternated in power since 1967.\n\nA senior leader said while they expected Mr. Modi to detail some of the major projects the State had received since 2014, the lack of direct attacks on regional players was as anticipated.\n\n“For his stature as the Prime Minister, you cannot expect him to indulge in personal attacks everywhere he goes. Even while attacking the Congress, he did not take any names. That’s his style and culture,” the leader added.\n\nHowever, observers believe Mr. Modi’s strategy of avoiding a mention of both the major Dravidian parties could have been a calculated tactic.\n\nPolitical commentator R. Mani said this was perhaps a move to ensure all alliance options remained open. “BJP leader Subramanian Swamy tweeted on Tuesday that he hoped the party aligned with the DMK and DMDK if Karunanidhi is not the CM candidate. So maybe, the BJP has not ruled out any option,” he opined.\n\nWhile it was true that the stature of the Prime Minister would not allow crass personal attacks on the Opposition, Mr. Mani said Mr. Modi’s address did not provide even a basic roadmap for the party in Tamil Nadu. “Calling it an election rally and completely ignoring elections is a curious way of dealing with the situation,” he added.\n\nHowever, almost every other senior national and state leader who addressed the rally , including Muralidhar Rao, L. Ganesan, Tamilisai Soundararajan, Vanathi Srinivasan and H.Raja took on the AIADMK and the DMK and placed the BJP as an alternative to the two.\n\nLeaders blame police\n\nMeanwhile, the State BJP faced some tense moments when many seats remained vacant well into the meeting. Party State president Dr. Tamilisai publicly accused the police of trying to block the cadres from entering the venue and warned of a reaction. Other leaders too urged the police to open more gates to the venue.", 
    "section": "national", 
    "title": "Modi steers clear of attack on Dravidian parties", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}