{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Senior Congress leader and former Union Minister V. Narayanasamy on Tuesday blamed the leaders of Bharatiya Janata Party, Puducherry unit for the Centre’s failure to implement the demands of ruling All India NR Congress such as accordance to Statehood and waiver of loan to the tune of Rs.5,000 crore.\n\n“The Modi Government has not done anything to the growth of Union Territory of Puducherry. The UT is grappling with heavy financial burden due to ineffective governance of AINRC Government,” said Mr. Narayanasamy in a statement.\n\nHe alleged that without knowing the origin of creation of separate public account, BJP, Puducherry unit president V.Saminathan has been criticising him and former Union Minister P.Chidambaram for creation of such account and mounting debts to the tune of Rs.5,000 crore.\n\nHe added that it was then Chief Minister N.Rangasamy took the decision and enacted a bill which enabled UT to get adequate loans from banks and through open market borrowings.\n\nMr. Narayanasamy said, “After borrowing indiscriminately, Chief Minister has spent the amount in prodigal manner rather than investing in infrastructure activities. Even I was not consulted then when I was Member of Parliament. Then how can I be responsible for creation of separate public account.”\n\nHe added that during parliamentary elections, Mr. Rangasamy promised that UT would get sufficient funds from Centre if Narendra Modi was voted to power. But on the contrary, budget outlay has been reduced by 20 per cent in the last two years and Union government has released only Rs.50 crore rain-relief assistance while asking the UT government to spend from its own sources. The promise of that Modi-Government would waive Rs.5000 loan was thrown into wind.\n\nBlaming the Centre for putting Smart City Proposal of Puducherry Government on the backburner, he said the BJP Puducherry unit leaders have no locus standi to criticise the Congress leaders as the former miserably failed to extend cooperation to AINRC to get its demands implemented.", 
    "section": "national", 
    "title": "Narayanasamy blames BJP for failure to implement demands", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}