{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Though the status of transgenders has improved after they were recognised by the Supreme Court as the third gender, there are still no basic social security benefits for them, according to B. Rangeela Jeevan, a transgender and president of District HIV Positive Welfare Society.\n\nAround 150 transgenders were in the district, but not a single free house site patta was given to any of them, Jeevan told The Hindu here. A total of 60 transgenders each in Tirunelveli and Kanyakumari districts had been provided with free houses by the State government.\n\nMany houseowners were not willing to rent their houses to transgenders in Thoothukudi district and they faced many social and psychological challenges, Jeevan said.\n\nThough the transgenders brought this demand for houses to the notice of officials many times, no action was taken in this regard. When the issue was represented to Collector M. Ravikumar, he said that house site pattas could not be given to transgenders within a radius of 19 kilometres from Thoothukudi. Jeevan claimed that even the authorities had not come forward to provide housing facility at far off places in the district. “Only a few kind hearted people rent out their houses but mostly the transgenders are not given houses for rent,” Jeevan said.\n\nEven if houses were rented, the transgenders could not afford high rent. Many of them were jobless as they suffered discrimination.\n\nCollector denies charges\n\nBut the Collector denied Jeevan’s allegations and said that he was ready to provide house sites away from the city in panchayat limits. But they were not willing to move away from the city since they wanted to live in a group. He said that meetings had been convened on their request thrice but the transgenders did not agree to move away from the city.\n\nThe district administration, he said, extended all benefits, including voter identity cards and family cards, to eligible transgenders.", 
    "section": "national", 
    "title": "“No house for rent for transgenders”", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}