{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "Observing that private individuals can refuse to receive registered post but a Postmaster cannot, the Madras High Court Bench here has criticised the Postmaster at Bodinayakanur in Theni district for having refused to receive an application addressed to him by a cable television operator seeking renewal of his registration under the Cable Television Network (Regulation) Act, 1995.\n\nA Division Bench of Justices V. Ramasubramanian and N. Kirubakaran said: “The application for renewal of registration sent on October 8 should not have been returned by the Postmaster with an endorsement ‘Refused.’ The conduct of the Postmaster in refusing to receive a registered post is wholly unacceptable.”\n\nThe observation was made while disposing of a batch of cases filed by the cable TV operator, Saisiva alias Sivasubramanian, who had been granted with a registration certificate for five years beginning from February 3, 2010 though the statutory rules framed under the 1995 Act do not provide for issuing a certificate with a validity of more than 12 months and require operators to renew it periodically.\n\nOne of the petitioner’s business rivals filed a writ petition in 2013 challenging the validity of the registration certificate issued for five years and even as that petition was pending in the court, the petitioner “by way of abundant caution” made a fresh application in 2014 seeking renewal of registration for an year and obtained a certificate valid from October 9, 2014 to October 8, 2015.\n\nThe validity of the second registration certificate was also challenged before the High Court by another individual. Subsequently, the Postmaster of Bodinayakanur Head Post Office issued a communication to the petitioner on February 2, 2015 asking him to reapply for registration since the first registration certificate for five years was illegal and hence the renewal done in 2014 was also invalid.\n\nAfter this, the petitioner moved the High Court challenging the Postmaster’s communication and simultaneously sent an application on September 18, 2015 seeking renewal of his registration for one more year.\n\nHowever, the application sent through registered post returned with the endorsement ‘Refused’ forcing the cable operator to file one more petition seeking renewal of registration.\n\nMadras High Court Bench in Madurai has criticised the Postmaster at Bodinayakanur in Theni district", 
    "section": "national", 
    "title": "Postmaster cannot refuse to receive registered post: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}