{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Miraya Vadra plays for Haryana in the basketball championship\n\nMiraya Vadra, daughter of Priyanka Gandhi, in action during the Sub-Junior National Basketball Championship in Puducherry on Tuesday. -Photo : T.Singaravelou\n\nPriyanka Gandhi’s daughter Miraya Vadra was the cynosure of all eyes as she took to the field on Tuesday for a basketball match here along with her team-mates from Haryana.\n\nThe 42nd Sub-Junior National Basketball Championship for boys and girls has been organised by the Basketball Federation of India in association with Pondicherry Basketball Association in Puducherry from Tuesday to next Monday at Rajiv Gandhi Indoor Stadium.\n\nCongress president Sonia Gandhi’s daughter Priyanka Gandhi is also in Puducherry to see her daughter in action. Security has been upped in and around the hotel where the mother and daughter are staying.\n\nOn Tuesday, though, Miraya left her mother at the hotel and turned up at the indoor stadium where she was joined by her team members.\n\nThe match between Haryana girls and Tamil Nadu girls began at 10.45 a.m. From the beginning of the match, Tamil Nadu team was maintaining the lead. In the first quarter of the match, Haryana scored only 6 points while Tamil Nadu notched up 27.\n\nTamil Nadu beat Haryana 80-58. Tamil Nadu’s Pavithra Sree scored a game-high 36 points.\n\nMiraya, sporting Jersey No. 15, did put her skills on display during the game, much to the delight of the shutterbugs from the media at the venue.\n\nA group-photo was taken at the end of the game.\n\nMathab Singh, Haryana team coach, told The Hindu , “Our kids were too tired since they travelled three days by train to reach Puducherry. Except in the first round, I feel the team did well in all other rounds.”\n\nAvoiding media glare, Miraya went with her friends to sit in public the gallery to watch other events.\n\nM. Sheeba, Tamil Nadu Coach said, “Our team has been maintaining the lead from the beginning and we are hopeful that the team will enter the quarterfinal.”\n\nThe championship is being played on league cum knock out basis and the final will be held on February 8.", 
    "section": "national", 
    "title": "Priyanka’s daughter wins hearts", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}