{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Protesters staging a black flag demonstration at Lakshmi Mills Junction to condemn Prime Minister Narendra Modi’s visit to the city on Tuesday. —Photo: M. Periasamy\n\nRepresentatives of 23 political parties and organisations jointly organised a black flag protest ahead of Prime Minister Narendra Modi’s visit to Coimbatore on Tuesday. The city police arrested 220 persons, including 26 women, who waved black flags at Lakshmi Mills Junction a couple of hours before the arrival of the Prime Minister.\n\nCoordinator of the Rohit Vemula Neethikana Kootamaipu (Justice for Rohit Vemula Federation) that comprises the 23 organisations, C. Venmani, said that they wanted to protest the Prime Minister’s visit to condemn his alleged inaction over the death of the research scholar despite the incident turning out be an issue concerning Dalits across the country.\n\n“The Prime Minister should have had things under control by acting at the right time,” Mr. Venmani said.\n\nThe protesters raised slogans seeking fulfilment of three demands. They wanted the Union Government to put and end to oppression of Dalits, case to be registered against the Minister for Human Resource Development for abetting suicide of the youth and action against Akhil Bharatiya Vidyarthi Parishad cadre and Union Labour Minister Bandaru Dattatreya for their alleged role in the incident.\n\nGeneral Secretary of Thanthai Periyar Dravida Kazhagam (TPDK) K. Ramakrishnan and representatives from Tamil Nadu Untouchability Eradication Forum, Adi Tamilar Katchi, Bahujan Samaj Party, Dravida Kazhagam, DYFI, SFI, AISF, RSF, RYF, CPI (ML) Red Star, CPI (ML) Liberation, Tamil Puligal, Dravidar Viduthalai Kazhagam, Social Justice Party and Dalit Viduthalai Katchi took part in the protest.\n\nThe protesters were taken to a marriage hall, where they were kept till the late hours of the day.", 
    "section": "national", 
    "title": "Protesters held for attempting to show black flag to PM", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}