{
    "author": [
        "S Ganesan"
    ], 
    "text": "Approval is yet to come from the Railway authorities, says Highways Department\n\nNotwithstanding the recent assurances from Railway authorities, construction of the first stage of the new multi-level bridge at Aristo Junction in Tiruchi continues to be hampered by the delay in grant of approval for transfer of railway land for the project.\n\nThe Highways Department was hoping to complete the first of the two stage project by the end of 2016, ahead of its scheduled time of February 2017. But a question mark has risen now on whether it would be able to meet the target. In the first stage, a new three-lane bridge with five arms will be built at a cost of Rs. 44.28 crore adjacent to the existing bridge. In the next stage, the old bridge would be dismantled and a new bridge with two arms built in its place. The second stage is scheduled for completion by 2019. Although both the Highways Department and the Railways were working simultaneously at the site, the Highways Department could not take up work on full swing on the first stage of the project as Railways has to transfer about 5,095 square metres of its land. Of this, nearly 872 square metres of land is required for laying the service lane along the left side of the bridge towards the Dindigul Highway.\n\nParleys have been going on between the Railways and the Highways Department for the transfer of the land over the past several months.\n\nOver the past few months, the Highways authorities and the Tiruchi MP P. Kumar have taken up the matter with the Railways seeking at least in principle approval from the railways so that the work could proceed until the inter-departmental process of land transfer was completed.\n\nIn October, Mr. Kumar had taken up the matter with the Railway Board chairman A.K. Mittal, who on receiving a representation from Mr. Kumar, reportedly instructed the Southern Railway General Manager to take steps for granting in-principle approval.\n\nAt a press conference here in December, A.K. Agarwal, Divisional Railway Manager, Tiruchi, said that issues pertaining to the transfer of the land had been sorted out with the Highways Department raising hopes that the tangle would come to an end soon.\n\nYet, the approval was yet to come from the Railway authorities, sources in the Highways Department said. Only after the grant of in-principle approval, the Highways Department could lay service lanes towards the Dindigul Highway.\n\nThe Highways Department had planned to open the Railway Junction-Dindigul Highway section (a part of the first stage of the bridge) by January end but this had been deferred now to March. The opening of the section would considerably ease the traffic congestion in and around the Railway Junction and Central Bus Stand owing to diversions enforced to facilitate the construction of the bridge.\n\nLaying of the service road simultaneously was considered vital to relieve the heavy traffic congestion caused by diversions.", 
    "section": "national", 
    "title": "Railways yet to transfer land for Aristo bridge", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}