{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "Finally there is a glimpse of hope that the statue of ‘Rebel’ Muthuramalinga Sethupathy, erstwhile king of Ramanathapuram, installed in front of the Collectorate but remained wrapped in plastic sheet for more than two years, could be unveiled on Thursday.\n\nThe king, who spent half his life in jails in Tiruchi and Fort St. George in Chennai after rebelling against the British, is kept “imprisoned’ in the form of a statue for over two years because of the Supreme Court order on unveiling statues at public places.\n\nAs it was perceived that the eight-foot life-size bronze statue of the king installed off Ramanathapuram-Rameswaram National Highway in front of the Kenikarai police station could not cause any hindrance to traffic or public, it has been included in the list of statues to be unveiled by Chief Minister Jayalalithaa on Thursday through video conferencing, sources here said.\n\nThe Information and Public Relations (IPR) Department in Chennai has asked the Public Works Department here to clean up the statue and send a picture after removing the plastic sheets, the sources said. The Electronics Department, which makes arrangements for video conferencing, has not received any alert till late on Tuesday evening, the sources added.\n\nAfter the government passed an order (GO No. 177) in 1995 to unveil a statue in honour of the king, the first to raise his voice against the British, the IPR Department had made ready the statue in 2010 at a cost of Rs. 4.95 lakh.\n\nThe king held a sword in his hand in the statue, signifying his valour, and it was installed in the later part of 2012 on a pedestal by the PWD.\n\nThe king was crowned when he was just a 72-day-old child. The Nawab of Arcot, along with the British, attacked his palace when he was 12 years old, captured him in 1772 and held him in Tiruchi jail till 1782. The British attacked him again in 1795 and jailed him in Fort St George till his last days. He died in the prison in 1809 at the age of 49.", 
    "section": "national", 
    "title": "Ramanathapuram rebel king’s statue likely to be unveiled tomorrow", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}