{
    "author": [
        "R Sivaraman"
    ], 
    "text": "Plea was made to Union Urban Minister M. Venkaiah Naidu\n\nChief Minister N. Rangasamy handing over a letter to Union Minister for Urban Development Venkaiah Naidu on Monday.-Photo : T.Singaravelou\n\nChief Minister N.Rangasamy has urged Union Government to include Karaikal town in the list of AMRUT (Atal Mission for Rejuvenation and Urban Transformation) cities.\n\nHe made the plea to the Union Urban Minister M. Venkaiah Naidu who was here in city on Monday.\n\nThe Chief Minister also formally submitted a letter requesting the Centre to fulfil various demands of the UT Govt.\n\nIn the letter, Mr. Rangasamy said Karaikal, is a notified town as per Census 2011 and has a population of 98,102. Due to rapid urbanisation and natural growth in the last four years since Census-2011, the population of Karaikal town has crossed more than one lakh, which is the main criteria for inclusion of a town / city under AMRUT.\n\nIn order to provide infrastructure such as water supply, sewerage, drainage and urban transport and to promote Karaikal as a hub of religious tourism, Government of Puducherry has sought central assistance through AMRUT scheme. Hence, Karaikal is to be included in the list of AMRUT cities, the Chief Minister added.\n\nThe Chief Minister also sought the release of balance central share for the projects sanctioned under the erstwhile Jawaharlal Nehru National Urban Renewal Mission.\n\nHe also asked 100 per cent funding for all the central sponsored schemes implemented by Union Ministry of Urban Development in the UT as recommended by Union Ministry of Finance.\n\nMr. Rangasamy also requested the Union Minister for early approval for signing agreement with French Development Agency (AFD) to take up drinking water and other infrastructure project by availing funding assistance from AFD.", 
    "section": "national", 
    "title": "Rangasamy wants Karaikal in AMRUT list", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}