{
    "author": [
        "K Lakshmi"
    ], 
    "text": "More coins will be supplied in nearby bank branches; hotel, trade associations and toll operators approached\n\nTo make coins available for various sectors in the city, the Reserve Bank of India, Chennai, has started reaching out to hotel associations, trade associations and toll plaza operators that have a great need for coins.\n\nAccording to sources in the RBI, the volume of coins being pumped in has increased over the past two years. Nearly 70 crore coins of various denominations, worth nearly Rs.195 crore, were disbursed in 2014-15 compared to 41 crore coins of various denominations, worth Rs.107 crore, during the previous year. “In this fiscal, we have already distributed coins worth nearly Rs.190 crore,” sources said.\n\nBesides remitting coins to various bank branches, the RBI is attempting to reach out to various sectors directly to reduce the shortage.\n\n“We are focussing on remitting more coins in bank branches at market areas, including Koyambedu, Purasawalkam and Parry’s Corner. More market area branches were identified last year and nearly Rs. 21 crore worth coins were provided to them between April and December,” officials said.\n\nMoreover, establishments such as hotels and toll plazas that need coins are being identified. Coins are supplied to various places through the nearest bank branches.\n\nThis fiscal, about Rs. 3 crore worth of coins have been provided so far. Hotels and traders are encouraged to exchange soiled notes of low denominations like Rs. 10 and Rs. 20 in banks to get coins.\n\nWith most counters in the RBI premises closed, the number of people visiting to exchange coins has dropped in the recent months.\n\nCoin pouches\n\nHowever, coin pouches are exchanged depending on the availability of staff members. “We want to create more venues where people can exchange currency notes for coins. Coin-vending machines are also being provided to various banks,” said an official.\n\nOf the 480 machines installed in various bank branches in the State, 182 machines are in Chennai.\n\nThe RBI has also increased the supply to camps in trade fairs and also coin exchange melas conducted by the banks as these reach the customers faster.\n\nCoins are supplied to various places like hotels and toll plazas through the nearest bank branches", 
    "section": "national", 
    "title": "RBI taps frequent users to plug coin crunch", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}