{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "Reserve Bank of India’s decision on Tuesday to keep the key policy rates unchanged has caused a wave of disappointment among the seekers of loans under different portfolios.\n\nWith little choice left for another cut in the lending rates before the end of this fiscal, the capital intensive industrial sectors like Tirupur knitwear cluster are now pinning their hopes on the new guidelines for setting up the minimum lending rates that was expected to come into force in April, for any reduction in interests on bank loans. During the monetary policy review on Tuesday, the RBI kept the Repurchase rates (the rate at which RBI lends to commercial banks) unchanged at 6.75 per cent itself and the cash reserve ratio at 4 per cent.\n\n“With the oil prices lower, inflation been controlled better and current account deficit a bit lower, the RBI could have reduced the Repurchase rates. Such reduction prior to the end of this fiscal could have prompted the banks to lower the interest rates at least a bit.\n\nKnitwear cluster here is badly in need of loans at lower costs to meet the expansion plans to increase the annual turnover from around Rs. 25,000 crore to Rs one lakh crore by 2020”, opined M. Velusamy, an apparel exporter and chairman of Confederation of Indian Industry (Tirupur district council).\n\nS. Dhananjayan, a senior member of Institute of Chartered Accountants of India, pointed out that cost of funds plays a pivotal role in keeping any industrial cluster vibrant and hence, the RBI, in consultation with commercial banks, should ensure reduction of interests on loans since the present rates were very high.\n\nPeople who look for constructing houses too sounded unhappy over the RBI decision to keep policy rates unchanged even under the prevailing conducive monetary climate.", 
    "section": "national", 
    "title": "RBI decision to keep policy rates unchanged irks loan seekers", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}