{
    "author": [
        "Staff Reporter"
    ], 
    "text": "To draw attention towards 21-point charter of demands\n\nVellore Taluk office wears a deserted look with minimal staff on Tuesday.- Photo: C. Venkatachalapathy\n\nMembers of the Tamil Nadu Revenue Officers Association (TNROA) are keeping away from work for two days to draw the attention of the State government towards their 21-point charter of demands.\n\nM. Gajendran, district president of TNROA, Vellore, said as many as 410 staff members of the Revenue Departrment, including office assistants, revenue inspectors, tahsildars and surveyors, took part in the strike that commenced on Tuesday.\n\n“We are demanding scrapping of the Contributory Pension Scheme (CPS), and implementing the old pension scheme.\n\nFrom 2003, employees and the government has been contributing 10 per cent each for the CPS, but those who have retired have not received any pension or benefits from the scheme,” he said.\n\nThe association has also demanded filling up of vacant posts in the Revenue department.\n\n7000 vacant posts\n\n“There are around 7,000 vacant posts in the department across the State. This includes all cadres such as office assistants up to tahsildars. In Vellore alone, there are 395 vacant posts,” Mr. Gajendran said.\n\nThey are also demanding issuing of Government Order for renaming the post of assistant to senior inspector and junior assistant to junior inspector.\n\n“The government had announced personal pay of Rs. 400 for office assistants but has not issued a GO to implement the same. This has been pending for four-and-a-half years,” he said.\n\nAs the revenue staff stayed away from work, taluk offices wore a deserted look with skeletal or nil staff.\n\nOffices paralysed at Tiruvannamalai\n\nOur Correspondent from Tiruvannamalai writes that Tamil Nadu Revenue Officers Association’s (TNROA) 48 hour strike call received overwhelming response from the officials in Tiruvannamalai District on the first day on Tuesday.\n\nR. Jothisankar, District President of TNROA said that out of 515 revenue officials in the district 450 have took part in the strike. He said that they had a 20-point demand and due to continued struggles of TNROA, government accepted and implemented only some of them.\n\nKey demands\n\nSeveral key ones were yet to be met are re designating junior assistants and assistants of revenue department as junior inspectors and senior inspectors respectively which would effectively do away with pay commission disparities.\n\nEven the Chief Minister has accepted the demand and made an announcement in the state assembly under rule-110.\n\nBut still the government was reluctant to implement it, Mr. Jothisankar said.", 
    "section": "national", 
    "title": "Revenue officials abstain from work", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}