{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Revenue officials staging a demonstration at Dindigul Collectorate on Tuesday pressing for a 15-point charter of demands; Taluk office in Ramanathapuram wears a deserted look.— PHOTOS: G. Karthikeyan and L. BALACHANDAR\n\nRevenue officials staging a demonstration at Dindigul Collectorate on Tuesday pressing for a 15-point charter of demands; Taluk office in Ramanathapuram wears a deserted look.— PHOTOS: G. Karthikeyan and L. BALACHANDAR\n\nRoutine work is paralysed and public are disappointed\n\nRoutine work was paralysed at the Collectorate here on Tuesday as more than 80 per cent of revenue department employees, mostly members of Tamil Nadu Revenue Officials’ Association, did not report for duty and took part in the State-wide stir.\n\nSince more than 400 staff at the Collectorate were absent, several sections wore a deserted look.\n\nHowever, officers managed to run the office with skeletal staff.\n\nIn Theni, regular work was partially disrupted as only 46 per cent of the staff took part in the strike, while the others reported for duty. Several sections in the Collectorate were functioning as usual with limited staff.\n\nThey revenue staff struck work pressing for their 15-point charter of demands which included salary for primary, graduate and postgraduate teachers on a par with the Central government staff, implementation of old pension scheme, scraping of new pension scheme and regularisation of pay for teachers who were appointed on contract basis.\n\nThey had blocked prime roads in Theni and Dindigul districts on Monday.\n\nRamanathapuram\n\nWork in Taluk offices and other revenue department offices were paralysed in the district as revenue staff launched a 48-hour strike on Tuesday, pressing a 19-point charter of demands.\n\nAs part of the State-wide strike, the entire revenue staff abstained from work as the Taluk offices across the district wore a deserted look. “All the 547 employees, including 138 women, right from Office Assistant to Tahsildar struck work and the strike was total,” claimed K. M. Thameem Raasa, secretary of the district unit of Tamil Nadu Revenue Officials Association told The Hindu .\n\nGeneral public, who visited the Taluk offices at various places to get certificates, seek details of welfare assistance and present petitions to redress their grievances returned disappointed, as per reports received here today.\n\nAs those employed in the election department also joined the stir, the two-day strike would hit the compilation of applications received for inclusion and deletion of names in the electoral list at the special camp held in the district on January 31, Mr. Raasa said.\n\nThe call for the strike, however, evoked poor response in Sivaganga district as only about 40 of the 418 employees joined the strike. An association office bearer attributed the differences between office bearers of the State and district bodies for the poor response.", 
    "section": "national", 
    "title": "Revenue staff strike work", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}