{
    "author": [
        "Legal Correspondent"
    ], 
    "text": "The Supreme Court on Tuesday gave the green signal to Gas Authority of India Limited (GAIL) to lay down natural gas pipelines cutting across seven districts of Tamil Nadu and dismissed the State government’s objections as merely “populist”.\n\nThe State government has been arguing that the pipelines affect the livelihood of about 5,500 small farmers. It has contended that “national interest” should not be at the cost of the lives and livelihood of large number of poor farmers. It suggested that pipes should be aligned along the national highways instead of near the homes and lands of farmers which would only render agricultural operations commercially unviable and leave the land virtually worthless.\n\n“We are not against farmers. But you can’t prevent the gas pipeline project which is in national interest. If you (State) have any problem you should have taken up the matter with the Centre, but you have no authority to direct GAIL to alter the alignment,” a Bench of Chief Justice of India T.S. Thakur and Justices A.K. Sikri and R. Banumathi said.\n\nUpholding the Madras High Court challenged by the State, the Bench observed that Tamil Nadu has no technical expertise or legal authority to ask GAIL to change its pipeline route.\n\nThe pipeline is to be laid between Kochi terminal, Kuttanad, Bengaluru and Mangaluru. About 300 km in Tamil Nadu is to pass through Coimbatore, Tirupur, Salem, Erode, Namakkal, Dharmapuri and Krishnagiri districts.\n\nGAIL’s counsel and senior advocate Dhruv Mehta said the pipeline has already been laid for 200 km at a cost of Rs. 685 crore.\n\nNoting that once land has been acquired under the law for a public project in national interest, it is understood to be vested with the government, as in this case, and not with the private owners concerned.\n\n“You supported farmers’ agitation against the project because votes are involved. You have gone by the sentiments of farmers,” the court told senior advocate Subramonium Prasad representing Tamil Nadu. It pointed out that only a handful has challenged the payment of compensation.\n\nSoftening its stand subsequently, the Bench directed the State to re-work the value of lands in the seven districts as on January 1, 2016 so that GAIL could pay 10 per cent of the value as compensation and an additional 30 per cent of the amount so determined.\n\n‘Tamil Nadu has no authority to direct GAIL to alter the alignment’", 
    "section": "national", 
    "title": "SC clears GAIL project", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}