{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Party entering electoral fray with trust in the people, says the PMK leader\n\nPattali Makkal Katchi (PMK) Chief Ministerial candidate Anbumani Ramadoss on Tuesday said that some parties had approached the PMK to join the alliance under its leadership.\n\nRefusing to divulge the names of the parties , Dr. Anbumani Ramadoss said his party was entering the electoral fray with confidence and trust in the people.\n\nThe PMK was ready to accept any party other than the DMK and the AIADMK under its leadership, he said.\n\nTaking pot shots at Desiya Murpokku Dravida Kazhagam leader Vijayakant, Mr. Ramadoss alleged that the DMDK leader did not have any ideology and had not met the people over the last four-and-half years.\n\nHe said the PMK had the backing of neutral voters, youth, and women.\n\nClaiming that the ruling AIADMK would face a crushing defeat in the upcoming polls like the one it faced in the 1996 elections, Mr. Ramadoss said the people had lost confidence in the DMK as well.\n\nDMK treasurer M.K. Stalin was copying the PMK on issues including Prohibition, creation of Lokayukta, and setting up of medical colleges in every district, he said.\n\nOn the appointment of new members for the Tamil Nadu Public Service Commission (TNPSC), he said it gave an impression that the Commission had virtually turned into an AIADMK body. The PMK would file a case on the matter, he said.\n\nProtest\n\nEarlier, leading an anti-liquor demonstration organised by the PMK women’s wing here, Mr. Ramadoss accused the DMK and the AIADMK of ruining the lives of several people by opening liquor shops.\n\nIf Kerala, Bihar, Gujarat, Mizoram, and Nagaland could implement total Prohibition, what prevents Tamil Nadu from implementing the same, he asked.\n\nThe quality of life of the people would significantly improve if they shunned the AIADMK and the DMK.\n\nThe people of the State who had given a chance for the DMK and the AIADMK for five decades were furious over the manner in which the two Dravidian parties ruled over the years, Mr. Ramadoss claimed.\n\nThere were different ways of mopping up revenue instead of remaining dependent on the revenue generated from TASMAC liquor outlets, he said.\n\nAppealing to the electorate to provide a chance to the PMK to govern the State, he said the party would first implement total Prohibition. The PMK would provide free education and create jobs if given a chance to rule the State, he said.", 
    "section": "national", 
    "title": "Some parties approached us for alliance: Anbumani", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}