{
    "author": [
        "Pon Vasanth Arunachalam"
    ], 
    "text": "“In this pattern of cultivation, crop gets maximum amount of nutrients”\n\nFor P. Prasanna (32), who has bagged Tamil Nadu Chief Minister’s Special Award this year for high yield of paddy by adopting System of Rice Intensification (SRI) technique, her interest towards farming never wanes though she is a busy woman juggling time between managing her family and being a teacher in a private school.\n\n“Born in an agricultural family, I was considered lucky by my parents. Right from childhood till my college, I was chosen to perform the rituals during the sowing and harvest times every season. So, my bonding with farming is deep-rooted,” Ms. Prasanna said.\n\n“During cultivation season, I spend a couple of hours in the early morning and all my weekends in the field,” she added.\n\nThe TRY 3 variety of rice, Ms. Prasanna cultivated in February 2015 gave 3,223 kilograms of rice, which converts to 16,115 kilograms per hectare, the highest yield in Tamil Nadu in the SRI during 2014-2015. The special award she received from Chief Minister Jayalalithaa included a cash price of Rs. 5 lakh and a medal.\n\nThough it was Ms. Prasanna’s husband M. Padmanabhan who mainly looks after agriculture in their family-owned lands, it was Prasanna’s keen interest that made them participate in the yearly contest for which the land should be enrolled in advance by paying a fee of Rs. 150.\n\n“All credit should go to her as she ensured that all the advice and guidelines by Agriculture Department officials were stringently followed,” said Mr. Padmanabhan. Ms. Prasanna said that though SRI cultivation involved tedious labour for the cultivators, the yield quality and consequently the income was much higher.\n\n“More importantly, only a bare minimum of chemical fertilizer was used,” she said, adding that even water requirement was much lesser.\n\nS. Kanagaraj, Joint Director (Agriculture), Madurai, pointed out that since the announcement of the award by the present government, this was the second time a farmer from Madurai had won.\n\n“There are many misconceptions about SRI cultivation among farmers, particularly about the yield, as they think that a lot of area gets wasted due to the spacing between the plants. But that is how the crop gets maximum amount of nutrients. Now, Prasanna’s success story can be used as an example for others,” he added.", 
    "section": "national", 
    "title": "SRI technique adopted by this teacher-farmer yields CM award", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}