{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“We need to encourage unique and imaginative ideas”\n\nIntellectual element in industrial activity has come to guide global enterprises as only innovation helps the power of branding, founder president, Native Lead, Madurai, Sivarajah Ramanathan told trade captains of the city here on Monday.\n\nSpeaking on “Start Up Business and Angel Investment” at the Thanjavur Chamber of Commerce and Industry, Mr. Sivarajah said that start ups and entrepreneurship were gaining currency in the global scenario in the recent years.\n\nWith projections claiming that the unemployment would hit a high by 2030 with up to 45 per cent educated persons going jobless then, it was only those youth germinating with start ups who could solve the tangle.\n\nThe Centre, both the Narendra Modi regime and the previous UPA dispensation, had imparted a definite thrust to the micro, small and medium enterprises sector over the past few years realising the importance of the industry segment.\n\nWith technology impacting all global activities, it had come to drive the industrial sector too where it had come to a stage when the successful new age enterprise could be defined as one that was knowledge-driven and intelligence-based.\n\nFor that, only innovation helped and more so was its power of branding.\n\nStating that big ideas power dreams and aspirations of the new age entrepreneurs, Mr. Sivarajah said that it was an age where ideas were evaluated and quantified them in monetary terms and added that every future business person must contend with that reality.\n\nMr. Sivarajah called upon the trade body members to create more intellectual property assets by innovatively conceiving an idea, converting that into a business model and capping that with a missionary zeal for managing a successful business module. “We need to encourage unique and imaginative ideas,” he added.\n\nChamber president S. Mohammed Rafi presided over the meet that was attended by a collective of trade and business leaders.\n\nChamber Joint Secretary S.P. Aruldoss introduced the chief guest Mr. Sivarajah.", 
    "section": "national", 
    "title": "‘Start-ups alone can solve unemployment problem’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}