{
    "author": [], 
    "text": "RELIGION\n\nSath Sangh, Kailasapuram : Radha kalyana mahotsavam, music programme on Srimad Ramayanam by students of Saraswathi Vidyalayam led by Rukmani Krishna and Krishna, BHEL Township, 7 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Srinivasa Perumal Sannidhi, Amma Mandapam Road, near Rajagopuram, Srirangam, 6 p.m.; Thirukurallappan Sannidhi, South Gate, Srirangam, 7 p.m.\n\nSri Rama Nama Sath Sangam : Sri Rama nama parayanam, 71,II Main Street, SMESC Colony, 6 p.m.\n\nGENERAL\n\nBishop Heber College : Inauguration of golden jubilee celebrations, Most Rev.G.Dyvasirvadam, moderator, Church of South India, chief guest, Rt.Rev.G.Paul Vasanthakumar, Bishop, CSI Tiruchi-Thanjavur Diocese, presides, 10 a.m.\n\nSeshasayee Institute of Technology : Leadership lecture series, S.Dorai Rajan, founder director, Kanzen Institute Asia Pacific Pvt.Ltd., speaks on Lean thinking for achieving excellence, 3.30 p.m.\n\nBharathidasan University School of Computer Science, Engineering and Applications : National seminar on Recent trends in computer science, V.M.Muthukumar, Vice Chancellor, inaugurates, Prafulla Agnihotri, Director, Indian Institute of Management, Tiruchi, chief guest, Khajamalai campus, 10.30 a.m.; Department of Environmental Management: National level workshop on ‘Ecopreneurship: Scope and Opportunities in Green Energy Technologies,’9.15 a.m.\n\nNational Institute of Technology Department of Instrumentation and Control Engineering : ACODS - international conference on Advances in control and optimisation of dynamical systems, 9 a.m.\n\nBharathidasan University Employees Welfare Association : Employees Day, V.M.Muthukumar, vice chancellor, chief guest, 10.30 a.m.\n\nShrimati Indira Gandhi College : Founder’s Day celebration, A.Kaliyamurthy, former superintendent of police, chief guest, K.Meena, former vice chancellor, Bharathidasan University, speaks, 11 a.m.\n\nLeo Club of AIMAN College of Arts and Science for Women : N.Vidhya, freelance trainer, speaks on Leadership, 1 p.m.\n\nIndian Welding Society : Annual general body meeting, Institution building, BHEL Township, 6.45 p.m.\n\nPonsiva Research and Innovation Trust and Innovation Incubator of Nehru Memorial College : Innovation trigger camp, college campus, Puthanampatti, 3.15 p.m.\n\nTamil Nadu Handicrafts Development Corporation : Crafts Bazzar, Kailasapuram Club, BHEL, 10 a.m. to 8 p.m.\n\nNorth Eastern Handicrafts and Handlooms Development Corporation : North East crafts bazaar, SRT Hall, Thillai Nagar, 10 a.m. to 9 p.m.\n\nMahatma Gandhi Centenary Vidyalaya : School day, S.M.Girirajkumar, Head, Department of ICE and EEE, Saranathan College of Engineering, chief guest, 5 p.m.\n\nBharathidasan University Department of Economics : Seminar on Mobile banking system and Indian economy, Khajamalai campus, 10 a.m.\n\nUrumu Dhanalakshmi College Department of Social Work : Awareness programme on exam fear, Police Colony, Anna Nagar, 11 a.m.\n\nM.A.M.College of Engineering : MATLAB workshop for electrical engineers, 9.30 a.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}