{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Welcoming the Supreme Court’s order that vacated the interim order of the Madras High Court staying the issue of title deed under the Forest Rights Act, 2006 (FRA), Tribal Peoples’ Council demanded that the State implement the Act without further delay.\n\nThe Scheduled Tribes and Other Traditional Forest Dwellers (Recognition of Forest Rights), Act, 2006 was implemented across the country, except Tamil Nadu.\n\nThe Madras High Court in its interim order dated April 30, 2008 directed that no patta be issued under the Act without the court permission. The Ministry of Tribal Affairs filed a petition in the apex court and the three- judge bench on Monday said there is no need for an order to restrict its operation in only one State.\n\nWelcoming the order, council’s chairman K.A. Gunasekaran said that for the past nine years tribals were denied to their legitimate rights without any fault of them. “Now, at last, all the impediments towards the implementation of this Act are over, there may not be any excuse at the part of the administration.\n\nHowever, he said that lot is to be done before implementing the same.\n\nThe age-old monitoring committee under the chairperson of the Chief Secretary, which had been constituted in a haphazard manner, is to be rejuvenated for its speedy implementation, the District level FRA committee under the chairperson of the District Collector is to be constituted and a sub divisional committee with Revenue Divisional Officer as its chairperson to be constituted.\n\nMr. Gunasekaran said that after forming these three committees, FRA committee at the hamlet level need to be formed with maximum of 15 members of which one-third should be women. “The claim of the beneficiaries should be scrutinised and recommended by the grama sabha to the sub-divisional committee”, he added. “Forest officials should co-operate with Revenue and Tribal Welfare Department officials for the speedy implementation of the FRA”, he added.", 
    "section": "national", 
    "title": "Tribal council welcomes apex court order on Forest Rights Act", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}