{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The district police have arrested five persons, including two Sri Lankan Tamils, on a charge of drug trafficking, and launched a hunt for two others, who were the accomplices of the Lankan Tamils, engaged in drug trafficking and gold smuggling.\n\nA special team, led by K. Maheswari, Deputy Superintendent of Police, Kilakarai, arrested the accused on Monday under Sections 24 and 29 of the Narcotic Drugs and Psychotropic Substances (NDPS) Act, and seized from them 20 kg of ganja.\n\nThey were produced before the Judicial Magistrate Court here on Monday evening, and remanded in judicial custody.\n\nWhile the Lankan Tamils – S. Lamudhin (40) and A. Mohamed Jasmine, both natives of Talaimannar – were taken to Chennai to be lodged in Puzhal Central Prison, the three local Tamils were lodged in the district jail here, the DSP said.\n\nThe locals – M. Nawaz Khan, R. Murugan and Gopal –acted as agents of the Lankan Tamils, whose modus operandi was to despatch gold through sea route from Talaimannar and arrive here on tourist visas to dispose of the gold with the help of the local accused, Ms. Maheswari said.\n\nWhile returning, the Lankan Tamils would arrange for sending a consignment of ganja through sea route and received it in Talaimannar after reaching there, she said.\n\nThey had arrived here a fortnight ago after allegedly despatching two kg of gold through the sea route but the police could not recover the contraband.\n\nThe police said that Lamudhin arrived here on January 15 and Jasmine on January 25 on tourist visas with a clear plan to return after collecting the money for the smuggled gold and despatching an unspecified quantity of ganja via the sea route.\n\nThe police also seized a car used by the accused for the illegal activity.", 
    "section": "national", 
    "title": "Two Lankan Tamils among five held for drug trafficking", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}