{
    "author": [
        "Aditi Iyer"
    ], 
    "text": "To encourage more students to apply to universities in the United Kingdom, the government there has launched scholarships worth £ 400 million.\n\nThis is one of the announcements made at British Council Chennai office on Tuesday, as part of their ‘Great Britain’ campaign.\n\nAbout 291 scholarships covering a variety of subjects and spread across 45 institutions in England, Scotland, Wales and Northern Ireland were available this year.\n\nThe Council will also be holding an ‘Education UK’ exhibition on February 6 at Taj Coromandel, where representatives from 64 universities would be participating.\n\n“With a reputation for leading international research, innovation and creativity, U.K. universities attract some of the world’s leading academics and industry professionals. There are over 490,000 foreign students from 200 countries studying there. Over 1,50,000 of them are Indians. I hope students and parents will use the one-day exhibition to meet the U.K. universities and find out more about the opportunities which are suited to them,” said Mei Kwei Barker, director South India, British Council India.\n\nOver the past few years, the officials have identified over 90 colleges in the United Kingdom that are allegedly functioning illegally.\n\nTo avoid students from making wrong choices, they have listed out only accredited institutions on their website.\n\n“Not only this, we are also holding weekly career briefing sessions to encourage prospective students to be vigilant and independent. In the past, we have come across cases where many fell victims to bogus agents and colleges. The fair will also have a session addressing this issue. We hope people make best use of it,” said Sonu Hemanii, senior manager education UK, South India.\n\nThe fair will also be held in Bangalore, Coimbatore, Hyderabad, Pune and Kochi in the coming months.", 
    "section": "national", 
    "title": "UK launches scholarships worth £ 400 million", 
    "subsection": "tamilnadu", 
    "date": "2016-02-03"
}