{
    "author": [
        "Special Correspondent"
    ], 
    "text": "An educationist and space scientist joined hands to create a ‘Students Science Forum’ to promote creativity and innovation among the students of this educationally backward district and realise the dreams of former President A.P.J. Abdul Kalam.\n\nThe forum to be formally launched on January 30 would focus on what science stood for and what direction science and technology had to take for realising sustainable progress, S. Ingersol, senior scientist, ISRO Propulsion Complex, and M.S. Vasan, correspondent, Vasan Matriculation School, said.\n\nThe school mates, who met recently, came out with the idea of launching the forum to identify hidden talents among rural students and provide right guidance to the students who had creative and innovative ideas in science and technology, they told The Hindu here on Sunday.\n\nTechnology was not in tune with nature now, Mr. Ingersol said, adding the by-products of technology – whether electronic goods, consumer items or food items – went in waste. The forum would guide the students on how science could be used for sustainable development, he said.\n\nThe forum would also help the students convert their innovative ideas into marketable products and secure patents for them. Topics on benefits of science and technology developments for the human kind, harnessing solar energy, sustainable agriculture, land and water resource management and impact of science and technology developments on natural resources would be discussed in the forum, they said.\n\n“We have identified a list of modules to be taught to the students and make the forum a hub for innovation,” Mr. Ingersol said.\n\nEvery year, about 200 interested students from classes VI to IX from across the district would be selected and trained in the forum free of cost. The forum would start functioning in June and the classes would be held for three hours on Sundays, he said.\n\nThe forum would be guided by a panel of advisors, senior scientists, technologists, educationists and social scientists, he added.", 
    "section": "national", 
    "title": "A forum for students to promote creativity, innovation", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}