{
    "author": [
        "Nahla Nainar"
    ], 
    "text": "Around 20 public speaking enthusiasts gathered for an evening of prepared and impromptu oratory at the 53rd meeting of the Tiruchi Toastmasters Club organised recently by the community body on the Thillainagar premises of Tiruchi Plus.\n\nIn view of the upcoming Republic Day (January 26), the theme, introduced by Toastmaster of the Day Nirmala, was “Patriotism – Should Boundaries Dictate the Expanses and Relevance of Patriotism?”\n\nThe session began with speeches based on 10 projects based on Toastmasters International guidelines, and concluded with “Table Topics” – where guests and participants spoke extempore (1 to 2 minutes) on random themes.\n\nAmong those who presented prepared speeches (with a time limit of 5 to 7 minutes) were Arul, Aarthi, Sukanya, Subhash, Anuradha, and Kishore. Of these, Aarthi’s talk on memories and Kishore’s speech on lessons from life engaged the audience’s attention for the clear communication of their ideas. Subhash’s speech on the Siachen Glacier was thought-provoking.\n\nSukanya’s realistic enactment of cooking her favourite recipe earned much applause while Anuradha’s visually-aided speech on natural disasters was declared to be informative.\n\nAll speakers were encouraged to make ample use of the word of the day “astounding”.\n\nClub president Sasi led the proceedings. The general evaluator for the evening was Toastmaster Rathnakumar, assisted by a timer, ‘ah’ counter, and grammarian (TAG) team of Toastmasters Bathool, Leo, and Sherin respectively.\n\nTiruchi Toastmasters Club is affiliated to Toastmasters International, based in California, U.S. Besides this, a chartered (officially recognised by the parent organisation) club is functioning at Bharathidasan Institute of Management (BIM) and two more are to be launched shortly at National Institute of Technology, Tiruchi, and M.A.M. College of Engineering and Technology.\n\nThere are more than 3,32,000 members of Toastmasters in 15,400 clubs across 135 countries.", 
    "section": "national", 
    "title": "An ‘astounding’ evening", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}