{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Child Protection Committee meetings should be convened in all the 95 village panchayats and 55 town panchayats in the district on January 27, said Collector Sajjansingh R. Chavan on Sunday.\n\nIn a press release issued here, the Collector said that the meetings should be convened at 11 a.m. on January 27. The meetings should be presided over by a committee of 10 representatives. The respective local body heads were the chairpersons, and the VAOs the secretaries of the committees.\n\nEach committee would have as it members school headmasters, two children suggested by them, an employee from the District Child Protection Committee, a member from a women self-help group, police officials and a Village Health Nurse (VHN).\n\nDiscussion on various subjects should be held at the meetings and resolutions should be adopted for checking child marriages, sexual assaults on minors, ending child trafficking, ensuring safety of every child lodged in the children’s homes, etc, the release said.\n\nMissing children\n\nAnother press release said Union Ministry of Women and Child Development had launched a web platform for the people to directly report, track and upload information on missing children. A comprehensive child protection scheme had been drafted for the welfare of the children. District Child Protection units under the leadership of the respective Collectors had been created for its implementation.\n\nThe portal, www.khoyapaya.gov.in, would serve as a platform for people to not only report missing of children but also track the efforts taken for retrieving them.\n\nFor more details the District Child Protection Officer, District Child Protection Unit, 1-4 Avvai Shanmugam Salai, Ozhiginasery, Nagercoil, could be contacted in person or through phone – 04652 272280.", 
    "section": "national", 
    "title": "Child Protection Committee meetings to be held on Jan. 27", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}