{
    "author": [
        "K Manikandan"
    ], 
    "text": "The passenger reservation centre was built near southern end of suburban platform four years ago\n\nThe delay in taking a decision to construct a compound wall has resulted in the building remaining locked—Photo: B. Jothi Ramalingam\n\nFour years after Southern Railway spent precious amount of tax-payers’ money for constructing a computerised passenger reservation centre at Chennai Beach station, the building continues to remain locked.\n\n“It has not functioned even for a day,” said a police constable at the traffic signal on Rajaji Salai. The passenger reservation centre has been built near the southern end of the suburban platform.\n\nThe building has 10 counters and a rest room for staff and had furniture.\n\nHowever, what the building lacked was a protective compound wall around it. As it was possible for everyone entering the reservation centre to walk across the suburban railway lines, constructing a compound wall was mandatory, but it was never done, traders said.\n\n“The building could not have been commissioned unless a compound wall was constructed around it. The delay in taking a decision to construct the wall has resulted in the building slipping into disuse,” said Mohammed Gani, a trader at Burma Bazaar.\n\nThe decision to construct a new spacious passenger reservation centre was to decongest the existing one at the concourse of the Beach terminal, where over 1,000 tickets are booked every day.\n\nWith the new building yet to be commissioned, people continue to book tickets for long-distance trains at the existing centre.\n\n‘Put it for better use’\n\n“With advancements in technology and ticket-booking made easy, the new centre might not serve the purpose any longer, but they can at least as Southern Railway has spent a huge sum to build it,” Mr. Gani said.\n\nSouthern Railway sources said a decision on better use of the abandoned building will hopefully be made soon.", 
    "section": "national", 
    "title": "Counter at Beach station in disuse", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}