{
    "author": [
        "Dennis S"
    ], 
    "text": "Talk of red tape and the recent death of a freedom fighter, waiting for grant of the Swatanthra Sainik Samman Pension Scheme (freedom fighter’s pension) for more than 30 years, would stand out as a classic example.\n\nR. Murugamalai was lodged in various jails for more than five years during the freedom struggle.\n\nWhen he first applied for pension in 1981 to the Home Ministry, it was rejected for want of documentary evidence.\n\nHe applied again in 1986 with certificates from two freedom fighters to prove that he served more than five years in various jails.\n\nHis application was rejected again, since the name of one of the two freedom fighters was not uniform in the certificate and in pro forma.\n\nAfter waiting for 23 years, the 93-year-old man moved the High Court in 2009 and won the case.\n\nThere were two long rounds of litigation in the High Court and the Supreme Court – both favouring the petitioner, but still there was no sign of him being granted the pension.\n\nMeanwhile, the Ministry sought clarification from the State government on the apparent discrepancy in the name as shown in the annexure and the certificate issued by S. Gangadhara Parasuram.\n\nArmed with an order passed in November 2014, which cited proceedings of the Principal Accountant General, favouring the Ministry, a review application was filed in the High Court, which is presently pending.\n\nThe freedom fighter died of old age while the litigation was pending and his 85-year old wife was impleaded in the case.\n\nHearing arguments from both sides, Justice M.M. Sundresh frowned upon the fact the petitioner was made to run from pillar to post.\n\n“It is unfortunate that though a National Litigation Policy has been promulgated, vexatious litigation like this are sought to be prolonged at the instance of the Government. Eighty per cent of the litigation in this country involves the government, both at the State and Central level. Probably, this can be a classical example,” he said.", 
    "section": "national", 
    "title": "Court frowns as freedom fighter dies battling for pension", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}