{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“All sub-systems of the engine performed well in a test”\n\nThe high-thrust cryogenic engine (CE20), which was successfully test fired at the ISRO Propulsion Complex (IPRC), Mahendragiri, for launching three-tonne class payloads, would be used on GSLV Mk-III flight by the end of this year, a senior IPRC scientist has said.\n\nA long duration hot test has proved that all sub-systems of the engine performed well and after completing a series of development tests on this indigenously developed engine, it would be ready for flight by the end of this year, the scientist told The Hindu here on Sunday.\n\nPreferring anonymity, he said the engine would be subjected to further confirmatory tests before it is tested and used to power the cryogenic stage of GSLV Mk-III launch vehicle.\n\nThough the engine was designed to carry three-tonne class satellites, the payload weight would be restricted to less than three tonnes in the initial developmental flight, he said.\n\nSelf-reliance\n\nIndia still relied on the European Space Agency (ESA) for launching its four-tonne class satellites, he said. The country could become self-reliant once the semi-cryogenic engine is developed, he said. IPRC has started the assembly, integration and testing facilities and is set to achieve a milestone in the next three years, he said.\n\nThe semi-cryogenic engine, using kerosene as fuel and liquid oxygen as oxidiser, is currently being designed and developed. The refined and purified kerosene to be used as fuel has been named as ‘isrosene’, the scientist said.\n\nOne dollar per one kg\n\nPointing out that India paid roughly about one dollar (US) for launching one kg weight of payload at the ESA, he said “we can considerably reduce the launch expenses after developing the semi-cryogenic engine.”\n\nThe IPRC was also into the development of airbreathing engines, he said adding “it’s a different technology altogether and initial tests are being conducted.”\n\nThe experimental flight would most probably be conducted this year, he said.\n\nA long duration\n\nhot test proves\n\nthat sub-systems\n\nof the engine performed well", 
    "section": "national", 
    "title": "Cryogenic engine may be used for GSLV Mk-III by year-end", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}