{
    "author": [], 
    "text": "(Clockwise from top left) Cultural festival at St. Joseph’s College in Tiruchi. — Photo: M. Srinath; the victorious Bishop Heber College women’s football team with the trophy in Tiruchi.— Photo: A. Muralitharan; seminar on ‘Nature in Tamil Christian Literature’ at Holy Cross College; C. Thiruchelvam, Registrar, Bharathidasan University, with the smart journal awardees; the annual convention of Association of Pharmacy Professionals in Tiruchi.\n\n(Clockwise from top left) Cultural festival at St. Joseph’s College in Tiruchi. — Photo: M. Srinath; the victorious Bishop Heber College women’s football team with the trophy in Tiruchi.— Photo: A. Muralitharan; seminar on ‘Nature in Tamil Christian Literature’ at Holy Cross College; C. Thiruchelvam, Registrar, Bharathidasan University, with the smart journal awardees; the annual convention of Association of Pharmacy Professionals in Tiruchi.\n\nJoseph Institute of Management and Department of Information Technology emerged winners of the shift I and shift II categories of INDEP’16, an inter-departmental cultural extravaganza of St. Joseph’s College. Literary events, dance, drawing, theatre, and music competitions were conducted as part of the event. Jothimani Ilangovan, Assistant Director/ Programme Head, All India Radio, Tiruchi, inaugurated INDEP’16. Ilavarasu, actor, was the chief guest for the valediction.\n\nFootball\n\ntournament\n\nBishop Heber College won the women’s title in the Bharathidasan University inter-collegiate football tournament. D. Paul Dhayabaran, Principal, and L.C. John, head, department of physical education, felicitated the students and the coach, G. Thambiraj.\n\nAwards given for lifetime achievement\n\nK. Narayanan, Indian Institute of Technology, Mumbai, has been awarded Smart Journal Distinguished Lifetime Achievement. The award was conferred on him by the SMART Journal of Business Management Studies and the Department of Commerce and Financial Studies of Bharathidasan University at a function held recently. Similarly, Geetha Subramaniam, Universiti Teknologi MARA, Malaysia and V.Sujatha, Principal, Cauvery College for Women, Tiruchi, received Smart Journal Distinguished Lifetime Achievement for their contribution in the field of commerce and management. Tulsi Jayakumar, SP Jain Institute of Management and Research, Mumbai, whose research paper was published in the SMART Journal in 2015 was honoured with SMART Journal Best Paper Award. SankaranVenkateswar, Saint Mary’s College of California, USA, S. Sekar, Syndicate Member, M.Selvam, Seminar Director and Chief Editor of SMART Journal of Business Management Studies spoke. Earlier, C. Thiruchelvam, Registrar, Bharathidasan University, inaugurated the international seminar on “Financial Markets: Issues and Challenges.\n\nMeet of pharmacy professionals\n\nPersonalised medicine would be future trend in the field of medicine, observed Oommen V. Oommen, secretary, Society for Translational Cancer Research, and Chairman, Kerala State Biodiversity Board, at the annual international convention of Association of Pharmacy Professionals organised by the Department of Pharmaceutical Technology and Centre for Excellence in Nanobio Translational Research, Bharathidasan Institute of Technology, in association with European Society for Translational Medicine and Austrian Society for Translational Medicine as scientific partners.\n\nHe delivered a lecture on ‘Biodiversity for cancer prevention.’ Ulrich Pfeffer, National Cancer Research Institute, Genoa, Italy, inaugurated the convention and released a book of abstracts published in a special issue of the journal New Horizons in Translational Medicine. Mr.Pfeffer delivered a plenary lecture on ‘From genetics to targeted prevention of cancer.’ K. Ruckmani, Professor and Head, Department of Pharmaceutical Technology, and Director, Centre for Excellence in Nanobio Translational Research, T. Senthil Kumar, Dean, Bharathidasan Institute of Technology, Suresh Chenupati, Executive Member and President, Association of Pharmacy Professionals, were present.\n\nThe annual awards of the Association of Pharmacy Professionals were presented by Mr. Oommen and Mr. Chenupati to the following persons in recognition of their services: R. Manavalan (Eminent Teacher), S.K. Kulkarni (Eminent Pharmacist), Ulrich Pfeffer (Outstanding Researcher), K. Ruckmani (Distinguished Scientist), T. Senthil Kumar ( Appreciation Award), and P. Sureshkumar (APP Young Talent Award).\n\nNature in Tamil Christian Literature\n\nResearch scholars from various colleges participated in a national seminar on ‘Nature in Tamil Christian Literature,’ organised by the PG and Research Department of Tamil, Holy Cross College and Centre for Research. Sr. Jeusin Francis, Principal, presided. N. Ilango, Head, Department of Tamil, Tagore Arts College, Puducherry, and Saibu Marikayar spoke. A book on ‘Nature in Tamil Christian Literature’ was released by Sr. Lilly, Secretary, Holy Cross College, and the first copy of the book was received by C. Manivalan, founder and director, Centre for Christian Literature, St. Joseph’s College.\n\nTraining for job aspirants\n\nTraining for post graduates appearing for TNPSC Group II examination was organised by the Youth Forum Study Circle of Seethalakshmi Ramaswami College with the support of Pace Academy. Around 120 post graduate candidates participated. The event was inaugurated by the Joint Commissioner of Income Tax, V. Nandakumar. He urged students to aspire high and work with dedication. P. Panneer Selvam, CEO, Pace Academy, and M. Jayanthi, Principal of the college, spoke.\n\nNSS camps\n\nNSS units of Cauvery College for Women conducted special camps in Palagaveri, Palayur Medu, Kaamanayagam Palayam, Solavanthan Thoopu and Devasthanam villages. Speaking at the inauguration of the camp held at Pettavaithalai, R. Murugan, president of the college, urged the students to be more sensitive to the needs of the villagers. V. Sujatha, Principal, K. Govindharaju, Director, SEVAI, and P. Selvam, chairman of the village, spoke. NSS Programme Officers A.R. Gomathi, A. Sahaya Jenitha, M. Neela, N. Sathammai Priya and Rita Shanthakumar took part in the camp.\n\nProgramme on cervical cancer\n\nMount Zion College of Nursing, Pudukottai, conducted an awareness programme on cervical cancer under the auspices of Maharani Rotary Club, Pudukottai. Poster and slogan writing competition were conducted for the students.\n\nJayabarathan Chelliah, chairman, Mount Zion Educational Institutions, presided. Parimala Devi, Dean and Special Officer, Government Medical College, Pudukottai, and V.C. Subash Gandhi, research scholar, Tamil Nadu Health Systems Project, spoke. Florence Jayabarathan, vice-chairperson, Mount Zion Educational Institutions, Jayson K. Jayabarathan, Director of the College, Jasmine Sheela, Principal, and Rajalakshmi, president, Maharani Rotary Club, were present.\n\nContributed by C. Jaisankar and G. Prasad", 
    "section": "national", 
    "title": "Cultural extravaganza", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}