{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "Come election time and there is no dearth of pollsters releasing the findings of their respective opinion polls much before actual campaigning starts at the ground level. Naturally, these opinion polls receive bouquets and brickbats.\n\nIn the absence of proper disclosure about the methodology adopted for the survey, its source of funding and attendant factors, political parties themselves have questioned the release of opinion poll findings.\n\nFormer Union Shipping Minister G.K. Vasan on Saturday, in fact, alleged that a survey undertaken by an independent pollster was done to create confusion in the minds of voters. He questioned the sample size of the survey and said it was grossly inadequate to reflect the opinion of an entire State.\n\nSuch allegations lead to the question of what the pollsters should disclose while publishing results to protect credibility. In the West, the debate on the effectiveness of available statistical tools to predict election outcome came under sharp focus after almost all major surveys failed miserably during the recent British elections. Some commentators suggested that peer review of both the sample collection and interpretation should be made compulsory.\n\nRajeeva Karandikar, an acclaimed psephologist and Director of the Chennai Mathematical Institute, says while peer review might be an ideal tool academically, constraints of time and resources may not make it a feasible option in the Indian context. “What we should ensure is an independent post facto review of the poll,” he adds.\n\nMr. Karandikar says transparency in the process of conducting the opinion polls was an essential element to protect its credibility. In this, the first and foremost disclosure should be that of the funding. “A survey by a good organisation with a sample size of say 5,000 would cost anywhere between Rs. 8 lakh and Rs. 10 lakh. It is absolutely essential to disclose the funding of the opinion poll to rule out the accusation of bias,” he feels. Further, past records of the agency should be available for reference to the reader.\n\nOn Saturday after an independent group, People Studies, released the results of a survey it had conducted for the forthcoming Assembly elections, social media was abuzz with posts as to how the narrow gap between the DMK and the AIADMK of just 0.2 percentage points in terms of voter support was counter-intuitive.\n\nExcept for the 2009 Lok Sabha elections, the AIADMK has maintained a minimum lead of six per cent over the DMK in all polls since 2006, as seen from its vote share excluding that of the allies.\n\nVenkatesh Athreya, economist and psephologist, says credible and scientific explanations have to back claims. “There should have been a detailed explanation (by People Studies) on the factors that have pushed the DMK so close to the AIADMK. Otherwise, such counter-intuitive data could only be presumed erroneous,” he feels.\n\nAlso, the chances of the AIADMK and the DMK improving their vote share between now and the date of polling looks slim as formations such as the People’s Welfare Front has firmed up.\n\nMr. Athreya says neither the big corporate agencies nor small NGOs which conduct these opinion polls put all material in the public domain. “The sampling methodology, the interviewing techniques, the situation the interviewee was when the survey was conducted and the methodology of interpretation — all these affect the outcome. For a credible opinion poll, material pertaining to all these aspects should be available for public scrutiny,” he says.\n\n‘Disclose the funding of the opinion poll\n\nto rule out accusation of bias’", 
    "section": "national", 
    "title": "Disclosures must to make opinion polls credible", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}