{
    "author": [
        "R Krishnamoorthy"
    ], 
    "text": "An elephant calf that fell into a pond at Kaadu Basavanamaalam village in Hasanur division of STR in Erode on Saturday. (Right) The rescued calf with its mother.— Photos: SPECIAL ARRNGEMENT\n\nAn elephant calf that had fallen into a pond in a land adjoining the reserve forest in Kottamalam beat of Hasanur division in Sathyamangalam Tiger Reserve was rescued “without human touch” and reunited with its mother by a forest team assisted by a group of locals on Saturday.\n\nThe male calf, aged about one year, had fallen into the pond in an agricultural land in Kaadu Basavanamaalam village where a herd had come to drink water.\n\nWhile the other adult elephants had left gradually one after the other, the mother elephant had stayed put and kept a watch on its calf, according to locals who were witness.\n\nOn noticing the calf struggling to come out, the locals alerted the forest staff of Germalam Range. A team led by forest guard Boopathi and assisted by anti-poaching team had initially broken the bund to make a slope and subsequently shoved the elephant calf softly from behind using stilts.\n\nThere have been numerous instances in the past when elephant calves that had been rescued in similar circumstances were rejected by the herd, due to what is being inferred as the physical touch of humans.\n\nThe personnel who were involved in the rescue operation had the presence of mind to smear themselves with mud and slurry before getting close to the calf, District Forest Officer of Sathyamangalam Division K. Rajkumar said.\n\nThe locals meanwhile kept a watch on the mother elephant that had to be chased when found approaching the pond menacingly while the rescue operation was in progress.\n\nTo the relief of the forest department team and locals, the calf, once rescued, had a tender reunion with its waiting mother and taken back into the forest.", 
    "section": "national", 
    "title": "Elephant calf rescued from pond", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}