{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Role of credit support for improving agriculture economy stressed\n\nFarmers at the agri exhibition held at Krishi Vigyan Kendra at Sandhiyur in Salem district on Saturday. —Photo: Special Arrangement\n\nTo showcase the rabi season agriculture and horticulture related technologies and pulses production strategies for the benefit of the farmers and stakeholders, an exhibition and seminar was conducted at Krishi Vigyan Kendra at Sandhiyur here on Saturday.\n\nThe pre-rabi campaign-cum-seminar on Agriculture and Horticulture Technologies for the district was attended by progressive farmers, farmers’ club leaders and agriculture entrepreneurs where farm implements and other products were on display.\n\nN. Sriram, Programme Coordinator, explained the importance of the campaign for improving production and thereby increasing the income level of farmers in the season. He said that the United Nations has declared 2016 year as International Year of Pulses mainly to improve the production and productivity of the pulses crops and to ensure nutrient security among the people through pulses based food.\n\nC. Rajendran, Joint Director of Agriculture (in-charge), emphasised the need and approaches for improving the pulses crops production so that the productivity is doubled and income level of the farmers gets increased.\n\nDeputy Director of Agricultural Marketing, Salem, Sugumar said that converting the group into farmers’ producers’ organisation for bringing in more value addition of products would benefit all.\n\nNABARD District Development Manager Bhama Bhuvaneswari emphasised the importance of farmers’ clubs and farmers’ producers organisations for improving the agriculture production, productivity and income of the rural farming community. “Farmers should have the professional skills, especially for planning and adoption of hi-tech agricultural technologies for improving the income,” she said.\n\nA. Udayakumar, Lead Bank Manager, Salem, explained the role of credit support for improving the agriculture economy and farmers’ income and asked them to develop proper agri business plan.\n\nDemonstrations on various farm implements, pest and diseases management practices, mango crop technologies, sustainable sugarcane initiatives and practices exclusively for rabi season were presented by the KVK scientists. More than 260 farmers from all the 20 blocks of the district participated.", 
    "section": "national", 
    "title": "Farmers asked to improve pulses production", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}