{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Asks companies to contribute from their CSR funds\n\n: Coimbatore Corporation on Friday met corporate companies for financial support to aid the construction of individual household toilets under the Swachh Bharat Mission.\n\nCommissioner K. Vijayakarthikeyan said that with the Rs. 8,000 support from the Central and State governments and the civic body, the beneficiaries will not be table to take up toilet construction.\n\nCSR funds\n\nTo make good the shortfall, corporate companies were asked to spend their corporate social responsibility (CSR) funds.\n\nAfter a slide show on the Swachh Bharat Mission, Dr. Vijayakarthikeyan said that the objective was to stop open defecation, put an end of manual scavenging and encourage people to use toilets.\n\nThe Corporation has so far received 6,056 applications from the city’s residents. Of those it had decided to aid construction of 2,266 toilets this year.\n\nDr. Karthikeyan and Swachh Bharat Mission coordinators Thirumal and Paramasivam said that the Corporation had created a separate escrow account to which the corporate companies could send the money.\n\nThe civic body would provide them the list of beneficiaries to bring about transparency.\n\nIf the companies were willing to engage contractors to directly take up construction, they could do so after proper agreement with the Corporation. Or they could transfer money and see the progress of work.\n\nThe company representatives wanted to know if the Corporation had arrived at the cost of toilet construction.\n\nA construction company representative who was present at the meeting said that a rough estimate suggested that the cost worked out to Rs. 29,000 if the toilet and septic tank had to be built.\n\nIf the toilet were to be linked to the Corporation’s underground sewer line, the construction would cost Rs. 23,000.\n\nThe company representatives and Corporation decided to fix the cost of construction at a little over Rs. 20,000. The former said that they would come back with how they were willing to support and how much they were willing to spend in a few days.\n\nThe Corporation then met Swachh Bharat Mission ambassadors to discuss how to conduct awareness programme for the people on use of toilets, handing solid waste and improving hygiene in their neighbourhood.\n\nAction plan\n\nSources said that the ambassadors had agreed to present a 100-day action plan to the Corporation in the next few days.", 
    "section": "national", 
    "title": "Financial help sought to construct toilets", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}