{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Agence Francaise de Developpement signs agreements to help Chandigarh and Nagpur also\n\nAs Prime Minister Narendra Modi and visiting French President Francois Hollande look on, Chief Secretary Manoj Parida and Pascal Pacaut, Director for Asia Development, AFD, sign the MoU on developing Puducherry as smart city, at Chandigarh on Sunday. Photo: Special Arrangement\n\nFrance on Sunday formalised an agreement to provide technical and financial assistance for developing Puducherry, the erstwhile French protectorate, as a smart city.\n\nAgence Francaise de Developpement (AFD), the French bilateral development finance agency, has inked agreements to develop Puducherry, along with Chandigarh and Nagpur as smart cities.\n\nAgreements formalised\n\nThe draft agreements signed between representatives of AFD and the three cities were formalised in the presence of visiting French President Francois Hollande and Prime Minister Narendra Modi in Chandigarh on Sunday.\n\n“The AFD agreement is independent of, but not completely unrelated to, the Smart City Mission of the Government of India for which Oulgaret Municipality is a contender,” said Manoj Parida, Chief Secretary, who was in Chandigarh to sign the draft deal with AFD representatives.\n\nOffshoot of agreement\n\nThe deal is an offshoot of the Indo-French bilateral cooperation agreement on sustainable urban development firmed up on October 5, 2012 and also the understanding reached during Mr. Modi’s visit to France in April, 2015 that French authorities would concentrate on Puducherry, Nagpur and Chandigarh.\n\nWhat the AFD pact does is to provide Puducherry a fall back cushion to realise its smart city aspirations even should Oulgaret Municipality which is currently competing among other shortlisted cities for inclusion in the Smart City Mission miss the bus.\n\nFrench pool of experts\n\nUnder the MoU for a period of three years, the technical cooperation programme will make available to the Puducherry a pool of French experts from the public sector (French municipalities, local public companies, agencies for urban planning), complemented by experts from private sector.\n\nThe experts would be culled from domains relating to aspects of sustainable urban development such as integrated development and urban planning, urban transport, water and waste management, architecture and heritage, renewable energy and energy efficiency.\n\n“In a larger context, the pool of experts could rotate like a roster between the three Indian cities to which French technical assistance will be provided,” the agreement states.\n\nIn fact, the AFD agreement envisages the scenarios of Puducherry (Oulgaret Municipality) being selected for the Smart City Mission and being left out.\n\nTechnical support\n\nIn a scenario of the city making it to the Centre’s list, technical support would be provided by the AFD to implement the smart city proposal.\n\nThis would essentially focus on areas such as strengthening the strategy and management of urban services, covering integrated development and urban planning, urban transport, water supply, sanitation, waste management, architecture and heritage, renewable energy and energy efficiency.\n\nThe AFD will help project management to oversee the detailed project reports and feasibility studies, assist in creation and structuring of the Special Purpose Vehicles to build strategic management and capacity building for financial management.\n\nIn a scenario where Puducherry fails to qualify, technical support would be provided to restructure the Smart City Proposal based on the Central Government’s assessment of the submission.\n\nMeetings envisaged to redefine priority\n\nThe agreement also envisages meetings to redefine priorities, exchange visits by delegations of decision-makers on the smart city theme and collaboration between academic and research institutions and exchange of technical know-how.\n\nThe AFD has committed to provide 2 billion euros of loan over the next three years to support smart cities and sustainable development.\n\nIt also agreed to bear the costs of posting French experts in India whereas the Government of Puducherry is expected to provide resources in support and coordination and make available technical data related to smart cities planning as well as staff, logistics and office space.\n\nPact will provide Puducherry a cushion to fall back on to realise smart city aspirations", 
    "section": "national", 
    "title": "France inks pact to provide assistance for smart city", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}