{
    "author": [], 
    "text": "Vijayadharani termed TNCC anti-women outfit, but defended EVKS when he attacked CM months ago\n\nThere is never a dearth of drama in the Tamil Nadu Congress Committee. Last week, party MLA S. Vijayadharani was removed from the post of Mahila Congress president. .\n\nA day later, she came down heavily on TNCC president E.V.K.S. Elangovan. Citing the leader’s past derogatory remarks against Chief Minister Jayalalithaa, she termed the Congress in Tamil Nadu an anti-women outfit.\n\nWhat she did not reveal was the fact that when Mr. Elangovan made those unsavoury comments against the Chief Minister soon after the latter had a meeting with Prime Minister Narendra Modi at her house in August last year, Ms. Vijayadharani spiritedly defended Elangovan on television channel debates. In fact, till November when her clash with Mr. Elangovan reached the doorsteps of the police, she was viewed as one of the staunch supporters of the TNCC chief. Well that’s the ghost from the past.\n\nA low-key birthday celebration\n\nFor loyalists of former Union Minister M. K. Alagiri, who fondly call him ‘ anja nenjan ’ (brave heart), January 30 is a crucial day - the birthday of their poster boy.\n\nBut in a dampener this year, these loyalists have been instructed to drop the grand celebrations as a mark of respect for the flood victims.\n\nEvery year, Mr. Alagiri would give freebies to the needy during his birthday celebrations and his supporters would put up banners and flex boards at every little available space in Madurai. With Mr. Alagiri himself now out of the DMK, and the party not in power, the eldest son of Mr. Karunanidhi seems to have chosen to remain low key.\n\nHowever, his loyalists former Deputy Mayor P. M. Mannan, and MLA Ghouse Batcha and others maintained that they would give away welfare assistance as usual on January 30.\n\nMeetings add to mystery\n\nThe selection process of Vice-Chancellor for the University of Madras is always keenly watched. The three-member Vice-Chancellor search panel has so far met twice but both times only two members were present. The first time the panel met at the convenor’s house, which was unconventional.\n\nSearch panel meetings are either held in the University for which the panel has been constituted or in the office of the Tamil Nadu State Council for Higher Education.\n\nA quick inquiry with the member who did not make it to the meeting revealed that he was away due to bereavement in the family. Later, the member was caught up with meetings with the national accreditation council. He is believed to have later informed the panel that he was available for meeting. However, he seems to have been left out of the second meeting too. Meanwhile, the search panel put up the notification on the website of the University.\n\nAt the same time the member who did not attend the meeting has also met the Higher Education Secretary, triggering speculation. Although the convenor and the member have maintained that all the moves were made with consensus of all three search panel members, what prompted the third member to meet the Secretary, especially when the panel is an autonomous body, remains a mystery. Incidentally, this member is known to be the Government’s favoured academician on several V-C search panels since 2011.\n\nFacing media unprepared\n\nSpontaneity can sometimes boomerang. This was exactly the outcome when Union Minister of State for Textiles Santosh Kumar Gangwar countered a surprise question from the media when asked for his reactions on the suicide of Rohith Vemula in Hyderabad. The Minister shot back “Who said he is a Dalit”, and further added that “He is not a Dalit”.\n\nBut when asked further by The Hindu on whether he had verified Rohith Vemula was not a Dalit, the Minister had this to say- “Someone told that he belongs to OBC community”, revealing that he did very little homework on the issue.\n\nReporting by Sruthisagar Yamunan, L. Srikrishna,\n\nR. Sujatha,\n\nR. Vimal Kumar", 
    "section": "national", 
    "title": "Ghost from the past", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}