{
    "author": [
        "S P"
    ], 
    "text": "The Department of Public Health and Preventive Medicine has warned private organisations and NGOs against conducting any vaccination camps.\n\nSuch camps should be conducted under the direct supervision of a competent medical professional at hospitals only.\n\nThis comes after a private organisation from Erode district collected money from residents of Ammapet in the city on Saturday to administer vaccine for Hepatitis B during a special camp that was proposed to be held on Sunday.\n\nThe organisation is stated to have created a fear in the minds of people that children are most affected by typhoid, and other diseases.\n\nHence, it promised to conduct a door-to-door vaccination at a price less than the government drug price.\n\nHealth officials were alerted and Deputy Director of Health Services J. Jegadeesh Kumar, and City Health Officer R. Selvakumar, stopped the organisation from proceeding further.\n\nMembers of the organisation were asked not to conduct such camps.\n\nCheap drugs\n\nDr. Selvakumar asked citizens not to fall prey for promise of cheap drugs during such camps conducted without permission.\n\nHe asked them to inform the civic body about such unauthorised camps over phone: 94435-52519.\n\nCorporation Commissioner K.R. Selvaraj too has warned of action against organisation conducting vaccination camps.\n\nUnder the Tamil Nadu Public Health Code and Tamil Nadu Public Health Act, 1939, camps could be conducted by private organisations and NGOs only for general health check-ups.\n\nThey need to obtain permission from Health Department, and the civic body to conduct special check-ups.\n\nThe organisers of free medical camps should follow the norms to prevent any untoward incidents, and ensure high medical standards.\n\nImmunisation can be carried out in hospitals after obtaining permission from authorities concerned, officials said.", 
    "section": "national", 
    "title": "Health Department warns of action", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}