{
    "author": [
        "Annie Philip"
    ], 
    "text": "An uplifting jugalbandhi by Bombay Jayashri and Ronu Majumdar opens a series of concerts\n\nThe Mother and Sri Aurobindo’s standing on art has inspired and attracted many an artiste to Auroville and Ashram.\n\nOpening a series of concerts which are an offering to The Mother and Sri Aurobindo was renowned Carnatic vocalist Bombay Jayashri joined by ace flautist Ronu Majumdar for Windsong, a jugalbandi concert at Bharat Nivas in Auroville recently.\n\nBoth artistes, known for their mastery over their respective mediums, ensured a seamless blend of Carnatic and Hindustani music traditions.\n\nMs. Jayashri and Mr. Majumdar, who have collaborated since 15 years, were accompanied by Ajeet Pathak on tabla and Sumesh Narayanan on mridangam.\n\nApart from her rich contribution to Carnatic music, Ms. Jayashri is also involved in studying the therapeutic and healing effect of music as well as reaching out to society through music with her Hitham Trust.\n\nMr. Majumdar, who has received training from Pandit Ravi Shankar, was in 2014 honoured with the Sangeet Natak Akademi award for his contribution to Hindustani Instrumental Music (Flute).\n\nWhile Mr. Pathak is the disciple of tabla maestro Ustad Sabir Khan, Mr. Narayanan has accompanied Ms. Jayashri several times and is also involved in multiple collaborations cutting across musical genres.\n\nMs. Jayashri’s last concert at the Matrimandir amphitheatre with her students was a memorable one for Aurovilians. She was also a part of the music festival in 2010 celebrating the centenary of Sri Aurobindo’s arrival in Pondicherry.\n\nMr. Majumdar expressed his happiness at returning to Auroville after a considerable time. He has played with his guru Pandit Vijay Raghav Rao at the Pondicherry All India Radio Sangit Sammelan in 1979 as a young man.\n\nIn Auroville’s Bharat Nivas, Ms. Jayashri and Mr. Majumdar began the concert with a composition in Raag Gorakh Kalyan. This was followed by a composition of saint Tyagaraja in Raag Charukeshi. They ended the evening with the popular bhajan Krishna nee Begane Baaro.\n\nThe concert also offered the audience a chance to hear Ms. Jayashri’s rendering of Hindustani classical music.\n\nThe duo also performed at the Ashram theatre in Puducherry. Other programmes in this series include Abhangavani, a programme of devotional music of the Maharashtra and Karnataka Bhakti poets by Jayateerth Mevundi, at Bharat Nivas, Auroville on January 31 at 8 p.m. He will be accompanied by Udayraj Karpur on the tabla and Ravindra Katoti on the harmonium.\n\nMr. Mevundi will also be performing a Hindustani Classical concert, accompanied by Mr. Karpur and Mr. Katoti at the Ashram theatre in Puducherry on February 1 at 8 p.m. Music lovers in Puducherry can also catch Mr. Katoti on the harmonium accompanied by Mr. Karpur on the tabla at the Alliance Francaise on February 2 at 7 p.m.\n\nHindustani classical music vocalist Dr. Ashwini Bhide Deshpande will take to the stage accompanied by Mr. Katoti and Mr. Karpur at the Ashram Theatre on February 3 at 8 p.m. and at Bharat Nivas, Auroville on February 4 at 9 p.m. There will also be more music in store at the upcoming Pondicherry Heritage Festival 2016 from February 5 to 7 in various locations in Puducherry.", 
    "section": "national", 
    "title": "It’s raining music in Puducherry", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}