{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "24 members, including two women, have submitted their candidature ahead of the AGM\n\nThe battle for boardroom has begun at the Tamilnad Mercantile Bank with 24 members submitting their candidature ahead of the Annual General Meeting. Two woman candidates – Maddhumathi Kannan Adityan (50) and Chitra Murali (52) will be contesting for the post of woman director.\n\nS.Vaikundarajan, the chairman of VV Minerals in Tirunelveli would be contesting for the first time along with his brother S. Jegatheesan. Mr. Vaikundarajan has 0.54 per cent shares in TMB. The other candidates include industrialist V.V.D.N. Vikraman and S. R. Aravind Kumar\n\nAs per the rules of TMB, to be a director, a person needs to hold a minimum of 500 shares or they should have an agricultural background.\n\nThe 95-year-old private bank headquartered in Thoothukudi will hold its AGM after a gap of five years on January 29. The 88{+t}{+h}AGM which was scheduled in June 2011 was injuncted by an order from the Madras High Court. However, in November 2015, the court vacated the stay.\n\n“This AGM is crucial for the bank to plan the way ahead and also for the IPO issue which has been pending for long,” said a senior officer . In a notice to its shareholders, the board has recommended an IPO of Rs. 500 crore.\n\nFrom the time the news of the AGM broke, shares of TMB has gone up to Rs 1.1 lakh from Rs 50,000. A trader in Thoothukudi, said, “When people got to know about the IPO and the bonus shares (1: 500) the share per price doubled. No one is willing to part with their shares. Usually these shares are bought by members of the Nadar community in Thoothukudi, Sivakasi and Virudhunagar belts. Some of them are even accumulating these shares expecting big returns.” The book value of Rs. 10 paid up share is Rs 91,000.\n\nFor those who are new to the TMB history, in the early 90s some of the Nadars sold their shares to the Ruias of Essar Group, which led to a massive agitation prompting the Ruias to sell the shares to serial entrepreneur C Sivasankaran for about Rs. 65 crore, who later asked the Nadars to pay Rs. 155 crore for the shares, almost double the price. In 2007, the Nadars managed to raise money and purchased half the stake. The rest was sold to a group of foreign investors who picked up 24.93 per cent stake in TMB.\n\nThe 95-year-old private bank is holding its AGM after a gap of five years", 
    "section": "national", 
    "title": "Mercantile Bank boardroom battle begins", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}