{
    "author": [
        "Staff Reporter"
    ], 
    "text": "“CM will favourably consider sanction of Rs.75 crore for development of the hospital”\n\nMinister for Health C. Vijaya Baskar at the paediatric surgery ward at Government Rajaji Hospital in Madurai which he inaugurated on Sunday.— PHOTO: R. ASHOK\n\nInaugurating the platinum jubilee celebrations at Government Rajaji Hospital here on Sunday, Minister for Health C. Vijaya Baskar announced swift sanction of Rs.1.5 crore for construction and renovation works at the hospital.\n\nHe also assured that he would request the Chief Minister to favourably consider sanction of Rs.75 crore for development of the hospital to mark the platinum jubilee year.\n\nEarlier, Mr. Vijaya Baskar inaugurated new operation theatres for laparoscopy, paediatric surgery and general paediatric surgery wings apart from a platinum jubilee arch at the administrative block.\n\nClaiming that the State government had done exceptionally well in the public health department, Mr. Vijaya Baskar said that government hospitals in Tamil Nadu had earned around Rs.1,110 crore through the Chief Minister’s Comprehensive Health Insurance Scheme (CMCHIS).\n\nHe said that the public had benefited from the CMCHIS in undergoing a wide range of expensive surgeries, including cochlear implants recently started in GRH, completely free of cost.\n\nThe Minister pointed out that the number of medical college seats in Tamil Nadu had been increased from 1,945 to 2,655 during the present government and all efforts were being made to increase the number of seats in Madurai Medical College (MMC) from 150 to 250 from this academic year.\n\nMadurai Collector K. Veera Raghava Rao urged the students and staff to give utmost importance to sanitation and hygiene at the hospital.\n\nM.R. Vairamuthu Raju, Dean of GRH and MMC, welcomed the guests while K. Senthil, State president of Tamil Nadu Government Doctors Association, highlighted the plans for the year-long platinum jubilee celebrations.\n\nP. Namperumalsamy, Chairman-Emeritus of Aravind Eye Care System, stressed the importance of research at GRH.\n\nV. Pugalagiri, alumnus of MMC and Chairman of Vadamalayan Hospital, took the audience through the history of GRH and the MMC.\n\nR. Govindammal (79), belonging to the second batch of the MMC, was honoured at the function. Mayor V.V. Rajan Chellappa, MP R. Gopalakrishnan, MLAs and former Dean of the GRH Revwathy Kailairajan offered felicitation.", 
    "section": "national", 
    "title": "Minister sanctions Rs. 1.5 crore for GRH", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}