{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Government to start minimal access surgery department at the medical college in Thanjavur also\n\nC. Vijayabaskar, Minister for Health, at the newly inaugurated Department of Minimal Access Surgery at KAPV medical college in Tiruchi on Sunday.— Photo: B.Velankanni Raj\n\nMinister for Health and Family Welfare C. Vijayabaskar on Sunday said the State government had decided to start minimal access surgery department at the Government Medical College in Thanjavur soon.\n\nSpeaking at a function after inaugurating the minimal access surgery department at the KAPV medical college here, he said the department had so far been functioning in a government medical college in Chennai.\n\nConsidering the importance and immense benefits to the patients, the department had been created in Tiruchi. It would be the 27{+t}{+h}department of the KAPV medical college. Two specialists had been posted for it. Steps had been taken to start the department in Thanjavur medical college hospital.\n\nMr. Vijayabaskar said it would enable the doctors to perform Roux-en Y weight loss surgery, which was performed in a very few private hospitals, in the Government Hospital too. The gastric bypass procedure would reduce the fat absorption substantially and reduce food intake of patients.\n\nSince the surgery involved huge cost, it had not been accessed to middle class and poor patients. Hereafter, they could undergo the Roux-en Y weight loss surgery at free of cost.\n\nHe said that many other surgeries including appendices, gallbladder, hernia and uterus could be done through laparoscopic surgery method. It would enable the patients to start their routine life as quickly as possible.\n\nStating that the health department had done remarkable contribution to the people of the State during the last five years, he said that the government hospitals had generated Rs.1010 crore by performing surgeries and treating patients under the Chief Minister’s Comprehensive Health Insurance Scheme. More than 5 lakh patients had been benefitted. It was just Rs.12 crore during the previous regime. Similarly, 710 more MBBS seats had been created in the State during the last five years, thereby increasing the medical seats to 2655 from 1945. The Government had recently recruited 400 speciality doctors to various hospitals through online recruitment system.\n\nT.P. Poonatchi, Minister for Khadi and Village Industries, said the new facility would benefit the people of Tiruchi, Perambalur, Ariyalur, Karur and neighbouring districts.\n\nK.S. Palanisamy, Collector, S. Geethalakshmi, Vice-Chancellor, Dr. MGR Medical University, R. Manoharan, Chief Government Whip, M. Paranjyothi, MLA, M.K. Muralidharan, Dean, KAPV Medical College, spoke.", 
    "section": "national", 
    "title": "New dept. for medical college in Tiruchi", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}