{
    "author": [
        "R Srikanth"
    ], 
    "text": "Using the groups feature, colleagues from a workplace or college students can share rides\n\nDrivers would also benefit by being able to use their space optimally —Photo: M. Karunakaran\n\nRidesharing is just what the doctor has ordered. It is almost like a panacea, solving a variety of ills: it can check traffic congestion and by ensuring fewer vehicles are on the road, can check pollution too. But it takes a lot for a ridesharing culture to take hold in a city. But, in recent times, there have been positive signs.\n\nNow, there is something more to encourage Chennai residents to consider ridesharing. On Saturday, Ola launched Ola Share, a ridesharing option, in the city.\n\nAs part of the launch offer, Ola is offering customers a flat discount of 50 per cent on fares that use the shareride button. Anand Subramanian, senior director, Marketing Communications at Ola said, After seeing the good response for Ola Share in Delhi, Mumbai, Kolkata and Bangalore, it has been rolled out in Chennai too.”\n\nTalking about the working of the share option, he said using social groups on the Ola app, colleagues from a workplace or friends from a college can come together to share rides. A user can join multiple groups or simply choose to share a ride with anyone.\n\nCustomised groups could also be started with due email verification. The social groups would be administered by Ola. As soon as a user requests a share ride on the Ola app, he/she will be matched with other users from their groups along their way. At present, 40 percent of the customers of the Ola app have been sent invitations. By next week, all users of app can be expected to be covered, according to sources.\n\nMr. Anand said the ridesharing feature is bound to create a win-win situation for the customers and the driver. While the customer would benefit cost-wise the driver would be able to use his space optimally.\n\nMr. Anand said that at a time when shared mobility was being talked about as the future of sustainable transportation, OlaShare helped make transportation within the city more affordable and helped reduce pollution and on-road congestion.\n\nAsked if there were any plans to roll out the ridesharing feature for autos, he said they were working on it and it could be launched in the future.", 
    "section": "national", 
    "title": "Ola drives in ridesharing to Chennai", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}