{
    "author": [
        "Special Correspondent"
    ], 
    "text": "While satellite channels have completely turned around the way political discourse happens in the State, many senior politicians have reservation about participating in live debates.\n\nPMK leader S. Ramadoss, party MP Anbumani Ramadoss, MDMK general secretary Vaiko, senior BJP leader L. Ganesan and DMK treasurer M.K. Stalin prefer one-on-one talk shows, instead.\n\nThe DMK and the AIADMK have nominated a panel of speakers to represent the party in these debates.\n\nActor-turned-politician Vijayakant’s Desiya Murpokku Dravida Kazhagam (DMDK) is probably the only party that has kept away from television debates.\n\n“There was a time many senior leaders showed enormous interest in participating in these debates. But their initial enthusiasm seemed to have evaporated. They prefer to stay away because they have reservation in sharing dais with those who cannot match their stature,” said M. Gunasekaran, who moderates a primetime debate on Puthiya Thalaimurai.\n\nEgos apart, many leaders do not like to be caught in a tight spot, likely to be created by the representative of a rival political party who has come with an agenda.\n\n“But many well-read personalities and ideologues, including Arunan, Suba. Veerapandian, BJP leader H. Raja, CPI national leader D. Raja and Pazha Nedumaran, never bothered about who is going to sit with them on the panel,” added Mr. Gunasekaran.\n\nA moderator of debates on another popular channel felt “image” matters a lot to the high-profile political leaders and even before agreeing to sit on a panel they would seek to ensure that the other panelists enjoyed a status on a par with them.\n\n“Still, we have succeeded in bringing leader like Subramanian Swamy, M.K. Stalin and Anbumani Ramadoss to our studios. But they would present their point of view and leave the studio without taking part in the debate,” he said.", 
    "section": "national", 
    "title": "Party seniors stay away from debates", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}