{
    "author": [
        "S Senthalir"
    ], 
    "text": "High alert sounded against backdrop of arrest of terror suspects\n\nserious discussions:N. Ravikumar, Superintendent of Police (North), interacts with hoteliers regarding security arrangements in Puducherry on Saturday.- Photo: S.S. Kumar\n\nPuducherry police has issued high alert against the backdrop of the arrest of several terror suspects with alleged links to IS in a continuing crackdown across the country.\n\nSuperintendent of Police (North) N. Ravikumar held a meeting with the hoteliers in Puducherry on Saturday asking them to step up vigilance in the wake of Republic Day celebrations on Tuesday.\n\nWith the French President Francois Hollande invited as a guest of honour for the Republic Day celebrations and the unique relationship Puducherry shares with France has been factored in for sounding the high alert, the police stated.\n\nMore than 30 hoteliers including representatives from three-star hotels participated in the meeting held on Saturday.\n\nHigh configuration CCTV\n\nDuring the meeting, the SP instructed the hoteliers to use high configuration CCTV cameras, check valid identity cards of the customers and their vehicles.\n\nThe hoteliers were instructed to install two CCTV cameras at two ends of the hotels facing the road to keep a tab on the movement of people. Besides, the camera with a backup of 15 days was asked to be installed for better recovery.\n\nValid identity\n\n“Complete information about the tourists who come to the hotels has to be collected and given to the concerned circle inspectors. The tourists should produce valid identity cards including their passport, Aadhaar card or voters’ id.\n\nIn case of foreign tourists, the hoteliers have to collect a copy of their passport and visa and form C should be surely submitted to the concerned police,” Mr. Ravikumar stated.\n\nHe appealed to the hoteliers not to hesitate in informing them about any suspicious persons or activities. They could either call the control room number 100 or nearby police station.\n\nRegular checks\n\n“The police will conduct regular checks in the hotels without disturbing the tourists. Every effort would be made to keep a check on terrorists’ activities in Puducherry,” he said.\n\nThe police also asked to keep a closer watch on suspicious persons and immediately alert the police in this regard.\n\nThe entire police force will be mobilised and put into action. Regular checks would be conducted on roads leading to the Puducherry, lodges, hotels, railway stations and bus stands.\n\n“Everyday at least 200 police personnel would be on duty for this and more than 600 police personnel will be deployed at the venue on the day of Republic Day celebration,” he said.\n\nMeeting with fishermen\n\nThe police force is also planning to install more surveillance cameras. They said that a meeting with the fishermen will also be held on Sunday to keep a vigil on the coastline.", 
    "section": "national", 
    "title": "Police to step up vigil on R-Day in Puducherry", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}