{
    "author": [
        "B Kolappan"
    ], 
    "text": "Television debates have taken the political class closer to homes of people\n\nYears ago a Tamil magazine published a cartoon in which a politician addressing an empty ground is consoled by his sidekicks that people were listening his speech from their homes.\n\nCut to the present, daily debates of television channels have indeed taken the political class closer to the homes of the people, who no longer are enthusiastic about travelling several kilometres to attend public meetings at regular intervals.\n\nIn Tamil Nadu, the emergence of independent regional satellite television channels have indirectly turned into a propaganda vehicle for leaders and spokespersons to articulate the party’s position on key issues and also to rise to prominence within the ranks and outside. For smaller parties, effective spokespersons have made it possible to gain wider acceptability.\n\n“If you organise a rally or a public meeting only party cadres will attend them. But debates on television channels have brought political parties and their leaders directly into the drawing and dining halls of every house. They have become a powerful propaganda machines for a political party,’ acknowledged Congress leader A. Gopanna, a regular on television debates.\n\nPublic meetings in Panagal Park in Chennai were a regular affair till the end of the 1990s. But vehicular congestion has made it impossible to hold any event in the commercial hub. A ban on public meeting on the sands of Marina also brought down the curtains on mammoth rallies.\n\n“Television debates have helped us convey our stand on vital issues and present an alternative point of view to the well-established political parties. The channels have provided the much needed space at a time it has become difficult to express our views in the traditional platforms, including the Assembly,” said CPI (M) Assembly floor leader A. Soundararajan.\n\nHowever, while agreeing that the overall balance sheet was good, Sashi Kumar, chairman, Media Development Foundation, opined that these debates had paved the way for evolution of a new rhetoric as television channels and political leaders were incapable of handling the nuances of the views that could be expressed clearly in newspaper articles.\n\n“These debates have become personality oriented, exemplified by the trend in Kerala since the same characters regularly represent their party,” he said, explaining how a study in Italy had found that the views of the Christian Democratic Party and the Left had become the same.\n\n“Of course, their views are different and people know the difference. But in the process of mainstreaming the debate, television channels appropriate the show and the differences got absorbed. Many a time they have become slanging matches,” felt Mr. Sashi Kumar.\n\nThe positive aspect of the debates, Tamilan Prasanna, joint secretary, media relations of the DMK, said was that they had brought to limelight a crop of youth who remained in the shadow in all these years.\n\n“These debates also identified us to our party leadership and understand the line of the opposition deeply,” said Mr. Prasanna, adding that TV channels had helped strike a chord with neutral voters, which was not possible on party platforms. Mr. Gopanna and Mr. Prasanna said they had to spend hours preparing for the debate.\n\n‘Many a time political debates\n\non television have become slanging matches’", 
    "section": "national", 
    "title": "Political ideation in drawing rooms", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}