{
    "author": [], 
    "text": "Pongal festival was celebrated at Mannar Thirumalai Naicker College, Madurai, on January 14 on behalf of K. Rajendra Babu and Family Trust. Girl students and staff members cooked pongal in the traditional way. V. Indhumathy, Regional Joint Director of Collegiate Education, chaired the celebration and delivered a speech on women empowerment. Competitions were conducted on the occasion and the winners received the prizes from Dr. Indhumathy. Students also presented a cultural programme. A. Arivuchelvam welcomed the gathering and R. Bhavani proposed a vote of thanks.\n\nII\n\nPongal celebration was inaugurated at E. M. G. Yadava Women’s College, Madurai, on January 8 by the secretary, E. M. G. S. Indirani. Students, dressed in traditional attire, prepared pongal in pots that created a festive mood. The campus was decorated with festoons, rangoli and sugarcane.\n\nIII\n\nStaff and students of Annai Fathima College of Arts and Science, Tirumangalam, recently celebrated ‘Samathuva Pongal’ in which the significance of the Tamil festival was explained. Students were told how work was worshipped through the celebration, which was also an occasion to showcase the art and culture of Tamil Nadu.\n\nIV\n\nChethana Matriculation Higher Secondary School, Madurai, celebrated Pongal on January 13 in which students took part in traditional games like tug-of-war, ‘uri adi’ and Rangoli. The correspondent, E. R. Reddy, presided over the celebration.\n\nV\n\nSPJ Matriculation Higher Secondary School, Madurai, celebrated Pongal with a Rangoli competition for parents. Teachers, parents and students prepared pongal in the traditional way. P. Abarna, Principal, presided over the function. A. Ajitha, Vice-Principal, proposed a vote of thanks.\n\nVI\n\nPalayampatti Nadar Uravinmurai A. Sankaranarayana Nadar Matriculation School, Madurai, in association with Rotary Club of Madurai Sangamam, celebrated Pongal on January 13 with various competitions for students, including elocution and Tirukkural recitation. There were also cultural programmes that depicted the importance of Tamil culture and heritage. G. Veeramani, president of Rotary Club of Madurai Sangamam, distributed prizes to winners of the competitions.\n\nNational conference\n\nThe Department of Mathematics of N. M. S. Sermathai Vasan College for Women, Madurai, conducted a national conference on “Contemporary Graph Theory and its Application” on January 11. V. Swaminathan, Coordinator, Ramanujan Research Centre in Mathematics, Saraswathi Narayanan College, who inaugurated the conference, delivered a lecture on “Very Excellent and Equitable Domination in Graphs” M. Valliammal, Head, Department of Mathematics, welcomed the participants. President G. Mariskumar delivered the presidential address. Principal D. Karthiga Rani and vice-president R. Mutharrasu offered felicitations. S. Francis Raj of Ramanujan School of Mathematical Sciences, Pondicherry University; I. Sahul Hamid of Madura College and A. Wilson Basker of Saraswathi Narayanan College, were the resource persons. S. Meena Kumari, Managing Trustee, Thainadu Rural Development and Social Welfare Trust, delivered the valedictory address. B. Manochitra proposed a vote of thanks.\n\nLecture delivered\n\nA lecture on “Prevention of sexual harassment of women at work place” was delivered at K. L. N. College of Engineering, Pottapalayam, on December 23 for faculty members by Bimla Chandrasekar, Director, Ekta Resource Centre for Women. The resource person discussed various problems faced by working women and presented a detailed overview of sexual harassment. Principal A.V. Ramprasad presided over the lecture.\n\nFunding received\n\nThe Department of Mechanical Engineering of Velammal College of Engineering and Technology, Madurai, has received a research and development funding of Rs. 16.49 lakh from the Department of Science and Technology for the project “Automated button feeding riveting machine for garment Industries” developed by G. Manikandan, Professor and Head, M. Maran and A. Arun Senthil Kumar, co-principal investigators.\n\nThe project is the outcome of consultancy work carried out for Penguin Apparels. The department also received Rs. 17 lakh from the DST for the development of safe, human-powered and low-cost multipurpose machine for fireworks industries in Sivakasi for the team comprising Dr. Manikandan, V. Anbumalar and P. Rajesh Kanna.\n\nThis project is the outcome of consultancy work carried out for Sri Kaliswari Fireworks, Sivakasi. The aim of the project is to develop a low-cost machine operated by human power for manufacturing fireworks considering the safety of labour.\n\nEducation programme\n\nThe National Service Scheme unit and Student Nurses’ Association of C. S. I. Jeyaraj Annapackiam College of Nursing and Allied Sciences, Madurai, conducted a continued nursing education programme on ‘Nursing,. a noble ministry in United States of America’ on January 11. C. Jothi Sophia, Principal, delivered the presidential address. Alfred R. Thiyagarajan, Vice-President, Open Wave Computing, the chief guest, emphasised the importance of psychological support for patients during treatment. Jessie explained the objective of the programme. D. Edwin Raja Kumar, NSS Programme Officer welcomed the gathering and Grace Balammal proposed a vote of thanks.\n\nWorkshop held\n\nA workshop-cum-training in drawing and painting for teachers was conducted by Kokuyo Camlin at Mepco Schlenk Nursery and Primary School, Tirumangalam, on December 31. Trainer K. Suja Prince trained participants in dip painting, vegetable painting, greeting card designing, megandhi drawing , sari printing and tattoo pasting.\n\nAn orientation programme on inter-personal communication skills was conducted at the school on January 2 for teachers. M. Rajasekaran, Dean, Ayya Nadar Janaki Ammal College, Sivakasi, the resource person, highlighted the significance of communication in an effective teaching-learning process. He advised the participants to develop positive interpretation, appreciation, gratitude and empathy towards students and avoid sarcasm, grudges and emotional traits.\n\nPongal was celebrated at the school with a talk on the traditional Tamil festival by S. Baskaran, adviser. He wanted the students to resolve to encourage the use of organic agents in the place of chemical pesticides. Various cultural programmes were performed by students on the occasion.", 
    "section": "national", 
    "title": "Pongal festival celebrated", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}