{
    "author": [], 
    "text": "Insufficient rail connectivity\n\nThere is insufficient rail connectivity between South Tamil Nadu and the Mayiladthurai-Villupuram broad gauge route.\n\nThough there is a perennial heavy rush of passengers from the southern districts to Chennai, and all the trains are always completely reserved, there are not enough services.\n\nThe route is made use of by private players.\n\nEven on special occasions, special trains are not available frequently on this route.\n\nParcel facility is also not extended to all the railway stations, whereby only the private operators stand to gain money at the expense of Railways.\n\nOn the other hand, at Chidambaram railway station which is visited by thousands, many do not even buy platform tickets.\n\nKeeping in view the financial position of Railways and also the wealth generation potential of this route in the best interests of the Cauvery Delta region and the southern districts, would the Ministry of Railways wake up to this reality?\n\nT. Raj Pravin,\n\nChidambaram\n\nDevelop Kanakkaneri\n\nas an eco-park\n\nKanakkaneri, a water body situated behind the Indira Gandhi Medical College and Research Institute, Puducherry, is surrounded by nearly 6000 families. It is covered by hyacinths. The residents use it as a place to relax, and go on walks.\n\nA decade ago, the Puducherry Government mooted the idea of creating a recreation centre with boat rides. Unfortunately the project did not take off.\n\nIt is requested that this project should be revived. and track for walking or jogging be made around the lake.\n\nOnce the lake is used for boat rides, it will arrest the growth of hyacinths.\n\nThe project will also serve visitors and attendants at the hospital.\n\nHence, it is requested that Kanakkaneri be desilted, and if possible an eco-park may be established with medicinal herbs.\n\nV. Ramalingam,\n\nThattanchavady Post\n\nSolution needed for stray dog problem\n\nStray dogs have multipled in Avvai Nagar and surrounding areas. A peaceful morning walk has become a run for life. Indiscriminate disposal of waste and open defecation have added to the situation.\n\nVehicles parked on streets, sand dumped on roads have become comfort zones for the canines. An immediate solution must be found.\n\nT.V. Sreekumar,\n\nLawspet, Puducherry\n\nReaders can send their mails to pondy.thehindu@gmail.\n\ncom and The Hindu, 135 Mission Street, I Floor, Puducherry – 605001", 
    "section": "national", 
    "title": "Readers Mail", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}