{
    "author": [
        "Readers Mail", 
        "File Id", 
        "Un-corrected Version"
    ], 
    "text": "The stretch from Ashok Pillar to K.K. Nagar bus stand is not well-lit at night —Photo: V. Ganesan\n\nThe construction of stormwater drains above road level is causing a great deal of difficulty to residents —Photo: M. Moorthy\n\nThe peril of rising\n\nroad levels\n\nHouses are constructed with an average basement height of three feet and well above the finished road level. Once the houses are constructed, the basement level cannot be raised. This being the case, while constructing stormwater drains or re-laying the roads with a new coat of tar, care must be taken to ensure that the rainwater from adjoining houses drains into SWDs or finds a way out of the plot. Presently, road levels are raised and SWDs obstruct the flow of rainwater from houses. The authorities concerned must look into this issue.\n\nR. Ganesan\n\nAdambakkam\n\nPost office is\n\nshort-staffed\n\nIn Nilamangai Nagar in Adambakkam, a post office has been short-staffed for many years.\n\nOnly two employees have been working at the facility since its inception and they are now not able to cope with the crowd, which has increased due to the development of the area over the past few years. Long queues are a daily occurrence at the post office, causing great inconvenience, especially to senior citizens and home makers.\n\nHence, I request the Postal department authorities to look into this issue and increase the staff strength at the post office.\n\nR.Maran\n\nAdambakkam\n\nBadly lit stretches\n\nin K.K. Nagar\n\nThere is no proper lighting on the stretch from Ashok Pillar to K.K. Nagar bus stand. At night, the entire area is pitch dark. Vehicles cross the median at great speeds, posing risks to pedestrians who want to cross the road.\n\nThere is no proper shelter in the bus stop for people waiting to board buses to Tambaram.\n\nAshok Nagar has been neglected and there is no proper lighting along many roads and residents often find crossing the road very difficult.\n\nK.S. Pattabiraman\n\nVOC Nagar, Pammal\n\nTraffic violations galore\n\nMany cars and mini cargo vehicles bound for Irumbuliyur in East Tambaram from West Tambaram side violate traffic rules. The vehicles travel on the wrong side of GST Road through the subway opposite Hindu Mission Hospital. The traffic police do not seem to be taking it seriously. The authorities should look into the matter.\n\nE.D. Kothandam\n\nEast Tambaram", 
    "section": "national", 
    "title": "READeRS' mail", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}