{
    "author": [
        "Contributed L"
    ], 
    "text": "The mahasamprokshanam performed at the famous Andal temple in Srivilliputtur drew a large number of devotees from far and near. Officials heaved a sigh of relief as the grand event ended peacefully.\n\nThough there were many reasons for the successful conduct of the event, the absence of VVIPs, including the two local ministers, MLAs, MPs and their followers, helped the officials handle the crowd efficiently. In fact, even the presence of Chief Minister’s confidante Sasikala went unnoticed as the devotees were focused only on the event.\n\nApart from the district administration and the police officers who were doing their role, the support extended by HAM Radio network to the event organisers was noteworthy. Positioning themselves around the four towers, the eight-member team, headed by Kalugumalai Raja, with shortwave listeners coordinated with the authorities. Likewise, the unmanned aerial survey too was a step forward in surveillance.\n\nWhen a devotee, who was atop a gopuram swooned minutes before the samprokshanam, a team of para-medical staff and doctors immediately provided first aid and helped him recover.\n\nWhen advocates presented a cheque for Rs.92 lakh to DMK treasurer M.K. Stalin for poll fund at the party’s advocate wing conference held in Madurai on Sunday, he thanked the lawyers and asked whether this amount (Rs.92 lakh) could be treated as first instalment. Amidst laughter and shock from all around, Mr. Stalin continued to say that as a party’s treasurer and Kalaingnar’s (Karunanidhi) son, he could not be found fault with such an expectation.\n\nHowever, Mr. Stalin said that the advocates had collected Rs.92 lakh to denote the age of party supremo Mr. Karunanidhi and wished them to collect another round soon before the elections.\n\nHe shared his “Namakku Naame” experience with the advocates and said that he had learnt from the visits to as many as 218 constituencies so far that the elected representatives — be it an MLA or MP, should go to the people and not the other way.\n\n“I have promised the people that I will follow this in future...”\n\n(CONTRIBUTED BY L. SRIKRISHNA)", 
    "section": "national", 
    "title": "Reporter’s diary", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}