{
    "author": [
        "Special Correspondent"
    ], 
    "text": "In a demonstration aimed at drawing attention to the lack of sufficient bus services from Chennai or Ponneri, residents prevented buses from entering and leaving Pazhaverkadu bus stand on Friday morning.\n\nThey said that this was the eighth time in the last five years that they were engaging in this form of protest. They claimed that despite such protests, the government has not taken any remedial action.\n\n“We stopped the buses from 7 a.m. to 11 a.m. It is the administration that is forcing us to protest in this manner,” said A. Murugan, a fisherman from Pazhaverkadu. According to the residents, there are over 80,000 people living in Pazhaverkadu and in 50 hamlets nearby, including Kottai Kuppam and Light House.\n\n“Pazhaverkadu is the main bus stop for us and most of the residents come here to board buses to Chennai or Ponneri, which is 19 km away and has the taluk office.\n\nA few years ago, there used to be many buses, but over the past five years, their numbers have declined considerably.\n\n“There are no buses during rush hour. Due to this, students are struggling. They are not able to reach school or return home on time. Besides, many fishermen are also put to great hardship on account of this,” said Durai Mahendran, general secretary, Tiruvallur Maavatta Paarambariya Aikiya Meenavar Sangam.\n\nHe said the residents had been asking for a bus terminus in the locality for the last several years.\n\n“Children are not able to come home on time and study. They get tired waiting for their bus. A few years ago, the government promised a bus service from Pazhaverkadu to Parrys. But they are yet to make good their promise,” he added.\n\nThey prevented buses from entering\n\nor exiting Pazhaverkadu stand", 
    "section": "national", 
    "title": "Residents besiege bus stand, highlight connectivity issues", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}