{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Union Bank of India Officers' Association on Sunday urged the Union Government and the Reserve Bank of India to have a relook and review the policy of licensing banks opened by industrial houses, new private sector banks and foreign institutions.\n\nAt its 23rd general body meeting (Ninth Biennial), the UBIOA adopted a resolution saying vigil was required to ensure that the new banks backed by industrial houses are not using the leeway provided by the regulator and the Government to further industrial interests. The industrial houses must not be allowed to avoid scrutiny of the professional public sector banks while taking loans from them.\n\nThe meeting was inaugurated by Sanjay Sharma, general manager, Field General Manager Office, Chennai, in the presence of top functionaries of All India Bank Officers' Association, Union Bank of India Employees' Union, All India Nationalised Bank Officers' Federation, and Canara Bank Officers' Association. A.P. Venkatasubramanian, president, UBIOA – Tamil Nadu, presided over the inaugural session.\n\nA total of 10 resolutions were adopted after the inaugural session, said Sivanesan, general secretary, State UBIOA, said.\n\nThe meeting, at the outset, called for urgent and effective measures by the Centre to hold the price line and control inflation.\n\nThe other resolutions encompassed sanction of suitable amount of education allowance every month for a maximum of two children for all officers; exclusion of dearness allowance, city compensatory allowance, and essential facilities and perquisites from the ambit of 'Income' for the purpose of computing Income Tax - till the IT law is amended, the bank managements must bear the Income Tax on salary and perquisite valuation; reservation / relaxation / concession to wards of officers and staff in (bank) recruitment process; safeguards for officers in disciplinary matters against \"whimsical, capricious, vindictive and malicious acts\" by the controlling, investigating and disciplinary authorities; scrapping of Kandelwal Committee report in the areas of recruitment and compensation; improvements in family pension, DA neutralisation and update of pension; reservation of seats in reputed schools and colleges for admission of wards of bank employees and officials, considering the transferrable nature of the job; and compensation for working late and on holidays.", 
    "section": "national", 
    "title": "‘Review bank licensing policy’", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}