{
    "author": [
        "S Poorvaja"
    ], 
    "text": "Forest officials and volunteers fix nets on the trees at the Revenue Office Quarters in Anna Nagar to protect birds that are at risk of falling out of their nests — Photos: M. Vedhan\n\nForest officials and volunteers fix nets on the trees at the Revenue Office Quarters in Anna Nagar to protect birds that are at risk of falling out of their nests. —Photos: M. Vedhan\n\nResidents noticed hatchlings falling out of nests built by a variety of birds at Anna Nagar\n\nConservationists, officials of the Forest Department and local residents came together at Revenue Office Quarters in Anna Nagar on Friday and Saturday with a common goal in mind — saving bird hatchlings. For over a week, residents of the area had been noticing hatchlings falling out of nests built by a variety of birds, including pond heron, night heron, cormorant and little egret, on neighbourhood trees. The sight of hatchlings falling on the roads and dying has moved them to action.\n\n“A resident had informed the department and several environmentalists that they had found about 35 to 40 small birds dead on the roads there over the last one week. A few volunteers went to assess the situation and said that if nets were put up on the trees there, they could protect the birds that were at risk for falling,” said S. David Raj, Forest Range Officer.\n\nVolunteers at the spot said that these birds had built over 1,000 nests on the trees in the thickly populated residential area. Nine birds that had fallen down on Friday were rescued by them and sent to Vandalur Zoo for treatment.\n\n“We worked as a group of around ten volunteers and fixed seven nets over the last two days. Since the nets are large, the process of fixing them is slow and we are hoping to finish the process in a few days,” said Nishanth Ravi, a wildlife rescue volunteer. The nets have been tied to the trees and at a good height so that they don’t pose any hindrance to passing vehicles. He said that while the birds visited the area and built nests every year, the numbers had increased this time due to the floods last year, which had increased the water in the surrounding ponds there.\n\n“The residents have been extremely cooperative and are pitching in to help us fix the nets. We plan to put up small signboards with information about the birds that visit this place every year as well,” he said.", 
    "section": "national", 
    "title": "Safety nets to save bird hatchlings", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}