{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Congress to challenge G.O. on relocation of Chidambaranathan statue\n\nThe district administration on Saturday night relocated the statue of freedom fighter Chidambaranathan Nadar installed along Nagercoil-Thiruvananthapuram National Highway near Kalyakavilai bus stand to the town panchayat office as per a Government Order passed in this regard.\n\nEarlier in the day, tension prevailed over the move to relocate the statue, and Thuckalay Assistant Superintendent of Police Vikrant Patil held talks with the agitated Congress cadres. He asked them to take efforts to get the G.O. revoked by appealing to the government within three to four days.\n\nSpeaking to reporters here on Sunday, V. Asokan Solomon, president of Kanyakumari west district Congress committee, and V. Kannattuvilai Paliah, president of Kanyakumari east district Congress committee, said that the G.O. on relocation of statues of Chidambaranathan in Kalyakavilai and Kavimani Desiga Vinayakam Pillai in Suchindram on the basis of an interim order passed by the Supreme Court itself was a faulty one.\n\nThe relocation of Chidambaranathan statue was done by the State government in haste, as it was aimed at preventing Tamil Nadu Congress Committee president E.V.K.S. Elangovan from inaugurating it on January 27.\n\nMr. Solomon said that the interim order of the Supreme Court stated that no permission should be given for construction of buildings and erection of statues on national highways after January 18, 2013, and it asked to maintain status quo till the outcome of the final order.\n\nThe Congress had decided to file a contempt of court petition against the government, he said.\n\nMr. Solomon told The Hindu that Collector Sajjansingh R. Chavan had given an assurance that the government would inaugurate the statue in the relocated place before January 27. If it was not done, the party would decide on its inauguration by the TNCC president.", 
    "section": "national", 
    "title": "Statue relocated with security", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}