{
    "author": [], 
    "text": "Pragyan Youth Business Summit brings together business leaders and students\n\nThe upcoming Union Budget, ‘Brand India’ and the importance of ‘Make in India’, and Foreign Direct Investments – these were some of the topics that were on focus at the Pragyan Youth Business Summit on Saturday in the city.\n\nThe event was conducted by ‘Pragyan’ a student organisation of the National Institute of Technology Tiruchi. “We wanted the focus of the summit to be on bringing together the current and future generations to engage in a discussion about the future of the country and how they can play an active role in shaping it.\n\nKumud Srinivasan, who opened the summit, spoke about ‘Leading India to its tomorrow.’ The day-long summit had participants from colleges across the country. For the students looking to delve into entrepreneurship, Sudhakar Ram, Founder and CEO of Mastek group, spoke about his journey towards a tech start-up.\n\nCarpooling comes\n\nto Ola in Delhi\n\nThe users of Ola app in New Delhi can, in addition to the ridesharing option on the app, access a new feature to offer car-pooling facilities for those in a group. Commuters in Chennai, where the ridesharing option was introduced recently, are observing the development with great interest.\n\nAnand Subramanian, senior director, Marketing Communications at Ola, said the option of carpooling on the Ola app was an extension of the ridesharing facility.\n\nIt allows users to create a custom list by simply adding friends with their mobile phone numbers. This helps CarPool users travel with their identified friends. Similarly, car owners can also choose to share their ride with anyone outside of their friends. Mr. Anand said: “All of Ola’s safety features including Track your Ride, Share Ride Details, 24-hour customer care support, SOS, emergency contacts and In-trip feedback are available on CarPool as well.”\n\nUsers in Chennai hope the carpooling option will be introduced here as well.\n\n(Reporting by S. Poorvaja and R. Srikanth)", 
    "section": "national", 
    "title": "Summit deliberates on role of youth", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}