{
    "author": [
        "Special Correspondent"
    ], 
    "text": "FARMER-FRIENDLY:The Seed Treatment Machine that was commissioned on Saturday at the production unit of Sakthi Sugars Limited at Ezhumathur, in Erode district.\n\nTwenty-two Shade Nets have been developed for optimum resource utilisation by sugarcane farmers in Modakurichi block with the help of Agriculture Department under the Sustainable Sugarcane Initiative introduced since 2011-12 in the command area of Sakthi Sugars Limited, Modakurichi unit.\n\nThe novel method to grow single bud sets to develop settlings / seedlings in trays filled with enriched coir pith in shade nets has been yielding the desired results.\n\nTo produce quality settlings, both pesticides and fungicides are treated and UV chamber is used to induce the sprouting. Necessary micro nutrient mixer and water soluble fertilizer spray has to be administered periodically. After hardening, 30 days old settlings are supplied to farmers and the shade net entrepreneur themselves arrange for labours to plant the settlings, V. Thiruvenkadam, Senior General Manager, Sakthi Sugars Limited, Modakurichi unit, said.\n\nFarmers are able to obtain higher yield by five to 10 additional metric tonnes per acre under SSI when compared to the conventional method.\n\nAccording to the Executive Chairman of Sakthi Sugars Ltd., M. Manickam, who has been monitoring technologies reflecting SSI implementation from bud cutting to cane harvest, the latest introduction is bud treatment device.\n\nOn Saturday, Mr. Manickam commissioned the device introduced by Sugar Cane Breeding Institute, Coimbatore, and developed by Sakthi Sugars Limited, Modakurichi, in the presence of Baksiram, Director of Sugar Cane Breeding Institute, Coimbatore. The treatment of bud in this device will help to control seed/soil born pathogens and impart drought tolerance to the seedlings.", 
    "section": "national", 
    "title": "Sustainable Sugarcane Initiative working well for farmers", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}