{
    "author": [], 
    "text": "S. Natarajan, Deputy Chairman, V.O.Chidambaranar Port Trust, releasing an audio CD during the golden jubilee celebrations at Kamaraj College in Thoothukudi. (Below) The 154th jayanthi celebration of Swami Vivekananda held in Sri Sarada Niketan College for Women, Amaravathipudur.— Photo: N. Rajesh\n\nS. Natarajan, Deputy Chairman, V.O.Chidambaranar Port Trust, releasing an audio CD during the golden jubilee celebrations at Kamaraj College in Thoothukudi. (Below) The 154th jayanthi celebration of Swami Vivekananda held in Sri Sarada Niketan College for Women, Amaravathipudur.— Photo: N. Rajesh\n\nStudents should dream until they achieved their desired success, Deputy Chairman of V.O. Chidambaranar Port Trust, S. Natarajan, said while addressing at the golden jubilee celebration of Kamaraj College in Thoothukudi on January 21. He advised the students to set success as their target and work hard towards achieving it and highlighted the significant contributions of former Chief Minister K. Kamaraj to education. Earlier, Mr. Natarajan inaugurated the newly-built air-conditioned seminar hall at the college. D. Nagarajan, Principal, welcomed the gathering. A compact disc on the golden jubilee celebration was also released by Mr. Natarajan. V. Elango, president, Managing Committee, received it. Cultural programmes were presented by students on the occasion. G. Narayanasamy, Coordinator, Internal Quality Assurance Cell, proposed a vote of thanks.\n\nSymposium\n\nA one-day national symposium “Gravi-2k16” was organised by the Department of Business Administration at Annai Velankanni College at Tholayavattam in Kanyakumari district recently.\n\nS. Xavier Benedict, Correspondent of the college, inaugurated it. S. Lazarus, President, presided. M. Anto Pravin Singh, Assistant Professor, welcomed the gathering and S. Josephen Kala, Assistant Professor, proposed a vote of thanks.\n\nAn inter-collegiate management competition was also conducted.\n\nNational Youth Day\n\nThe Centre for Vivekananda Studies of Ayya Nadar Janaki Ammal College, Sivakasi, celebrated National Youth Day on January 12 in which various competitions were conducted for students. K. Nalini, Coordinator of Centre for Vivekananda Studies, welcomed the gathering. V. Pandiyarajan, Principal, presided over the function and highlighted the various teachings of Swami Vivekananda. He also distributed prizes to the winners of competitions. R. Selvakumar proposed a vote of thanks.\n\nJayanthi celebration\n\nThe 154th jayanthi celebration of Swami Vivekananda, Bliss Fest – 2016, was conducted in Sri Sarada Niketan College for Women, Amaravathipudur, on January 12 and 13. Registrar of Alagappa University V. Balachnandran, in his inaugural address, spoke about Swami Vivekananda’s ideals. Students participated in various cultural events organised as part of the celebration. S. SelvRani, Principal, presided over the event. M. Selvam, Chairman, School of Management, Alagappa University, in his special address on January 13, appealed to the students to walk on the path of Swami Vivekananda with courage and confidence. M. Meenalochani, Cultural Coordinator, proposed a vote of thanks.\n\nProgramme for students\n\nThe Extension Activity Cell of the Department of Biotechnology of Sri Kaliswari College, Sivakasi, conducted a programme to mentor government school students at Sukkiravarpatti on January 6 under the Rashtviya Avishkar Abhiyan. Twelve students and two staff members, S. Amarnath Pandian and K. Siva, delivered lectures on dengue fever, malaria, bird flu, swine flu and rat fever and suggested measures to control them.\n\nPongal\n\ncelebrations\n\nThe twin-function of paying homage to Sri Balagangadharanatha Mahaswami and Pongal celebration was held at Sri Adi Chunchanagiri Women’s College, Cumbum, recently. The event comprised deepanjali, pushpanjali and gitananjali to the founder of the college. Cumbum N. Ramakrishnan, M.L.A., secretary, presided over the function.\n\nSabahath Sabina, secretary, staff union, welcomed the gathering. The Principal, Suthamathi Ravichandran, and joint secretary R. Vasanthan offered felicitations. Rev. Fr. Philip Arokiaraj, K. M. Abbas, former Head, Jamath Committee, and Firos Khan, ex-serviceman, participated in the celebration.", 
    "section": "national", 
    "title": "TAMIL NADU", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}