{
    "author": [
        "R Srikanth"
    ], 
    "text": "More substations being built to tackle disruptions in electricity distribution this summer\n\nThe Tamil Nadu Generation and Distribution Corporation (Tangedco) is constructing new substations in many locations in the city and its suburbs to tackle the power situation during summer.\n\nThe demand for power supply has been on the rise owing primarily to creation of new neighbourhoods in the suburbs, but the transmission network has not kept pace with this growth. This, officials said, had resulted in severe problems caused by voltage fluctuations and power outages.\n\nTangedco is constructing substations at Sithalapakkam Medavakkam, inside multi-storey housing complexes in Siruseri and also at Egattur near Kelambakkam. The areas are located around the IT corridor, where the demand for power supply is always on the rise.\n\nThe Corporation is also establishing a substation dedicated to people living in tenements constructed by Tamil Nadu Slum Clearance Board at Ezhil Nagar in Okkiyam Thoraipakkam, apart from a similar facility at Cancer Institute in Adyar. Similarly, three substations of 33/11 KV substations are planned at Chengalpattu and Kancheepuram, officials said.\n\nOf the proposed eight substations in North Chennai, Tangedco has already commissioned two at Kolathur and Korattur, while others were being built in Tirumangalam, Ammai Appan Lane in Gopalapuram, All India Radio, R.V. Nagar and Vaigai Colony near Anna Nagar.\n\nThe official said: “While the substation at Woods Road in Royapettah has been completed, it is yet to be commissioned due to delay in cable-laying work. It will be commissioned next month.”\n\nTaking into consideration the feedback about power outages registered due to inadequate transmission network from the field officials and areas suffering from power overload during the past five years, it was planned to construct substations to improve the power supply, officials recalled.\n\nThe substations were being executed under the Restructured Accelerated Power Development and Reforms Programme (RAPDRP) funded by the Central government, they added.", 
    "section": "national", 
    "title": "Tangedco reaches out to suburbs", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}