{
    "author": [
        "Special Correspondent"
    ], 
    "text": "“DMK will establish Lok Ayukta, if elected to power”\n\nIf the Dravida Munnetra Kazhagam is elected to power in the ensuing Assembly election, Lok Ayukta will be established in Tamil Nadu, according to party treasurer M.K. Stalin.\n\nAddressing DMK’s advocates’ wing conference here on Sunday, he said that whenever the DMK was in power, the judiciary in the State was given due respect and there was a cordial working relationship between the government and the judiciary.\n\nHe said that a little over 13 lakh cases were pending in various courts in Tamil Nadu. The DMK would work closely with the judiciary and take steps to reduce the pendency of cases.\n\nA number of law colleges were opened in the State when Mr. Karunanidhi was the Chief Minister, and the law university was named after B.R. Ambedkar. Many court buildings came up in districts and taluks.\n\nWhen there was clash between advocates and police on the Madras High Court campus, the then Chief Minister Mr. Karunanidhi, who was in hospital for a surgery, offered to meet the then Chief Justice in person and explain the steps taken by the government.\n\nWhen the judiciary approached the Centre seeking protection by Central forces, the present State government should haveassured the judiciary that it would provide security with the State police, Mr. Stalin said. “If the CM had no time, she could have directed a senior minister or the Chief Secretary to meet the judiciary and ensured that the Central forces were withdrawn. Such a strained relation was not a welcome sign,” he noted.\n\nAssembly sessions\n\nWhen the DMK was in power (2006-11), Mr. Stalin said, the Assembly was held for 223 days. But when the AIADMK was in power the Assembly was held for 182 days (2001-06) and 186 days (2011-16). Even on those days, the time was used for singing praise of the Chief Minister. Time had now come to bundle out the AIADMK, he said.\n\nHe said that the DMK relied on advocates whenever it was out of power as the AIADMK filed case after case against the party, he said amidst applause.\n\nEarlier, the advocates’ wing presented Rs. 92 lakh to the party for election expenses.\n\nSenior advocate R. Shanmugasundaram, R.S. Bharathi, Viduthalai, former Ministers Durai Murugan and I. Periyasamy spoke.", 
    "section": "national", 
    "title": "Time has come to bundle out AIADMK, says Stalin", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}