{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Ranganathaswamy Temple, Srirangam: Thai car festival, Namperumal purappadu from sanctum sanctorum 3 p.m.; reaching Ranga vilasa mandapam, 3.30 p.m.; purappadu from the mandapam, 7 p.m.; reaching Vagana mandapam, 7.30 p.m.; purappadu in Aalum pallakku, 8 p.m.; reaching vagana mandapam, 9 p.m.; purappadu, 9.30 p.m.; reaching sanctum sanctorum, 9.45 p.m.\n\nArulmigu Mariamman Temple, Samayapuram : Thai poosam festival, theerthavari at Vadathiru Cauvery, 6 p.m.; public darshan, 7 p.m.; receiving seer from Srirangam Ranganathar, 10 p.m.; maha abishekam, 1 a.m. (the next day)\n\nSri Andal Thirupaavai Mahotsava Sabha : Thirupaavai mahotsavam, Sri Vedanata Desikan Sannidhi, discourse by Veerapuram Sri Sampath Dikshithar, Srirangam Srimad Andavan Ashram, North Chithirai Street, Srirangam, 10 a.m.; discourse by Sri H.R.Sridharachariar, 11 a.m.; discourse by Sri G.S.Rajagopalachariar, noon.\n\nHindu Samaya Mandram: Sri Radha Kalyana mahotsavam, Sampoorna Narayaneeyam parayanam, 30 Rajaji Street, Renga Nagar, Srirangam, 8.30 a.m.; discourse on Rukmani Kalyanam by N.Rama Diskshithar, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha : Sri Vishnu Sahasranama parayanam, Nachiyar Kovil, Woraiyur, 6 p.m.\n\nCULTURE\n\nSri Sathguru Thiagabrahma Aradhana Trust and Sri Sathguru Sangeetha Sabha : Inauguration of 169th aradhana celebrations of Sathguru Sri Thiagaraja Swamigal, Rama Varma, inaugurates, S.Gopinath, Executive Director, BHEL, Tiruchi, presides, release of pictorial biography of Alathur brothers authored by Lakshmi Devnath, Kodiyalam Seshadri Iyengar Kalyana Mandapam, South Devi Street, Srirangam, 6.15 p.m.; vocal concert by Sri Rama Varma and party, 7.30 p.m.\n\nGENERAL\n\nDistrict Administration : Public grievances meeting, K.S.Palanisamy, Collector, presides, Collector’s Office, 10 a.m.\n\nTiruchi Corporation : Civic grievances meeting, A.Jaya, Mayor, presides, Corporation Office, 11 a.m.\n\nRotary Club of Tiruchi: Meeting, Bharathi, speaks, Hotel Femina, 6.30 p.m.\n\nNational College Department of Tamil : Dr. N. Seshadri endowment lecture on Sanga Tamizhisai by T.Kanagasabai, head, Department of Performing Arts, Bharathidasan University, 11.30 a.m.; 3 (TN) Air Squadron (Tech) National Cadet Corps: Release of blood donors directory supplement, M.Jothimani Ilangovan, Assistant Director (programme), All India Radio, Tiruchi, chief guest, 10 a.m.\n\nShrimati Indira Gandhi College : Valediction of international conference on Clinical Research, C.Thirupathiraja, research associate, Stanford School of Medicine, speaks, S.Kunjithapatham, college secretary, presides, 4.45 p.m.\n\nJ. J. College of Engineering and Technology : NSS wing, special camp, Alampatti, 10 a.m.\n\nShivani College of Engineering and Technology : National Voters Day, essay competition, P.Selvaraj, college chairman, presides, 4 p.m.\n\nNehru Memorial College, Puthanampatti : Seminar on Perspectives in research forum on cloud computing and big data analytics, S.Bhuvaneshwari, Head, Department of Computer Science, Pondicherry University, Karaikal campus, speaks, 10 a.m.\n\nPeriyar College Pharmaceutical Sciences : Valediction of NSS special camp, K.Chandrasekaran, Assistant Director, Drug Control, chief guest, Appathurai village, 5 p.m.\n\nKongunadu College of Engineering and Technology, Tholurpatti : Lecture on Seismic response control using base isolation strategy by S.Keerthana, assistant professor, 5 p.m.\n\nJamal Mohamed College: Botany Association, Lecture on ‘Organic farming -- the way of life’ by H.D. Subashini, from Holy Cross College and on ‘Natural farming’ by G. Sither, natural farming expert, Syed Hyssainudeen Hall, 10 a.m.\n\nShrimati Indira Gandhi College : Department of Biochemistry, Valediction of conference on ‘Clinical research’, C. Thiruppathiraja, from Stanford University, delivers valedictory address and releases proceedings of conference, S. Kunjithapatham, secretary, presides, K. Santhanam Auditorium, 4.45 p.m.\n\nJ.J.College of Engineering and Technology : Inauguration of NSS special camp, K.Ponnusamy, college chairman, presides, Alampatti, 9 a.m.\n\nHoly Cross Matriculation Higher Secondary School : National Integration, R-Day celebrations, Suka Asanam, S. Ganesamurthy, Assistant Commissioner of Police, distributes certificates, School campus, 9-30 a.m.\n\nDepartment of Information and Public Relations : Government exhibition, St.John’s Vestry Anglo Indian Higher Secondary School grounds, 4 p.m.", 
    "section": "national", 
    "title": "tiruchi today", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}