{
    "author": [
        "Special Correspondent"
    ], 
    "text": "A day-long training programme for teachers highlighted the steps to be taken for putting an end to child sexual abuse in educational institutions.\n\nThe training programme was organised by the Salem chapter of the Young Indians (Yi) of the Confederation of Indian Industry under ‘Project Masoom’.\n\nThe best way to stop child sexual abuse is to talk about it, Ketan J. Vora, Director, ‘Project Komal’, an initiative of the Salem chapter of Young Indians, said.\n\nThe project was inspired by an episode of Satyamev Jayate , a talk show hosted by actor Amir Khan, focuses on spreading awareness about child sexual abuse in schools. The project is supported by the local branch of Childline India Foundation, which is in charge of intervention and rehabilitation through its helpline service ‘1098’.\n\nChildren should know what is ‘good’ touch and ‘bad’ touch,” said Ms Lakshmi Siddharthan, Director, TMS Eye Hospital.\n\nRather than going into the root causes, the project focussed on creating a basic awareness about child sexual abuse, as the perpetrators were usually known to the victims. The Yi plans to screen an animation film titled ‘Komal’ on the subject followed by group discussions with student volunteers.\n\nThiyagarajan, Childline City Coordinator, Tiruchi, addressed the session on the salient features of ‘Project Masoom’.\n\nHe said that that child sexual abuse is very much in the closet. In the past, the teachers are unwilling to talk about it.\n\nThe school managements were worried about the backlash from parents.\n\nBut the situation has changed of late, he said. At present there is good response from the schools and this proved the success of the ‘Project Masoom’.\n\n‘The best way\n\nto stop child\n\nsexual abuse\n\nis to talk\n\nabout it’", 
    "section": "national", 
    "title": "Training for teachers to check child sexual abuse in schools", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}