{
    "author": [
        "D Suresh Kumar"
    ], 
    "text": "The suspected suicide of three girls of a private naturopathy and yoga college in Villupuram district allegedly unable to withstand the institution’s monetary exploitation, bears testimony to the unfettered manner in which self-financing colleges function in Tamil Nadu.\n\nThere has been no tangible crackdown on financial exploitation of students by private colleges, including collection of capitation fee for the past decade.\n\nOn Sunday, the relatives of the girls and their classmates narrated how the SVS College of Naturopathy and Yoga Science that reportedly lacked in academic and infrastructural facilities, charged exorbitant fees, but issued receipts for lesser amounts.\n\nAlthough a Fee Regulation Committee headed by a retired judge of the High Court, constituted as per the directions of the Supreme Court in the Islamic Academy of Education case in 2003, fixes the maximum fee that could be collected by an institution, the fee structure remains on paper in a number of colleges. Complaints to authorities have often gone in vain as in the instant case where the then Villupuram Collector failed to take concrete steps to deal with complaints lodged by students.\n\nThe only time the State witnessed strong and persistent action against errant engineering colleges was during 2002-05 when Prof. E Balagurusamy was the Vice-Chancellor of the Anna University. He took proactive measures like conducting periodic surprise inspections and encouraged students to lodge complaints.\n\n“Colleges that refused to maintain minimum standards or fleeced students were disaffiliated and the students were transferred to other institutions. You don’t see such action now,” recalls a professor. It has been a while since the Fee Complaint Cell for monitoring engineering colleges has been active on the ground. “During the erstwhile DMK regime and also in the early years of this government, members of the Fee Complaint Cell did go on much publicised inspections of colleges to deal with students’ complaints. But many of these cases were never pursued to their logical end,” points out an academic.\n\nUnfortunately many of them are beyond the purview of central regulatory authorities and are affiliated to State universities. Quite a few politicians pressure the universities to grant affiliation to the colleges,” says Prof M. Anandakrishnan, an eminent academician and former Vice Chancellor, Anna University.\n\n“I won’t say this exploitation happens due to a lack of will. Sometimes it is due to available willingness, in the sense that they (authorities) simply close their eyes (to the exploitation). The public unfortunately is not organised enough to raise its voice against incompetent institutions and fleecing unlike in the case of Hyderabad (suicide of Dalit scholar Rohith Vemula),” adds Dr Anandakrishnan.", 
    "section": "national", 
    "title": "Victims of fleecing by self-financing colleges", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}