{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Corporation using its Bharathi Park yard for repairing bins, storing waste and parking septic tank and waste carrying lorries has troubled residents of the area.- Photo: S. Siva Saravanan\n\n: Lorries with and without waste move in and out of the Coimbatore Corporation’s yard behind Bharathi Park. Strewn around the yard are damaged bins and sacks containing paper and plastic waste. Workers are busy repairing the bins and the drivers parking the vehicles.\n\nComplaints\n\nOutside, the residents of Jawahar Nagar complain that the activities in the yard have affected their daily life.\n\nThe residents allege that the ITC that uses a portion of the yard for sorting waste collected from wards in West and Central zones has dumped tonnes and tonnes of waste without removing them and in the event of fire, the consequences will be unimaginable.\n\nS. Jayachandran, a resident, also wants to know if the Corporation can allow a park to be used as a waste segregating hub. The residents also complained that the Corporation was using the yard to wash septic tank cleaning lorries and bins. This creates foul odour, they say.\n\nAdding to the woes is the sound from hammering bins during the repair process is equally disturbing.\n\nThe Corporation’s activities have spoilt the enviable residential locality that Jawahar Nagar and Bharathi Park was, rues Saradha Murthy, another resident.\n\nThey want the Corporation to not allow ITC to use yard for waste segregation and storage and stop parking septic tank cleaning lorries and also repairing bins.\n\nSources in the ITC denied the company’s role in waste segregating and storing waste.\n\nCorporation officials say that following complaints, they have asked ITC’s Wealth out of Waste team to remove the plastic and paper waste.\n\nThe Corporation officials also say that they have instructed lorry drivers not to wash lorries and bins there so that the odour does not trouble residents.", 
    "section": "national", 
    "title": "Waste segregating hub at Bharathi Park troubles residents", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}