{
    "author": [
        "M K"
    ], 
    "text": "According to the Consumer Protection Act, 1986, cases listed in the District Consumer Dispute Redressal Forum (also referred as consumer court) should be redressed in 90 days to help consumers get justice without delay. But, nearly 800 cases have piled up at the forum in Coimbatore as the post of president is lying vacant for more than seven months.\n\nPending cases\n\nCases pending before the forum pertain to issues related to construction, insurance and medical claims, medical negligence, loan, dishonouring cheques, deposit claims and poor maintenance of consumer goods.\n\nPanel\n\nThe redressal forum here was established in 1991 and functioned at the district court premises before it was shifted to the Collectorate in 1993.\n\nThe forum, with a panel of three persons, is headed by the president – a retired district judge who holds office for five years or till he turns 65 years old, which ever is earlier.“Two others, including a male social worker or advocate and a female social worker are members. The forum here has two members and the post of president is vacant from June 4, 2015, after the then president Ramarajan retired,” S. Radharamanan, president of the Coimbatore District Consumer Lawyers Association said.\n\nTenure\n\nThe last president of the forum here was initially president of the forum at Erode and in-charge of Coimbatore from October 2014, before he was made the president for Coimbatore from January 2015. During his tenure for the next five months he was in-charge of The Nilgiris. He travelled to Udhagamandalam every Friday.\n\nThe process of appointing a president begins only after the current president retires. “Till then, the president of the forum in the near by district is posted in-charge of the vacant position. But we have not got an in-charge president too,” Mr. Radharamanan said.\n\nSecretary of Coimbatore Consumer Cause K. Kathirmathiyon said that last week they have written to the Registrar of the State Consumer Redressal Commission, Chennai, to fill up the vacancy.\n\n“Recently, a president has been appointed for the forum in The Nilgiris where only about 50 cases were pending,” he said.\n\nIt is learnt that more than 50 new cases came to the forum every month when it had a president. Now, around 35 cases are added every month. While some cases are settled in the stipulated period of three months, number of cases went on for up to two years.\n\nConsumer lawyers and activists sought appointing a president in-charge here till the appointment of a full time president.\n\nNearly 800 cases have piled up as the post of president is lying vacant for more than seven months", 
    "section": "national", 
    "title": "Without president, cases pile up at consumer dispute redressal forum", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}