{
    "author": [], 
    "text": "Malladi Krishna Rao, Yanam MLA, on a padayatra for the welfare of his constituency.— Photo: Special Arrangement\n\nAfter Rajya Sabha election Malladi Krishna Rao’s stand vis-à-vis AINRC is yet to be known\n\nYanam MLA Malladi Krishna Rao seems to have taken an advance step to face Assembly polls. Mr. Rao who was keeping a low profile after AINRC president and Chief Minister N. Rangasamy deftly avoided giving him a Rajya Sabha ticket. While his supporters and other observers have been anxiously watching his next move, the Yanam MLA has launched a four-day 105-kilometre Paadayatra from Yanam to Antarvedi temple situated on the banks of Godavari with thousands of his followers for the welfare of people of Yanam. Many view this as a kick start to his campaign ahead of Assembly election.\n\nLast January Yanam MLA called upon the fishermen community to support Mr. Rangasamy, in the forthcoming elections.\n\nProjecting that Mr. Rangasamy would come to power as Chief Minister after 2016 Assembly elections, Mr. Rao has dropped indications that he could join the AINRC. At present Mr. Rao’s stand vis-à-vis AINRC is yet to be spelt out.\n\nSeason of sieges\n\nLast week a few of government offices witnessed strange scenes with pensioners squatting inside the offices of top level officers. Municipality pensioners laid a siege to the office of Local Administration Director on Thursday urging to implement their charter of demands.\n\nOver 80 pensioners staged a demonstration before the office for a while. Then entered into the chamber of Local Administration Director and sat in his chamber. They alleged that they were not paid retirement benefits, commutation, gratuity, leave salary and other benefits since 2011.\n\nMeanwhile, the pensioners of Bharathi Mills laid siege to the office of general manager. They alleged that they were not paid retirement benefits for three years.\n\nCreative carvings\n\nVisitors to the 30th Flower, Vegetable and Fruit show cum Farm Fest 2016 were treated to a riot of colours with variety of roses and a host of hybrid varieties.\n\nWhile creative patterns with flowers and vegetables have always delighted visitors, it was a first for the event organised by the Department of Agriculture to feature carvings based on landmarks or famous personages. Some of the vegetable carving exhibits were modelled on the Aayi mandapam, state emblem of Puducherry, former President A.P.J. Abdul Kalam, Mother Teresa and other leaders.\n\nNearly 150 varieties of flowers including imported mocara orchids and plants were kept on display at the show.\n\nBy R. Sivaraman and\n\nS. Prasad", 
    "section": "national", 
    "title": "Yanam MLA walks all the way to face polls", 
    "subsection": "tamilnadu", 
    "date": "2016-01-25"
}