{
    "author": [
        "Staff Reporter"
    ], 
    "text": "HCL Technologies Limited (HCL), which is launching its paid-training programme here with an assurance of job in the company, said that it is aiming to create 3,000 to 4,000 jobs in the next three years in Madurai.\n\nIn an interaction with media, Srimathi Shivashankar, Associate Vice President with HCL, said that the recruitment would be done only from Madurai and surrounding districts, apart from a few exceptions for senior positions.\n\nShe said that this was part of the commitment made by HCL during the recent Global Investors’ Meet.\n\n“The first training batch commencing on March 4, which is likely to have around 250 trainees, will have people only from Madurai district. In the subsequent batches, we will extend it to nearby places,” she said.\n\nShe said that the company would also provide job opportunities for those with experience. “Many people working in metro cities want to return closer to their hometowns. There are also women, who might have quit their jobs for family reasons and want to re-start their career again,” she said.\n\nHCL said that engineering graduates with specialisation in any streams could apply for the training with no limitation on age. Applicants selected after an interview, which according to Ms. Srimathi, would test their learnability, have to pay Rs. 2 lakh for the six month training programme.\n\nFirst three months of training will be at the HCL Training and Staffing Services (HCL TSS) campus in Madurai and the next three months of on-the-job training will be at the upcoming HCL office inside ELCOT IT Special Economic Zone (SEZ) Park at Ilanthaikulam.\n\n“Most people who are applying now are graduates who passed out a couple of years ago but could not find a job,” she said.\n\n“Those who clear the training will be placed at Madurai HCL with an initial salary of Rs. 1.54 lakh per annum”, Ms. Srimathi said.\n\nOn salary being comparatively lesser than metro cities, she said that the cost of living in smaller cities is also relatively low.\n\n“Moreover, this is for the entry level. The salary will be increased subsequently,” she said.\n\nShe said that the recruited people will be involved in IT and IT enabled services, which will mainly include product development and infrastructure management.", 
    "section": "national", 
    "title": "3,000 to 4,000 jobs will be created in three years: HCL", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}