{
    "author": [], 
    "text": "45-year-old victim, whose headless body was in a trunk on a train at Central, is yet to identified\n\nIt has been over four years since the headless body of a man was found in a train at Chennai Central railway station, but the police have been unable to get a lead or even identify the victim.\n\nThe victim’s hands and legs were tied and the body was found inside an abandoned trunk in an unreserved compartment of Grand Trunk Express that reached Central station from New Delhi in March 2012.\n\nAn investigating policeman recalls that they noticed the body when they checked the luggage at the scanning equipment.\n\nThe victim was 45 years old and was wearing a T-shirt. The police investigated the murder case from all possible angles, but they are yet to make a breakthrough. “We asked for a missing persons list from Madhya Pradesh, New Delhi and neighbouring States to identify the victim. We also tried to identify the body using the brand of the T-shirt he was wearing.\n\nThe CCTV footage of all the stations between Chennai and New Delhi was also collected. We also co-ordinated with the New Delhi police,” he says.\n\nHowever, the police were not able to crack the case. “In 2014 it was transferred to the local police for further investigation, but it has not helped,” the officer adds.\n\nStone-throwing menace continues\n\nDespite a crackdown on miscreants by the railway police, incidents of stones being thrown at suburban and long-distance trains continue. Absence of illumination at some spots is reported to be the reason.\n\nThese incidents cause anxiety for commuters and the police personnel. In a recent incident, a passenger on Nellai Express was injured. Railway Protection Force (RPF) sources said a miscreant hurled a stone at the train, which left a passenger injured.\n\nA few weeks ago, a similar incident was reported on a suburban train. Though no one was injured, government railway police (GRP) combed the area. Officials suspected youth to be involved in the incident, in which ballast stones were thrown at the train.\n\nA senior GRP official said they picked up a few minors and let them off after a warning. “People who throw objects at trains risk a prison term if found guilty,” he said and appealed to people who come across miscreants indulging in such acts to contact the GRP. The official said that if the suspects are children, they would be counselled.\n\n(Reporting by Vivek Narayanan and T. Madhavan)\n\nNote: Starting this week, Police Patrol will appear every Wednesday", 
    "section": "national", 
    "title": "4 years on, police yet to crack murder case", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}