{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The water in the Singanallur tank does not reflect the sky in its true colour as it has a green tinge. The 155-acre tank is, of course, free of water hyacinth.\n\nThe Coimbatore Corporation removed them sometime in 2014-15.\n\nIt had spent Rs. 30 lakh to remove the weed, and refurbish the boat house with the objective of launching boating service and also promoting water sports.\n\nThe corporation had planned a tie-up with the Sports Development Authority of Tamilnadu (SDAT) to promote canoeing.\n\nBut in the 12 months since the inauguration of the boat house in January 2015, there has been very little boating in the tank.\n\nChildren visit the boat house in the evenings to play in the park, says a security personnel there.\n\nSources in the Coimbatore Corporation say that the civic body was on the verge of inking an agreement with the SDAT but administrative changes in the latter delayed things.\n\nTo date, there has been no progress.\n\nThey also say that the before introducing boating service, the corporation had wanted to clean the sewage flowing into the tank by building a small sewage treatment plant.\n\nThis too has been pending.\n\nThe corporation had proposed the plant with the capacity to treat 2 million litres (of sewage) a day flowing in from the Sanganoor Canal and sent it to the State Government but there has been no progress thereafter.\n\nMayor P. Rajkumar says that he is following up on the issue with the idea of promoting canoeing first and then throwing open the boat house to the public for recreation.\n\nEnvironment activists say that the first objective is to treat the sewage flowing into the tank because sewage is what aids the growth of the water weeds.\n\nAt present, water hyacinth is in the Sanganoor Canal, near the mouth of the tank.\n\nIn sometime, it will grow into the tank, negating the good wood the corporation had done.\n\nTherefore, STP should be the priority.\n\nCorporation officials say that they are hopeful of developing tank sooner than later as it is part of the Smart Cities project’s area-based development initiative.", 
    "section": "national", 
    "title": "A boat house without boats", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}