{
    "author": [
        "Deepa H"
    ], 
    "text": "Among a raft of projects, estimated to cost over Rs. 1000 crore, for which Chief Minister Jayalalithaa recently laid the foundation stone, are three grade separator projects in the city, which promise to benefit immensely residents of the surrounding areas.\n\nWelcoming the proposals, residents have said the Highways Department must ensure that the works are executed within the stipulated time.\n\nChinmaya Nagar resident T. N. Harashankar recalled that it had been several years since the flyover at Kaliamman Koil Street had been proposed.\n\n“If I am right, it was sometime in 2011. It has taken the department more than four years to actually begin implementing the project,” he said, adding that residents were hoping that an arm of the flyover would land in Kaliamman Koil Street.\n\n“This is an important road connecting Jawaharlal Nehru Salai and Arcot Road and traffic is quite heavy,” he explained.\n\nResidents of Velachery, who have been witnessing an increase in traffic after the opening of a mall, want an end to the congestion and the long wait at the Vijayanagar junction.\n\nA long-time resident of Velachery, S. Kumararaja, suggested that it would be advisable for the department to take up work on one flyover at a time in Velachery.\n\n“After the Phoenix mall came up, the number of vehicles taking the Velachery Bypass Road has increased considerably. There is also quite a bit of movement from and to the MRTS station. If the flyover from the bypass is completed first, it would help reduce congestion at the Vijayanagar junction considerably,” he said.\n\nResidents of Medavakkam are happy that the flyovers announced in the 2012 budget are finally being constructed. A resident of Vadakkupattu Main Road, J. Venkitachalam, said that since vehicles from the three sides were pouring into the Medavakkam junction, sometimes, motorists had to wait for up to 45 minutes to cross the signal.\n\n“It is a bottleneck and once the flyovers are completed, it will help reduce waiting time, especially for those from IT companies on the Sholinganallur side,” he said.\n\nHighways department sources said that contractors had been told to complete the projects within the stipulated time.\n\n“We have already taken steps to shift electrical poles, transformers and other service lines,” said an official.", 
    "section": "national", 
    "title": "A lot of hope riding on three grade separators", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}