{
    "author": [
        "S Vijay Kumar"
    ], 
    "text": "With past budgets flattering only to deceive, the expectations are muted\n\namil Nadu has not got its due share in railway projects over the years resulting in backlog of development and the Centre is committed to correct it.” These were the words of Union Railway Minister Suresh Prabu when he came to Chennai to launch new services recently.\n\nIt is a fact that despite having a Union Minister of State for Railways for about 10 years, Tamil Nadu has not made significant strides in railways compared to other States.\n\nBetter coaches, faster trains and modern amenities continue to be the basic demands though new lines and expeditious completion of ongoing projects are also a priority.\n\nFor more than a decade now, passengers in the southern districts of Tamil Nadu have been pressing for a double broad gauge (BG) line with electrification in the Chennai-Nagercoil route, which is the highest revenue-generating corridor in the southern BG stream. Officials say the project is nearing completion between Chennai and Madurai, which will pave the way for operating more trains including high-speed expresses.\n\nIn the southern districts, a few important railway projects that would serve the people in more than one way have been either put on the backburner or their execution has been progressing at snail's pace. An example of this is the Virudhunagar-Tenkasi-Shencottah-Punalur-Kollam gauge conversion work that has been going on for nearly two decades.\n\nThe Madurai-Bodi section, one of the last routes on the metre gauge in Tamil Nadu, was closed in 2011 for gauge conversion. However, the work is yet to begin for want of funds.\n\nThe delay in completing the Villuppuram-Madurai doubling work has been holding up introduction of additional trains on the already saturated single-line section connecting the southern districts with Chennai.\n\nIn the central region, introduction of Tiruchi-Bengaluru and Thanjavur-Chennai inter-city express trains is a constant demand of the people. A. Giri, member of Divisional Railway Users Committee based at Kumbakonam, says there is a need to set up a Rail Yatri Nivas in the pilgrim town of Kumbakonam and also establish coach maintenance facilities there.\n\nPassengers and traders in Coimbatore region want a daily train to Shimoga via Bengaluru. Currently, passengers rely on buses or try their luck with the meagre quota of berths available in three trains from Kerala that pass through Coimbatore.\n\nCompletion of the Podanur–Pollachi gauge conversion and restoration of the rail connectivity between Coimbatore and southern districts would do immense good to the migrant population from the South that is settled in the western part of the State.\n\nIn Puducherry, people demand that the railways accord priority to projects such as the new line linking Chennai, Cuddalore, Mahabalipuram and Puducherry. They also expect better connectivity between Puducherry and other regions such as Karaikal, Mahe and Yanam. They have also urged the Union Railway Minister to introduce a daily express train between Puducherry and Chennai.\n\n(With inputs from S. Sundar in Madurai, R. Rajaram in Tiruchi, V.S. Palaniappan in Coimbatore and R. Sivaraman in Puducherry)", 
    "section": "national", 
    "title": "A train of long-pending demands", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}