{
    "author": [
        "V S"
    ], 
    "text": "The pachyderms were provided nutritious diet, treatment for various ailments\n\nTemple and mutt elephants lined up for special pujas marking the end of the 48-day-long state-sponsored rejuvenation camp at Thekkampatti on the banks of river Bhavani in Mettuppalayam on Tuesday.\n\nThe 31 temple and mutt elephants that took part in the State-sponsored elephant rejuvenation camp along the banks of the Bhavani at Thekkampatti near Mettuppalayam started returning on Tuesday evening.\n\nThe eighth rejuvenation camp began at Thekkampatti on January 7. Two of the elephants were from Puducherry — Lakshmi (25) of Manakula Vinayakar Temple and Prakruthi (12) of Thirunallaru temple. Abhirami (11) of Thirukkadaiyur Amirtha Kadeswarar Temple attended the camp for the first time.\n\nIn the initial years, the government used to hold the camp at Mudumalai in The Nilgiris. Considering the long travel for the pachyderms in the ghat section, the camp was shifted to Thekkampatti in the last few years.\n\nAt the camp, the elephants were given nutritious diet as per the chart prepared by veterinarians depending on the gender, age, height and weight. The day would begin with a brisk morning walk, a bath in the specially erected shower along the river banks and puja. A team of dedicated veterinarians used to attend to the elephants for various ailments. Sivakami (48) belonging to the Thiruthalinathar Swamy Temple had wounds on its leg and is almost healed now. Sivakami continues to use the shoes that the rejuvenation camp had provided last time. Thirupparangundam Temple elephant Deivani (8) and Thirukurankudi Temple elephant Valli (24) were treated for sleep disorders.\n\nMahouts and cavadis have been provided with a health chart and diet for each elephant and asked to maintain the health of the pachyderms.\n\nOn Tuesday, marking the valediction of the camp, the pachyderms were given a bucketful of fruits, including apple, pineapple, water melon, sugarcane and jaggery by Commissioner for Hindu Religious and Charitable Endowments M. Veerashanmugamoni and his team of officers.\n\nSimilarly, the 48-day long rejuvenation exercise for camp elephants of the Forest Department also came to an end on Tuesday.\n\nAt Theppakadu in Mudumalai Tiger Reserve, of the 24 camp elephants (trained/tamed), 16 of them took part in the valediction while the rest eight abstained either due to sickness or musth.\n\nAt Anamalai Tiger Reserve, 22 camp elephants took part in the valediction and Field Director V.T. Kandasamy presented Rs 1,500 cash incentive to the cavadis and mahouts Arumugam and M. Manian for the best training that they had imparted to elephants Saravanan and Abhinaya.\n\nIn Coimbatore, the rejuvenation camp at Chadivayal at the foothills of Siruvani came to an end for Pari, Sujay and eight-year-old elephant Masini.\n\nOn completion of the camp, Masini allocated for Samayapuram temple is being sent to the temple by a truck tonight.\n\nWith the camp having come to an end, elephant safari at Mudumalai and Anamalai is expected to begin from Thursday.", 
    "section": "national", 
    "title": "After 48 days, elephants leave camp rejuvenated", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}