{
    "author": [
        "M K"
    ], 
    "text": "A 76-year-old French national, who accidentally fell off from a moving express train late on Monday night, was found injured on the railway track near the Nanjundapuram over bridge on Tuesday morning. The victim identified as Cameroon, who suffered a fracture on his shoulder and a head injury, was rescued by loco pilot who crossed the section six hours later.\n\nRailway police sources said that the man had come to India with his wife Arzona (74) and daughter Zona (46) a few days ago. On Monday evening they boarded the train at Kochuveli (near Thiruvananthapuram) to Yeshwantpur in Karnataka. They wanted to make a trip to Puttaparthi in Karnataka, for which they boarded the train.\n\nThe train crosses Coimbatore around 1.35 a.m. and reaches Yeshwantpur around 9.30 a.m. His family realised that he was missing and informed the railway police at Kerala and Karnataka.\n\nKerala Railway Police informed their counter parts to check if he was found stranded or if he had accidentally fallen off the train.\n\nMeanwhile, around 7.30 a.m. Sujay (37), a loco pilot, taking oil tankers saw a man motionless close to the railway track on the opposite direction and stopped his train. Realising that he was alive, he took the victim in the guard van and also alerted the Podanur Railway Police.\n\nAn ambulance was ready by the time the train reached the station and rushed him to Coimbatore Medical College Hospital. Hospital Dean A. Edwin Joe said the foreign national was under treatment in the trauma ward and his condition was stable. He said that Mr. Cameroon would be under observation in the trauma ward for one more day and shifted to the general ward.\n\nPolice said that there was difficulty communicating with him as he was injured. With the details and contact numbers available in his purse they managed to inform his family. They suspected that he could have accidentally fallen down.", 
    "section": "national", 
    "title": "Alert loco pilot saves life of foreign national", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}