{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Their inherent inquisitiveness was appreciated as the very foundation for innovative breakthroughs that win Nobel Prizes by none other than accomplished scientists themselves in a serene atmosphere for research they never had imagined of!\n\nAs many as 140 academically-brilliant Plus-One students, including 10 from government schools, had a head-start in pursuing science research on the very first of the five-day DST-INSPIRE (Innovation in Science Pursuit for Inspired Research) Internship Science Camp at the Bannari Amman Institute of Technology, Sathyamangalam, on Tuesday by way of hands-on training in physics, chemistry, mathematics and biotechnology laboratories.\n\nFor the rest of the training duration, the students belonging to schools spread over Erode, Coimbatore, Tirupur, Karur, and The Nilgiris who were chosen on the basis of their sterling performance in SSLC will be expanding their horizons of thinking through taking part in science quiz and brainstorming interactions with a team of mentors drawn from Indian National Science Academy, Madurai Kamaraj University, Bharathiar University, Bharathidasan University, and Anna University.\n\nAdvocating precedence for learning over studying, Senior Scientist at Indian National Science Academy T.J. Pandian, a Bhatnagar Awardee (1984) in Biological Sciences, and one among the 10 mentors, believed that such programs in stimulating atmosphere provide the apt platform for students to hit at path-breaking innovations to address emerging challenges confronting mankind such as chickungunya and zica.\n\nChoice of India, owing to its ancient richness in several spheres of knowledge, by countries worldwide for guidance reflects India's eminence as a fertile ground for research and innovations, said P.R. Krishnakumar, Chancellor of Avinashilingam University, Coimbatore, who was the chief guest for the inaugural session.\n\nReferring to the inadequacy of the education system due to little space it offers for original thinking, and the ready availability of information in online and electronic formats, Dr. Krishnakumar, who is also the managing director of the Arya vaidya pharmacy (Coimbatore) Limited, said the onus was on learners to chaff out wisdom from knowledge. Waking up early in the morning was vital for success, Dr. Krishnakumar stressed.\n\nPresiding over the inaugural session, BIT chairman S.V. Balasubramanian who received the first copy of the souvenir from the Chancellor said it was vital for India at this juncture to make the most of the demographic advantage of having a relatively higher composition of youth population. Mr. Balasubramaniam said India was increasingly being viewed as the ultimate destination by many countries seeking to bolster scientific and technological manpower.\n\nK. Duraisamy, District Educational Officer, Gobichettipalayam, said inspiration for scientific achievements must necessarily be backed by persistent efforts.", 
    "section": "national", 
    "title": "Best brains brought together for inspired research", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}