{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Sports tourism should be promoted at the Race Course in Udhagamandalam, says the Nilgiri Documentation Centre.\n\nThere was a time when the hill station attracted many sports enthusiasts. The honorary director of the centre, Dharmalingam Venugopal recalled that love for sports was promoted in Udhagamandalam by the British.\n\n“Englishmen brought gymkhana, polo, cricket, boating, tennis, shooting and horse racing to The Nilgiris. They also invented the game of snooker here,” he said. Football, cricket, and especially hockey continued to be popular throughout the district.\n\nThe district has produced legendary football and hockey players in the 1950s and 60s and was selected as the acclimatisation centre for the Indian contingent to the 1968 Olympic Games, in Mexico.\n\nChampionships\n\nUdhagamandalam has hosted several national championship events since then. But sports activities steadily declined over the last two decades due to lack of promotion, modernisation of sports facilities and sponsorship.\n\nStating that a proposal has now been made to set up a high altitude sports facility in The Nilgiris, Mr. Venugopal said that it should be done in a manner that will combine revival of local interest in sports and promote sports tourism. This would require a location in or around Udhagamandalam that was convenient and accessible.\n\nHe said that Race Course sprawling on over five acres of prime land in the heart of the town would be an ideal choice for such a facility. The present Race Course was not fully operational from 1900 and was always a multi-sports complex.\n\nEarlier, the race course housed an Archery, Badminton and Croquet (ABC) Club – a prominent land mark – which he says was pulled down without valid reason.\n\nMany national level tournaments were conducted in the Race Course grounds, he added.\n\nHe said that as horse races have become unviable and long ceased to have any tourist attraction, converting Race Course into a multipurpose complex was a good idea.\n\nMr. Venugopal also suggested that the sports authorities should consider taking over the sport facilities on the now defunct HPF premises. Promoting ‘Sports Tourism’ will be a part of the Voteforooty campaign during the coming elections, he added.", 
    "section": "national", 
    "title": "Call to promote ‘sports tourism’ in Ooty", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}