{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Judges express anguish over officials’ failure to attend to requirements of judiciary\n\nThe Madras High Court Bench here on Tuesday directed the Tirunelveli Collector to expedite the process of finding a suitable location for relocating Tenkasi Additional Sub-Court and Additional District Munsif Court, now functioning from a private building even after the expiry of the rental agreement entered with its 77-year-old owner in 2013.\n\nJustices S. Manikumar and C.T. Selvam warned the Collector of including the State government too as a party to a writ petition filed by the building owner and issuing appropriate directions if he did not take steps to relocate the courts at the earliest. The judges also expressed anguish over officials’ failure to attend to infrastructural requirements of the judiciary.\n\nAdjourned\n\nLater, the hearing on the writ petition was adjourned till Monday to enable a government counsel to obtain instructions from the Collector.\n\nIn his affidavit, the petitioner had stated that he could not take possession of his building, rented out for establishment of the courts, due to the inordinate delay by the district administration in finding an alternative location.\n\nThe petitioner’s counsel, A. Velan, pointed out that the petitioner had entered into a rental agreement with the Tenkasi Principal Sub-Court long back and renewed it once in every 11 months.\n\nHowever, since the property had to be partitioned between his legal heirs, the petitioner chose not to renew the agreement after its expiry on November 22, 2013 and sought possession of the building.\n\nRequest not honoured\n\nThe request was not honoured for want of an alternative building to shift the courts.\n\nReplying to one of his representations, the Principal District Judge had on September 18, 2014 said that a letter had been addressed to the District Collector to allot old Taluk Office buildings in Tenkasi for accommodating the two courts until the construction of new combined court buildings in the town.", 
    "section": "national", 
    "title": "Collector directed to expedite relocation of Tenkasi courts", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}