{
    "author": [
        "Sruthisagar Yamunan"
    ], 
    "text": "In a surprise move, the Congress high command has decided that interviews of ticket aspirants would be conducted in the respective districts, neutralising the role of senior leaders.\n\nThe interviews are scheduled for Wednesday. Many within the Tamil Nadu Congress Committee (TNCC) are worried that leaving the selection process to inexperienced functionaries might result in selection of inefficient candidates.\n\nA former MLA, on condition of anonymity, said there was confusion on what the rationale behind the decision was. “They have done it in reverse. While collection of applications was done in a centralised manner in Chennai, interviews have been decentralised. This shows complete disregard to electoral experience,” the leader said.\n\nSome in the party feel this was an attempt to avoid clash of factions in the selection process. In the past, each faction had demanded a quota based on the region the leader hails from. However, most district presidents belong to one faction or the other. “Now, they have appointed observers. Some of them have no standing in the party nor have they won elections. This idea may backfire as these leaders will try to form groups to establish themselves,” said another leader.\n\nThere is no clarity on whether the recommendations of the district committees would be final or if the filtering process would involve another round of interviews at the headquarters.\n\nPoor strategy\n\nMoreover, sources say that conducting the interviews before the party gets to know which seats it could contest in the DMK alliance was a poor strategy. “The entire process is a waste of time. If you select a person in the interview and later tell him that the seat has not been allocated, he will lose his morale and would probably walk out,” said a former MP.", 
    "section": "national", 
    "title": "Confusion in Congress as interviews shifted to districts", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}