{
    "author": [
        "Special Correspondent"
    ], 
    "text": "DMK and Congress councillors stage a walkout citing civic body’s lack of concern for people\n\nCouncillors of the ruling AIADMK and Opposition parties arguing during the Tiruchirapalli City Corporation Council meeting on Tuesday.— PHOTO: M. SRINATH\n\nhe Tiruchirapalli City Corporation Budget for 2016-17 came in for severe criticism from the Opposition parties on Tuesday with members of the Dravida Munnetra Kazhagam and the Congress staging a walkout protesting against the civic body’s failure to address people’s issues and execute many pending project proposals.\n\nParticipating in the discussion on the budget at the Corporation Council meeting, a cross-section of the Opposition councillors flayed the civic body for failing to identify a suitable site for an integrated bus stand over the past five years.\n\nM. Venkataraj (DMK) accused the corporation of failing to implement many projects announced in the earlier budgets over the past few years.\n\nThe civic body has not even been able to identify a site for the integrated bus stand and suggested that the corporation could have at least made efforts to get the Defence land adjoining the Central Bus Stand to expand it.\n\nResidents demand to shift the Ariyamangalam garbage dump has not been addressed.\n\nThere was no mention of the move to shift the Gandhi Market to the outskirts of the city, even after the recent agitation by the traders against a possible move to shift them to Kallikudi.\n\nSome wards in the city were still getting discoloured water and efforts had not been made to collect the tax dues mired in litigation, he said.\n\nThe ruling party members raised vociferous protests after G. Sathyamurthy (DMK), who alleged that the Budget documents of the corporation were just a compilation of pictures, with just cosmetic changes over the past few years.\n\nKavitha Selvam (DMK) criticised the corporation for failing to extend the underground drainage to uncovered areas in the city.\n\nThere was a severe shortage of sanitary workers and solid waste management was poor in the city.\n\nM. Kumar of the DMK and K. Sankar of the DMDK said attempts had not been made to regularise the unapproved layouts in the five wards that were added to the corporation consequent to delimitation a few years ago.\n\nTerming the budget as a document bereft of any tangible benefit to the city residents, K.S. Nagarajan led a walkout by the DMK councillors.\n\nThe lone Congress councillor R.Hema soon followed suit, raising similar complaints.\n\nM. Mohamed Mustafa of the MDMK said the Budget had not addressed the present and future requirements of the city. Injustice had been done to the city as it failed to make it to the Smart City project.\n\nRefuting the charges made by some DMK councillors, R. Gnanasekar, K. Abishekapuram zone chairman, maintained that there was no discrimination in the allocation of funds to wards represented by the Opposition.\n\nJ. Srinivasan, Deputy Mayor, faulted the Opposition for failing to read the budget properly and cited the move to build skywalks at a couple of places in the city and a few other projects as welcome initiatives.\n\nThe State government had been allotting adequate funds for taking up various projects in the city, he said.\n\nMayor A. Jaya said a decision on the integrated bus stand would be announced by the government. Steps had been taken to extend the underground drainage system to the uncovered areas under AMRUT scheme.\n\nThe corporation was focussing on improving solid waste management and other basic amenities for the people, she said.\n\nThe Deputy Mayor faulted the Opposition for failing to read the budget properly", 
    "section": "national", 
    "title": "DMK slams corporation budget", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}