{
    "author": [
        "B Kolappan", 
        "S Poorvaja"
    ], 
    "text": "Long before the battles are set to begin, it has begun. This one is a war of memes. Throwing memes at each other is how political parties are taking the first leg of their yet-to-begin election campaign.\n\nOn Tuesday, the front page advertisement released by the DMK across newspapers questioning what it termed Chief Minister Jayalalithaa’s failure to meet people triggered an avalanche of activity on the social media between supporters of the DMK and the ruling AIADMK.\n\nThe DMK advertisement titled “Mudiyattum! Vidiyattum!” (Let it be over! Let it be dawn) had alleged that Ms. Jayalalithaa could be seen only on television, banners and stickers in all the five years in office.\n\nThe tagline, ‘Ennamma Ipadipanreengalemma’, roughly translated as ‘Why are you doing this Amma?’, was first used in a television show by actor and director Lakshmy Ramakrishnan. Subsequently, it became the opening lines of a hit song of the film ‘Rajinimurugan’ starring Sivakarthikeyan, and has been the base content of a lot of memes circulating on social media.\n\nDMK treasurer M.K. Stalin also tweeted the advertisement.\n\nEven though the AIADMK has not responded officially to the campaign, supporters of the ruling party sought to turn the tables on the DMK, saying its leader M. Karunanidhi also failed to attend the Assembly.\n\nAnother poster alleged that Mr. Stalin did not visit his Kolathur constituency. “Have you seen his riding bicycle or inviting other to his family marriage or remaining in the Assembly for more than five minutes,” said a poster titled “Mudiyattum DMK! Vidiyattum Tamizhagathukku!” (Let DMK be finished. It's a dawn for Tamil Nadu)\n\nDMK spokesperson T.K.S. Elangovan justified the absence of Mr Karunanidhi in the Assembly, saying that the seating arrangement in the House would not allow him to enter the House. “Our leader never said he would not attend the House. There is hardly any space for the wheel-chair bound leader to enter the Assembly. He once openly declared that he was ready to come to the House if there was a proper seating arrangement, said Mr. Elangovan.\n\nHe dismissed as an ‘'utter lie’ the statement that Mr. Stalin had not visited his Kolathur constituency. “He is one MLA who made it a point to visit his constituency whenever it was possible. He had even created a toll-free number for the voters to express their needs,” added Mr. Elangovan.\n\nHowever, there were a section of DMK loyalists who did think that the campaign had backfired for them, after having spent a lot of money. Their contention was that the opposite versions of the memes were all released unofficially, and only on social media, costing virtually nothing.\n\nDMK holds interviews\n\nThe DMK leadership has started the process of interviewing aspiring candidates for the Assembly polls and the district secretaries are not allowed to be on the panel.\n\n“This time we have made a conscious decision not to allow them to ensure free flow of opinion from candidates. They will be tongue-tied if the district secretaries are present,” said a senior leader.\n\nWhile announcing the date for interview, the DMK leadership had made it clear that barring the district secretary, the presence of other office-bearers from the district was not allowed. It also urged the candidate not to bring recommendations supporting their candidature.\n\nDistrict secretaries were not allowed to sit in the interview but their opinions were taken into consideration, a cadre said.\n\nMemes against leaders of rival parties set the tone for election battle", 
    "section": "national", 
    "title": "DMK advertisement triggers a war of words with AIADMK", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}