{
    "author": [], 
    "text": "SALEM\n\nCentral Excise, Customs and Service Tax Commissionerate : Central Excise Day-2016, P. Jagdish, Additional Principal Chief Conservator of Forests, chief guest, S. Arokia Raj, Joint Commissioner of Central Excise, C. Thiyagarajan, Deputy Commissioner of Central Excise, speak, B. V. V. T. Prasad Naid, Commissioner of Central Excise, presides, Foulk’s Compound, Anal Medu, 5.30 p.m.\n\nTamil Nadu Iyal Isai Nataka Manram and Department of Art and Culture: Ramayanam festival titled 'Varna Kalanjiyam', Ambika Kameshwar troupe presents dance drama “Rama Kathamrutham”, Vijaragavachariar hall, Cherry road, 6.30 p.m.\n\nPeriyar University: Department of Biochemistry, national conference on ‘experiment therapeutics and clinical research’, S. Nagini, head, Department of Biochemistry and Biotechnology, Annamalai University, inaugurates, C. Swaminathan, Vice Chancellor, presides, 10 a.m.; M. Manivanna, Registrar, delivers valedictory address, 4 p.m.\n\nTangedco: Salem Electricity Distribution Circle, power consumers grievances day meeting, R. Manivannan, Superintending Engineer, SEDC, presides, office of the Executive Engineer, Salem South, 3 p.m.\n\nThe Kavery Engineering College, Mecheri: Department of Civil Engineering, seminar on ‘quality assurance in engineering education’, R. Anandharaj, CEO and co-founder, Webslash and Webtroy Technologies, Chennai, chief guest, 9.30 a.m.\n\nSona School of Management: Digital MBA and E-learning platform for MBA students, B. Krishnakumar, General Manager, Univercel, Chennai, chief guest, 10 a.m.\n\nVivekanandha Arts and Science College for Women, Sankagiri: Annual Day, V. Sampath, Collector, chief guest, M. Karunanithi, chairman, presides, 10 a.m.\n\nCommissionerate of Central Excise: Tax Payers Day, Foulk’s compound, Anal Medu, 9 a.m.\n\nNew Century Book House Limited: Book exhibition, Bose maidan, 9 a.m. to 9 p.m.\n\nMuslim Youth Federation: Zikr majlis, Mettu street, 9 p.m.\n\nNAMAKKAL\n\nTangedco: Power consumers’ grievances day meeting, Office of the Executive Engineer, Rasipuram, 3 p.m.\n\nGnanamani Educational Institutions: Campus recruitment drive by Campus Images, Coimbatore, T. Arangannal, Chairman, presides, 10 a.m.\n\nMahendra Engineering College: Department of Mechanical Engineering, S. Kumaresan, Associate Professor, National Institute of Technology, Tiruchi, speaks on ‘manufacturing techniques’, M. G. Bharathkumar, Chairman, presides, 10 a.m.; Department of Electrical Engineering: national level workshop on ‘energy auditing and energy efficiency’, Mahadevan, president, Tamil Nadu chapter of Society of Energy Engineers and Managers, Chennai, Dhamodaran, research scholar, National Institute of Technology, Tiruchi, and others speak, 10 a.m.; Department of Electronics and Communication Engineering: seminar on ‘digital image processing’, T. Balakumaran, Assistant Professor, Coimbatore Institute of Technology, resource person, 9.30 a.m.\n\nTIRUCHENGODE\n\nK. S. R. Institute of for Engineering and Technology: Mechanical Engineering Research Forum, M. Prabhu speaks on ‘Nanofluids and its applications: an overview’, 1 p.m.\n\nVivekanandha College of Engineering for Women: Department of Information Technology, ‘Ernesto-16’ national level technical symposium, M. Karunanithi, Chairman, presides, 10 a.m.; Department of Electrical and Electronics Engineering, entrepreneurship awareness camp, S. Kumaravel, Professor, Department of Electrical Engineering, National Institute of Technology, Tiruchi, chief guest, 10 a.m.\n\nAssociation of Mechanical Engineering of Sengunthar College of Engineering and Goodwin Motors, Chennai: Workshop on ‘design and vehicle dynamics’, 9.15 a.m.\n\nERODE\n\nSree Amman Arts and Science College: Valediction of workshop on 'Short Film Making', Founder of Sree Amman Educational Institutions T. Jayalakshmi, distributes certificates, felicitation by P.Thirunavukkarasu, Chief Editor, Nizal Film Magazine, 10 a.m.\n\nBannari Amman Institute of Technology: Workshop on 'Synthesis, Machining & Testing of Composite Materials, 9 a.m.; National Entrepreneurship Network's E-Week 2016 Celebration - Innovate Ideas for a Better World, 9 a.m.; NSS program SEVAYATRA 2016, 8.30 a.m.; IMPIRE 16 – State Level Technical Symposium, 9 a.m.\n\nNandha Engineering College: Signing of Memorandum of Understanding with San Techno Solutions, College Chairman V. Shanmugan presides, 2 p.m.; Student Development Program on 'Employability Skills' by K. Udhayakumar, Deputy Director, Centre for University-Industry Collaboration, Anna University, 2 p.m.; 'An Overview of FACTS Controllers, and Design and Stimulation Study of TCSC' by S. Jeevananthan, Professor, Pondicherry Engineering College, 1.30 p.m.\n\nErode Sengunthar Engineering College: 'Leaders Talk' by Prakash Reddy, IET GATE Academy, Hyderabad, on 'Awareness of Competitive Examinations', 2 p.m.; Knowledge sharing sessions on CNC Machine Functions, Hyper Loop Train and Intellectual Property Rights, 4 p.m.\n\nEBET Group of Institutions: Introduction to Japanese Language Training, 3.15 p.m.", 
    "section": "national", 
    "title": "engagements", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}