{
    "author": [
        "Walter Scott", 
        "D J"
    ], 
    "text": "Officials demonstrate how food items are adulterated\n\nFOR BETTER HEALTH:Collector S. Natarajan at the Food Safety Workshop organised at Ramanathapuram Collectorate on Tuesday. District Designated Officer M. Jagadish Chandra Bose is seen.— Photo: L. Balachandar\n\nThe district wing of Tamil Nadu Food Safety and Drug Administration Department organised a training-cum-workshop to enhance awareness of food safety from manufacturing to distribution to storage to consumer points among stakeholders.\n\nInaugurating the one-day programme held at the Collectorate here on Tuesday, Collector S. Natarajan said that the event aimed at sensitising food manufacturers, distributors and stockists to the need for providing safe, unadulterated and quality food to the consumers.\n\nHe said that after the Food Safety and Standards Act, 2006 came into force in August 2011 throughout the country, repealing the Prevention of Food Adulteration Act, 1954, the State government set up Tamil Nadu Food Safety and Drug Administration Department and implemented the new Act, making it mandatory for the food business operators to obtain licence.\n\nTo ensure food safety and standards of food items, food laboratories had been set up across the State, he said, and appealed to the manufacturers, hoteliers and traders to ensure that the consumers got safe and quality food items.\n\nM. Jagadish Chandra Bose, District Designated Officer, Food Safety Wing, in his address, detailed the provisions of the Act and dwelt upon the duties and responsibilities of the food business operators to provide safe and quality food items and prevent spread of food-borne diseases.\n\nHe exhorted the food business operators to adopt good manufacturing practices and advised the representatives of trade bodies and chambers of commerce to play the role of watchdog in the larger interest of consumers.\n\nThe workshop was an eye-opener to the consumers as the officials demonstrated how various food items such as pepper, ‘vadagam’, candies and cakes were subjected to colouring and adulteration. “I have decided to avoid drinking tea after seeing the demonstration of how tea dust was coloured and adulterated,” S. Ramesh, a consumer, said.\n\nA cross section of the consumers who attended the workshop said that it was unbelievable that even fruits such as watermelon and pomegranates were coloured with artificial substances, adopting injection method.", 
    "section": "national", 
    "title": "Enhancing awareness of food safety", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}