{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Farmers affiliated to various crop growers’ associations staging a demonstration in Tirupur on Tuesday seeking amendments to Petroleum and Minerals Pipelines (Acquisition of Right of User in Land ) Act.- Photo: R. VIMAL KUMAR\n\nDemanding amendments in the Petroleum and Minerals Pipelines (Acquisition of Right of User in Land) Act, farmers belonging to different associations staged a protest here on Tuesday.\n\nThe agrarian community was of the stance that the farm lands should not be used to lay underground pipelines to take natural gas from Kochi to Bengaluru as planned under the project of Gas Authority of India Limited (GAIL).\n\nS. R. Madhusoothanan, coordinator of Tamil Nadu Farmers’ Livelihood Protection Committee, which was fighting against the laying of gas pipelines through farm lands, said that the provisions in the Petroleum and Minerals Act forces the farmers not to raise crops that have deep root systems or construct borewells or any other buildings up to a certain distance from the tract along which the underground pipelines were laid.\n\n“Small and marginal farmers will be affected due to the existing provisions as they will be left with little cultivable space”, he said.\n\nThe farmers were of the opinion that the gas pipelines should be drawn alongside highways or stretches where farms were not there.\n\n“We will continue with our struggle on the issue. Compensation amount given to farmers for using their lands to lay gas pipelines were also extremely low”, they said.\n\nCoimbatore\n\nFarmers’ organisations, political parties and civil society activists on Tuesday staged a protest near the Coimbatore South Taluk office urging the State Government to actively pursue the case seeking review of the Supreme Court judgement in the GAIL pipeline issue.\n\nG.K. Nagaraj of the Kongunadu Jananayaka Katchi said that along with former MP P.R. Natarajan, leaders of other organisations and farmers’ leaders, the protestors had come together under the ‘farmers’ livelihood protection committee’ banner to also ask the Government to appoint a competent lawyer to fight the case.\n\nPlus, it was also to ask the Government to challenge the Petroleum and Minerals Pipeline Act, 1962, as the proposed alignment of the gas pipeline by GAIL would destroy livelihood of farmers in the region. He added that the protest was part of the agitations held in other parts of the State.", 
    "section": "national", 
    "title": "Farmers seek changes in Act", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}