{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The court had earlier dismissed the association’s petition challenging Madras High Court order\n\nFarmers Sangham has moved the Supreme Court to review the latter’s order in the Gas Authority of India Limited (GAIL) pipeline alignment issue.\n\nThe Supreme Court had on February 2, 2016 dismissed the association’s petition (and also that of the State Government) challenging a Madras High Court order that allowed GAIL to lay gas pipeline through fields in Coimbatore, Tirupur, Erode and other western districts in the State.\n\nIn its review petition, the farmers’ association has stated that GAIL had been selective in quoting the State Government’s order on compensation. One the one hand, the GAIL accepted a State Government recommendation for compensation to farmers through whose lands the pipeline was to be laid and on the other it questioned the Government’s jurisdiction over giving such a recommendation.\n\nThe association has also asked the apex court to consider the fact that the writ petition GAIL had filed in the Madras High Court challenging a State Government order for realignment of the pipeline was not maintainable under Article 12 of the Constitution of India.\n\nGAIL is a Central Government company under the Companies Act and therefore under Article 226 of the Constitution it cannot raise a dispute with the State Government.\n\nIt has pointed out to the apex court that the Madras High Court that had heard the GAIL appeal against the State Government order had failed to consider the fact that order was to consider realignment and not shelve the project. In fact, GAIL, which accepted the State Government order and participated in farmers’ meeting in the western districts in the State, failed to consider realignment. And this was contempt of court.\n\nThe farmers’ association has also accused GAIL of material suppression and said that the Madras High Court had failed to notice the abuse of court process by the company. It said that the company had suppressed the fact that it did not have authorisation to lay pipeline in Tirupur, Namakkal and Krishnagiri districts and had permission to lay pipeline only in Coimbatore, Erode, Salem and Dharmapuri districts.\n\nThe association had also pointed out to the court that GAIL issued notice to only 106 of the 456 land owners on whose land it wanted to lay the pipeline. It had omitted whole villages and none was put on notice.\n\nThe farmers had also told the Supreme Court that the Madras High Court had failed to notice the GAIL’s submission that farmers would not suffer was wrong. Land with a width of 20 metres from the pipeline would turn unusable as farmers should not grow crops on this land. Many farmers would lose the entire land because of this clause.\n\nFor those reasons, the Supreme Court was liable to reconsider/review its order on the issue as otherwise 5,500 farmers would be put to irreparable loss, it stated.", 
    "section": "national", 
    "title": "Farmers’ association moves SC to review GAIL pipeline alignment order", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}