{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Film directors Ameer, Karu Palaniappan and S.P. Jananathan coming out of the Vellore Central Prison for Men after meeting Perarivalan, a life convict in the Rajiv Gandhi assassination case on Tuesday. — Photo: C. Venkatachalapathy\n\nA.G. Perarivalan, one of the life convicts in the Rajiv Gandhi assassination case, has urged the Chief Minister to grant him parole to visit his 74-year-old ailing father.\n\nFilm director Ameer, who met him in the Vellore Central Prison for Men on Tuesday, said Perarivalan wanted to convey his birthday wishes to the Chief Minister, and is hoping to get parole on the occasion. His application seeking parole was sent to the government on February 8.\n\n“He wanted to meet us. Earlier this month, he had sought parole to meet his father, who has not been keeping well. As there has been no information on his application, he wanted us to bring it to the notice of the Chief Minister,” he told reporters. Directors S.P. Jananathan and Karu Palaniappan accompanied him during the visit.\n\nBasic right\n\nHe added that Perarivalan has not sought parole during his 25 years of being imprisoned. “This is a basic right of a prisoner. Perarivalan is confident that the government will grant him parole. He wanted us to convey birthday wishes to the CM and said he will be happy if granted parole on the occasion,” he said.\n\nMr. Ameer said the directors’ association will submit a petition to the government and CM’s Special Cell urging for grant of parole.\n\n“We had also sent a petition seeking the release of the seven life convicts in this case, but have not been able to meet the Chief Minister earlier due to floods, and now, due to elections,” he mentioned.\n\nPerarivalan’s father Gnanasekaran alias Kuyildasan, a retired teacher, has not been keeping well for sometime now.\n\n“He has neurological problems, bone-related ailments, high blood pressure and diabetes. I had submitted an application to DIG, Prisons, Vellore seeking parole for Perarivalan to meet his father. Following this, he too sent an application but there has been no headway till now,” Arputhammal, Perarivalan’s mother said.\n\nShe said there has been no information on their earlier plea seeking release of Perarivalan and others in the case.", 
    "section": "national", 
    "title": "Film directors urge CM for parole to Perarivalan", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}