{
    "author": [
        "K Lakshmi"
    ], 
    "text": "Sirens will be installed to trigger an alarm when full capacity is reached; sensors, for flood monitoring\n\nloods may no longer catch residents, living downstream of the four city reservoirs, by surprise. For, the Water Resources Department (WRD) plans to install flood warning systems in the reservoirs to provide accurate information about impending floods.\n\nAt present, teams from the district collectorate and the revenue department alert residents living close to the reservoirs through announcements on the public address systems.\n\nSoon, the WRD will install a siren that will trigger an alarm when the water level reaches its full capacity at reservoirs in Chembarambakkam, Red Hills, Poondi and Cholavaram.\n\nSensors will also be fitted at the reservoirs so that data on rainfall, inflow and water level in the reservoirs can be recorded at frequent intervals and better monitored.\n\nTo ensure the safety of the dams, lightning conductors would also be installed with funds obtained under the Dam Rehabilitation and Improvement Project of the Central Water Commission (CWC).\n\nIt may be recalled that a three-member team of Dam Safety Review Panel from CWC had inspected the reservoirs six months ago and listed deficiencies and requirements.\n\nRs. 13 crore sanctioned\n\nWork to improve the waterbodies is likely to begin in March with the Rs. 13 crore sanctioned recently. WRD officials said damages in the parapet walls over the top of the bunds and drains that carried rainwater to the bottom of the reservoirs would be repaired.\n\nLeaks in the bund, as in the Cholavaram reservoir, would also be fixed.\n\nVulnerable portions repaired\n\nVulnerable portions of a parapet wall over the top of bund stretching for 8 km at the Chembarambakkam reservoir would be repaired. Leaky masonry structure of vents in the reservoir dam and deck bridge over the shutters used for inspection would also be set right.\n\nLong-pending works in Red Hills reservoir including fixing leaks in the weir and strengthening of the bund along the Ambattur Red Hills Road, Surapet, would also be carried out. Vegetation would be cleared too.\n\nWork completion in 6 months\n\nFor several years now, residents have been complaining that a stretch of bund near the Surapet intake tower was being misused for illegal activities.\n\nBesides reconstructing the damaged concrete lining along the bund in the Poondi reservoir, the department will also build a flood monitoring office, an official said.\n\nThe department plans to complete the work in six months.", 
    "section": "national", 
    "title": "Flood warning systems for reservoirs", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}