{
    "author": [
        "Deepu Sebastian Edmond"
    ], 
    "text": "Puthiya Sakthi Front launched, aims to change TN politics\n\nSix months ago, Thirumurugan Mahadhevan had no interest in politics. He was just a young doctor working in Bangalore. Then, in Tamil Nadu, the floods came.\n\nThe floods changed everything. Dr. Mahadhevan talks of coordinating relief materials and travelling to five villages of Cuddalore district in an attempt to feed starving villagers. He still sounds incredulous when he says, “The men were drunk even as they were without food. If Tasmac could provide alcohol, why not food?”\n\nThat came to be a significant building block in his new worldview. When 51 organisations came together to announce the formation of the political platform Puthiya Sakthi Front (PSF) on Tuesday - Dr. Mahadhevan is part of the youth group associated with the platform, helping identify suitable candidates - prohibition was among the three main points on the agenda. The other two were a scam-free and corruption-free governance.\n\nAt the press conference on Tuesday, the focus was on developing a new political culture for the State. “Tamil Nadu does not have an organised civil society. We see this as the first step towards one,” said Jagadeeswaran of the Loksatta Party. His organisation is one of the four registered political parties under the PSF umbrella. PSF hopes to attract more organisations and individuals - people can join the effort by giving a missed call to 8144178687 - and eventually have independent candidates supported by it in all 234 constituencies.\n\nD. Jagadeeswaran and other affiliates of the PSF were clear about where they hope new faces would come from - the flood relief groups. “We are in touch with many youngsters who were part of flood relief and hope they will come on board,” said Mr. Jagadeeswaran. Clearly, the politics of the city’s youth has been transformed by the floods.\n\nNavin Udayar said he had always wanted to enter politics, but the aftermath of the floods gave him the confidence to take the leap. The IIM-Indore graduate and entrepreneur has joined the Future India Party - registered in 2014 - after being part of a team that coordinated relief efforts during the floods. “The support I received after the floods convinced me that it was the right time to enter politics.... I felt that at least the aftermath of the disaster could have managed better if those in power used their resources better,” he said. Mr. Udayar wants to concentrate on his start-ups, so he will not be contesting this election.\n\nDr. Mahadhevan too, has decided against contesting. “I am an emotional person and a politician sometimes needs to make decisions that I won't be able to take,” he said.\n\nThen there are others who do not want to take the plunge. Pravin Perumal, a dentist, has refused to take to electoral politics despite his fellow volunteers at Namma Team (NT) egging him on. His NT, active in social service before the floods, had seen a spike in membership during it. “We went from 20-30 friends to a 150-strong team,” said Dr. Perumal.", 
    "section": "national", 
    "title": "From the floods emerges a new political party", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}