{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Union Ministry of Commerce is studying the proposed Trans-Pacific Partnership (TPP) agreement and the impact that it would have on Indian trade. The Centre of WTO Studies is also analysing the possible impact of the agreement on India, according to Ravi Capoor, Joint Secretary of Department of Commerce, Ministry of Commerce and Industry.\n\nHe was speaking at an outreach programme on Free Trade Agreements signed by Federation of Indian Export Organisation here on Tuesday.\n\nThe TPP would cover 12 countries and about 35 per cent of the global trade was controlled by these countries. The agreement was expected to be signed in the next one or two years. The Ministry was looking at the possible impact it would have.\n\nIndia had so far signed 16 trade agreements and most of them were with South Asian and African countries. However, only 10 per cent to 12 per cent of the entire trade from the country happened under these agreements. Exporters should make use of these agreements, he said.\n\nThe Indian Trade portal would give details of the benefits if the exporters typed out the HS code or products that they were interested in exporting or importing. The Ministry was also trying to develop a mobile application for this portal to simplify it further.\n\nIn the globalised scenario, countries would manufacture only the products that they were strong in. In the next 10 or 15 years, tariff would not be an issue for international trade. It would be the non-tariff barriers. So industry should move towards value addition and adoption of technology. India had to move to a level to develop standards for all products. He later told presspersons that global trade was expected to grow at 3.3 per cent. But, it would end up growing at about two per cent this year. The global trade had shrunk and there were issues such as low oil prices. They were affecting exports.\n\nRegarding Free Trade Agreement with the European Union, he said that Europe was strong in wine, dairy products and automobiles. India had emerged as a hub for manufacture of automobiles. These sectors were likely to be affected if the FTA was signed.", 
    "section": "national", 
    "title": "Govt. studying proposed TPP agreement", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}