{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The Madras High Court on Tuesday directed the Public Works Department (PWD) to depute a senior officer who can appear before the court and explain the issue relating to construction of new buildings to accommodate the new campus of the Dr. Ambedkar Government Law College, Chennai.\n\nThe government had accepted the recommendation of Justice P. Shanmugam Commission to shift the campus from the city.\n\nThe issue pertains to a public interest litigation (PIL) moved by lawyer K. Balu in 2008, following a brutal clash among students of the college.\n\nHe requested the court to restrain the media from publishing / broadcasting the violence that took place on the college premises on November 12, 2008, and to take suitable steps against the police officers who failed to stop the clash.\n\nSubsequently, the State government appointed a commission to probe the violence, headed by Justice P. Shanmugam, a former judge of the Madras High Court.\n\nThe commission made a recommendation to shift the college from its present campus by opening new campuses in and around Chennai.\n\nBased on the recommendation, the State government decided to build two campuses at Pattarai Perumpudur village, Tiruvallur district, and at Thiruporur, Kancheepuram district. Detailed plans were made and the PWD estimated a cost of Rs. 115 crore for the construction.\n\nWhen the PIL came up for hearing on Tuesday before the First Bench headed by Chief Justice S.K. Kaul, the Director of Legal Studies made a submission in this regard and stated that a revised estimate and re-planning had been sought from the PWD based on the current rates.\n\nNoting that this did not require any re-planning other than the requirement of deciding in how many phases the construction would be done and what construction would be done in what phase, the Bench said, “We require the presence of a senior PWD officer to explain the issue to us,” and posted the matter to March 9.", 
    "section": "national", 
    "title": "HC seeks update on new campuses for law college", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}