{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "The regional virology laboratory will serve as the apex of labs at the State level.- Photo: Special Arrangement\n\nJipmer is setting up a state-of-the-art regional virology laboratory under a Government of India initiative to strengthen diagnostics and surveillance for existing and emerging viral strains, and screening for potential agents of bioterrorism.\n\nIt has already earmarked 10,000 sq ft to develop a full-fledged Viral Diagnostic Laboratory facility. “We expect to have the lab up and running by September,” Dr. S. C. Parija, Jipmer Director told The Hindu .\n\nThe lab will be equipped with BSL-2 (Biosafety Level) facility to carry out serology, RT-PCR, isolation, fluorescence microscopy, tissue culture and sequencing for all enlisted viruses. The lab is also mandated for engages in basic as well as applied research in viruses, development of kits and diagnostic reagents, identification of unknown samples referred from sub-state level labs, and contribute towards vaccine development.\n\nThe mandate of the virology laboratory, apart from identifying viruses and other agents causing significant morbidity at the public health level and agents causing epidemics, will include developing diagnostic kits — most kits at present are imported — and offering training to health professionals.\n\nThe regional virology laboratories will serve as the apex of labs at the State level and in Medical Colleges. The Jipmer virology laboratory will be the referral institution for labs in Andhra Pradesh and Kerala.\n\nAccording to Dr. Parija, the network involves six laboratories in AIIMS, PGIMER, Chandigarh, the National Institute of Epidemiology, Chennai and the Regional Medical Research Centre, Dibrugarh, Assam.\n\nThe scheme also involves setting up tier-three laboratories in 120 Medical Colleges while 30 of a total of 150 Government Medical Colleges will house tier-two State Level virology laboratories for serological and molecular diagnosis and research.\n\nAn agreement was firmed up in October, 2014, among Jipmer, the ICMR and the Department of Health Research under the scheme, ‘Establishment of a network of laboratories for managing epidemics and natural calamities’. .\n\n10,000 sq. ft. has been earmarked for the facility which will be ready by September", 
    "section": "national", 
    "title": "Jipmer to set up regional virology lab", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}