{
    "author": [
        "S Senthalir"
    ], 
    "text": "Jyoti Garin translates the monologue of a priest who falls in love with a courtesan\n\nLove for literature can transcend language barriers and boundaries. The French translation of renowned playwright Girish Karnad’s English play ‘Flowers’ blossomed through this passion for literature.\n\n‘Les fleurs’ is said to be the first French translation of Girish Karnad’s English play.\n\nJyoti Garin from South France during her stay in Japan in 2007-08 read the play ‘Flowers.’ “I liked it and as an afterthought decided to translate the play to French,” she said.\n\nAfter completing her education in Puducherry, she moved to France. She teaches Hindi and Sanskrit for the French as a foreign language in the corporate sector in South France.\n\nShe worked with Sophie-Lucile Daloz in France to complete the translation work. Published in 2005, ‘Flowers’ is a monologue of a pious priest who falls in love with a courtesan Chandravati. In this play, the priest talks about his life torn between love for God and Chandravati, his sense of duty to the king and wife.\n\n“The play ‘Flowers’ is a monologue from a folk tale,” said Jyoti Garin.\n\nJyoti Garin read excerpts from the play in French at a reading organised by Alliance Francaise in Puducherry on Friday.\n\nShe first translated the work to French and then met the playwright to discuss about it in 2010. “I did not work with Girish Karnad while translating. He did not know about it. When I finished the work I wrote detailed question and sought an appointment with him in Bangalore in 2010. We spent four or five hours discussing,” she said.\n\n“I came to know him through films in art movies during the 1980s. I knew him first as an actor. As we grew up reading literature, I read his works,” she added.\n\nThe renowned writer did not raise any objection to the translation work. “Literature is for passion and fun. I see what is happening and translate what moves me. There are many ways of translating. I do not go by any particular criteria. He just asked me to do the best in the context,” she said.", 
    "section": "national", 
    "title": "Karnad’s play ‘Flowers’ blossoms in French", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}