{
    "author": [], 
    "text": "RELIGION\n\nSelva Vinayagar Temple: Discourse on ‘Anmeega Jothidam’ by P.A. Ponniah, Railway Colony, 7.30 p.m.\n\nPanniru Tirumurai Mandram: ‘Tiruvasagam’ mutrothal, 7 a.m.; Tiruppugazh recital, South Adi Street, Meenakshi Sundareswarar Temple, 6 p.m.\n\nTiruvalluvar Kazhagam: Discourse on ‘Tiruvarutpa’ by M. Vijayaraman, North Adi Street, Meenakshi Sundareswarar Temple, 7 p.m.\n\nTiruvalluvar Mandram: Discourse on ‘Sekkizhar Pillaithamizh’ by Arunachalam, Sakthi Velammal Nagar, S.S. Colony, 5 p.m.\n\nGita Bhavanam: Discourse on ‘Bhagavad Gita’ by Swami Sivayogananda, 3 American Mission Lane, Kamarajar Salai, 6.45 p.m.\n\nBharathi Yuva Kendra Trust: Discourse on ‘Villi Bharatham’ by Tiruchi Kalyanaraman, Setupati Higher Secondary School, North Veli Street, 6.30 p.m.\n\nRamakrishna Mutt: Aarathi, New Natham Road, 6.30 p.m.\n\nCULTURE\n\nInternational Sivananda Yoga Vedanta Centre: Yoga and meditation classes; 444 KK Nagar East Ninth Street, 6 a.m., 6.30 p.m., and 10 a.m. and 4 p.m. (for women).\n\nPrajapita Brahmakumaris Ishwariya Vishwa Vidyalaya: Free rajayoga meditation classes; 36 Meenakshi Nagar, P and T Nagar; 40 Sambandamoorthy Street; 47 B CMR Road and 357 Anna Nagar, 6.30 a.m. and 5.30 p.m.\n\nTamil Isai Sangam: 49{+t}{+h}annual Tamil music festival; nagaswaram by Ezhumalai Parameswaran, 4.30 p.m.; Thevaram music, 5 p.m.; Karumuttu T. Kannan, Thakkar, Meenakshi Sundareswarar Temple, presents ‘Muththamizh Perarignar’ award to Nityashree Mahadevan; Sri Ponnambala Desigar of Kundrakudi Mutt releases souvenir; A.C. Muthiah presides, 6 p.m.; vocal concert by Sirkali G. Sivachidambaram, Raja Muthiah Mandram, 7 p.m.\n\nGENERAL\n\nLady Doak College: National conference on ‘Smart materials,’ 9 a.m.; Reji Philip, Associate Professor, Optics Group, Raman Research Institute, delivers valedictory address, Multimedia Theatre, 3.30 p.m.\n\nThiagarajar College: Symposium on ‘Ethnomedicinal significance of 99 Kurinji flowers referred to by Kabilar;’ S. Punitha, Assistant Medical Officer, Ezhumalai PHC, addresses; M. Eyini, Principal, presides, Diamond Jubilee Hall, 9.30 a.m.; State-level seminar on ‘Plastic waste management and smart polymers;’ V. Rajendiran of Central University of Tamil Nadu speaks, Main Hall, 9.30 a.m.\n\nSourashtra College: V. Kalaiselvan, Head, Department of English Language Studies, MK University, delivers lecture on ‘Text and context: layers of meaning;’ L.P. Ramalingam, Principal, presides, Department of English, 10.30 a.m.\n\nMannar Thirumalai Naicker College: S. Natanagopal, secretary, The Madura College, declares 42{+n}{+d}annual sports meet open, Pasumalai, 3 p.m.\n\nSLS MAVMM Ayira Vaisyar College: Fine Arts Club competitions, Kallampatti, 2.30 p.m.\n\nVelammal College of Engineering and Technology: Meeting on ‘Chase the vision, not the money,’ Department of Electrical and Electronics Engineering, 2.30 p.m.\n\nMadurai Public School: First Annual Day celebration; R. Raja Govindasamy, Director, Mannar Thirumalai Naicker College, and J. Angelo Irudayasamy, Chief Educational Officer, address, Visalakshpuram, 5 p.m.\n\nPowerloom Development and Export Promotion Council: K. Veera Raghava Rao, Collector, inaugurates ‘Texpo 2016,’ buyer-seller meet and powerloom products mela; M. Duraisamy, chairman, presides, Madurai District Tiny and Small Scale Industries Association, Dr. Ambedkar Road, 10 a.m.\n\nGandhi Museum: Training programme in village industries; R. Natarajan, Education Officer, addresses, Creed, Vadipatti, 11.30 a.m.\n\nMadurai District Tiny and Small Scale Industries Association: 30{+t}{+h}All India Ideal Home Exhibition, Tamukkam Ground, 4 p.m.\n\nAlcoholics Anonymous: Meeting, AG Church, Melur, 6.30 p.m.; Deep Hospital and Loyola Technical Institute, Gnanaolivupuram, 7 p.m.", 
    "section": "national", 
    "title": "MADURAI TODAY", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}