{
    "author": [
        "Staff Reporter"
    ], 
    "text": "The National Council for Teacher Education (NCTE) on Tuesday informed the Madras High Court that no action will be taken against self-financing teacher training institutions in the State till a final decision is made on their petitions challenging certain new regulations imposed by the Council.\n\nThe Council made the submission when a batch of petitions filed by the Tamil Nadu Self-Financing College of Education Management Association and others came up for hearing before the First Bench of Chief Justice S.K. Kaul and Justice M.M. Sundresh.\n\nThe issue pertains to a set of new norms introduced to the NCTE (Recognition, norms and procedure) Regulations, 2014. The norms relate to infrastructural and instructional facilities, enhanced endowment and reserve fund, qualification of teaching staff, curriculum and implementation strategies in view of the changing duration/intake of programme offered in the institutions within the time frame allowed by the council.\n\nAlleging that the norms are impracticable as they made drastic changes in the existing system, the petitioners sought to declare the norms null and void.\n\nThe petitioners submitted that an expert committee has been appointed by the Union Human Resource Development Ministry to look into the feedback of the implementation of the regulations and the committee had sittings throughout the country, including Chennai, where the representatives of the petitioners met the committee.\n\nThe association sought the court to direct the Council not to take any coercive action, since the committee is examining the matter. They also pleaded that sufficient time would be granted to do the committee.\n\nRecording the submissions, the Bench said, “In view of the exercise already being undertaken by the authorities and the submission made by the Council, a reasonable view may be taken in this behalf and as stated, sufficient time would be given to implement the new rules.” The Bench then closed all the petitions.\n\nPetitions filed by TN Self-Financing College of Education Management Assn.", 
    "section": "national", 
    "title": "No action till new rules issue is settled, NCTE tells court", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}