{
    "author": [
        "L Renganathan"
    ], 
    "text": "Collector thanks all the security personnel and officials for the smooth conduct of Mahamaham\n\nThe authorities in Kumbakonam have announced that the devotees would be allowed to take a holy dip in the Mahamaham tank only during the day after Tuesday.— PHOTO: M. SRINATH\n\nA day after the Teerthavari rituals connected with the Mahamaham coming to an end on Monday, thousands of pilgrims continued to throng the sacred tank and the temple town on Tuesday. Bus services into the town have been restored and all vehicular restrictions eased to help pilgrims reach the tank easily.\n\nThe authorities have announced that the devotees will be allowed to take a holy dip in the Mahamaham tank only during the day.\n\nAlso, depending on the flow of pilgrims, water in the tank would be recycled periodically, the officials said.\n\nThanjavur District Collector N. Subbaiyan, who coordinated all activities and measures, told presspersons on Tuesday that about two years of planning went into the successful endeavour and all the line departments and governmental agencies had spent more than Rs. 260 crore towards ensuring that the visiting pilgrims had a memorable experience.\n\nDr. Subbaiyan thanked, on behalf of the district administration, all the men and officers of the police force, Fire and Rescue Services, governmental departments,\n\nHome Guards, volunteers, and the people of Kumbakonam who contributed their mite to the flourishing festivities.\n\nIn his interaction with the media, Commissioner of Municipal Administration G. Prakash said that the public, traders, and visiting pilgrims had helped in reducing the use of plastic carry bags during the festival period.\n\nThey had remarkably heeded to the call for shunning plastics to the extent possible, he said.\n\nConservancy staff\n\nMr. Prakash recalled the “wonderful effort” of the conservancy staff who had come from various districts to Kumbakonam in clearing garbage frequently and thereby help keep the surroundings clean and tidy.\n\nAs most of the outstation police personnel who had been drafted for Mahamaham duty started leaving Kumbakonam on Tuesday, there were traffic snarls on main road stretches leading to Thanjavur and Mayiladuthurai during the day as many vehicles got piled up.\n\nDevotees kept arriving in Kumbakonam and the rush near the Mahamaham tank was palpable.\n\nThe meagre number of police personnel in the town had a tough time regulating the traffic especially in road important junctions as the pilgrims crisscrossed the roads to reach the tank and Portramarai kulam areas.\n\nCouncil thanks CM\n\nMeanwhile, the Kumbakonam Municipality at an extraordinary meeting of the Council on Tuesday thanked Chief Minister Jayalalithaa for allocating adequate funds for the successful conduct of the Mahamaham festival and facilitating the development of the town.\n\nChairperson Rathna Sekar thanked officials and all others who ensured that the visiting pilgrims were provided comfort and safety.", 
    "section": "national", 
    "title": "Pilgrims continue to throng Kumbakonam", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}