{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "The Madras High Court Bench here has upheld the validity of a statutory rule that provides for reservation of 20 per cent of vacancies in government service to candidates who have completed their school and collegiate education in Tamil medium when they apply for jobs through “direct recruitment” and not for similarly placed “in-service” candidates.\n\nA Division Bench of Justices S. Manikumar and C.T. Selvam dismissed writ petitions filed by two police constables, including a woman, challenging the definition of the term ‘direct recruitment’ under Rule 2(a) of the Tamil Nadu Appointment on Preferential Basis in the Services under the State of Persons Studied in Tamil Medium Rules, 2010.\n\nThe constables, M. Durai Murugan and K. Tamil Selvi, serving in Ramanathapuram district were aggrieved over the refusal of Tamil Nadu Uniformed Services Recruitment Board (TNUSRB) to give weightage to graduation courses undergone by them in Tamil medium just because they had applied for the post of Sub-Inspector of Police under the quota for in-service candidates.\n\nWhereas candidates applying for ‘direct recruitment’ were given additional weightage.\n\nHowever, Additional Advocate General K. Chellapandian pointed out that a few other in-service candidates had filed similar cases before the Principal Seat of the High Court in Chennai challenging a notification issued by the TNUSRB last year for recruitment of Sub-Inspectors of Police and those cases were dismissed by the First Division Bench on January 20 this year.\n\nThough the statutory rule was not under challenge in those cases, the First Bench led by Chief Justice Sanjay Kishan Kaul had interpreted Rule 2(a) and categorically held that preference for those who had studied in Tamil medium could be given only during first appointment in public service and could not be extended to departmental candidates.\n\nThe Division Bench led by Mr. Justice Manikumar recorded the submissions of the AAG and said: “The judgment rendered by the honourable First Bench is squarely applicable to the facts on hand. Merely because the rule has not been impugned in the earlier proceedings, it is not open to the petitioners to file a fresh writ to declare the rule as ultra vires.”", 
    "section": "national", 
    "title": "Preference for Tamil medium candidates in govt. service upheld", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}