{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Workers of political parties that are part of the People's Welfare Front staging a protest in Tiruchi on Tuesday in support of JNU students.— PHOTO: B. VELANKANNI RAJ\n\nMembers of the People’s Welfare Front (PWF) staged a demonstration here on Tuesday, condemning the Bharatiya Janata Party (BJP) government for the attacks on Jawaharlal Nehru University (JNU) students and reporters in New Delhi recently.\n\nDenouncing the Centre for booking sedition charges against JNU student leader Kanhaiya Kumar, the protesting PWF members demanded that the charges against the student leader be withdrawn.\n\nWorkers of the PWF which comprises the two Left parties, Marumalarchi Dravida Munnetra Kazhagam and the Viduthalai Chiruthaigal Katchi took part in the demonstration near the Collectorate.\n\nLed by the CPI urban district secretary K. Suresh, the nearly two-hour long demonstration saw the participation of CPI-M Politburo member K. Varadarajan, MDMK deputy general secretary Mallai Sathya, CPI State executive council member Indrajit, CPI-M state committee member Sridhar, and VCK State general secretary N. Prabakaran.\n\nHolding their respective party flags, the PWF members raised slogans criticising the BJP government for the attacks on the JNU students and reporters in New Delhi.\n\nThe PWF members condemned BJP national secretary H. Raja’s purported comments targeting CPI MP D. Raja over the JNU row. While demanding a ban on the Akhil Bharatiya Vidyarthi Parishad, the demonstrators sought the release of the arrested student leader Kanhaiya Kumar.\n\nSpeaking to reporters at the protest venue, Mr. Varadarajan accused the BJP government of letting loose attacks on those who had different ideology and those speaking against the government.\n\nThe PWF had been created with the objective of saving democracy in the country and to quell fundamentalist forces, he said. The PWF had been fighting for an alternative in Tamil Nadu, he said.", 
    "section": "national", 
    "title": "PWF condemns Centre for attacks on JNU students", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}