{
    "author": [
        "Special Correspondent"
    ], 
    "text": "It could be an ideal alternative to the risky trawling, say experts\n\nThe Rameswaram fishermen, who often get arrested by Sri Lankan navy on charges of poaching and faced threat to their livelihood, could take up the profitable sea cage farming of Cobia and Pompano, the high value marine fishes, A. Gopalakrishnan, Director of Central Marine Fisheries Research Centre (CMFRI), Kochi said.\n\nAddressing the gathering before distributing hatchery-produced Cobia fingerlings to select fishers at Mandapam Regional Centre of CMFRI here on Tuesday, he said sea cage farming of the two high value species could be an ideal alternative to the risky trawling and exhorted the marine fishermen to switch over to cage farming.\n\nHe said the Mandapam Regional Centre, which has perfected breeding, seed production and farming technologies for the two species, produced about two lakh fingerlings of Pompano and 50,000 fingerlings of Cobia in a year for the benefit of local fishermen and entrepreneurs.\n\nDespite being a research Institute, CMFRI continued in the seed production for the benefit of fishermen, he said adding at present 16 fishermen Self Help Groups were engaged in sea cage farming, setting up 50 cages in the Gulf of Mannar and Palk Bay.\n\n“It is quite profitable and this can be the best alternative for marine fishers,” he said.\n\nSeaweed rafts\n\nThe fishermen could take up sea cage farming, he said adding they could benefit more if they took up Integrated Multi Tropic Aquaculture (IMTA) and cultivated ‘kappaphycus,’ using seaweed rafts attached to the cages.\n\nThey could harvest about 300 kg of ‘kappaphycus’ per raft in 45 days, even while growing the marine fishes.\n\nHatchery proposed\n\nAs the Tamil Nadu Fisheries Department proposed to set up a hatchery for producing seeds of the two species, jointly with CMFRI, the demand for seeds could be easily met in the coming years, he said.\n\nA. K. Abdul Nazar, Scientist in-charge, CMFRI, Mandapam region said the introduction of sea cage farming has helped fishermen improve their economic standards.\n\nK. Kasinathapandian, Deputy Director of Fisheries, said the Cobia fingerlings were distributed to fishermen under the Fisheries Management for Sustainable Livelihood (FIMSUL) with 90 per cent subsidy for setting up two cages per group.\n\nBoby Ignatius, Principal scientist, Mariculture division, CMFRI, Kochi, R Jayakumar, Senior scientist and B Johnson, Scientist, Mandapam region were present.", 
    "section": "national", 
    "title": "Rameswaram fishermen told to take up sea cage farming", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}