{
    "author": [
        "Staff Reporter"
    ], 
    "text": "It will augment water supply to Corporation by bringing 61 million litres per day: officials\n\nThe third Vaigai water supply scheme for Madurai, proposed last year, was sanctioned Rs. 320 crore through the Atal Mission for Rejuvenation and Urban Transformation (AMRUT) scheme, Mayor V.V. Rajan Chellappa announced at the Corporation Council meeting on Tuesday.\n\nCorporation officials said that the scheme would augment the drinking water supply to Madurai Corporation by bringing 61 MLD (million litres per day) in addition to the 115 MLD already being received through the first two Vaigai water supply schemes, commissioned in the year 1996 and 2009.\n\nSources said that the scheme would increase the present availability of 90 litres per capita per day (lpcd) to 135 lpcd.\n\nThough the implementation of the project, which is executed with 20 per cent contribution from the State government and remaining from the Centre, was not likely to commence before the assembly elections, officials said that preparatory paper work was in progress.\n\nMeanwhile, answering councillors to questions about drinking water situation for this summer season, Mr. Chellappa pointed out that the present level of Vaigai dam is 45 feet compared to 34 feet during the same time last year. “So, there will not be any drinking water issues at least till June,” he said.\n\nNon-cooperation of officials alleged\n\nMany councillors alleged non-cooperation of officials from engineering section in timely execution of projects. K. Jeyavel, Chairman of North Zone (Zone 2), complained that developmental works under the councillor’s fund of Rs.15 lakh were getting stuck due to delay in issuance of work orders.\n\nA majority of the councillors also complained about non-availability stock on the Corporation stores. Responding to the complaints, Commissioner Sandeep Nanduri assured swift action in rectifying the issues.\n\nObjecting to a resolution on extending the maintenance contract of a private player for the electric crematorium at Thathaneri, M. Dass, councillor of ward 9, questioned the rational of Corporation paying Rs.950 to the company for every body cremated.\n\n“The Corporation has set up the infrastructure and machinery. There are also 29 Corporation employees available at the cremation ground. Then what is the need of paying Rs. 950 of the Rs.1,350 collected for cremation of a body to the company. We could just engage them in need of maintenance work,” he said.\n\nWhile passing the resolution to extend the company’s contract by another three months,\n\nMr. Chellappa assured Mr. Dass to review the contract after three months.", 
    "section": "national", 
    "title": "Rs. 320 cr. for third Vaigai water scheme", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}