{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Its report will help CCIM allow State government to admit students next year\n\nAssessment:Head of three-member team from Central Council of Indian Medicine Vijayakumar (second from right) interacting with doctors at Government Siddha Medical College in Palayamkottai on Tuesday.— Photo: A. Shaikmohideen\n\nA three-member team from Central Council of Indian Medicine (CCIM) inspected Government Siddha Medical College here on Tuesday to ascertain if the 50-year-old institution has got adequate infrastructure for educating undergraduate and postgraduate students to be admitted next academic year.\n\nCCIM members Vijayakumar, Christian and Leelavathi visited outpatient and inpatient sections, library, medicine preparation room and watched Siddha formulations, including jellies, being packed in pieces of newspapers and given to outpatients. They also checked records at the college and hospital.\n\nDuring an informal chat with reporters amidst inspection, Dr. Vijayakumar said that the annual inspection, usually done in Siddha and Ayurveda medical colleges in Tamil Nadu and Kerala with the objective of ensuring better infrastructure facilities for better education, was being conducted at Government Siddha Medical College here.\n\nApart from ascertaining the strength of teaching and non-teaching staff, the team inspected the facilities available for outpatients coming to the hospital every day and the hostel facilities available for students.\n\n“Besides ensuring better facilities in the college and the hospital, our report will also help the CCIM to allow the State government to admit students in the next academic year,” Dr. Vijayakumar said.\n\nThough this college was 50 years old, the hospital does not have modern radiological investigation facilities and the public have to rely upon private centres for these services. Lack of herbal garden, cramped buildings, water scarcity, etc., are other problems the college is facing.\n\nThe college and the hospital, which were started in a small building as a temporary measure, are still functioning in those structures.\n\nWhen the students started revolting against the delay in identifying a permanent space in the past, a five-acre government poramboke land near Kadayanallur, about 70 km from here, was allotted. However, the students were keen on getting a sprawling land belonging to Hindu Religious and Charitable Endowment Department near Munneerpallam in view of easy accessibility to the city and the Western Ghats, which is known for its rich herbal wealth.", 
    "section": "national", 
    "title": "Team inspects Siddha medical college", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}