{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Contextualising the impact of climate change for a local audience was the focus of a knowledge sharing workshop conducted for the region’s journalists by the M.S. Swaminathan Research Foundation (MSSRF), in collaboration with ClimaAdapt at Hotel Femina on Tuesday.\n\n“Climate change is an important problem because it has affected our agriculture, animal husbandry, and also our water systems,” said R. Rajkumar, senior scientist, MSSRF, in his opening address. “Climate literacy is essential for journalists in the print and electronic media so that they can disseminate information about climate change effectively,” he added.\n\nThe topic may be seen in a different perspective by scientists and the general public, but climate change is relevant to all, said B. Jayashree, head, The Hindu Media Resource Centre (HMRC).\n\n“We have noticed that the media tend to focus on climate change only when an international conference is being held on the issue. But the coverage is skipped by readers and viewers because it doesn’t have a local resonance,” said Ms. Jayashree. “It is our duty to show that climate change is part of our life too,” she added. The ‘faddish’ nature of environment news coverage and the urge to create sensationalism was obscuring crucial aspects of the climate change debate, said M.S. Arasu, Tiruchi region co-ordinator, ClimaAdapt, a research programme that focuses on climate change adaptation in agriculture in India.\n\n“What we are getting is only a macro-level examination of environmental issues, with most of the studies being done in north India,” said Mr. Arasu. “For example, it is not widely known that methane emissions from rice fields are being studied for its role in global warming and climate change. We get more rains now than before, but at a more unpredictable rate.”\n\nNancy Anabel, director, Information Education and Communication, MSSRF, said that using technology to help farmers to adapt to environmental change is the way forward in local climate action. “Everyone has their own lens to view the problem, but we have not been able to reach out with relevant information to those most affected by it. For example, mobile phones could easily be used to convey useful data such as market rates and rainfall trends to farmers, so that they can plan their crop patterns,” said Ms. Nancy.\n\nFisheries are equally affected by the rising sea levels due to climate change, she said, which requires more efforts to be directed towards saving marine resources.", 
    "section": "national", 
    "title": "Tell readers that climate change is part of life, scribes urged", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}