{
    "author": [
        "M K"
    ], 
    "text": "For the 1,500 youth in Western Tamil Nadu, who assisted police at various levels for the last two years, today is their last day as youth brigades. They will undergo training for seven months from tomorrow, and rejoin the force as policemen.\n\nUntil then the men in khaki will be overstretched to ensure that the works carried out by the brigades are not brought to a screeching halt.\n\nExamination\n\nThe brigades wrote an examination conducted by the Tamil Nadu Uniformed Services Recruitment Board on November 29 for selection for the post of Grade-II constable.\n\nAlmost all of them got through and they will undergo training for seven months and join the Tamil Nadu Special Police as constables. This includes around 225 youth brigades from the Coimbatore District Police and 53 attached to the Coimbatore City Police.\n\nThey were recruited in 2013 to assist police who faced shortage of manpower. Youth Brigades joined the department on February 12, 2014, to assist the police at the stations and offices of department officer including offices of the police commissioner and superintendent of police in taking important letters, providing first aid to accident victims, driving vehicles of police officers and computer related works.\n\nBut as days went by, based on their education qualification, expertise and confidence the officers had on them they were involved in confidential tasks, patrolling with police personnel and even preparing drafts for First Information Report, to name a few. A senior police officer in West Zone said that the young and energetic brigades had even exceeded expectations.\n\nThe officer added that youth brigades on stepping into full-fledged service will be able to serve the department better than other newly recruited police constables as they already know how police stations and other department offices function. But, despite earning this reputation, the youth including many graduates got a mere Rs. 7,500 a month as consolidate pay.\n\n“After seven months we will get Rs. 15,000 a month. It is worth the wait,” says C. Sakthivel (22) a B.Sc. IT graduate. He is among the 62 brigades who joined the force on February 12, 2014. Nine of them left due to various reasons while the rest stayed back to get their dream job.\n\nWhile brigades who got selected as Grade-II police constables will retire at lower ranks, C. Gokul Prasad (21) and his friends have planed to make use of the quota for department personnel for direct sub inspector selection so that they could get elevated to higher ranks.\n\nTop police officers said that the space left vacant when youth brigades are relieved would be filled up by policemen from the armed reserve.", 
    "section": "national", 
    "title": "Today is their last day as Youth Brigades", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}