{
    "author": [
        "Krishnadas Rajagopal"
    ], 
    "text": "Slamming the acquittal of Jayalalithaa as a “gross miscarriage of justice”, senior advocate Dushyant Dave for Karnataka that it had “become a fashion for political leaders to term crores of money they get as birthday gifts”.\n\n“It is unbelievable how such defence is taken up and accepted,” Mr. Dave, who is assisted by Supreme Court advocate Joseph Aristotle, submitted. Special Prosecutor B.V. Acharya was present in the courtroom.\n\nTerming the trial court judgment as a “brilliant analysis” of the anti-corruption law interpreted by the Supreme Court, the senior lawyer said, “We are looking into the sources of her income and not into whether she has accounted it for the five years (1991-1996). This is not an Income Tax matter, but corruption. The prosecution’s version is that wealth amassed is completely, grossly mis-proportionate to any known sources of income”.\n\n‘Marriage of the century’\n\nAt one point during the hearing, when Mr. Dave described the wedding of the accused, V.N. Sudhakaran as the “marriage of the century”, Justice Ghose checked him.\n\nMr. Dave alleged how the accused continued to reside under the “same roof” with Ms. Jayalalithaa despite the fact that allegations of corruption were raised against them.\n\n“What does it show? If I had some responsibility, I would have disowned them. Because they are in public life, they feel they can be so brazen,” Mr. Dave submitted.\n\nKarnataka’s appeal described the High Court judgment as “cryptic, lacks reasoning and illogical”.\n\nIn July 2015, the apex court refused to stay the Karnataka High Court judgment of acquittal while issuing notice to all the four accused on all the petitions filed by the Karnataka government, Dravida Munnetra Kazhagam (DMK) leader K. Anbazhagan and an intervention application filed by Bharatiya Janata Party (BJP) leader Subramanian Swamy.\n\nThe court also issued notice to a separate petition filed by Mr. Anbazhagan challenging the Karnataka High Court order setting aside the confiscation of properties held by Indo-Doha Chemicals and Pharmaceuticals Pvt Ltd., Signora Enterprises Pvt. Ltd., Ramraj Agro Mills Ltd., Meadow Agro Farms, Riverway Agro Products “for and on behalf of Ms. Jayalalithaa”.\n\nHigh Court judgment “cryptic, lacks reasoning and illogical”", 
    "section": "national", 
    "title": "‘Trial court judgment a brilliant analysis’", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}