{
    "author": [
        "Deepa H"
    ], 
    "text": "A member of AIADMK women's wing gets a tattoo done on her arm on the eve of Jayalalithaa's birthday.— Photo: M. Karunakaran\n\nOn Tuesday, over 1,000 party cadres, who wanted to wish the general secretary and Chief Minister Jayalalithaa a happy 68{+t}{+h}birthday, tattooed her image on their arms.\n\nK. Premalatha of Tharamani, said though she had been a party member since 1989, she did not get the opportunity to get a tattoo done. “I wanted something permanent to show my love to Amma and what better way than a tattoo. Several of my neighbours, who are not party cadres, too came as they love Amma. We want her to win in all the 234 constituencies. We are having special prayers for her to be hale and hearty,” she said adding that the pain did not matter as it was for Amma.\n\nThough the organiser, Velachery MLA M.K.Ashok had planned only for 668 persons, the numbers swelled to 1,050.\n\n“I have a tattoo of Amma that I got made two years ago. Many youngsters saw that and wanted something similar. I thought why not celebrate Amma’s birthday with her tattoos, so that we can show our undying love by permanently having her image and name. Today, I tattooed the word Amma too,” said Mr. Ashok.\n\nOver 40 gypsies from neighbouring States, Vellore and Hosur made the tattoos. Diamond Rajini, a gypsy from Vellore, said the organisers gave fresh needles for each of the participants and good imported red, green and purple colours. “We are all Amma’s and Thalaivar’s fans. I have tattoos of the ship that was featured in the Tamil movie Aayirathil Oruvan and MGR and the two-leaves symbol of the party,” said an excited Rajini.\n\nSenior party leaders and Ministers, including O. Panneerselvam, Natham R. Viswanathan, R. Vaithilingam, Edappadi K. Palaniswami, P. Palaniappan and B. Valarmathi, participated in the event organised on the eve of Ms. Jayalalithaa’s birthday.\n\nBirthday greetings\n\nMeanwhile, over 14.75 lakh callers have left birthday greetings for Ms. Jayalalithaa by calling on 044- 33124234. “We are transcribing the messages and the best ones will be presented to Amma.\n\nOver 1,000 party cadre tattoo her image on their arms", 
    "section": "national", 
    "title": "Wearing love for Amma on their sleeves", 
    "subsection": "tamilnadu", 
    "date": "2016-02-24"
}