{
    "author": [], 
    "text": "Delhi Chief Minister Arvind Kejriwal , spoke to Josy Joseph and Nistula Hebbar on his recent face-off with the Centre and the Odd-Even scheme….\n\nDelhi Andaman and Nicobar Islands Civil Service (DANICS) as well as IAS officers have gone on strike against the actions of your government, and you are blaming the Centre. Why?\n\nThe Central government and the Prime Minister are not combating me politically in a direct way, sometimes they shoot from the Anti Corruption Bureau’s (ACB) shoulder, sometimes from the Lt. Governor (Najeeb Jung’s) and now from the officers. The officers held a meeting here last night [Wednesday], for over 5 hours on the 7th floor. Some of the officers who attended told me that the LG was there on speaker phone from Goa… he in turn was in touch with Union Home Secretary Rajiv Mehrishi and Nripendra Mishra (principal secretary to Prime Minister Narendra Modi). He was getting instructions and conveying it to them. You can imagine, in this situation, that there is an attempt to destabilise the government by the PMO.\n\nThe bureaucrats are all scared and have no option but to agree to all legal and illegal demands by the PMO. After the raid on Rajendraji (Rajendra Gupta, principal secretary to CM) the CBI has been calling two officers everyday, randomly, telling them that it is related to the raid whereas that is not so. The CBI makes them sit the whole day for nothing and that has created such a widespread fear psychosis that if you work with Kejriwal, appear sympathetic or show any loyalty to my government you will be finished.\n\nBy suspending the two DANICS officers, aren’t you adding to the fear?\n\nSuspensions have happened for corruption and insubordination. There have been three instances, once when I went to a jhuggi settlement at night, where there were people without shelter, and no official around. On the spot I suspended three people. The second instance was the auto permit scam, where again three people were suspended. Then we had a Cabinet meeting to redesign the pay scales of public prosecutors, and jail cadre staff that had been pending for a while. They refused to implement it because they got a call from the LG’s office.\n\nHadn’t you left it open for the LG to refer it to the President?\n\nHe referred it to the President two days later. Till then why didn’t it get implemented. How is a phone call from the LG a valid argument for insubordination?\n\nTo tell you frankly, it is now the time to look for professional sector experts to work in the government. There is absolutely no reason why the health secretary should not be a health management expert or a doctor. Why should an IAS be health secretary? In fact this could be an opportunity in disguise for the Delhi government to replace these bureaucrats with domain experts.\n\nWhat would be the first step to that?\n\nI have asked for the details of all posts, and will proceed from there. (smiles).\n\nEveryone is commending your political acumen that just a few days ago your Principal Secretary Rajendra Kumar’s office was raided by the CBI but all everyone is talking about is the DDCA scam. That you have been successful in diverting attention from possible graft in your office.\n\nBut that is exactly what happened that day. The raid was in the morning and I didn’t realise it till about four or five in the evening when staffers told me that, “sir, they were looking for the DDCA files.” After that I gave my press statement. The truth is the truth. Did they find anything against Rajendra? The CBI is such an agency that if it finds Rs. 2 it will say it has found Rs. 100. If they had found something they wouldn’t have kept it to themselves.\n\nThis intense bitterness in the political discourse, how do you see this panning out, do you see an end to this?\n\nThe Prime Minister should allow us to work, that’s it. The bitterness can finish in two minutes, the Prime Minister needs only to call the Lt. Governor and tell him not put obstacles in our work and hand over the ACB to us. These are the two things we want. I’m the quarter sized chief minister of a half-state, he is the ruler of the entire country, why is he after me?\n\nIs that what drove you to call him a psychopath and a coward?\n\nIf I fire from someone else’s shoulder, I think it’s a cowardly act. Himmat hai to aankh main aankh daal ke baat karo (look me in the eye and talk to me if you dare).\n\nWhat about the word “psychopath”?\n\nWe’ll talk about that some other time. (smiles).\n\nTomorrow morning we are expecting chaos on Delhi roads.\n\nWhy should you expect chaos? You should say, best of luck! And apprehension of chaos is a hypothetical question. In fact now I’m quite hopeful.\n\nPeople are ready now, even the bitterest of critics. I have always been saying that this will not work without the support of everyone…\n\nIt is now the time to look for professional sector experts to work in the government\n\nThe CBI is such an agency that if it finds Rs. 2 it will say it\n\nhas found Rs. 100", 
    "section": "national", 
    "title": "‘Bureaucrats are all scared, the CBI is harassing them’", 
    "subsection": "general", 
    "date": "2016-01-01"
}