{
    "author": [], 
    "text": "He said this was one of the reasons for pushing the December 31 deadline for submitting comments on the issue to January 7. A final recommendation or a regulation on differential pricing of data services would be out by January-end. “The comments help us finalise our guidelines. These responses are not helpful at all…but we felt ignoring them is not a solution given that we have received the highest ever responses on a consultation paper, which shows that the issue is important to people. Voices of such a large number of people should not go unheard,” he said.\n\nTill Thursday morning, the regulator had received 18.27 lakh comments on the consultation paper, with over 14 lakh being template comments in support of Free Basics, either through mobile or emails. In contrast, the responses (about 3.81 lakh) filed using a platform by savetheinternet.in, too, were received in the template format, but these addressed the questions raised in the consultation paper.\n\nFor those who have expressed support for Free Basics through email, the TRAI plans to write back, seeking response on differential pricing of data services. “I don’t have any comments to make on Free Basics. It may be a great idea. We have not mentioned it in our consultation paper also… Free Basics uses differential pricing as one of the means to offer their product. It’s not that they are not linked. But this is just one product, multiple products can be developed using this architecture and we just wanted to consult if this architecture should be allowed,” he explained.\n\nThe consultation paper on differential pricing of data services raises concerns over zero-rating tariff models — a practice wherein service providers offer free data to users for select applications and websites. According to Internet activists, this model violates the principle of net neutrality as it restricts access to free, open Internet for users, making the paper key to the ongoing debate on net neutrality.", 
    "section": "national", 
    "title": "Consultation papers are not opinion polls, says TRAI chief", 
    "subsection": "general", 
    "date": "2016-01-01"
}