{
    "author": [
        "Kavita Upadhyay"
    ], 
    "text": "The Vasundhara Raje government is victimising me on the basis of caste, says Umrao Salodia.— Photo: Rohit Jain Paras\n\nAfter being allegedly overlooked for the State Chief Secretary post, senior IAS officer Umrao Salodia, a 1978 batch IAS officer from the Dalit community, on Thursday sought voluntary retirement. Mr. Salodia, who accused the Vasundhara Raje government of “victimising him on the basis of caste” also converted to Islam on Thursday.\n\nIn a letter to Ms. Raje, Mr. Salodia wrote: “For the first time after Independence, myself, an IAS officer from the SC/ST category would have been appointed today [on Thursday] as Chief Secretary [of Rajasthan] on the basis of seniority.”\n\nMr. Salodia, Chairman of the Rajasthan State Road Transport Corporation (RSRTC), alleged that the current Chief Secretary C.S. Rajan was given a three-month extension till March next year, to deny Mr. Salodia the opportunity to replace him as Rajasthan’s Chief Secretary. He sought voluntary retirement as he “did not wish to work under a junior officer.” Mr. Salodia, who converted to Islam on Thursday, told that he believed in the equality that Islam, unlike Hinduism which discriminates on the basis of caste, offered to all its followers. “After conversion, my name is Umrao Khan,” he said.\n\nBaseless charge: Minister\n\nRajasthan Parliamentary Affairs Minister Rajendra Rathore dismissed Mr. Salodia’s allegations. Addressing the media on Thursday, Mr. Rathore said Mr. Salodia had acted in violation of the law as he spoke against the government.\n\n“Mr. Salodia’s allegations are baseless. Had the government discriminated on the basis of caste, Rajasthan Assembly Speaker [Kailash Meghwal] of the SC/ST community would not be in that post.”", 
    "section": "national", 
    "title": "Dalit IAS officer alleges harassment, converts to Islam", 
    "subsection": "general", 
    "date": "2016-01-01"
}