{
    "author": [], 
    "text": "Though a senior Home Ministry official said a formal order would be issued terming the suspension null and void, no such order came till late evening.\n\n“The Home Ministry has received a reference from the Lieutenant-Governor on the suspension of two DANICS officers. It declares the suspension order non-est and the two officers should be considered deemed to be on duty,” a Ministry official said. The officials were suspended after they refused to sign a file on the Cabinet decision to hike the salary of public prosecutors.\n\nBut Chief Minister Arvind Kejriwal sent out a stern warning to the agitating officers saying the government was exploring “all options” against those who were on leave. He said the government would not tolerate corruption and insubordination. “DANICS and IAS associations in Delhi have become full-fledged B teams of the BJP,” he said, accusing Prime Minister Narendra Modi of “firing” at the AAP government through the L-G and the officers.\n\nIn a series of tweets, he said time had come to replace bureaucrats with professionals and sector experts to infuse fresh energy and ideas in governance. “People will be very happy if these officers go on long leave. Government is ready to give paid leave. Governance will become honest, smooth and efficient. Government exploring all options against officers who r on leave today. Chori aur Seenazori? Government will not tolerate corruption n insubordination. Time has come to replace bureaucrats wid professionals and sector experts. Infuse fresh energy n ideas in governance [sic]”.\n\nDeputy Chief Minister Manish Sisodia also questioned the timing of the protest, calling it part of a conspiracy to ensure the failure of the odd-even scheme to be rolled out tomorrow. “The Delhi government does not need people who are not willing to work. Officers who have gone on a mass bunk can go on leave for as long as they want, a month or maybe a year. If they want we can give them transfer also,” Mr. Sisodia said on the sidelines of a press conference here.\n\n“I am not trying to say officers who have opted to go on leave do not work, but there are still many in the department who don’t. We have received a number of complaints about such officers. The Aam Aadmi Party does not entertain this attitude, we are here to work for the people,” he said.\n\nAsked how the government would run if a large number of bureaucrats did not come to work, he said: “We will manage.”\n\n‘People will be very happy if officers go on long leave... Governance will be honest & efficient’", 
    "section": "national", 
    "title": "Delhi officials go on mass leave", 
    "subsection": "general", 
    "date": "2016-01-01"
}