{
    "author": [
        "Raviprasad Kamila"
    ], 
    "text": "In a letter expressing serious concerns and raising a note of caution against the proposal to drop 13 cases, including 12 hate-speech cases against Sri Rama Sene chief Pramod Muthalik, Dakshina Kannada Deputy Commissioner A.M. Ibrahim has stated that such a move would send “wrong signals and demoralise the police force”.\n\nOn December 25, The Hindu had reported on a letter written to the Director of Prosecution by the Home Ministry to get the opinion of prosecutors on the proposal to drop the 13 cases, including the infamous 2009 Mangaluru pub attack case.\n\nMr. Ibrahim, in a letter dated December 28, 2015, addressed to Additional Chief Secretary, Home Department, advised the government against entertaining any such move. He also shared in the letter his concern that such a move could motivate other fringe elements to take the law into their own hands.\n\nHe requested the government to pursue the cases vigorously, at least those relating to Dakshina Kannada “so that culprits are brought to book in the interest of justice and fair play”.\n\nThe letter said Dakshina Kannada was communally sensitive and many incidents of communal violence were occurring at regular intervals.\n\nMr. Ibrahim, in his letter to the Home Department, said: “It is often reported that in all taluks of Dakshina Kannada, immoral policing and enforcement of law in the name of morality and ethics by vigilantes are very common.”\n\nMr. Ibrahim said the activities of Mr. Muthalik and his outfit were major reasons for law and order problem in Dakshina Kannada. “He visited the district on December 13, 2015 and made a fiery speech. Due to the enormous bandobast made by the police, no untoward incident took place.”\n\nThe letter said that the Superintendent of Police of Dakshina Kannada, in a letter on December 12, 2015, had requested prohibitory orders banning Mr. Muthalik from entering the district for a programme scheduled this month.", 
    "section": "national", 
    "title": "Dropping cases against Muthalik will demoralise police force, says DC", 
    "subsection": "general", 
    "date": "2016-01-01"
}