{
    "author": [
        "Justin Mccurry"
    ], 
    "text": "Although the day when every household has its own robot is some way off, the Japanese are demonstrating a formidable acceptance of humanoids\n\nErica enjoys the theatre and animated films, would like to visit South-East Asia, and believes her ideal partner is a man with whom she can chat easily.\n\nShe is less forthcoming, though, when asked her age. “That’s a slightly rude question… I’d rather not say,” comes the answer. As her embarrassed questioner shifts sideways and struggles to put the conversation on a friendlier footing, Erica turns her head, her eyes following his every move.\n\nIt is all rather disconcerting, but if Japan’s new generation of intelligent robots is ever going to rival humans as conversation partners, perhaps that is as it should be.\n\nErica, who, it turns out, is 23, is the most advanced humanoid yet to have come out of a collaborative effort between Osaka and Kyoto universities, and the Advanced Telecommunications Research Institute International (ATR).\n\nAt its heart is the group’s leader, Hiroshi Ishiguro, a professor at Osaka University’s Intelligent Robotics Laboratory, who is perhaps best known for creating Geminoid HI-1, an android in his own likeness, right down to his trademark black leather jacket and a Beatles mop-top made with his own hair.\n\nErica, however, looks and sounds far more realistic than Ishiguro’s silicone doppelganger, or his previous human-like robot, Geminoid F. Though she is unable to walk independently, she possesses improved speech and an ability to understand and respond to questions, her every utterance accompanied by uncannily human-like changes in her facial expression.\n\nErica, Ishiguro insists, is the “most beautiful and intelligent” android in the world.\n\n“The principle of beauty is captured in the average face, so I used images of 30 beautiful women, mixed up their features and used the average for each to design the nose, eyes, and so on,” Ishiguro says, pacing up and down his office at ATR’s robotics laboratory. “That means she should appeal to everyone.”\n\nShe is a more advanced version of Geminoid F, another Ishiguro creation who this year appeared in Sayonara , director Koji Fukada’s cinematic adaptation of a stage production of the same name.\n\nThe movie, set in rural Japan in the aftermath of a nuclear disaster, made Geminoid F the world’s first humanoid film actor, co-starring opposite the human actor Bryerly Long. While robots in films are almost as old as cinema itself, Erica did not rely on human actors — think C-3PO — or the motion-capture technology behind, for example, Sonny from I, Robot . Although the day when every household has its own Erica is some way off, the Japanese have demonstrated a formidable acceptance of robots in their everyday lives over the past year.\n\nFrom April, two branches of Mitsubishi UFJ Financial Group started employing androids to deal with customer enquiries. Pepper, a humanoid home robot, went on sale to individual consumers in June, with each shipment selling out in under a minute.\n\nThis year also saw the return to Earth of Kirobo, a companion robot, from a stay on the International Space Station, during which it became the first robot to hold a conversation with a human in space.\n\nHotel staffed by robots\n\nAnd this summer, a hotel staffed almost entirely by robots — including the receptionists, concierges and cloakroom staff — opened at the Huis Ten Bosch theme park near Nagasaki, albeit with human colleagues on hand to deal with any teething problems.\n\nBut increasing daily interaction with robots has also thrown up ethical questions that have yet to be satisfactorily answered. SoftBank, the company behind Pepper, saw fit to include a clause in its user agreement stating that owners must not perform sexual acts or engage in “other indecent behaviour” with the android.\n\nIshiguro believes warnings of a dystopian future in which robots are exploited — or themselves become the abusers — are premature.\n\n“I don’t think there’s an ethical problem,” he says. “First we have to accept that robots are a part of our society and then develop a market for them. If we don’t manage to do that, then there will be no point in having a conversation about ethics,” he adds.\n\nNomura Research Institute offered a glimpse into the future with a recent report in which it predicted that nearly half of all jobs in Japan could be performed by robots by 2035.\n\n“I think Nomura is on to something,” says Ishiguro. “The Japanese population is expected to fall dramatically over the coming decades, yet people will still expect to enjoy the same standard of living.” That, he believes, is where robots can step in.\n\nIn Erica, he senses an opportunity to challenge the common perception of robots as irrevocably alien. As a two-week experiment with android shop assistants at an Osaka department store suggested, people may soon come to trust them more than they do human beings.\n\n“Robots are a mirror for better understanding ourselves,” he says. — © Guardian Newspapers Limited, 2016", 
    "section": "national", 
    "title": "Erica, ‘most intelligent’ android, leads Japan’s robot revolution", 
    "subsection": "general", 
    "date": "2016-01-01"
}