{
    "author": [
        "Deepa H", 
        "Sruthisagar Yamunan"
    ], 
    "text": "Unlike the run-up to the Lok Sabha elections in 2014, Chief Minister Jayalalithaa did not state at the party general council meeting on Thursday that the AIADMK would face the Assembly elections alone. This has led to speculation that she might be open to forge an alliance given the continuous history of anti-incumbency defeats in Tamil Nadu since 1989.\n\nHowever, as the political situation stands, the AIADMK seems to have fewer options than its archrival DMK when it comes to finding suitable allies. Incidentally, the DMK’s position too is not very comfortable given the reluctance of smaller parties to align with it.\n\nIn fact, with many of the smaller outfits, who have traditionally held hands with either of the two Dravidian parties chalking their own path, the pool to lift allies has shrunk drastically, making electoral arithmetic even more crucial.\n\nFor example, the Left parties and the VCK, who contested the 2011 Assembly elections from AIADMK and DMK camps respectively, have come together with the MDMK to form the People’s Welfare Alliance. This group has positioned itself as an alternative to the two principal Dravidian parties. The PMK, which had the tag of being the most consistent alliance hopper in recent history, has also adopted a similar strategy and wants to lead an alliance. This leaves five significant smaller players, who have been traditional allies, out of AIADMK’s and DMK’s equation.\n\nThis is probably the reason why the DMDK’s worth has shot up as the State heads closer to the polls with DMK president M. Karunanidhi issuing a direct invitation. However, it is a given that the Leader of the Opposition Vijayakant will not tie up with the AIADMK. The Congress too is in an identical situation, with its government in Karnataka appealing against acquittal of Ms. Jayalalithaa in the disproportionate assets case.\n\nThis leaves the Tamil Manila Congress, the Manithaneya Makkal Katchi and the BJP alone as potential allies of the AIADMK. Though the first two may move any way, the BJP is currently trying to revive the now defunct National Democratic Alliance in Tamil Nadu.\n\nFive significant players are already out of the AIADMK and the DMK equations", 
    "section": "national", 
    "title": "Finding allies a difficult task for AIADMK", 
    "subsection": "general", 
    "date": "2016-01-01"
}