{
    "author": [
        "S Sandeep Kumar", 
        "Appaji Reddem"
    ], 
    "text": "Open universities and open schools will be introduced to help people acquire life skills, says Andhra Pradesh Chief MinisterN. Chandrababu Naidu.— File photo: K.R. Deepak\n\nAmaravati project is on track; Phase-I will be completed by 2018, says the Andhra Pradesh Chief Minister\n\nThough the last 18 months have been challenging for Andhra Pradesh Chief Minister N. Chandrababu Naidu , interlinking Godavari and Krishna rivers has been a notable achievement for him.\n\nIn an interaction with Appaji Reddem and S. Sandeep Kumar of The Hindu , in Vijayawada, Mr. Naidu lists out his priorities for 2016, which include a drought-proof State, completion of the Polavaram project, construction of a capital city in Amaravati and development of coastal region as an export hub.\n\nAmid multiple challenges you faced in the last 18 months post Andhra Pradesh bifurcation, what is the most satisfying achievement you would like to highlight?\n\nThe interlinking of Godavari and Krishna rivers has been the most satisfying exercise. The next aim is to make Andhra Pradesh a drought-proof State through different measures such as sparkler irrigation system, construction of 10 lakh farm ponds and dry-spell mitigation through rain guns. This will be the biggest and most important exercise of my life besides Amaravati.\n\nWith the State having multiple drought-prone districts, is it possible to have the mammoth plan of realising the goal of a drought-proof A.P.?\n\nThere was a long-drawn crisis and uncertainty in agriculture. Godavari was just 170 kilometres away and joining the sea. In this backdrop, the crisis is clearly a human failure. Now, I found a solution through interlinking of rivers. We have 900 mm average rainfall but still we suffer due to lack of proper irrigation while Israel, with 500 mm rainfall, is successful in agriculture.\n\nOf late, you are focussing more on recharging ground water table. What is the broad plan?\n\nThe idea is to bring the average ground water table to three metres across the State. We are planning smart water grids, installation of piezometers to record water levels in villages and mandals. We want to involve people, especially farmers in the exercise. One metre ground water re-charge is equivalent to 90 TMC of water. Besides, there will be no evaporation loss and a lot of energy can be saved.\n\nPolavaram has been a long-drawn project. How confident are you about completing the mega-irrigation initiative?\n\nWe will complete the project by 2018. The Central funding is crucial and we are confident of constructing the project within the stipulated time.\n\nHow did your meeting with NITI Ayog vice-chairman Arvind Panagaria go on Wednesday?\n\nThe meeting went on well and he has completed the report which was already submitted to the Prime Minister’s Office. Now everything rests with the PMO.\n\nWhat are the concrete developments witnessed in the phase one of the capital in Amaravati?\n\nWe’ll be completing phase-I by 2018. Already, three top universities like SRM, VIT and Amity have come forward (to set up campuses). We’ll be inviting Symbiosis next. The project is very much on track. To ensure construction of the capital, we need funding from the Centre besides borrowing.\n\nThere is a plan to leverage the long coastline in A.P. Can you elaborate more on this?\n\nA.P. is centrally located with long coasts and high drafts. This is the biggest advantage for us.\n\nI want to make the region a manufacturing hub and coastline should be utilised for the development of export industry.\n\nTo achieve this, the Centre has to clear bottlenecks and grant incentives. I see it as a future nerve centre of export industry.\n\nYou were talking about Darbar shift by June 2016. Is the exercise on track?\n\nWe are committed to shifting the entire administration by June and already six lakh square feet space is being created at Mangalagiri in the Amaravati capital region to accommodate the Secretariat and other offices.\n\nThere is a lot of emphasis on your pet programme Janmabhoomi. What would be the focus areas?\n\nThe focus is to change challenges into opportunities. From being a power-deficit State, we have turned around to become a power-surplus State. Likewise, we’ve achieved 11.8 per cent growth rate in the first half. Now, we plan to develop smart villages and smart wards by involving public and private sectors. I also want NRIs and corporate firms along with local people to develop the smart villages.\n\nYou are always known to be an IT man. What are your grand plans for 2016?\n\nWe are introducing 10-15 MBPS fibre optic lines that provide internet, telephone and video on-demand services across the State. The connectivity work has already been completed in Srikakulam and Vizianagaram districts and by June, the entire State will be covered. This apart, we are setting up content corporations in association with the private sector to provide unlimited content through cloud computing so that the people from all sectors could reap benefits. Open universities and open schools will be introduced to help people acquire life skills.\n\nI want to make the coastal region a manufacturing hub and use coastline for export industry", 
    "section": "national", 
    "title": "‘Interlinking Godavari, Krishna my most satisfying exercise’", 
    "subsection": "general", 
    "date": "2016-01-01"
}