{
    "author": [
        "Rukmini S"
    ], 
    "text": "What matters more for development: location or community? New official data show that while some communities do better than others in sex ratio and literacy, State-level differences can be as important.\n\nNewly released data from the Census shows that on average nationwide, Christians, followed by Muslims, continue to have the most gender-equal child sex ratios of 958 girls for every 1,000 boys and 943 respectively. Buddhists follow, with Hindus, Jains and Sikhs, recording the lowest child sex ratios; the numbers for Jains and Sikhs have, however, improved since 2001, while those of all other communities have worsened.\n\nHowever, a look at the State-wise data shows that communities are not monoliths. In the States with better sex ratios, including the States with high tribal populations and the southern States, the sex ratios of all communities tend to be higher than they are in other States.\n\nIn Kerala, for instance, Hindus, Muslims and Christians have nearly the same sex ratio among the 0-6 year child population, around 965 girls for every 1,000 boys, which is higher than the national average for each of those communities as well. In Haryana, the State with the worst sex ratio, on the other hand, the sex ratios of the child populations of Sikhs, Hindus, Christians and Muslims are all lower than the national average.\n\nMuslim sex ratios are particularly unaffected by location; while Christian child sex ratios dip below 900 girls for every 1,000 boys in Haryana, Rajasthan and Punjab, for instance, the Muslim child sex ratio only falls below 910 in one State: the Muslim-majority Jammu & Kashmir.\n\nThe State which had a far more gender-equal sex ratio of 941 in 2001 has seen one of the sharpest ever declines. Consequently, the sex ratio of the child population of all communities in the State is now below 900, except among Buddhists.\n\nA similar combination of location and community is at play when it comes to literacy. For the country as a whole, Muslims have the lowest literacy rates for both men and women, while Jains have the highest for both.\n\nIn Kerala, however, the literacy rate among Muslim women (79 per cent) is higher than it is for men of all communities in Bihar. National averages hide other State-level variations.", 
    "section": "national", 
    "title": "Location too matters for growth", 
    "subsection": "general", 
    "date": "2016-01-01"
}