{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Pilgrims waiting for darshan at the Ayyappa temple at Sabarimala on Thursday morning.\n\nSabarimala Ayyappa temple continued to witness heavy pilgrim inflow on Thursday.\n\nRituals in connection with the Makaravilakku pilgrimage season began with Tantri Kandararu Mahesh Mohanararu performing the Ashtadravya Maha Ganapati homom in the morning followed by Ashtabhishekom and Neyyabhishekom.\n\nThe police regulated the inflow of pilgrims by blocking them at different points from Pampa and releasing them periodically. Pilgrims had to wait for hours in the thickly packed iron barricades.\n\nThe police too were put to task in managing the mammoth crowd that had reached Sabarimala during the past 48 hours.\n\nAravana stock\n\nTravancore Devaswom Board officials at Sabarimala told The Hindu that the pilgrim turnout would be much high in the coming days as a large number of devotees from different parts of Tamil Nadu could not undertake their pilgrimage during the Mandalam season owing to the floods in Chennai and other parts of the State.\n\nDevaswom Executive Officer Renu Gopal told The Hindu that the TDB had ensured sufficient stock of Appam and Aravana, the most sought-after prasadom at Sabarimala, to meet the pilgrims demand.\n\nCentral forces\n\nThe temple administration had maintained a buffer stock of 14 lakh cans (250 ml each) of Aravana as on Thursday. Mr. Gopal said the TDB had made elaborate arrangements for the Makaravilakku festival to be celebrated on January 15.\n\nAs many as 1,050 civil police officers had been deployed at the Sannidhanam from Wednesday.\n\nBomb squad and commandos of the State Police have been deployed at the Sannidhanam.\n\nA company each of National Disaster Response Force and Rapid Action Force attached to Central Reserve Police Force have been deployed at Sabarimala right from the beginning of the annual pilgrim season in mid-November.", 
    "section": "national", 
    "title": "Long wait for pilgrims at Sabarimala temple", 
    "subsection": "general", 
    "date": "2016-01-01"
}