{
    "author": [
        "Suhasini Haidar"
    ], 
    "text": "The frequency of Prime Minister Narendra Modi’s visits abroad has been one of the defining marks of his tenure. In 2014, Mr. Modi visited 9 countries in 7 months (1.2 countries a month), and doubled that rate in 2015, visiting 28 countries in 12 months (2.3 per month).\n\nSo, where will he head in 2016, and what is likely to drive those visits? More importantly, will he travel more than he has travelled in the past 19 months? Senior officials who spoke to The Hindu say ‘no.’ “This will be a year of incoming rather than outgoing visits,” one official explained “We will not see a repeat of the past two years now, the PM has indicated.”\n\nInstead, he will hit the floor running with incoming visits, some from countries keen to invite the Indian PM, and others returning his visit. French President Francois Hollande will be the big visitor in January, when he comes to be the chief guest for the Republic Day Parade.\n\nAnother visit that will be looked out for is one by Nepal’s new Prime Minister K.P. Sharma Oli. There is some hope that Bangladesh PM Sheikh Hasina could also visit in the first quarter of the year, to return Mr. Modi’s visit in June last year, as well as to attend an international women’s conference. As The Hindu reported, visits are expected from leaders of Israel and Palestine.\n\nDespite the string of big visits expected later in the year as well, Mr. Modi will undertake some travel, according to officials. Some of the visits are long overdue, including to Maldives.\n\nAnother visit on the anvil is to Saudi Arabia. “This is one of the most important G-20 member countries that Mr. Modi has not been able to visit yet,” an official said.\n\nThis will be a\n\nyear of incoming rather than outgoing visits,\n\nsay officials", 
    "section": "national", 
    "title": "Modi’s itinerary for 2016 is filling up", 
    "subsection": "general", 
    "date": "2016-01-01"
}