{
    "author": [
        "National Bureau"
    ], 
    "text": "Prime Minister Narendra Modi along with Uttar Pradesh Governor Ram Naik and Ministers Nitin Gadkari and Harsh Vardhan in Noida on Thursday.- Photo: Ramesh Sharma\n\nTough exchange of words between Prime Minister Narendra Modi and the Congress on Thursday ended the country’s political calendar for the year. Mr. Modi accused the Congress of trying to “destroy Parliament” while the Congress blamed him for exercising “autocracy.”\n\nThe Prime Minister launched his attack against the Congress at a public meeting in Western Uttar Pradesh where he laid the foundation for a 14-lane Delhi-Meerut Expressway.\n\n“Those who have enjoyed power for 50-60 years, they have no right to destroy Parliament...to stop functioning of Parliament,” said Mr. Modi, hinting at the Congress rule ever since India became independent.\n\nThe heated rhetoric from both sides implies that the coming year would be full of political wrangling over the contentious issues like the passage of the Goods and Services Tax (GST) Bill and the amendment to the Land Acquisition Act. Mr. Modi said the Congress should take an oath that it will allow Parliament to function in 2016.\n\nProjects in poll-bound U.P.\n\nThe government also announced road projects worth Rs. 55,000 crore for Uttar Pradesh. The announcement of the projects comes a year ahead of the U.P. polls.\n\nThe Prime Minister hailed the expressway project as a “highway to development.” At an estimated worth of Rs.7,500 crore, Mr. Modi said the project would employ thousands of people and also boost the purchasing power of the poor.\n\nHe said that from January 1 the government would abolish the interviews for class III and class IV employees; appointments would only be on merit.\n\nReacting to the Prime Minister’s remarks, Congress spokesperson Randeep Singh Surjewala said: “We believe the responsibility of running Parliament is that of the government and of championing people’s issues is that of the Opposition.” The Prime Minister was “out of step with reality,” he said.\n\n‘Those who have enjoyed power for 50-60 years have no right to destroy Parliament’", 
    "section": "national", 
    "title": "Modi sets a tough political tone for the New Year", 
    "subsection": "general", 
    "date": "2016-01-01"
}