{
    "author": [
        "Lalatendu Mishra"
    ], 
    "text": "As the flood-affected people of Chennai try to piece their lives together, large Mumbai-based corporates with a significant presence in the southern city and many multinational corporations running big back-office operations there have risen to the occasion.\n\nApart from meeting relief needs on the ground, corporates are providing their employees soft loans and work flexibility, besides adopting local facilities.\n\nTata Group companies and the Tata Trusts have contributed to flood relief besides various other interventions. “We diverted our people to the flood-affected districts. We ran community kitchens, provided access to safe drinking water and set up health camps. We treated over 8,000 patients and supplied 1,80,000 litres of purified water,” Khorshed Palati, Senior Development Officer, Tata Trusts told The Hindu .\n\nMahindra Group said its firms supported the relief work. Mahindra Consulting Engineers installed 20 pre-fabricated toilets at various relief camps.\n\nMahindra Research Valley provided immediate support by distributing food packets, bed sheets and mats to around 1,000 affected families.\n\nIn its relief work for the community, Hinduja Group flagship Ashok Leyland adopted three facilities — an old age home, a home for the mentally challenged and an orphanage — where residents were being provided provisions, clothes, towels, pullovers, water, medicines, and toiletries, among other essentials.\n\nLarge MNCs having their base in Chennai, especially for backend operations, captive KPOs/BPOs, are doing their best to ensure uninterrupted services to their global clients.\n\nFor flood victims in general Shell sent trucks filled with non-perishables, medication, clothing, blankets, cleaning material and drinking water from Bengaluru to Chennai as an immediate action, a top official said.\n\nJet Airways made available cargo space for relief material to be transported free of cost.\n\nThe airline also helped bring back 27 school children who were stranded in Port Blair by rerouting them via Kolkata to Bengaluru at no extra charge.\n\nBesides meeting relief needs, they have provided soft loans and work flexibility to their Chennai employees", 
    "section": "national", 
    "title": "Mumbai corporates stand by Chennai in its hour of crisis", 
    "subsection": "general", 
    "date": "2016-01-01"
}