{
    "author": [
        "Vijaita Singh"
    ], 
    "text": "Pakistani singer to get Indian citizenship\n\nFile photo of Pakistani singer Adnan Sami who has been granted Indian citizenship with effect from January 1.\n\nIt will be an apt New Year’s gift for Pakistani singer Adnan Sami. Mr. Sami will become an Indian citizen on Friday as soon as he completes the necessary paperwork. The Union Home Ministry cleared the proposal on Wednesday. Mr. Sami, who has been staying in India since 2011, will have to fill a citizenship form at the Home Ministry’s office in Delhi and pay Rs. 13,700, a senior government official explained.\n\nThe Hindu reported on October 24 that the decks had been cleared for Mr. Sami’s Indian citizenship after Attorney General Mukul Rohatgi gave a favourable opinion.\n\nMr. Sami will be given citizenship under Section 6 (I) of the Indian Citizenship Act, 1955 under the category “citizenship by naturalisation.”\n\nThe power to grant citizenship lies with the Home Ministry and Mr. Sami will have to go to the Foreigners Division Office located on Jai Singh Road, near Connaught Place to complete the paperwork.\n\n“There is a fee for every process and for acquiring citizenship it is Rs. 13,700. He will have to sign the citizenship form as well and once the formality is done he will be provided the citizenship certificate,” said the official.\n\nMr. Sami is now on a three-month visa extension which was given to him on October 6 by the MHA. His Pakistani passport issued on May 27, 2010 expired on May 26 this year and it was not renewed by the Pakistan government. He then renounced his Pakistani citizenship. Mr. Sami approached the Home Ministry with the request to legalise his stay in India on humanitarian grounds.\n\nLahore-born Sami first arrived in India on March 13, 2001 on a visitor’s visa issued by the Indian High Commission in Islamabad.", 
    "section": "national", 
    "title": "New Year’s gift for Adnan Sami", 
    "subsection": "general", 
    "date": "2016-01-01"
}