{
    "author": [
        "Pavan Dahat"
    ], 
    "text": "Even after the much-discussed “leaked tapes” of purported conversations with the relatives of Chhattisgarh Chief Minister Raman Singh to “fix” a by-election last year, senior Congress leader Ajit Jogi remains the most popular politician in the State even as Mr.Singh continues to be the most powerful leader in the ruling BJP.\n\nMore than a year and a half before the alleged tapes surfaced, many senior Congress leaders in Chhattisgarh had blamed the Jogis for Congress candidate Manturam Pawar’s last-minute withdrawal from Antagad assembly byelection in August, 2014.\n\nThe Jogis have always denied the allegations of a “hidden alliance,” but the family remains sidelined in the State Congress unit and it accuses the party of practicing ‘Anybody but Jogi’ policy.\n\nAccording to some Congress sources, the party’s central leadership was already in the know of the tapes.\n\nAn officer-bearer of the State unit went on to allege that the “tapes” may have been “leaked” at the behest of the central leadership to corner the Jogis as “Rahul Gandhi is not very comfortable with Ajit Jogi’s ways”.\n\nExpulsion threats\n\nHowever, the Jogi group is familiar with the threats of “expulsion” from the party. But after every trip to New Delhi, the Jogis manage to “extract” what they want from the central leadership.\n\nThe leaked tapes seem to have rung more alarm bells in the CM’s house than in the Congress as it also features Raman Singh’s son-in-law Puneet Gupta.\n\n“If the tapes are authentic, then the big question to ask is who dared to tap the phones of the chief minister’s relatives.\n\nBut the tape saga would not leave a big impact on Raman Singh’s politics unless and until the central leadership of the BJP takes the issue seriously.\n\nAction ruled out\n\nThe action against the CM is ruled out as the BJP does not really have many options in the State, with most of the leaders and even cabinet ministers embroiled in a series of controversies,” said a BJP leader, requesting anonymity.\n\nAn election observer, who spoke to The Hindu on the condition of anonymity, said the leaked tapes will not have much impact unless and until the central leadership of both the parties decide to act.", 
    "section": "national", 
    "title": "Not much changes in Chhattisgarh politics after ‘leaked tapes’", 
    "subsection": "general", 
    "date": "2016-01-01"
}