{
    "author": [
        "Shiv Sahay Singh"
    ], 
    "text": "Yechury asks party cadres to be prepared for the upcoming elections in four States\n\nThe five-day plenum of the Communist Party of India (Marxist) ended here on Thursday with a resolve to strengthen the links of the party with the people for it to emerge as a revolutionary party with a mass line and combat all deviations within.\n\nAddressing the concluding session of the plenum, CPI(M) general secretary Sitaram Yechury said: “We have to combat all deviations inside our party. We have to be steeled as communists to fight the deviations inside our party and, in doing so, the only weapon we have is party unity.”\n\nIn his short speech replete with quotes from left-wing intellectual Faiz Ahmed Faiz and Vietnamese Communist revolutionary leader Ho Chi Minh, Mr. Yechury said it was only the CPI(M) that could offer a “policy alternative, a better political culture that fights corruption, moral degradation and degeneration, which is rampant in Indian politics today.” A document highlighting the decisions of the plenum stated that it was the “historic responsibility” of the CPI(M) that it must emerge as the “vanguard of the people’s upsurge”.\n\nMr. Yechury said the party had successfully completed the mandate of the 21st party congress by holding the plenum that had “resulted in a more galvanised CPI(M).”\n\nThe CPI(M) general secretary also urged party cadres to be prepared for the upcoming elections in four States, including West Bengal and Kerala, where they have to take the party’s message to the people and also brave attacks by hostile forces.\n\nThe plenum unanimously adopted the Report on Organisation. The Resolution on Organisation also highlighted the need for inclusion of more women, youth and other sections unrepresented in the party. “A total of 191 amendments and suggestions were received for the Draft Report on Organisation, of which 36 were accepted. There were 73 amendments and suggestions to the Draft Resolution on Organisation, of which six were accepted,” a press release said.", 
    "section": "national", 
    "title": "‘Only CPI(M) can be an alternative’", 
    "subsection": "general", 
    "date": "2016-01-01"
}