{
    "author": [
        "Alok Deshpande"
    ], 
    "text": "Maharashtra mulls over formation of a corporation to look into woes\n\nThree successive years of deficient rain has hit banana production in Maharashtra and given rise to the monopoly of traders. Maharashtra’s banana farmers now sell their product at the lowest of rates to traders, who go on to sell the fruit at a much higher rate in urban areas.\n\nTaking note of the discontent among farmers, the State government is mulling the formation of a banana corporation, which will look into the famers’ woes — from cultivation to marketing of the fruit.\n\nJalgaon district is considered the State’s banana capital. Over 45,000 hectares of land in the district is under banana cultivation.\n\nIn 2015, poor groundwater level and disease-hit crops decreased the total production of the fruit from around 20 tonne per hectare to 12-14 tonne per hectare. In Jalgaon, majority of the banana crop is concentrated in Raver and Yaval tehsils.\n\n“Traders take advantage of the fact that it is a perishable fruit. Once off the tree, the farmer looks forward to selling it as soon as possible. Due to low production this year, farmers are ready to sell it even at a lower price to avoid losses. They know that it won’t be a profitable, but it is better to have some money than nothing,” said Dipak Patil, a banana farmer from Sakali, in Jalgaon’s Yawal tehsil. Mr. Patil owns around 40 acres of land with 45,000 banana trees.\n\nFalling rates\n\nApart from the falling rates, failure of insurance companies to settle claims of crop loss has also harmed farmers. A number of them have approached the Bombay High Court and the case is pending.\n\nSince there is no government-mandated minimum support price, the rates per quintal are decided by market committees of respective tehsils.\n\nThe Raver Market Committee in 201 decided to set a rate of Rs 375 per quintal. “It is hardly followed by anyone. Farmers want at least some cash in hand and traders take advantage of it. The same situation exists everywhere,” said Haribhau Jawale, BJP MLA from Jalgaon district.\n\nInclusion in mid-day meal\n\nHe added that the monopoly of Jalgaon bananas is now over and north Indian States too cultivate the fruit.\n\n“It has further lowered the demand. Supplementary processing industries along with agriculture are needed. Banana beer could also be one of the major options,” he said, adding that around 42 by-products can be obtained.\n\nIn the recently concluded winter session of the State Assembly, a number of MLAs demanded the inclusion of banana in the mid-day meal scheme in schools as it would ensure a fixed sale and price for the fruit.\n\nChief Minister Devendra Fadnavis, who was in Muktainagar in Jalgaon on Thursday, said the government would look into the formation of a banana corporation, which will take care of crucial aspects such as fixing price, marketing, and opening supplementary industries.\n\nThe failure of insurance firms\n\nto settle claims\n\nof crop loss has\n\nalso hit farmers", 
    "section": "national", 
    "title": "Poor rainfall lands banana farmers on a sticky wicket", 
    "subsection": "general", 
    "date": "2016-01-01"
}