{
    "author": [
        "Shoumojit Banerjee"
    ], 
    "text": "The prime accused in a ponzi scam was shifted to the Solapur Medical College late Wednesday evening after he complained of severe chest pain.\n\nMahesh Motewar, chairman and managing director of the scam-hit Samruddha Jeevan Foods India Ltd., was due to appear in a local court in Osmanabad in a 2012 cheating case. His police custody was to end on Thursday.\n\n“A day before the end of his police remand, the accused complained of chest and back pain and had to be shifted to Solapur. It is doubtful whether he will be produced in court today,” said an officer at the Murum police station.\n\nA police team from Odisha is also in Umarga, Osmanabad, to question Mr. Motewar as several investors in the State have been hit by the scandal.\n\nDetained on Monday\n\nMr. Motewar, known for his ties with Maharashtra’s politicos, was detained in Pune on Monday and handed over to the Osmanabad district police, who arrested him.\n\nOn Tuesday, the Central Bureau of Investigation raided 58 places linked to the Samruddha Jeevan Group of companies, including 40 locations in Pune and offices in Nashik, Aurangabad, Solapur, and Odisha.\n\nThe Osmanabad police declared Mr. Motewar absconding since 2013, under Section 299 of the Code of Criminal Procedure, after he failed to appear in court in connection with a Rs 35-lakh dairy scam in Umarga. But the accused was conspicuously visible in public. The same year, the Securities and Exchange Board of India barred the company from raising money after a probe exposed how it defrauded investors through dubious cattle and goat farm schemes. The Sebi probe revealed that the company ran the Collective Investment Scheme without proper regulatory approvals.\n\nMahesh Motewar was due to appear in a local court in Osmanabad in a 2012 cheating case", 
    "section": "national", 
    "title": "Prime accused in Pune ponzi scheme takes ill on day of trial", 
    "subsection": "general", 
    "date": "2016-01-01"
}