{
    "author": [
        "Prafulla Das"
    ], 
    "text": "In a classic case of the rich enjoying the poor’s benefits, the Naveen Patnaik government has been hit by a major ration card scam that is baring its fangs across Odisha.\n\nMany rich and influential people, including elected representatives of the ruling BJD, have managed to procure ration cards under the National Food Security Act, it has emerged.\n\nThe State government had not taken any strong step when opposition Congress and BJP had earlier alleged that undue favours were shown to the ruling party leaders, workers and sympathisers in the issuance of the ration cards while deserving poor families were denied the same.\n\nBut skeletons soon started tumbling out of the BJD government’s cupboards. Mayor of Cuttack, Anita Behera, resigned after it came to light that she had been issued a ration card. Many other city corporators were also found to have been included in the list of beneficiaries.\n\nMore such cases of irregularities have been emerging from different parts of the State. Those found to have been issued the digitised ration cards under the National Food Security Act (NFSA) include councillors, corporators, panchayati raj institution representatives and the spouse of a ruling party legislator. (Wife of Rajiv Patra, a sitting BJD legislator from Baliguda in Kandhamal district, was issued such a card.)\n\nFinding himself in a tight spot, Chief Minister Naveen Patnaik placed a senior administrative officer under suspension a day after Ms.Behera resigned. The officer is question was earlier the in-charge of the verification process for issuance of these cards in the Cuttack Municipal Corporation.\n\nAn employee of the Corporation and a school teacher were also suspended over the issue the day Ms.Behera resigned.As demand grew for action against all those whose names figured in the list, the State government on Thursday clarified that the Baliguda legislator’s spouse had in fact applied for cancellation of the card about a month ago.\n\nSimilar allegations have also cropped up from several urban local bodies in the Chief Minister’s home district of Ganjam, including from the Berhampur Municipal Corporation. The other urban local bodies that have figured in the scam so far include Puri, Bhadrak, Kendrapara, Keonjhar and Mahanga.\n\nWhile opposition parties are keen to make it a major political issue during the New Year ahead of panchayat elections, many heads may roll as the Chief Minister has directed the District Collectors to register criminal cases against the well-to-do who had procured ration cards and the officials who facilitated issuance of the cards to undeserving families.\n\nUntil Ms.Behera’s case came to light, the Patnaik government had been refusing to acknowledge any irregularities in the selection of NFSA beneficiaries. On numerous occasions, poor villagers were seen agitating before office of Collectors in different districts protesting exclusion of their names.", 
    "section": "national", 
    "title": "Ration card scam bedevils Odisha government", 
    "subsection": "general", 
    "date": "2016-01-01"
}