{
    "author": [
        "B Aravind Kumar"
    ], 
    "text": "Thanking the general council for authorising her to take all decisions, Jayalalithaa said AIADMK cannot be defeated in future\n\nChief Minister and AIADMK general secretary Jayalalithaa at the party's general council meeting at Thiruvanmiyur in Chennai on Thursday. -Photo: M. Vedhan\n\neeping her alliance options open, AIADMK general secretary Jayalalithaa on Thursday said she will take the “right decision” at an “appropriate time” based on the “electoral climate” at the time of the Assembly elections.\n\nIn her address at the party’s general council, Ms. Jayalalithaa said several strategies had to be followed to emerge victorious in elections.\n\nNew strategies need to be formulated to defeat the “evil designs” of opponents every time, she added.\n\n“There is no single strategy that can win all elections. Therefore, the AIADMK had an alliance with a few parties in 2009 Lok Sabha elections. In 2011, the Assembly elections were fought in the company of a few parties.\n\n“In 2014 Lok Sabha elections, we contested alone and won 37 seats to become the third largest party in Lok Sabha. Likewise, I will take the right decision at the appropriate time,” she said to the thunderous applause of the executive committee and general council members.\n\nThanking the general council for fully authorising her to take “all decisions on elections”, she said the AIADMK can’t be defeated in future.\n\n“The party has ruled thrice with MGR as Chief Minister. It has ruled thrice under my leadership. This is a movement that has won six elections to form governments. We will only win hereafter.”\n\nOn floods, relief\n\nSensing the pulse of the people in the aftermath of the floods in six districts, the Chief Minister devoted a considerable time of her speech to explain once again that the floods were the result of nature’s fury and how the government had put its best foot forward in relief and rehabilitation measures.\n\nShe appreciated her partymen along with others for providing relief to the flood-hit.\n\nTargeting arch-rival DMK for carrying out a false propaganda, she said there was no need to expect an anti-incumbency wave to set in hereafter and asked her partymen to counter the allegations against the party by explaining to people the facts on floods.\n\nThroughout her speech, the AIADMK supremo ignored the DMDK and its leader Vijayakant, the Opposition leader in the Assembly.\n\n“It was Amma who gave him the address during the last Assembly elections. In the coming elections, he will lose his address again,” said an AIADMK MP.\n\nTargeting the DMK, she says no need to expect an anti-incumbency wave will set in", 
    "section": "national", 
    "title": "‘Right decision on alliance will come at right time’", 
    "subsection": "general", 
    "date": "2016-01-01"
}