{
    "author": [], 
    "text": "National Archives files reveal late PM failed to declare the diamond and emerald necklace, said to be received as a gift\n\nAn art deco emerald and diamond necklace expected to realise £120,000 - £180,000 at auction, is seen during a photocall at Christie’s in central London in this photo dated December 11, 2015. The preview was to promote the auction titled “Mrs Thatcher: Property from the Collection of the Right Honourable The Baroness Margaret Thatcher of Kesteven”.— Photo: AFP\n\nA diamond and emerald necklace allegedly given to Margaret Thatcher by a Middle Eastern oil minister but never declared as a gift caused consternation inside No 10, newly released documents reveal.\n\nDowning Street press officers were alerted when a Guardian journalist called about the supposed clandestine donation in October 1985, according to documents released by the National Archives in Kew on Wednesday.\n\nBracelet and earrings\n\nThe jewels, said to have included earrings and a bracelet, were allegedly given by the then president of OPEC, Mana Saeed al-Otaiba from the UAE. A No 10 press officer wrote in a detailed note: “David Pallister of the Guardian has been enquiring about certain gifts allegedly made to the prime minister in March 1982 by Dr Otaiba.\n\n“The gifts were allegedly presented in Flood Street [Thatcher’s house in Chelsea] when Dr Otaiba was on a private visit to London at a time when the oil market was very sensitive.\n\n“The gifts allegedly comprised a necklace, earrings and bracelet, all in diamonds and emeralds; and were allegedly purchased from the jewellers Kuchinsky [Kutchinsky in Knightsbridge].” Downing Street had no record of the meeting but noted that Thatcher had received gifts from Otaiba at official meetings in 1981.\n\nNo 10 was told the jewels had been spotted in a car on their way with Otaiba to Flood Street. Charles Powell, Thatcher’s private secretary, and Bernard Ingham, her press secretary, were alerted to the dangers.\n\nAnother Downing Street memo said: “I’ve passed this info on to [the press officer] but asked him not to say what gifts have actually been received. It could be difficult if the PM did receive the gifts personally without our knowledge and Dr Otaiba was to see a denial in the Guardian .” Downing Street’s file does not state whether Thatcher received the necklace. However, a diamond and emerald necklace featured in a Christie’s sale of her personal possessions in December and fetched £158,000. The sale catalogue did not explain how it came into her possession.\n\nA Christie’s spokesperson told the Guardian : “We had understood that this was not such an object [i.e. a gift]. However, any gifts which were given to Margaret Thatcher whilst serving as prime minister and deemed by the Cabinet Office to be of significant value were purchased after Margaret Thatcher’s tenure as prime minister.”\n\nThe jewellers Moussaeiff, which now owns Kutchinsky, said it did not recognise the Christie’s sale jewellery and added that Kutchinsky files could not be accessed easily.\n\n‘Red Storm Rising’\n\nThe newly released documents also revealed that Ronald Reagan urged Thatcher to read a blockbuster thriller to understand the Soviet Union’s cold war thinking in the run-up to a failed arms control summit in Reykjavik.\n\nThe then US President suggested the Prime Minister should read Red Storm Rising , the second novel by the thriller writer Tom Clancy, during a phone call in preparation for the 1986 meeting with Mikhail Gorbachev in the Icelandic capital. — © Guardian Newspapers Limited, 2015", 
    "section": "national", 
    "title": "Thatcher’s mystery gems", 
    "subsection": "general", 
    "date": "2016-01-01"
}