{
    "author": [
        "M Dinesh Varma"
    ], 
    "text": "Works of women from several countries on display at painting exhibition\n\nThe artistic voice of women from several countries has found expression in a painting exhibition that is on show at Kala Kendra, Bharat Nivas in Auroville.\n\nHosted by Pondicherry Art Akademy, ‘Mirror Canvas’ features an assortment of styles and media in the 86 paintings on display.\n\nThe exhibition, which is on till March 30, has entries by 21 women painters, including six artists based in Auroville who hail from the U.S., France, Germany, Spain and the Czech Republic. Indian artists from Bengaluru, Chennai and Coimbatore, besides Puducherry, have displayed their works at the event.\n\n“The only commonality is that these are all works by women painters. The exhibition features a variety of themes, styles and media,” said Sridalaadevi G. of the Akademi who is a painter herself for whom the myriad roles of women in society is in itself a compelling leitmotif in her works of art.\n\nCompared to last year’s show at the Aurodhan when the Akademy displayed works by ten artists, this event has not only doubled that number but also lent an international flavour for the event.\n\nA panel of senior artists selected the women artists for the event based as much on their works as their dedication to the art. Most artists have submitted between three to five paintings for the show.\n\n“In a way, our paintings are just a reflection of our self. And when others come and stand in front of our painting, surely they will see it from their own perspective and so it reflects them too. Here, the canvas plays the role of a mirror, says Ms. Sridalaadevi.\n\nSome of the interesting exhibits that could make a visit to the Bharat Nivas Kalakendra totally worth it include ‘Saraswati’ by Audrey Wallace from the U.S. who has made Auroville her home since two years ago, Bindu Nambiar’s exploration of the elaborate make up of the performer of Kerala’s ritual art of Theyyam or Coimbatore-based Sindhumati’s painting ‘Lady with doves’ which dabbles with traditional techniques.\n\nAlso on display are works by Emilie Moreau, a French artist whose style is described as a “mix of pop, street and narrative figuration”. Ms. Emilie is associated with the Coon art gallery in Madrid and the Art DropShip in Chennai.", 
    "section": "national", 
    "title": "A variety of styles and themes", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}