{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Asserting that the Pattali Makkal Katchi would bring about a “revolutionary change” in education system by revamping it, party’s Chief Ministerial candidate Anbumani Ramadoss has promised that school and higher education curriculum will be of superior standard if his party is voted to power.\n\nAddressing a meeting organised by the party’s students’ wing here on Tuesday on ‘Free and quality education’, Dr. Anbumani said that the salient features of proven and effective educational systems of developed nations would be followed in the State, wherein the syllabus matching the standards of CBSE curriculum would be introduced in all government and aided schools in a bid to provide quality and free education to every children.\n\n“The badly diluted ‘Samacheer kalvi’ curriculum will be taken to greater standards as we intend to take it even to the disadvantaged children studying in the government or aided schools. Free, quality and compulsory education will be provided through e-learning in Tamil Nadu, where no importance was given for providing quality education after the rule of K. Kamaraj,” Dr. Anbumani said.\n\nApart from this, the children would be provided with right ambience for learning English as second compulsory language and Hindi or any other foreign language as third optional language at school level, which would enable them to compete at national and global level.\n\n“If the PMK is voted to power, we’ll never give you freebies such as television sets and domestic appliances. Instead, we’ll give you free education, healthcare and free farm inputs through corruption-free administration, which will collectively save at least Rs. 1 lakh per family per annum,” he assured.\n\nWhile answering participants’ queries, Dr. Anbumani solicited valuable suggestions from the audience on making the educational system more vibrant.\n\nSpeaking to reporters later, he said that the PMK would be the right choice of the voters, especially the young voters.", 
    "section": "national", 
    "title": "Anbumani for free, quality education", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}