{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Commuters, especially women, travelling on buses or waiting at bus stops in the city have to be extremely cautious of their belongings. A group that engages in conversations with commuters, only to rob them, is on the prowl, caution police. Three such suspects were arrested recently.\n\nThe group targets elderly women commuters, snatching gold chains from them.\n\nRadha, Kalishwari and Meenachi, all in their early twenties, and from Chinna Salem in Villupuram district, were arrested by the SRMC police team on charges of stealing a gold chain weighing four sovereigns from a woman commuter in Karambakkam.\n\nThe police team headed by inspector R. Purushotaman got clues about the suspects after the victim narrated the manner in which the crime was committed.\n\nWhile the victim was waiting at the bus stop, a group of three women approached her and picked up a conversation with her.\n\nThey informed her that the gold chain she was wearing had snapped and asked to her keep it inside her bag.\n\nThe victim did as she was told. But when she got down at her destination, she found that the chain was missing, police said.\n\nInvestigating team\n\nThe investigating team comprised women who acted as decoys who made several trips on the city buses, keeping a close watch on strangers approaching elderly women commuters.\n\nThe women police personnel were able to nab the suspects red-handed while travelling in a city bus recently, sources said.\n\nPolice said the suspects might be part of a larger gang.\n\n“Passengers, especially elderly women travelling alone, have to be careful. They have to avoid picking up conversations with strangers,” they said.\n\nThree members of a group that engages elders in conversation only to rob them were arrested recently", 
    "section": "national", 
    "title": "Beware of attention diversion gang, bus commuters warned", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}