{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Thassim Beevi Abdul Kader College for Women, an autonomous institution in Keezhakarai, plans to introduce an undergraduate course on ‘Textiles, Fashion Technology and Interior Designing’ from the coming academic year.\n\nTalking to reporters at the college on Wednesday, Principal S. Sumayaa said that the college would soon be entering into a memorandum of understanding with National Institute of Fashion Technology, an institution run by the Union Textile Ministry, to finalise the curriculum.\n\n“We are talking with NIFT and the new course will be a boon to enterprising young women, who aspire to explore the international fashion business,” Ms Sumayaa said adding the college had already set the trend by introducing industry-needed courses such B.Sc. Food Processing and Quality Control, and B.Sc. Home Science - Nutrition, Food Service Management and Dietetics.\n\nTwo PG courses\n\nShe said that the college would also be introducing two postgraduate courses – M.Sc. Microbiology and M.Sc. Psychology. It had introduced B.Sc. Psychology in 2015-16 to churn out professional counsellors, who were in demand in hospitals, schools, colleges and industries, she said.\n\nThe college was offering 14 UG and seven PG courses and three research programmes in the departments of Commerce, Computer Science and Home Science - Food and Nutrition, catering to about 2,000 students from the rural areas of the district, she said.\n\nThe college, which celebrated its silver jubilee three years ago, would have its 25th Graduation Day ceremony on March 23, S. Sheik Dawood Khan, Deputy General Manager, Seethakathi Trust, said.\n\nSyed Akheel Ahmed, former Vice-Chancellor of Yenepoya University, Mangaluru would deliver the convocation address, he said adding this would be preceded by Sports Day on March 21 and Academic Day on March 22. Arif A Rahman Buhari and Khalid A K Buhari, Chairman and Secretary of the Trust respectively, would grace the events and lyricist Vairamuthu and Fajila Azad, Life Coach, Hypnotist and alumna of the college, would be the special guests, he added.", 
    "section": "national", 
    "title": "College to start fashion technology course", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}