{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Move to achieve 100 per cent polling in May 16 Assembly elections\n\nDistrict Election Officer and Collector S. Natarajan launched a series of fresh initiatives on Wednesday to reach out to a cross section of voters with an objective of achieving 100 per cent polling in the May 16 Assembly elections.\n\nAs part of the ongoing SVEEP (Systematic Voters’ Education and Electoral Participation) activities, the Collector pasted stickers on buses to popularise the toll-free number to reach the Election Cell, distributed pamphlets to the public and pledge forms to school children.\n\nThe Collector launched the new initiatives by pasting stickers on government and private buses at the new bus stand to popularise toll-free number 1800 425 7038 to reach the Election Cell established at the Collectorate complex and clarify doubts on the electoral process.\n\nMr. Natarajan visited the weekly market near the new bus stand and distributed pamphlets to the public, exhorting them to discharge their democratic duty by casting their votes in the elections. They should set aside the day for taking part in the electoral process, he said.\n\nThe Collector later visited the Arignar Anna Middle School near the municipal office and distributed ‘Parents Pledge Forms’ to the students. The students were advised to obtain signatures of their parents in the forms and return the same to their teachers.\n\nThe parents, affirming faith in democracy, should pledge to cast their votes in the May 16 Assembly elections without any bias towards caste, creed, religion and language.\n\nLater Mr. Natarajan, accompanied by Revenue Divisional Officer Ram Pradeepan, visited a gas agency godown and passed voters awareness stickers on cooking gas cylinders. Henceforth, the gas cylinders distributed by the agency to consumers would carry the stickers, B.R.N. Rajaram Pandian, Partner, Wallia Gas Agency, said.\n\nThe legends on stickers read, “I take pride in being a voter,’ ‘Don’t sell your votes for money’ and ‘Cast your vote and be a responsible citizen.’", 
    "section": "national", 
    "title": "Collector launches many voter awareness initiatives", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}