{
    "author": [
        "Special Correspondent"
    ], 
    "text": "G. Ramakrishnan (second from left), CPI(M) State secretary, accepting contribution for election fund of the party at a meeting in Tiruchi on Wednesday.— PHOTO: A. MURALITHARAN\n\nThe Communist Party of India (Marxist) State secretary, G. Ramakrishnan, on Wednesday demanded a separate law to check honour killings.\n\nClaiming that untouchability and honour killings continued to prevail in the State, Mr. Ramakrishnan said all parties and like-minded organisations had a crucial role to play in checking such crimes.\n\nThe recent murder of a Dalit youth in Udumalpet was yet another instance of honour killing in the State, Mr. Ramakrishnan said alleging that the DMK and the AIADMK had failed to eliminate untouchability and honour killings.\n\nMr. Ramakrishnan was addressing a public meeting organised by his party to explain the path of the People’s Welfare Front (PWF) encompassing the two Left parties, MDMK, and the Viduthalai Chiruthaigal Katchi.\n\nThe PWF had accorded priority to the enactment of a special law to check honour killing by making it a key component in its common minimum programme, he said.\n\nLaunching an attack on the DMK and the AIADMK, Mr. Ramakrishnan said the two Dravidian parties had no locus standi to speak about Periyar’s ideals as they had failed to follow them over the years. There was no fundamental change in the State in the 47-year rule of the two Dravidian parties as they had failed to solve people’s problems. There was no difference between the DMK and the AIADMK as both were equally corrupt, he alleged.\n\nThe PWF had been formed to usher in a change in Tamil Nadu, he said and added that the front would take steps not only to wipe out corruption but also to confiscate the ill-gotten wealth amassed by the two Dravidian parties.\n\nMr. Ramakrishnan received election fund mobilised by the district unit of the party.\n\nLater, Mr. Ramakrishnan told presspersons that the Election Commission should take steps to check distribution of money among voters in the run up to the Assembly election.\n\nTo a question, he said it was up to the Tamil Maanila Congress and the Desiya Murpokku Dravida Kazhagam to decide on joining the PWF.", 
    "section": "national", 
    "title": "CPI(M) wants separate law to check honour killings", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}