{
    "author": [
        "Aditi R"
    ], 
    "text": "The Department of Social Defence has submitted a proposal to the State government for creating a de-addiction centre exclusively for children in conflict with the law.\n\nThe centre, if approved, will be set up at Chengalpattu in Kancheepuram district and will be the first of its kind in the State.\n\n“Work on it will begin once we get a nod from the government,” said R. Lalvena, Director of Social Defense, Chennai. The move came after the department witnessed a large influx of children who are victims of substance abuse.\n\n“The regular de-addiction centres are not equipped to handle children. So, we proposed an exclusive facility for them,” he said.\n\nThere are 26 de-addiction centres for adults in the State run by private organisations, but none for children in conflict with the law, despite the Juvenile Justice (Care and Protection of Children) Act, 2011, specifically mentioning the need to establish one.\n\nThe Juvenile Justice Committee of the Madras High Court, too last year, directed the State Government to open a separate centre for children in conflict with the law, experts said.\n\nCounselling and training\n\nApart from proposing an exclusive centre for children, the department has also tied up with the Rajiv Gandhi National Institute of Youth Development in Sriperumbudur to offer regular counselling, soft skill training, behaviour therapy and vocation-based livelihood training.\n\n“They have worked with us in the past, but from next month, they will be offering courses and training to children in all homes on a regular basis. They have designed a separate syllabus for the same,” said officials in the Department.\n\nThere are currently 166 children lodged in six government-run observation homes across Tamil Nadu and there are 13 in two homes run by non-governmental organisations.\n\nLast year witnessed several cases of children escaping from observation homes, with officials citing addiction problems as one of the probable causes.\n\nActivists hope that the same would not happen once the centre is created.\n\n“With this initiative, we hope the children would not find the need to escape from homes anymore,” said A. Narayanan, Director of CHANGEindia.\n\n“Apart from de-addiction, they also need rehabilitation and properly trained staff to look after them,” he added.", 
    "section": "national", 
    "title": "De-addiction centre proposed for children in conflict with law", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}