{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Trial courts should not allow the prosecution to go on a “witch hunt” against the accused in criminal cases since the latter also have a fundamental right to a fair trial guaranteed under Article 21 of the Constitution, the Madras High Court Bench here has said.\n\nJustice P.N. Prakash made the observation while allowing a criminal original petition filed by an accused in an attempt to murder case challenging a Judicial Magistrate’s nod to recall all 36 prosecution witnesses in his case as demanded by a newly appointed Special Public Prosecutor.\n\nPointing out that the SPP had not given any reason for “wholesale” recall of witnesses already examined before the trial court by the earlier prosecutor; the judge said that the prosecution must give reasons for recalling each witness and why it was essential for deciding the case.\n\nAlso observing that witnesses could not be recalled for examination at the mere asking of the prosecution, the judge said that even if a witness had turned hostile during earlier examination, his/her statement could not be ignored totally as per a recent amendment to Section 154 of the Indian Evidence Act. “Those portions of the statements which are compatible with the prosecution case can be relied upon by the trial court to fasten criminal liability on the accused,” Mr. Justice Prakash said and set aside the Judicial Magistrate’s January 27 order to re-examine all the 36 witnesses.\n\nThe judge, however, gave liberty to the SPP to thoroughly analyse the depositions of the 36 witnesses and then file a fresh application, before the Judicial Magistrate, for recalling as many of them as required after giving acceptable reasons for examining them once again.\n\nWitnesses cannot be recalled for examination at the mere asking of the prosecution, says judge", 
    "section": "national", 
    "title": "Don’t allow “witch hunt” against accused: HC", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}