{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Vehicles with GPS being tracked at the election control room in Thoothukudi on Wednesday.— Photo: N. Rajesh\n\nIn a bid to keep a close eye on vehicles being utilised by flying squads and static surveillance teams in all Assembly constituencies, a new mechanism of tracking such vehicles is in place here.\n\nThirty-six vehicles, which had been equipped with devices of global positioning system, meant for these squads and teams in the six constituencies across Thoothukudi district, were being monitored in a control room here, Assistant Collector of Thoothukudi, M. Pradeep Kumar, said here on Wednesday.\n\nThe movement of vehicles could be located with the help of global positioning system. Besides, mobile phones were also provided to Returning Officers to keep track of the GPS-equipped vehicles. To prevent any violation in the model code of conduct, the constituencies — Thoothukudi, Kovilpatti, Tiruchendur, Srivaikuntam, Vilathikulam and Ottapidaram —were being monitored by a flying squad and a static surveillance team on three shifts round the clock.\n\nSpecial camps\n\nSpecial camps conducted in 26 colleges under Thoothukudi division comprising taluks of Thoothukudi and Srivaikuntam evoked good response from students. Such camps were organised to enrol first time voters in the electoral roll. As many as 584 students had applied forms at the programmes and 93 applications were received through web-based service on www.elections.tn.gov.in, Sub Collector and Returning Officer of Thoothukudi Assembly constituency S. Gopala Sundara Raj said here on Wednesday.\n\nMeanwhile, the Returning Officer said 41 complaints of violations of model code of conduct had been received so far from Thoothukudi constituency. Any poll related violation, could be complained through ‘WhatsApp number -8903129134’, which is functional round-the-clock, and also through www.elections.tn.gov.in and mobile phone app ‘TN Elections’.\n\nHe said a meeting was convened with owners of marriage halls in Thoothukudi. They were instructed not to allow any poll-related meetings or offering ‘annathanam’ without prior permission.\n\nThe owners were asked to report to the electoral authorities every week about what happened at their marriage halls. Twenty three owners attended the meeting.\n\nPoll materials despatched\n\nPoll materials were despatched to the six assembly constituencies across Thoothukudi district ahead of the forthcoming Assembly polls.\n\nThe materials were kept in respective taluk offices amidst tight security, sources said here on Wednesday.\n\nThe district has a total of 1,559 polling stations at 856 locations.\n\nThe district comprising six Assembly constituencies has a total electorate of 13,69,989, including 6,78,248 men, 6,91,683 women and 58 others, in the electoral rolls released in January this year.\n\nConstituency-wise electors: In Vilathikulam, there are 2,04,302 voters of whom 1,01,366 are men, 1,02,934 women and two others.\n\nThe total electorate in Tuticorin is 2,75,218, of whom men total to 1,35, 978, women 1,39,211 and 29 others.\n\nWhile in Tiruchendur, the total number is 2,23,973 – 1,09,797 men, 1,14,163 women and 13 others, Srivaikuntam has a total electorate of 2,04,824 with 1,01,823 men, 1,02,997 women and four others.\n\nOttapidaram has 2,17,224 total voters of whom 1,07,973 are men and 1,09,244 are women and seven others.", 
    "section": "national", 
    "title": "Election control room tracks GPS-equipped vehicles", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}