{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Allaying fears of jewellers, who are protesting over the levy of 1 per cent excise duty on jewellery, the Joint Commissioner of Central Excise and Service Tax has clarified that the procedure for compliance, including registration, payment of the duty, and filing of returns can be done online with no interface with departmental officers.\n\nIn a statement here, Vikas Nair, Joint Commissioner, Central Excise and Service Tax, Tiruchi, said only if the turnover of a jeweller during preceding financial year was more than Rs. 12 crore, he would be liable to pay the excise duty.\n\nJewellers having turnover below Rs. 12 crore during preceding financial year would be eligible for exemption of up to Rs. 6 crore during next financial year. Such small jewellers would be eligible for exemptions of up to Rs. 50 lakh for the month of March, he said.\n\nCentral Excise officers had been directed not to visit the premises of jewellery manufacturers. Articles of silver jewellery (other than those studded with diamonds, ruby, emerald or sapphire) were exempt from the duty.\n\nAn artisan or goldsmith who manufactures jewellery only on job-work basis was not required to register with the Central Excise, pay duty and file returns, as all these obligations would be on the principal manufacturers.\n\nThe facility of Optional Centralized Registration was available and there was no need for a jewellery manufacturer to take separate registrations for all his premises.\n\nField formations have been directed to grant hassle-free registrations, within two working days of submission of the registration application. There would be no post registration physical verification of the premises.\n\nJeweller’s private records or records for State VAT or records for Bureau of Indian Standards (in the case of hallmarked jewellery) would be accepted for all Central Excise purposes. There was no requirement to file a stock declaration to the jurisdictional central excise authorities.\n\nExcise duty was to be paid on monthly basis and not on each clearance. A simplified quarterly return had been prescribed, for duty paying jewellers. Moreover, simplified export procedure was available for exempted units, Mr. Nair added.", 
    "section": "national", 
    "title": "Excise duty on jewellers only if turnover is over Rs. 12 cr, says official", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}