{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Farmers in the district expect more clarity on the new crop insurance scheme introduced by the Union Government.\n\nWhile the new scheme, Pradhan Mantri Fasal Bima Yojana, that promises a boost to farming sector requires the farmers to pay a nominal premium for coverage, farmers here are anxious to know how well it would reflect at the ground level.\n\nAs per the new scheme, a uniform premium of 2 per cent has to be paid by farmers for all kharif crops and 1.5 per cent for rabi crops.\n\nAs for annual commercial and horticulture crops, the premium will be only 5 per cent. The balance premium will be paid by the Government to provide full insured amount to farmers against crop loss on account of natural calamities.\n\nThe relief for farmers is removal of capping on premium rates in the new scheme. So far, the capping done to limit government outgo on premium subsidy resulted in low claims paid to farmers. Now, the farmers will be able to get claim against full sum insured without any reduction.\n\nUnder the new scheme, full claim could be obtained for inundation as well.\n\nSo far, the claims were processed only in the cases of hail storm and land slide. Also, under the earlier MNAIS (Modified National Agricultural Insurance Scheme), only coastal areas were covered for cyclonic rain.\n\nHenceforth, the entire area of the country will be covered for cyclonic as well as unseasonal rain.\n\nAccording to Logusamy, functionary of Tamizhaga Vivasayigal Sangam, farmers are awaiting a detailed description of the scheme by the Insurance Regulatory Development Authority to know whether individual farms can benefit from the new scheme. So far, the damage was assessed at the firka level and the loss in production of a crop as against the State average was the basis for calculation of claim.\n\nThe problem farmers have been facing is that officials seldom visit individual farms to assess the damage and create a database of crop yield estimate.\n\nIn the last few years, farmers have suffered substantially due to drought and inundation caused to tapioca, paddy, maize, and turmeric crops.\n\nBut, barring a handful of tapioca cultivators on Bargur hills, the several other applicants could not get their claims, farmers lamented.\n\nThey, nevertheless, hope that the advantage in maximum use of technology under the new scheme will result in benefit.\n\nThe scheme provides scope for use of smart phones to capture and upload data of crop cutting to reduce delays in claim payment to farmers, and remote sensing to reduce number of crop-cutting experiments.", 
    "section": "national", 
    "title": "Farmers seek clarity", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}