{
    "author": [], 
    "text": "Says photographs published in newspapers prima facie show that they were taken when the accused were in police custody\n\nExpressing concern over publication of pictures of the accused suspected to be involved in the Udumalpet ‘honour’ killing in the media, the Madras High Court, on Wednesday, suo motu raised the issue and censured the State police for their negligence.\n\nThe issue pertained to the arrest of five persons on Tuesday in connection with the murder of Dalit youth V. Shankar in Udumalpet in daylight on March 13. On Wednesday, pictures of the arrested persons were widely published in media. Taking exception to this, a Division Bench of Justices M. Jaichandran and S. Nagamuthu questioned the Public Prosecutor S. Shanmughavelayutham as to how the media was allowed to take pictures of the accused, despite an order of the High Court directing the DGP to issue circulars to all the police stations instructing them not to publish the photographs of accused as it will hamper the investigation.\n\n“If the photographs of the accused are published, it will affect the identification parade and ultimately, the trial will also be affected. Therefore considering the consequences, the DGP was asked to issue circulars. Despite this direction, the photographs of the accused were published in some newspapers,” the Bench said.\n\nThe photographs published in newspapers prima facie show that it was taken when the accused was in police custody. Hands of the accused were tied behind, the Bench added.\n\nThe prosecutor submitted that despite efforts taken by the police to prevent the media from taking picture, they managed to take pictures. “It has to be verified whether media persons took the photograph or the police handed it out,” he added and assured that action will be taken against the officer who gave the photo or permitted the media to take the photographs.\n\nHe further assured that new circular as directed by the Division Bench will be issued and copies will be provided to the media.", 
    "section": "national", 
    "title": "HC pulls up cops for releasing pictures of accused to media", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}