{
    "author": [
        "Mohamed Imranullah S"
    ], 
    "text": "An applicant under the Right to Information (RTI) Act, 2005 here is shocked over the Registrar (Administration)-cum-Public Information Officer of the Madras High Court having taken nearly a year to reject an application made by him though the legislation imposes a statutory duty to reply within 30 days of receipt of the application.\n\nM. Sivasankar, an advocate, had made the application on February 14 last year wanting to know the status of a complaint of corruption lodged by one K. Sakrapani of Madurai against a judicial officer in Erode district on September 10, 2014.\n\nReplying to it on February 17 this year, PIO V. Devanathan conceded to have received the application on February 19 last.\n\nNevertheless, without giving any reason for taking so long, the PIO stated: “Since the information sought is in respect of a complaint made against the judicial officer and since you are a third party to the said complaint, the information could not be furnished.”\n\nThe reply also does not provide details of the appellate authority, to whom an appeal could be preferred, as required under Section 8(ii) and (iii) of the Act.\n\nWondering how could the PIO of a High Court give such a reply, the applicant feared that it might set a bad precedent to the PIOs of government departments. “At the first place, the information sought by me may not fall under ‘third party information’ since I did not seek personal details of the judicial officer such as his blood group or Income Tax returns. I only wanted to know status of a corruption complaint against him.\n\n“Even if the PIO had concluded that the information sought was ‘third party information,’ then he should have rejected my request within 30 days of receiving the application or followed the procedures, prescribed under Section 11 of the Act, of issuing a notice to the judicial officer concerned and wanting to know if he had any objection to disclosing the information,” the applicant said.\n\nHe pointed out that the Act stipulated a specific time limit for every act done under it and, therefore, there could be no justification for the long delay of one year taken by the PIO to reject the RTI application.", 
    "section": "national", 
    "title": "High Court takes a year to reply to RTI application", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}