{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Mettupalayam Police on Tuesday arrested G. Rangasamy (48) of Karattumedu near Mettupalayam for allegedly trying to misbehave with a 32-year-old woman of the same locality the previous night. Rangasamy was booked under sections of the Indian Penal Code and Schedule Caste/Scheduled Tribe Prevention of Atrocities Amendment Ordinance Act, arrested and lodged under judicial custody.\n\nChain\n\nsnatched\n\nMahalingapuram Police are on the lookout for two men aged around 25 to 30 years for allegedly snatching a seven sovereign gold chain from a woman who runs a petty shop at Malarvizhi Nagar in Chinnampalayam, near Pollachi, on Monday.\n\nAccording to the police, the two men came in a bike and one of them walked to A. Jayarajathi’s shop and asked for beedi and chewing gum.\n\nHe snatched her chain when she turned to take the items. The two men then fled the place on their bike.\n\nYouth booked under POCSO Act\n\nThudiyalur All Woman Police booked C. Santhosh (25), a driver from Thirumalayampalayam near Periyanaickenpalayam, under sections 3(a), 4 and 5(l) of the Protection of Children from Sexual Offences Act for allegedly kidnapping a 16-year-old girl of the same locality, marrying and sexually abusing her. The police said that the girl, a Muslim, and the boy were lovers and got married in a temple recently.\n\nIt is learnt that the girl’s parents tried to convince her and take her back home, but in vain. Her father then petitioned the Superintendent of Police of Coimbatore District, following which it was taken up by the all woman police. On Wednesday Santhosh was arrested and lodged under judicial custody.\n\nWoman succumbs to burns\n\nJ. Shakunthala Rani (32), a mother of three from Suleswaranpatty near Pollachi, who was injured when fire spread all over her following a kerosene spill while using a stove in her house on March 5 died at a private hospital in Pollachi on Tuesday.\n\nBail for aged couple\n\nKrishnasamy (70) and Mahalakshmi (62) of Kangeyampalayam near Sulur who were arrested for murdering their mentally disturbed son Rajendran (41) at their house on January 23 were released on bail on Wednesday.\n\nThe bail was granted by Principal District Judge R. Pongiappan on Tuesday on condition that they should appear in the Sulur Police Station at 10.30 a.m. every day.\n\nJewellery usurped\n\nPeelamedu Police are on the lookout for a man who pretended as a policeman, offered help to safeguard the jewellery of M. Lakshmi (78) of B.R. Puram near Peelamedu on Tuesday and usurped 20 sovereigns gold jewellery from her. The police registered a case under Sections 170 (personating a public servant) and 420 (cheating and dishonestly inducing delivery of property) of the Indian Penal Code.", 
    "section": "national", 
    "title": "Man arrested for misbehaving with woman", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}