{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Will be sent to all political parties\n\nA youth welfare organisation has released a model election manifesto, which is touted to reflect the needs and expectations of the youth for the Assembly polls in Puducherry.\n\nReleasing Youth Model Election Manifesto-2016, Siva Mathiyazhagan, co-founder of Trust for Youth and Child Leadership(TYCL), said: “It is a purely youth-oriented initiative to flag young people’s needs and expectations.”\n\nThe main purpose of collating these details is to urge political parties to create inclusive and self-sustained Puducherry. The model manifesto will be sent to all recognised political parties.\n\nAccording to Mr. Mathiyazhagan, there was a gap between the needs of young people and what was offered by the government and political parties in terms of sustainable development.\n\nIn order to fill that development gap, the TYCL has initiated to prepare a manifestofrom the perspective of youth towards a safe, inclusive and sustainable Puducherry. This process is not to blame or criticise the parties and the government, he said.\n\nA survey was conducted in all the constituencies of Puducherry region with the support of local youth and student volunteers.\n\nThe promotion of organic and integrated farming through interest free loans to all small / medium scale farmers in Puducherry and a transparent market linkage for farmers’ products have been identified as essential requirement for the agricultural development\n\nAccording to Mr. Siva Mathiyazhagan, the survey revealed that the youth expected free, inclusive and quality education to all the students up to under graduation and zero child abuse in Puducherry by 2030.\n\nPuducherry should be announced as ‘Child Friendly City’. Smart Citizen Development Card should be introduced with holistic and integrated individual development record will be mapped and maintained online.\n\nThe TYCL also cited that cyber-crime against women and children should be prevented with highest hacking tech support.", 
    "section": "national", 
    "title": "Model manifesto of youths released", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}