{
    "author": [
        "Sangeetha Kandavel"
    ], 
    "text": "Says complete closure will affect operations in IT sector\n\nThe National Association of Software and Services Companies, the apex body for Information Technology and Information Technology Enabled Services industry, has sent a letter to the Election Commission requesting exemption from full holiday on the day of Tamil Nadu Assembly elections 2016. The IT sector works on a 24x7x365 basis to cater to clients across the globe, so a one-day complete closure would disrupt operations.\n\nAccording to the letter sent by Nasscom, IT companies have global clients and strict standards to abide by, which do not allow interruptions in 24x7 operations like Business Process Outsourcing and Remote Infrastructure Support. Citing an example, the letter highlighted a similar instance in Maharashtra wherein during the elections of 2014, a notice was issued which essentially says that hospitals, airlines, IT / ITES industry, etc whose operations cannot be closed are given exemption from compulsory holiday but the organisation has to give a minimum of 2 hours of time for the employees to cast their vote. This notice was issued by the Industries and Labour Department, Government of Maharashtra. Also, IT / ITES Industry then did not have Continuous Industry Status as proposed in their draft IT Policy 2015 and the notice was issued as per NASSCOM’S special request in the interest of the industry.\n\nK. Purushothaman, Senior Director, Tamil Nadu and Kerala, Nasscom, said, “The industry fully understands and shall abide by the fundamental right enshrined in the Constitution as well as The Representation of the People Act, 1951, whereby there should be no impedance in the right of an eligible voter to exercise his / her franchise.” “But at the same time we want to ensure that there is business continuity. So we have requested the government to look into this issue,” he added.\n\nNasscom’s past chairman Lakshmi Narayanan said, “Like in other States that had the polls, we have requested that essential and critical services be allowed to function on Election Day. The IT industry is such a cosmopolitan industry that we will have a significant part of our workforce working in Tamil Nadu from other States like Andhra, Telangana, Karnataka, Kerala, Maharashtra, etc. who will not be participating on election day.” “There is a precedent and we want to have the same set of facilities in this State too for the IT/ITeS industry,” he said, adding that IT firms will make all efforts to make sure that employees vote.\n\nTamil Nadu has more than 3.5 lakh employees in the IT sector. Of this, 40 per cent are from other States. The State accounts for more than 10 per cent of the total IT exports carried out from India.\n\n‘There is a precedent and we want to have the same set of facilities in this State too for IT/ITeS firms’", 
    "section": "national", 
    "title": "Nasscom plea against poll holiday", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}