{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "C. Chandraprabha (right), state officer-in-charge for NCSC, interacting with C. Velusamy (47), father of Dalit youth V Shankar, at his home at Komaralingam on Wednesday. NCSC investigator S. Lister (left) is also present.Photo: R. VIMAL KUMAR\n\nThe NCSC team which visited the scene of crime and spent time with the victim’s wife and family, also said the Adi Dravidar Welfare Officer has been asked to help Shankar’s family get Rs. 5 lakh from the corpus created by the Ambedkar Foundation for the benefit of Scheduled Caste victims of such violence. Reacting to the release of photos of the accused, Mr. Lister, who was the team’s investigator, said it (the release) would not have any impact on the identification parade and investigation as images of the accused were already captured on CCTV.\n\nThe committee was also briefed on the harassment faced by the inter-caste couple and Mr. Shankar’s family from the relatives of Ms. Kausalya.\n\nThe committee members then visited Ms. Kausalya at the Coimbatore Medical College Hospital (CMCH) where she reportedly expressed her desire to pursue studies. After a 40-minute interaction with her, Ms. Chandraprabha said the NCSC would also recommend police security for her and her in-laws and a ‘green house’ for their family based on a request from Shankar’s father Veluchamy.\n\nWhen asked about continuing incidents of honour killings in the State over the last few years and demand by political parties for a new legislation, she said “The chairman of the Commission (at New Delhi) has to decide on it.” Meanwhile, CMCH Dean A. Edwin Joe said that Kausalya was administered 36 stitches on her forehead and her health was improving steadily. Senior hospital authorities said that psychiatric counselling was also given to her on Wednesday.\n\nShe would be under observation in the Intensive Care Unit for a couple of days. “After studying her health condition and discussions with police officers on security aspects, we will decide on shifting her to the ward,” a senior doctor said. According to him, the girl has started feeling safe and comfortable.\n\nTwo-tier security has been provided by the police around the hospital and around 10 police personnel are on guard round-the-clock. While a team checks persons entering and leaving the ICU, three women constables guard her bed.\n\nAccording to hospital sources, she has evinced interest in meeting three persons from her husband’s family.\n\nRevenue and police officials are trying to facilitate the meeting.", 
    "section": "national", 
    "title": "NCSC team meets victim’s wife, family", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}