{
    "author": [
        "Special Correspondent"
    ], 
    "text": "11-month-old Yaseen with his parents after his cardiac and tracheal Surgery at Apollo Hospital in Chennai. Also seen are doctors (from left) Rajan Santhosham, Neville Solomon, and Rajagopal Jaganathan —Photo: M. Vedhan\n\nFrom the moment 11-month-old Yaseen came to Apollo Children’s Hospital in Chennai from Oman, doctors faced a huge challenge: the baby had a hole in his heart, a narrow wind pipe, and his left lung had collapsed. He also had Down’s syndrome.\n\nThe hospital in Oman where he had been admitted, was not able to perform surgery on him, and had asked if he could be transferred to Chennai. He had been on a ventilator for one month in Oman, and was brought on ventilation to Chennai.\n\nOnce the flight brought the baby and his parents to the city, a multi-disciplinary team was formed at the hospital, and doctors decided that they would do both procedures at once — patch up the hole in his heart and fix his windpipe.\n\nBut, there were problems even before the surgery: Yaseen had two cardiac arrests, he kept bleeding and parts of both his lungs kept collapsing, said Suchitra Ranjit, paediatric critical care specialist. “It was a battle to keep him going for surgery and after the surgery too,” she said.\n\nNeville Solomon, paediatric cardiac surgeon, said the challenge was to shift the baby to the operation theatre and on to a heart-lung machine, without him arresting.\n\nThe narrowed wind pipe made it very difficult to intubate Yaseen, and the repeated bleeds blocked the tube.\n\n“The baby had a ventricular septal defect and a patent ductus arteriosus — two defects in the heart that we patched up. The cardiac surgery took two hours, after which the tracheal surgery was done,” he said.\n\nRajan Santosham, thoracic surgeon, said a third of Yaseen’s trachea had been narrowed.\n\n“Congenital tracheal stenosis is a rare condition,” he said. Treating it involved removing about 1.4 cm of the narrowed portion of the trachea and joining the other two ends together. This procedure too took about two hours and this was done off the heart-lung machine.\n\n“Doing this procedure off the heart-lung machine is more complicated, but better, because it shortens the amount of time the baby was on the heart-lung machine as being on it is harmful and could lead to complications,” said Dr. Solomon.\n\nYaseen is now off the ventilator and breathing normally.\n\nFor Rukkaiya and Essa Salim, Yaseen’s parents, it has been a long ordeal — from their baby’s diagnosis of a heart condition, to his second diagnosis of tracheal stenosis, the trip to India on February 19 and finally to hearing Yaseen’s cry on his first birthday a couple of days ago. After this, doctors say, Yaseen will not have any problems.", 
    "section": "national", 
    "title": "Omani baby undergoes heart, tracheal surgery", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}