{
    "author": [
        "B Aravind Kumar K Raju"
    ], 
    "text": "35-km road finds no mention in Reserve Forest notification, claim officials\n\nActivists are crying foul over the felling of nearly 150 trees in the Meghamalai Reserve Forest in violation of forest laws, for widening of a 35-km road adjoining the wildlife sanctuary in Theni district to benefit estate workers and to promote tourism.\n\nApart from the tree felling that could continue as the work was still progressing, activists are also worried about the environmental degradation the road could bring with it.\n\nStrangely, the entire 35-km stretch has been left out of the notification when it was declared as a reserve forest in 2009. “It is not clear if it was deliberately left out or a clerical mistake when the RF was notified,” say forest officials in Theni district. Therefore, the Forest Department has no document to show the road falls under its control, say officials.\n\nMegamalai Wildlife Warden Sornappan says the road was obtained from estate owners and handed over to the Highways Department for widening it. “The forest department’s permission was given to lay the road as it was in existence for a long time,” he says.\n\nThe Highways Department officials say they have all the documents and government orders to support the road widening project. “Special permission was obtained from the Principal Conservator of Forests in this connection,” claims a senior official of the Highways Department in Theni District.\n\nThe work was commenced to relay and widen only the 35-km-long road. It would be converted into 10-metre-wide road only if the Highways Department has in its possession the 22-metre on both sides of the road, the official said.\n\nActivists, however, say the existing road was only 5.5-metre-wide and the journey back-breaking whereas the widening of road was being taken up from 10 to 22 metre which has resulted in felling of nearly 150 trees. “Even on Wednesday, ten earth movers were on the job,” says an activist. For tree felling inside reserve forests, the permission should have been obtained from the District Level Committee as per the Hill Area Preservation Act. Also, it falls within the eco-sensitive zone of the Meghamalai Wildlife Sanctuary. Therefore, massive tree felling and widening needs the clearance from the MoEF and the Central Empowered Committee, activists claim.\n\nEven if the road was not notified as an RF by mistake, forest officials in the headquarters here say the local District Forest Officer should have applied his mind. Initially, he seems to have raised an objection stating that the proposal needed clearance under the Forest Conservation Act but had retracted later, say sources.\n\nAs it was adjacent to the Meghamalai Wildlife Sanctuary the borders of which were about 20 to 100 metres to the right side of the road while going uphill, the Supreme Court guidelines have to be followed as it is clearly in the buffer zone, activists say.\n\n“Last year, there was a herd of 16-elephants on the road. Laying a double road will lead to increased traffic and the resultant population pressure on the bio-diversity rich eco-system could be irreversible,” says an activist.\n\nWhen contacted, Conservator of Forests Madurai Circle Nihar Ranjan said that he would look into the issue and refused to comment further.", 
    "section": "national", 
    "title": "Over 100 trees felled to widen road in Meghamalai", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}