{
    "author": [
        "Staff Reporter"
    ], 
    "text": "His love for sports has taken him to places, literally. A podium finish at the 2016 IPC Athletics Asia-Oceania Championships in Dubai has added to the feats of 37-year-old para-athlete K. Santhamuthuvel, a resident of Sathuvachari.\n\nOn Tuesday, as he returned home after celebrating success in Dubai, he brought along two more additions to his treasure trove of medals. He bagged gold in discus throw and silver in shot put at the championships held from March 6 to 12.\n\n“Eighteen players from the country participated in the championship. There were two of us from the State. Players from 24 countries participated in the event,” he said.\n\nIt was in an accident at the age of four that Mr. Santhamuthuvel’s left lower limb was injured. As he coped with his orthopaedic disability, it was sports that caught his interest when he was in class XI.\n\n“I joined the Paralympic Committee of India and started to train in 1997, and participated in various State, national level events. I won the gold medal in discus throw in the UK Athletic Championship in 2009, bronze in discus throw in IWAS World Games in Bengaluru in 2010. In 2014, I won the silver medal in the Asian Games held in China,” he said.\n\nHe has participated in championships held in various countries such as Germany and Sri Lanka. In fact, he has won more than 170 medals at the State, national and international events, he noted.\n\nWith the victory at the Dubai championships, Mr. Santhamuthuvel has qualified for the Rio Paralympics. While he has brought laurels both for the country and State, this athlete stresses the need for more motivation from the State government.\n\n“The State government should take more interest in encouraging athletes like us. The process for giving cash awards and providing employment for para- team is very slow. If a para-athlete wins a medal, it takes four to five years for the government to hand over the cash award. But it is not so for regular athletes,” he said.\n\nHe pointed out to States such as Haryana and Karnataka that have laid down clear-cut provisions to award para-athletes. “In Tamil Nadu, there is no such separate government order. There are at least 170 players in the State, and the government should do more to encourage players. Government jobs should be provided too,” he added.\n\nHe has been waiting for a job under the sports quota for close to 19 years, he said.", 
    "section": "national", 
    "title": "Para-athlete shines at international meet", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}