{
    "author": [
        "D Madhavan"
    ], 
    "text": "Pattarai Perumbudhur is believed to be sitting on an archaeological goldmine\n\nPattarai Perumbudhur, a nondescript village on National Highway (NH 205) that connects the city with neighbouring Andhra Pradesh via Tiruvallur, is known only for its 7th century A.D. Pallava-era Shiva temple. Many of those who drive to the hillock temples at Tirutani and Tirupati, do so after visiting the Shiva temple in Pattarai Perumbudhur.\n\nBut now, there is more going for the village.\n\nA two-day extensive survey conducted recently by a team from the Tamil Nadu State Archaeology Department has now put the small village with its 1,000 families, on the archaeology map.\n\nThis follows the discovery of large numbers of broken potsherds including red ware, black and red ware and black ware, in the village.\n\nIn fact, rows of dry water channels in the village have layers of such broken potsherds, giving a hint of its rich past. The potsherds, archaeologists said, are dated between 5th century B.C and 1st century B.C of the Megalithic period. Interestingly, for the first time, archaeologists used a modern Total Station Theodolite (TST) for the survey to enhance its accuracy.\n\nPrior to the survey, the excavation project had its approval from the Central Advisory Board for Archaeology (CABA), a wing of the Union Ministry for Culture and the apex body to permit excavations in the country.\n\n“We have not seen such huge collections of potsherds in a small area such as a village. A detailed excavation, which will be done in the coming days, will reveal more about the early inhabitants of the region which includes Chennai and Tiruvallur,” Arcot Musuem curator J. Ranjith, who is also in-charge of this excavation project, said.\n\nAt the end of the two-day survey, archaeologists selected the most elevated point at the site for intensive excavation. Small trenches will be dug on the site in the coming days for the purpose. Archaeologists said in any excavation site, the elevated spots contain most of the evidence of the early inhabitants.\n\nFunded by the State government under excavation projects, the entire process will be monitored by the commissioner of the department D. Karthikeyan, deputy director R. Sivanandan, and deputy superintendent archaeologist S. Vasanthi. The entire excavation is expected to be completed in six months. The archaeology team involved in the project include P. Baskar, J. Baskar and a senior engineer of the department T. Thangavel.\n\nArchaeological experts said that the entire region along the 136-km-long-Kosasthalaiyar river, which originates in Pallipet village in Tiruvallur district and flows into Bay of Bengal at Ennore Creek in Chennai, is rich in artefacts of early settlers dating back to 7{+t}{+h}century B.C. But, what makes the Pattarai Perumbudhur site different from other excavation sites in Chennai and elsewhere in Tamil Nadu is that the site remains “undisturbed” in terms of human settlements.\n\n“Such an undisturbed area is an archaeological goldmine, for details of early inhabitants in the region will be intact,” said D. Tulasi Raman, retired assistant director of the department.", 
    "section": "national", 
    "title": "Past presented in potsherds", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}