{
    "author": [
        "Special Correspondent"
    ], 
    "text": "Incident on Friday night; detailed inquiry ordered by City Police Commissioner\n\nThe police have suspended a head constable attached to the Taramani police station and registered cases against three other persons, including a home guard, in connection with the assault on a 17-year-old boy in Kannagi Nagar on Friday night.\n\nAccording to the police, constable Saravanan, attached to the Kanathur police station, and a few others, including home guard Senthil, a police driver, are involved in the assault on Ganesh (name changed), a 17-year-old boy from Kannagi Nagar.\n\nSoon after the incident, the boy’s mother Sumathi and father Vincent registered a complaint with City Police Commissioner T.K. Rajendran and sought action against the ‘policemen’ who assaulted her son.\n\n“A detailed inquiry by a team headed by K. Shankar, Additional Commissioner, South, was ordered by the City Police Commissioner and the report has been sought. Saravanan is a head constable in the Taramani crime wing,” said a police source. Meanwhile, Mr. Vincent said that he was not happy that the constable was only suspended.\n\n“The men who hit Ganesh had also verbally abused my wife and daughter. He is depressed about it. Besides, his left ear is damaged and he is not able to hear properly. I will be admitting him to the Rajiv Gandhi Government General Hospital tomorrow,” he told The Hindu .\n\nPeople’s Union of Civil Liberties general secretary V. Suresh said if it was true that the policeman had been suspended, it was not enough.\n\n“He should be prosecuted. The senior officers should send a signal to the people that breaking the law shall not be permitted even if it is a policeman,” he said.\n\nThe incident happened on Friday night, when Ganesh was about to have dinner.\n\nA few persons, claiming to be policemen, dragged him away from his house and put him in a jeep.", 
    "section": "national", 
    "title": "Policeman suspended for assault on minor", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}