{
    "author": [
        "Staff Reporter"
    ], 
    "text": "They filed a non-cognizable report against the employers, says the girl\n\nSold as domestic help for Rs. 56,000 nearly five years ago, 21-year-old Madhuri (name changed) is pleading her case with senior police officers, seeking justice against her “owners” who physically and mentally harassed her. She was rescued last week by the Domestic Workers Rights Union, an organisation, but her ordeal for justice has only just begun.\n\nThough having spent nearly two days at Byappanahalli Police Station, she claims that the police have filed just an NCR (Non-cognizable Report) instead of a criminal case against the couple who “bought” her from her village in Madanapalli, Andhra Pradesh. When she was 17, Madhuri was brought to work in a house on G.M. Palya Road. A broker had facilitated the transaction, which saw her mother get Rs. 56,000 for the sale.\n\nIn her statement, Madhuri says she was not paid a salary and was virtually confined to the house.\n\nMadhuri claims that the people who allegedly bought her—a husband and wife—beat her, mentally harassed her, and even threatened to spread rumours about her, if she escaped.\n\nGeeta Menon of the Domestic Workers Rights Union alleges that the Byappanahalli police refused to lodge a complaint, and instead acted like “mediators” to scuttle the case. “They called the employers and the mother and tried to browbeat the victim not to file a complaint … they tried to force her to go back to the village with her mother. But, the girl knew she would be forced to work again. She is keen on continuing her studies,” Ms. Menon said. Visits to senior police officers yielded no result, and eventually, they have filed a petition with the Women’s Rights Commission.\n\nEventually, just an NCR was filed on March 11. Deputy Commissioner of Police (East) N. Satish Kumar said he would look at the complaint and allegations, and ensure an FIR is filed in the case.\n\nThe girl, a native\n\nof Andhra Pradesh, was allegedly sold to a city couple\n\nfor Rs. 56,000", 
    "section": "national", 
    "title": "Police turn ‘mediators’ even as domestic help complains of abuse", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}