{
    "author": [
        "Sunitha Sekar"
    ], 
    "text": "Removal of posters and banners as per the model code of conduct has come as a relief to many\n\nResidents of the city say they are glad to be able to drive past walls that are free from the menace of posters and walk on pavements unhindered by banners.\n\nExpressing relief over the Model Code of Conduct coming into effect after the announcement of elections for the Tamil Nadu Legislative Assembly, Srinivasa Ragavan, a 65-year-old resident of T. Nagar said he was fed up of looking at posters and banners of various political parties.\n\n“Why can’t the walls always be kept clean? It is an eyesore to witness one party after another pasting posters and occupying road space with banners. The posters are such a distraction while driving,” he said. There are occasions when people have been injured by the iron rods installed to support flags of political parties, he said, adding he was glad that the Election Commission had enforced the ban.\n\nThe model code of conduct came into effect on March 4 and subsequently, about 13,000 cases of defacement of walls and 4,000 banners were reported in Chennai with Corporation staff already on the job of pulling down posters in various places.\n\nV.S. Jayaraman of T.Nagar said he was now able to walk on the pavement freely. “Earlier, there would hardly be any space for commuters to walk with parties installing banners every 100 metres or so. We know this is temporary, but it is a good respite for us,” he added.\n\nEven on social media platforms, residents have time and again expressed anger over the phenomenon of banners and the defacing of walls with posters. Venkatraman (@venkat5456) tweeted: Good to see election model code of conduct implemented strictly…all posters/banners from political parties removed now!”", 
    "section": "national", 
    "title": "Residents rejoice over cleaner walls", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}