{
    "author": [
        "R Vimal Kumar"
    ], 
    "text": "The family of the Dalit youth, who was hacked to death in full public view a couple of days ago, for marrying a caste-Hindu girl, has expressed doubts over the investigation of the case.\n\n“We are still not convinced about the manner in which the inquiry into Shankar's murder is going on. We were too surprised to see the photographs of the five persons who were arrested for his murder got circulated through social media even before we were shown them for identification,” V. Vigneswaran (19), brother of murdered Dalit youth Shankar (22) told The Hindu on Wednesday.\n\nArrest or surrender?\n\n“We still have doubts whether the five persons were actually arrested or they surrendered voluntarily before the police to hide something else”, said Mr. Vigneswaran, speaking from the family's home.\n\nThe sequence of the incidents is suspicious, family members said, prompting them to be suspicious of the investigation too.\n\n“On Monday when the body was brought for burial, the police officials initially said they will show the proof of the arrest to the crowd who gathered, before the rituals were conducted. However, they soon began lathi-charging the family members and others in the village,” said some of the villagers who still have bruises and injuries on their bodies.\n\nMr. Vigneswaran said soon after the marriage of Shankar with Kausalya was held on July 12, 2015, the family members of Kausalya had been issuing veiled threats asking us to send the girl back to her native town.\n\n“Within 10 days of the marriage, Kausalya was kidnapped at Madathukulam. At that time, we had to run from pillar to post to get her back as police officials of various stations in Udumalpet sub-division refused to take up the case and kept passing the buck to other stations citing jurisdiction issues,” he added.", 
    "section": "national", 
    "title": "Shankar’s kin wary of investigation", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}