{
    "author": [
        "K Manikandan"
    ], 
    "text": "Massive drive to replace more power-consuming incandescent bulbs and CFLs with LED lamps at railway stations\n\nThe Southern Railway has embarked on a drive to install Light Emitting Diode (LED) lamps to replace the conventional and more power-consuming incandescent and compact fluorescent lamps (CFLs) at railway stations and office buildings.\n\nThough the LED bulbs are more expensive — five times higher than most others — Southern Railway has been replacing the conventional bulbs with LED lamps as they result in savings of both energy and money in the long run.\n\nSouthern Railway officials told The Hindu that they had recently completed the work of installing LED lamps in five railway stations in the Chennai Division on the Renigunta route — Tiruttani, Ekambarakuppam, Vepagunta, Putur and Pudi.\n\nOfficials said that LED lamps were installed at all the platforms, concourses, approach roads, ticket booking counters and other office buildings in the five stations about two months ago. The annual savings is expected to be an estimated Rs. 3.45 lakh every year at each station. “The initial cost is high, but the payback period for return on investment is 21 months,” officials said.\n\nAt Chennai Central and Egmore, the administration is replacing conventional bulbs and tube lights with LED lamps on a large scale and this effort includes the new signage boards. In terms of illumination, passengers are unable to tell the difference between LED lamps and conventional tube lights and bulbs, but they appreciate the power- and money-saving from former. “Money thus saved should be re-invested to improve passenger amenities,” said B. Rangan, who was waiting at the concourse at Central station to board a train to Coimbatore.\n\nOfficials said that they would soon be installing nearly 5,000 LED lamps at stations and office buildings all over Chennai Division and the projected savings in power was estimated to be over 3 lakh units and a sum of Rs. 32.4 lakh a year. The railway administration had also installed solar-powered lights in Tambaram and Chengalpattu and water heaters and pumps elsewhere.", 
    "section": "national", 
    "title": "Southern Railway blazes an eco trail", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}