{
    "author": [], 
    "text": "Colleges YET TO APPOINT counsellors as asked by government\n\nA few days ago, a student of an engineering college committed suicide. The boy hanged himself in the hostel.\n\nA few of his friends alleged harassment by the management as the reason. The management said that the boy resorted to the extreme step because he had failed in all the subjects except one in the recently concluded semester exam.\n\nIn the same college a couple of days prior to the suicide, the students had clashed with one another. The college management’s inquiry revealed that a fracas between a few students grew into a clash between students of two disciplines.\n\nPeople familiar with the problem say that the recent incidents are unique to that institution.\n\nEvery now and then students of two different disciplines or linguistic identities or localities clash. Likewise, students commit suicide due to depression or not being able to cope with the academic pressure or other reasons. But all these could be addressed if only the institutions had students’ counsellors, says T. Veeramani, Professor, Psychology, Government Arts College, Coimbatore.\n\nThe counsellors would first be able to identify problems and then offer professional help which faculty would not be able to offer, however qualified they may be.\n\nU.L. Bhuvaneswari, another psychology teacher, says faculty most often think advising students is tantamount to counselling students, which is wrong. There are techniques involved in identifying the problem in students – there are tests to assess students. Likewise, there are counselling techniques, which those trained may not know.\n\nTrained psychologists would identify if students are under depression or stress or fatigue or boredom and talk to them and then suggest relaxation techniques.\n\nIn this context, it becomes necessary to appoint psychologists or qualified students counsellors in colleges.\n\nAssociation of University Teachers member N. Pasupathi says that sometime ago there was a direction from the State Government to appoint counsellors but most colleges did not do so.\n\nThe colleges must at least now take steps to appoint trained counsellors/psychologists because the challenges today’s students face are enormous.\n\nKarthik Madhavan", 
    "section": "national", 
    "title": "Students’ issues, and psychological antidote", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}