{
    "author": [], 
    "text": "RELIGION\n\nArulmigu Thayumanaswamy Temple, Rockfort: Theppam festival, Kailasa Parvatham – Anna vaganams, 7 p.m.\n\nSri Ranganathaswamy Temple, Srirangam: Panguni car festival, Namperumal reaching Jeeyapuram Asthana mandapam, 11 a.m.; purappadu, 5 p.m.; reaching kannadi arai, 10 p.m.\n\nSri Srinivasa Perumal Temple, Indiranagar: Sri Alamermelmangai Thayar Brahmotsavam, homam, thirumanjanam, 8 a.m.; serthi sevai, 6.30 p.m.\n\nSri Vishnu Sahasranama Parayana Sabha: Sahasranama parayanam, Hayagreevar Sannidhi, Sankar Nagar, Srirangam, 6 p.m.; Meadow Castle Residential Complex, Sankar Nagar, 7 p.m.\n\nSri Rama Nama Sath Sangam: Sri Rama Nama parayanam, 6/16, II Cross, Sundar Nagar, 6 p.m.\n\nGovindammal Tamil Mandram: N. Arulsamy speaks on “Silapathikaram”, Pappammal Anna Chathram, Keezha Chinthamani, 6.30 p.m.\n\nGENERAL\n\nUrumu Dhanalakshmi College Bharathi Vasagar Vattam: Students book review, 12.30 p.m.\n\nK. Ramakrishnan College of Technology: Workshop on Quadcopter by Wingfotech-Chemclave, IIT, Madras, 10 a.m.\n\nHallmark Business School: Lecture on “Basics of ERP solutions” by P. Vijayanand, project manager, Chettinad Group of Companies, 10 a.m.\n\nMother Nursery and Primary School, Varaganeri: Social awareness science exhibition, 10 a.m.\n\nMMA Trichy Chapter and Konrad Adenauer Stiftung: Workshop on “Managerial excellence through neuro linguistic programming”, Hotel Sangam, 9.30 a.m.\n\nMadras Management Association: A talk on “People management” by G. Ramasubramanian, Director, Excel HR, Hotel Sangam, 6.30 p.m.\n\nBishop Heber College: Achievers’ Day celebration, C. Thiruchelvam, Registrar, Bharathidasan University, chief guest, 5 p.m.\n\nShrimati Indira Gandhi College: Installation of new office-bearers of Rotaract Club, Savitri Sivakumar, speaks on “Women empowerment”, 2 p.m.\n\nNational College: Library Day, S. Neelakandan, assistant professor, National College, chief guest, 11.30 a.m.\n\nAll Rotary Clubs of Tiruchi: Felicitations to RVN Kannan on his election as district governor RI district 3000, PLA Ratna Residency, 6.30 p.m.\n\nJayaram College of Engineering and Technology: Workshop on “Windows Azure”, 9 a.m.\n\nChinmaya Vidyalaya, Srirangam: Kids mela, N. Rajkumar, assistant professor, Chennai Medical College Hospital and Research Centre, and P. Shankari, assistant professor, Dhanalakshmi Srinivasan Medical College and Hospital, chief guests, 6 p.m.", 
    "section": "national", 
    "title": "TIRUCHI today", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}