{
    "author": [
        "Staff Reporter"
    ], 
    "text": "Traders at the Salem Collectorate on Wednesday demanding clarification on supporting documents and cash ceiling limits. —Photo: E. Lakshmi Narayanan\n\nStating that traders and farmers are being continuously threatened by election officials in the name of seizures, members of Salem Shevapet Maligai and Shop Varthaga Nala Sangam threatened to boycott elections, if clarifications on supporting documents and cash ceiling limits are not given in writing.\n\nAddressing the media at the Collectorate on Wednesday, its president S.C. Natarajan said that Chief Electoral Officer Rajesh Lakhani had recently clarified that persons who are contesting elections would be known only after filing of nominations began on April 22.\n\nThe CEO said that election expenditure of each candidate would be calculated only after that.\n\n“If it is so, why hardship is caused to traders?,” he asked.\n\nMr. Natarajan sought clarity on the types of supporting documents that traders should carry, maximum limit that each person can carry and if four persons are travelling in a vehicle how much is the maximum limit for each person.\n\n“We want it to be given in writing,” they added.\n\nThe members said that documents should be sought only after April 22 and until then they should be allowed to carry cash and other items without documents.\n\n“In the name of flying squad, traders and farmers are threatened,” they added. They also questioned why no cash or other items were seized from any members of political parties and only from traders.\n\n“If harassment of traders continues, we will boycott the elections,” they added.\n\nLater, they submitted a petition to the District Electoral Officer and Collector V. Sampath, who assured to look into the issue.", 
    "section": "national", 
    "title": "Traders threaten to boycott elections if seizures continue", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}