{
    "author": [
        "Special Correspondent"
    ], 
    "text": "The Dravida Munnetra Kazhagam has been hijacked by the corporate, Marumalarchi Dravida Munnetra Kazhagam general secretary Vaiko has alleged.\n\nSpeaking to reporters here on Wednesday, Mr. Vaiko said that even as the Desiya Murpokku Dravida Kazhagam, which was opposed to both the All India Anna Dravida Munnetra Kazhagam and the DMK due to their corrupt administration, was keeping equidistance from these two parties, the “corporate-held” DMK was continuously and methodically spreading rumours that it would enter into an electoral pact with it.\n\n“While these rumours spread through a section of the media predicted a possible pact between the DMK and the DMDK, its founder Vijayakant has made it clear that he would never align with the DMK. We believe that the DMDK would join hands with the People’s Welfare Front,” Mr. Vaiko hoped.\n\nHe said that the recent honour killing of Sankar in Udumalpet for having married a caste Hindu girl had clearly showcased the breakdown of law and order in the State. Even after the couple had filed complaints with the police following death threats from her relatives, the police did not even file a first information report, which had emboldened them to murder the Dalit youth.\n\nThe PWF leaders would stage a demonstration in front of Valluvar Kottam in Chennai on March 21 in this regard.\n\nMr. Vaiko also held the AIADMK government and the previous Karunanidhi-led DMK regime responsible for the “anti-agriculturists attitude” prevailing in the State.\n\n“After the DMK gave its nod for GAIL pipeline project on June 6, 2008, the AIADMK government attempted to muscle the farmers of the ‘Kongu’ region through coercive measures. Having fought for the rights and welfare of the farming community all the time, the PWF has earned the goodwill of the farmers,” Mr. Vaiko said.\n\nHe hoped that young voters would back the PWF.\n\nLater, Mr. Vaiko received election fund mobilised by the party cadres at the function. On behalf of Tirunelveli city district, its secretary K.M.A. Nizam handed over Rs. 27 lakh.\n\nMeanwhile, a group of fishermen from Thoothukudi submitted a petition to Marumalarchi Dravida Munnetra Kazhagam general secretary Vaiko on Wednesday appealing to him to initiate steps for early release of 20 fishermen detained by the Sri Lankan navy.\n\nWhen a group of 20 fishermen for Therespuram in Thoothukudi, who left their base on March 2 in three boats, was fishing near Pamban on March 5 with hooks suspended from 7 km-long ropes tied with the boat, the hooks got drifted away in strong winds. As the drifting hooks entered the Sri Lankan waters, the fishermen tried to retrieve the hooks with the catches.\n\nHowever, they were detained by the Sri Lankan navy for allegedly entering the waters of the island nation.\n\n“The detained fishermen, along with the boats, each carrying about Rs. 50,000-worth fishes, were taken to Kaplatti harbour and then remanded in judicial custody,” said A. Jesu, president of Therespuram Country Boat Fishermen Panchayat.", 
    "section": "national", 
    "title": "Vaiko hopes DMDK will join hands with PWF", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}