{
    "author": [
        "Serena Josephine"
    ], 
    "text": "Draft list of booths in 13 Assembly constituencies in the district released\n\nCollector R. Nanthagopal releases the draft list of polling stations in the presence of representatives of political parties on Wednesday.- Photo: C. Venkatachalapathy\n\nTo make access to polling stations easy for voters, a total of 3,439 polling stations will be set up across Vellore district for the May 16 Assembly elections. The draft list of polling stations in the 13 Assembly constituencies in the district was released on Wednesday.\n\nCollector R. Nanthagopal, who is the district election officer, released the draft list of polling stations in the presence of representatives of recognised political parties.\n\nThere were 2,912 polling stations in the district during the Assembly elections in 2011. As many as 3,272 polling stations were established for the Lok Sabha polls conducted in 2014, a press release said.\n\nRationalisation exercise\n\nFollowing the orders of the Election Commission, rationalisation of polling stations was carried out in the district. Officials carried out the rationalisation drive by re-organising parts (a cluster of areas).\n\nDuring the rationalisation exercise in October 2015, new polling stations were added to enable all voters to access the polling stations easily to cast their votes. Accordingly, the draft list for the May 16 Assembly elections consists of 3,439 polling stations.\n\nIn Katpadi assembly constituency, polling stations No. 141 to 144 have been established at the Government Teacher Training Institute, Viruthampet. As a total of 11 polling stations would function on the same campus, the number of voters turning up will be high, and there are chances of law and order problems arising on the polling day. These factors along with the hardship faced by voters were brought to the notice of election officials.\n\nAs a solution, these four polling stations could be set up at the Panchayat Union Middle School, Gandhi Nagar (West) that is one km away from the teacher training institute.\n\nThe proposal to shift the polling stations has been sent to officials. Political parties have also been asked for their views and suggestions for change, if any, in the draft polling stations list.\n\nHighest number\n\nAs per the list, Sholinghur assembly constituency has the highest number of polling stations with 299 for 2,54,526 voters, followed by Arcot with 291 polling stations for 2,44,129 voters. Gudiyatham constituency has 289 polling stations for 2,60,612 voters.", 
    "section": "national", 
    "title": "Vellore district to have 3,439 polling stations", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}