{
    "author": [
        "Tamil Nadu Bureau"
    ], 
    "text": "One of the biggest grossers for political parties is the money they collect from aspirants wanting to contest the Assembly elections. The number of applicants is even presented as a yardstick to gauge the strength of the parties.\n\nWhile thousands apply for a seat in parties like the DMK and the AIDMK, it is obvious that a party could at the most field only 234 candidates. So where does the money collected from the rest go?\n\nMost parties state that the money collected will not be returned and would be deposited in the party account to be used for election expenses. In some parties, the money is returned to candidates if the seat they applied for gets allotted to an alliance partner.\n\nThis year, the ruling AIADMK received a total of 26,174 applications from cadres interested in contesting in the Assembly elections in Tamil Nadu, Puducherry and Kerala.\n\nOn behalf of AIADMK general secretary and Chief Minister Jayalalithaa alone, 7,936 applications had been filed by cadres. A total of 17,698 persons sought tickets in Tamil Nadu, 332 in Puducherry and 208 in Kerala. A cadre had to pay Rs. 11,000 as application money for a seat in Tamil Nadu, Rs. 5,000 for Puducherry and Rs. 2,000 for Kerala. According to an official release from the party, Rs. 28.40 crore was collected through the application process.\n\nWhen quizzed whether they felt the amount being collected was too high, cadres said it all goes into the party kitty and that there was nothing wrong with that. “It will go towards general party expenses including paying staff who run the offices. Campaign expenses for leaders too are taken from this,” explained a source.\n\n“In the DMK, the deposit collected from ticket seekers will go to the election fund. But we will return the money from the aspirants if the constituency preferred by them are allotted to alliance partners,” said party spokesperson T.K.S. Elangovan.\n\nThe application costs Rs. 1,000 and the party collects Rs. 25,000 as deposits. For women and Dalits, the amount is Rs. 15,000. “We used to collect only Rs 5,000. This resulted in a great number of party men applying for seat. But their intention is to meet our leader Kalaignar in the name of interview and the crowd is unmanageable. So we increased the deposit amount,” said Mr. Elangovan.\n\nAs far as the Left parties are concerned, they do not follow the system of inviting applications from the aspiring candidates. “ Our district units finalise the candidates list and forward it the state committee. We will follow the process only after seats are allotted to our party,” said CPI(M) state secretary G. Ramakrishnan.\n\nBoth in the CPI and CPI(M), MLAs and MPs are full-time party workers and the party pays them wages. While the CPI (M) MLAs and MPs even hand over their salary to the party, the CPI charge a levy from MLAs and MPs and other members.\n\n“We also consult the district units to elicit opinion on candidates. After that, the state committee fields the candidates and takes care of the election expenditure. The candidate has to concentrate only on campaign,” said CPI state secretary R. Mutharasan.\n\nBJP State vice-president S.R. Sekar says for smaller outfits, returning the money could be impossible. “In the BJP, we have collected about Rs. 1.25 crore in the nomination process. Whatever we collect becomes crucial to manage election expenses. We do not even ask the candidates if they have enough money to spend knowing well some of them will not,” he said.\n\nTamil Maanila Congress vice president B.S. Gnanadesikan said aspirants apply knowing very well that only a few of them would eventually get seats. Collecting the fee also helps weed out those who are not serious about contesting. “Parties like the TMC depend on the commitment of their members, who do not have the habit seeking the return of the deposit,” he added.\n\n( With inputs from B. Kolappan, Sruthisagar Yamunan and Deepa H. Ramakrishnan)\n\nSince everything goes into party kitty, cadres see nothing wrong in it", 
    "section": "national", 
    "title": "Where ticket aspirants turn benefactors for parties", 
    "subsection": "tamilnadu", 
    "date": "2016-03-17"
}